{
    "Category": "in Books (",
    "ListPrice": "$18.00",
    "Name": [
        "How Nature Works: the science of self-organized criticality"
    ],
    "OfferPrice": "$13.46",
    "Reviews": {
        "AverageStarRating": "3.3 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5PKMWIQYSBR5"
                },
                "Date": "on May 30, 2000",
                "Helpfulness": 0.98,
                "StarRating": "5",
                "Text": "I couldn't let the previous reviewer's comments stand without comment. I can't believe the reviewer read the same book that I did. Bak's treatment is detailed, clear, and balanced. When he is enthusiastic he let's you know  exactly why, leaving you free to make up your own mind. The fact that most  of the studies he describes were published in Physical Review Letters might  tell you something about their quality. The book provides wonderful  examples of the role of models in science, much better than any I've come  across in rather extensive search for materials for a course on the Nature  of Science I help teach. I'm reading the book for the third time (not  because it is difficult to read, but simply because it repays rereading)  and I admire it more with each reading. If you want to understand models  that display Self Organized Criticality, this book is without question the  place to go."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 21, 2001",
                "Helpfulness": 0.95,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXSH6O4OP5L4M"
                },
                "Date": "on December 16, 2001",
                "Helpfulness": 0.9459459459459459,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3L6ITQ2GT78KR"
                },
                "Date": "on January 12, 2000",
                "Helpfulness": 0.9047619047619048,
                "StarRating": "4",
                "Text": "I used this book (along with Stu Kauffman's \"At Home in the Universe, Feynman's \"The Character of Physical Law\", and Cohen & Stewart's \"Collapse of Chaos\") for a freshman seminar at Duke  University on \"Emergence of Complexity\".  My students really  enjoyed Bak's book.  It gave them a whole new perspective on the nature of  physical and biological systems and on the nature of scientific models.  Most importantly, their short essays on various parts of the book showed  that Bak's enthusiasm for his subject was contagious.  Students appreciated  Bak's creative use of simple models to introduce new ways of thinking about  a wide range of phenomena."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3V94HTDKTOY1O"
                },
                "Date": "on February 8, 2005",
                "Helpfulness": 0.8823529411764706,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on November 3, 1997",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "In spite of its many faults: failure to acknowledge Prigogine's conclusions that foreshadowed most of Bak's; petty sniping at others, incredibly hit and miss editing, and some outright silly passages (such as the idea that people living somewhere where there haven't been earthquakes for a long time would want to buy earthquake insurance), Bak has something important to say, and at times says it well and eloquently.The fact that he has found a substantial number of natural systems that create a spoor of commmon properties, and has nailed some of them is important. But: he says he insisted on the title of his book, not the editors (permit me to doubt this)and then says not one word about how he came to the conclusion that power curves, fractals, 1/f distributions and Zipf's law apply to ALL of nature. Has he any evidence of natural processes that don't? Is anyone working this side of the problem?  He has a refreshing view of what good science consists of, but does not display a scientist's attitude of disinterested pursuit of truth. This may be editorial inspiration to avoid qualifications in order to make stronger statements. I hope so, because I genuinely like the way he thinks, and find his ideas stimulating. But his claim to be the \"discoverer\" of self-organized criticality is close to fatuous."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 12, 2003",
                "Helpfulness": 0.7283950617283951,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADRKDB72QYL5D"
                },
                "Date": "on January 24, 2005",
                "Helpfulness": 0.8,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SJ6SMVQQ7TPH"
                },
                "Date": "on August 10, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A126KX6FVI4T66"
                },
                "Date": "on July 29, 2001",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "One of the most original concepts of modern times is pulled together in this book. The named a whole new science because of Per Bak and his many friends: complexity theory. I think he hasn't grasped the whole of it yet, but this book gives an overview of where he has gone following fractal and chaos down the road to practal physics. From entropy and Zipf's law to piles of sand that fall when overloaded, a picture of a differential physical geometry that influence the great and the small is set forth in terms that are understandable.  Self-organization of a critical nature is the clock work of a Godless universe with a purpose."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJRRNQMIV6U0M"
                },
                "Date": "on May 24, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "It's a short book that takes a long time to read. He explains topics well and simply. There's very little posturing. What was most interesting to me in the book is the description of the process of scientific discovery. He talks a great deal about finding very simple models, how these simple models often exhibit the behaviour of their much more complicated cousins, about cooperating with others in a cross disciplinary manner, about not be stuck in a dominant paradigm, and about working a problem until it's solved. Very refreshing."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PQ1DP3PJPLOH"
                },
                "Date": "on June 22, 1998",
                "Helpfulness": 0.7058823529411765,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OJPC8MOBI3X4"
                },
                "Date": "on May 14, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HSZ5OZTUZQXK"
                },
                "Date": "on February 2, 1998",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3R0GF55NK3TPF"
                },
                "Date": "on October 8, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The author is the discoverer of Self-Organized Criticality, and this is a easy and not to long book to read. You will learn about Punctuated Equilibrium,Power Laws,and Fractal Geometry. A sand pile model is used to show self-organized criticality. Mass Extinctions,Stock Market crashes,Earth crust will be presented as critical systems. A must read book for showing how sudden crises or avalanches as the author call's them,and how it affects the world that we live in. Will make you think about sudden rare events in a different way. If you buy this book, I would also recommend buying \"Ubiquity\" by Mark Buchanan. Together they will help you understand the subject better."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HSM71V3IM2K6"
                },
                "Date": "on September 10, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I felt that the book was well written given that many of the concepts detailed were rather complex and advanced. I enjoyed the read because the author made a convincing case in addressing my doubts about a purely 'Darwinian' or 'Religious' explanation for evolution as we know it."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on November 4, 1999",
                "Helpfulness": 0.6428571428571429,
                "StarRating": "2",
                "Text": "Per Bak's ideas (and ideas of others that are occasionally presented without quoting the original sources) are remarkably interesting, but the book itself seems to be a product of an uncontrolled avalanche in author's  brain.  Too low rigor and signal-to-noise to be interesting scientifically,  too poorly written to be read as fiction - sorry, two stars.  A 10-page  summary could have done much better."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QJVACIMZ39JT"
                },
                "Date": "on January 17, 2015",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YYYDLLFM662K"
                },
                "Date": "on August 13, 1997",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "4",
                "Text": "Bak and his fellow researchers have pioneered research in ``self-organizing criticality'', basically what happens when you have a system of loosely-coupled ``things'', each of which can slip suddenly, and you uniformly increase the stress on them all.  They first explored this in the context of dropping grains of sand onto a pile, but then noticed that it seems to describe many things --- the behavior of markets, of earth quakes, even punctuated equilibrium in the evolution of an ecosystem.  Neat!  But, uh, so what"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FSJLK1QAHNC"
                },
                "Date": "on March 20, 2009",
                "Helpfulness": 0.4,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A271DHTWIINMIB"
                },
                "Date": "on October 15, 2014",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "As described and fast shipping. Thanks"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17E7K3MQ5KKR5"
                },
                "Date": "on January 20, 1999",
                "Helpfulness": 0.4444444444444444,
                "StarRating": "2",
                "Text": "Per Bak has a record as one of the best, most stimulating physicists of our age. However, I am not happy with the idea of SOC and do not count it as among his best work. The weakness is that universality classes for sandpile models (and complex adaptable systems) have never been defined. Without universality classes one cannot claim that an arbitrary mathematical model (like a sandpile model or a 'complex adaptable system') describes or explains anything in nature. One or a few scaling exponents do not define a universality class for systems away from criticality. There is no evidence, to date, that turbulence, economics, and most other phenomena that occur in nature or society are critical phenomena. Socio-economic phenomena surely do not obey any invariant laws of motion. I suspect that the best that one can hope for is a model that maybe works temporarily and then fails because moods and behavior change, like the Black-Scholes option pricing pde."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADI6PNN3PDVWJ"
                },
                "Date": "on May 2, 2000",
                "Helpfulness": 0.46153846153846156,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1U9F2NLNOC1BY"
                },
                "Date": "on January 9, 2014",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": "The book sensationalizes the topic while really having nothing of significance to say. I only read it in preparation for a presentation I had to give. It is one of those vacuous texts that isn't worth the trees cut down to print it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACUZ27FON4BD0"
                },
                "Date": "on August 24, 2001",
                "Helpfulness": 0.44,
                "StarRating": "1",
                "Text": "I have read a large number of books on complex systems but this one is by far the worst that I have come across. The writing is poor, unengaging, and overly verbose. He also tries to give himself much more credit than he is due. Given Bak's obnoxious reputation, I should have expected this but I had my hopes before I started reading. Unfortunately I put the book down completely unimpressed. Skip this book and pick up anything by Stu Kauffman (try \"Investigations\")."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIC2Z7T84HSBF"
                },
                "Date": "on November 26, 1999",
                "Helpfulness": 0.4482758620689655,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 24, 2001",
                "Helpfulness": 0.3,
                "StarRating": "1",
                "Text": null
            }
        ],
        "ReviewUrl": "http://www.amazon.com/How-Nature-Works-self-organized-criticality/product-reviews/038798738X/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "27"
    },
    "Salesrank": "#379,035",
    "Timestamp": "2015-05-24 15:16:53.202247",
    "itemurl": "http://www.amazon.com/How-Nature-Works-self-organized-criticality/dp/038798738X"
}
