{
    "Category": "in Books (",
    "ListPrice": "$30.00",
    "Name": [
        "Astrobiology: A Brief Introduction"
    ],
    "OfferPrice": "$26.91",
    "Reviews": {
        "AverageStarRating": "4.4 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20X749PCD47PQ"
                },
                "Date": "on December 7, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CG2RR3BU55FX"
                },
                "Date": "on August 7, 2006",
                "Helpfulness": 0.7857142857142857,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24EO0PFT3G7L3"
                },
                "Date": "on September 27, 2006",
                "Helpfulness": 0.7857142857142857,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VEWI193BTDEI"
                },
                "Date": "on November 27, 2009",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is an excellent book; in a field inherently complex they have given sensible prose so the reader can follow the trajectory of an evolving cellular life on earth.  Just one example:  the Miller-Urey experiment did not resolve all questions, especially the question of prebiotic formation of lipids which derive from the reduction of the carbon-compound sugars.  So where did the sugars get reduced?  The sugar molecules come from the ocean passing through the elevated temperatures of the planetary crust, \"where reduction can be catalyzed by the iron mineral troilite (FeS)\".  Apparantly, every 8 million years deep sea vents filter the ocean--in geologic time 8 million years is about a week.(page 80-81)  The lipids are an important part of cell biology.  Heinrich Holland's book The Chemical Evolution of the Atmosphere and Oceans (1984)is extremely technical and by now dated, but still recommended.  Plaxco and Gross give updated information.  Those early Hadean years and environment gave the groundwork for what was to happen eventually."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DRM4CFTBFGY0"
                },
                "Date": "on January 30, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The book is on the required reading list for an on-line intro into astrobiology course I'm currently taking and although I am not a professional scientist I am able to follow mostly all of the concepts in the book.  The organic chemistry can be off-putting but anyone with a high school organic chemistry education will have no problem understanding.  I highly recommend the book for anyone interested in evolutionary biology or those who merely wish to understand exactly how space exploration will (hopefully) some day be able to find alien lifeforms elsewhere in our universe."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2T7QSYEPG7AKR"
                },
                "Date": "on March 28, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "this is a great starting point, with references at the ends of the chapters.  very worthwhile as an introduction to astrobiology.  for science-oriented readers."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GAHSKFONFZRR"
                },
                "Date": "on March 14, 2013",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A397PJ4A5Y57S2"
                },
                "Date": "on February 21, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IQG3JIMMR6A3"
                },
                "Date": "on March 13, 2013",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "Greta book for a newbie because it offers a wide but shallow snapshot of material relative to astrobiology. It will, however, be very disappointing for anyone who is looking for in-depth material."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20PYYOYNGB8SH"
                },
                "Date": "on December 21, 2012",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NHTQ5IVAUW05"
                },
                "Date": "on July 18, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "As a chemist, this book is almost like reading an awesome novel on the physical aspects of the creation of the universe and potential life beginnings."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJ49QMXGNQWYE"
                },
                "Date": "on January 30, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great book for beginners.  The subject matter is complex and vast, but the book touches the science of astrobilogy mastery."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ML5YFHBY4QK7"
                },
                "Date": "on May 11, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Writing this review because Kevin Plaxco is the best, and you should read his book. He's kind of hilarious."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AW0YIFV8ROTL4"
                },
                "Date": "on July 18, 2006",
                "Helpfulness": 0.625,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33RR95A3FAVA6"
                },
                "Date": "on September 18, 2012",
                "Helpfulness": 0.5,
                "StarRating": "2",
                "Text": "This could have been a very good book on the topic of astrobiology, however, it is not geared for an audience without a considerable biochemistry background. Instead of writing it in laymans terms, it is too bogged down with advanced bio-chemical material, notes and sidebars. In addition, it is very muddled with scientific endeavors that either failed or were not accepted by the scientific community. So instead of focusing only on what is accepted today, the authors lead you down a very muddled and distracting road. I understand the need for the authors to present some of the material due to its historical value, but that could have been done in a more restricted concise fashion without bogging down the reader with distracting information. I am able to get the gist of what they have presented, however, even though I am an amateur astronomer and hold a doctorate (not in the natural sciences, however), I had a hard time following the long streams of bio-chemical strings presented in this book. In my opinion, it is NOT for the layman, but more for the professional natural scientist."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SL6IETA9J6HD"
                },
                "Date": "on April 19, 2010",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": "Plaxco and Gross give an expansive coverage for this topic. It is a bit too chemistry-oriented, with formulae of reactions discussed both via text discussions and figures. Also, the sidebars were fascinating, but at the same time distracting from the flow of the text. I think this is not a book for the casual reader, but rather a supplemental to a couse textbook on this topic."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A365G0ITZENCB7"
                },
                "Date": "on November 8, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "item was as described and shipped fast"
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Astrobiology-Introduction-Kevin-W-Plaxco/product-reviews/1421400960/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "17"
    },
    "Salesrank": "#532,001",
    "Timestamp": "2015-05-24 15:18:43.772723",
    "itemurl": "http://www.amazon.com/Astrobiology-Introduction-Kevin-W-Plaxco/dp/1421400960"
}
