{
    "Category": "in Books (",
    "ListPrice": "$15.95",
    "Name": [
        "The Day Without Yesterday: Lemaitre, Einstein, and the Birth of Modern Cosmology"
    ],
    "OfferPrice": "$11.01",
    "Reviews": {
        "AverageStarRating": "4.4 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18ZY238E0F7M6"
                },
                "Date": "on January 31, 2006",
                "Helpfulness": 0.9615384615384616,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3G5TMJO990F6C"
                },
                "Date": "on December 28, 2005",
                "Helpfulness": 0.8888888888888888,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KKXV0HG92CJ8"
                },
                "Date": "on January 1, 2006",
                "Helpfulness": 0.9090909090909091,
                "StarRating": "5",
                "Text": "Georges LemaÎtre may just be the Rodney Dangerfield of cosmology - he just can't get the respect he deserves [in the book I'm currently reading, it says \"Modern cosmology is based on the big bang theory proposed by George Gamow...\"].  _The Day Without Yesterday_ by John Farrell goes a long way towards making the case that Georges LemaÎtre should at the least share the title of the Father of Modern Cosmology.  In the book, we follow the trajectory of the life of Fra Georges LemaÎtre, priest, mathematician, and physicist, played out against the first 2/3rds of history of the 20th Century and the history of modern cosmology.  We learn of LemaÎtre's \"primeval atom\" - the original version of the big bang - and his interactions [or lack thereof] with Einstein, Hubble, Gamow and others.  I am pleased to report that LemaÎtre lived long enough to hear about the discovery of the cosmic background radiation and the vindication of the big bang.  LemaÎtre is a good example of the fact that religion and science need not conflict.  I highly recommend this fine book to fans of biography and the history of science."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AS9JE8SJSQ0B8"
                },
                "Date": "on January 9, 2007",
                "Helpfulness": 0.9,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10PUCDEAR3KXZ"
                },
                "Date": "on October 6, 2005",
                "Helpfulness": 0.8181818181818182,
                "StarRating": "5",
                "Text": "John Farrell's fascinating and compelling biography of the Belgian priest who one-upped Einstein and laid the foundation of new branch of science is simply wonderful.  Written with a vibrancy that is uncommon for scientific biographies, Farrell has brought forth a true-life story of an unlikely hero who looked to the stars and found the secret of the universe.  It doesn't get better than this.  VERY HIGHLY RECOMMENDED!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QRZ06JM57LS6"
                },
                "Date": "on August 6, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28VVGDQT3YFKD"
                },
                "Date": "on June 26, 2006",
                "Helpfulness": 0.75,
                "StarRating": "3",
                "Text": "I checked this book out from the library in hopes of learning more about Lemaitre, and up to a point I was satisfied. Certainly, there is more biographical information about the man than I have seen elsewhere, and there were interesting sidelights about Eddington and Gamow. However, this is in no way a definitive biography, and as mentioned by at least one other reviewer, the explanations of cosmological models given are quite inadequate and downright confusing at times. This whets the appetite but does not satisfy."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1D5VURX96JFP4"
                },
                "Date": "on February 28, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FE4GLHIMFOLK"
                },
                "Date": "on November 17, 2005",
                "Helpfulness": 0.7,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30CIW9YR5USE0"
                },
                "Date": "on March 10, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I'm fascinated by Lemaitre.  He was both a cosmologist and a priest; what a perfect person to discover the big bang.  This book is mainly about his life and discoveries but also serves as a general history of cosmology.  All the major players in cosmology from Einstein to Guth are included."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32AC75S3S20QC"
                },
                "Date": "on June 20, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This is a very well written and highly readable account of what may arguably be the most important byproduct of Einstein's General Theory of Relativity, The Big Bang Theory of Cosmogenesis.  The story of George LeMaitre, the Belgian priest-scientist credited for having developed the idea of the primeval atom from which our universe emerged, is fascinating not only from the scientific aspect but from the theological aspect as well.  While he saw no incompatibility between science and religion, he rejected the notion of mixing the two.  But first and foremost, the author presents LeMaitre as a man of science who shows from Einstein's equations that the universe had a start as did time, and that it is expanding.  This finding largely results from his store of astronomical knowledge and the red shift of galactic light, a phenomenon discovered independently by Hubble proving observationally that the universe is expanding.  Einstein himself had trouble accepting these results at first but later comes to accept that his brilliant equations were right after all in predicting a dynamic universe as opposed to the steady state universe that he preferred to believe in.  I would recommend this book to any reader who wishes to delve deeper into the story of The Big Bang and the works of those great scientists who brought it into being."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Y0DY1CRIC9BK"
                },
                "Date": "on March 8, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A great read and thoroughly researched book (118 notes, loaded with references).  It covers Georges Lemaître's (1894-1966) scientific contributions especially regarding the expanding universe and primeval quantum, which together can be understood as the Big Bang theory.  To my surprise, Lemaître also made significant contributions and predictions associated with collapsing stars (black holes) and the cosmic microwave background, which Lemaître called 'cosmic fireworks' as remnants of the initial expansion (bang) of the universe.  Being in the technology industry myself, how delightful it was to read that this priest-scientist loved computer technology and promoted its academic use on the campus where he taught in Belgium.  Similarly revealing was the friendship and correspondence Lemaître maintained with many leading cosmologists of his time, mostly with Einstein but also with Hoyle.  A wonderful read with many interesting details.  Highly recommended."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KKRKEOURF71I"
                },
                "Date": "on May 4, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18DTBCND2KYHS"
                },
                "Date": "on March 24, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AT7E2BG2EQOJJ"
                },
                "Date": "on June 24, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The author presents the little-known story of how the Big Bang theory of the universe originated, especially with the ground-breaking work of the Belgian scientist Georges Lemaitre.  I read it avidly."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EPNJ5ZFCJNUQ"
                },
                "Date": "on June 15, 2009",
                "Helpfulness": 0.5555555555555556,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1D12CHDBQRKZH"
                },
                "Date": "on September 20, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "A wonderful science-bio on Lemaitre, one of the founders of modern Cosmology.  It covered area I had not seen before."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFE9JZNNFCCGB"
                },
                "Date": "on November 26, 2006",
                "Helpfulness": 0.26666666666666666,
                "StarRating": "3",
                "Text": null
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Day-Without-Yesterday-Lemaitre-Cosmology/product-reviews/1560259027/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "18"
    },
    "Salesrank": "#364,682",
    "Timestamp": "2015-05-24 15:35:50.901284",
    "itemurl": "http://www.amazon.com/Day-Without-Yesterday-Lemaitre-Cosmology/dp/1560259027"
}
