{
    "Category": "in Books (",
    "ListPrice": "",
    "Name": [
        "QED: The Strange Theory of Light and Matter"
    ],
    "OfferPrice": "",
    "Reviews": {
        "AverageStarRating": "4.8 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A258HDMERSI6WJ"
                },
                "Date": "on June 24, 2000",
                "Helpfulness": 0.9943820224719101,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALXB8RERGC7SB"
                },
                "Date": "on March 6, 2002",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Z7FFJGXSKOHE"
                },
                "Date": "on October 27, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3K844VG7EP3FC"
                },
                "Date": "on August 23, 2001",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1F9O2Y7UNQW9W"
                },
                "Date": "on January 13, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2554O9V7M9G2B"
                },
                "Date": "on January 21, 2006",
                "Helpfulness": 0.9090909090909091,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LIW6OKHU8DIS"
                },
                "Date": "on May 29, 2000",
                "Helpfulness": 0.9333333333333333,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27WFYW9ZJ5DN1"
                },
                "Date": "on January 24, 2001",
                "Helpfulness": 0.8518518518518519,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ARA52HB238HT"
                },
                "Date": "on August 28, 2000",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Richard Feynman stands out from other physicists in his witty ability to  explain physical phenomenons in a simplistic way.  Quantum physics (or  quantum theory) is by far the most fascinating yet the most perplexing  subject ever studied in recent-to-present history.  I was lucky to have  come acorss Feynman's \"QED\" while I was taking undergraduate  quantum physics.  Feynman adroitly explains the path of an electron without  discussing vectoral analysis.  He clearly conveys the ideas behind quantum  theory by translating the obscure mathematical notations and manipulations  into plain language understood by readers who are not in the science field."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PJDV044CLYCY"
                },
                "Date": "on December 23, 2005",
                "Helpfulness": 0.9166666666666666,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANT9YUT7FNG4H"
                },
                "Date": "on July 9, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "These are the popular lectures that Dr. Richard P. Feynman gave in New Zealand in 1979.  Feynman's legendary teaching ability and wit are in full force here.  These lectures are meant to give a general audience a taste of  the most successful theory in physics, quantum electrodynamics, or QED for  short, that he developed independently of two others (Schwinger and  Tomonaga), who all shared the Nobel Prize in 1965. Feynman builds up the  theory using very simple ideas such as \"all we do is draw little  arrows on a piece of paper and we get all these answers.\"  We see how  light can be reflected from the center of a mirror, but that it really  reflects from all points on a mirror.  How can that be, you say?  Answer:  watch these videos! Feynman moves from light, to electrons, to their  interactions in the first three lectures.  We even get to see the legendary  \"Feynman Diagrams\" drawn by the master, himself! In the fourth  lecture Feynman discusses the problems or difficulties with the theory  (always honest, he never quite believed that the theory was completely  perfect, even though it gave the right answers.  In fact, he said in his  Nobel Prize acceptance speech that \"... we might just be sweeping the  difficulties under the rug.\") as well as discussing some of the  current (in 1979) theories such as quarks and gluons. These tapes are  invaluable for the interested amatuer who wants to learn the basics of the  theory which describes all of everyday experience except for gravity, or  for the physics student to find out what it is that you are really  calculating with those messy equations, and how it really goes."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D7XC7USJ9X7J"
                },
                "Date": "on February 20, 2001",
                "Helpfulness": 0.9090909090909091,
                "StarRating": "5",
                "Text": "We cannot complain about lack of science books for laymen. Among them, many are of very good quality, describing sectors of science with competence and, sometimes, charm. The books by Gamow, for instance, are notable, as are those by Jeremy Bernstein. Then there are books which not only explain physics to you, but give you tools so that you can, by yourself, understand new things. These are very rare. I can think of two. Cosmology, by Harrison, allows you to derive by yourself consequences of the universe expansion by the trick of moving mirrors, a nice, simple and useful tool. But it is restricted to this rather esoteric corner of science. Then there is Feynman's QED. This is unique. By the clever trick of a clock attached to each photon and by the use of it in combination with his breakthrough idea of summing over all paths, he succeeds in extracting not only the specialized phenomena of high energy physics, but magically renews the good old optics of mirrors and refraction. Using his simple rules you can understand light \"like a pro\", and even do your own little research projects. I published papers on quantum field theory, yet, learned quite a bit from this small and precious book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GZ96QV62C7AO"
                },
                "Date": "on January 17, 2004",
                "Helpfulness": 0.9,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1E2WQFVYF4E71"
                },
                "Date": "on April 17, 2002",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MJMYLRTZ76ZX"
                },
                "Date": "on July 20, 2002",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": "This is the best book for the layman on the difficult subject of quantum mechanics. I've read much more technical works on the subject, but none of them can match Feynman's clear and concise explanations of the fascinating and paradoxical world of quantum mechanics. Feynman had a gift for explaining difficult physics concepts to the non-physicist, and this book is perhaps the best example of his ability to do this. Using primarily spatial concepts, visualizations, and diagrams rather than advanced math, Feynman clearly illustrates and explains many of the fundamental aspects of QED in a way that the non-specialist can grasp. A true classic in the field, and one that hasn't been equalled since in its clear and concise treatment of the subject. All in all, a great book from both a great physicist and great teacher."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GF2864MIW7HU"
                },
                "Date": "on September 15, 2005",
                "Helpfulness": 0.8888888888888888,
                "StarRating": "5",
                "Text": "This book is basically a transcript of a series of lectures Professor Feynman gave at UCLA and in New Zealand.  The lectures were given at the University of Auckland in New Zealand because Feynman wanted to \"try out\" the lectures on people far from home to see if they would work. [...] The book  QED attempts successfully to give the reader an idea of how light works at a fundamental level and is actually very weird and untuitive due to our inherited and evolved senses and perception.  Feynman preps the reader to anticipate these very strange unintuitive scientific findings and goes on to explain them very well."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A86GTYQ4MZB73"
                },
                "Date": "on May 9, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "What differentiates Feynman from other eminent physicists of the 20th Century is his uncanny ability to communicate abstract and complicated theories of physics into totally comprehensible lamens terms.  For example, in QED, he explains the movement of electrons without actually  discussing vector analysis.  He simplifies the calculus of quantum  electrodynamics by using arrow diagrams and describes the path of electrons  almost in a narrative style. The hardest thing in writing is simplicity;  for Feynman, who deals with the complexities of life in their most minute  detail, such simplicity is poetry to the curious mind."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7USQM4ERFZ9P"
                },
                "Date": "on May 15, 2005",
                "Helpfulness": 0.875,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RRU57OK3Z8I1"
                },
                "Date": "on July 6, 2002",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Feynmann, one of the physicists who developed the theory of quantum electrodynamics, winning a Nobel Prize for doing so (with 2 others) had a unique skill at presenting the physical essence of a principle, without getting lost in mathematical formalizm.  After all, the mathematical description of a concept is only one form of expression of the idea, albeit in precise terms.  Feynmann's discussion of QED explains with great power the way that when one examines the action of particles in the real world, the classical deterministic description of the particle and what happens to it proves inaccurate.  For instance, when a particle travels between two points, one cannot know its exact location and how it is moving.  One can only describe the particle's movement in terms of probabilities.  A classical description of the action of the particle would attribute a fixed path to its course.  In quantum physics, one describes the probable path.  There is a finite, however small, probability that at any given time in the questioned interval the particle may be found in any location in space.  It's true path description allows the particle to travel by all possible paths, and the classical path is merely the one which is most probable.  Feynmann explains this and related phenomena with compelling logic and power.  He writings are a unique and essential explanation of modern quantum analysis.  They are readily understood by non-physicist readers, requiring only a willingness to concentrate and open one's mind.  This is a remarkable work."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TN0L7YA0VFHV"
                },
                "Date": "on June 8, 2000",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on November 28, 2001",
                "Helpfulness": 0.8181818181818182,
                "StarRating": "5",
                "Text": "This is great book. It's rather startling, however, to see (further down the line) someone recommend this and David Deutsch's \"The Fabric of Reality\" in the same breath. It ought to be clear to anyone familiar with Richard Feynman's works, how adamant he was about the scientific method and how adverse he was to the sort of pseudo-scientific tricks played in \"The Fabric of Reality\". (See especially the last chapters of \"The Character of Physical Law\", \"Surely You're Joking, Mr. Feynman\", and \"What Do You Care What Other People Think?\".) The moral of this, I suppose, is that it is possible to read a book, and even to think you like it, and not understand a word of it. Very discouraging. Well, some people are capable of appreciating Richard Feynman, at least."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 5, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "As a 3rd year undergrad physics major at Caltech, I sometimes got lost in the forest of mathematical equations that the professors threw at me.  This is the book that helped me understand it intuitively.  Feynman makes it  seem so easy, and says so much with those simple examples he gives.  I've  never read a science book that made a difficult subject like this seem so  easy. Only Feynman does it like that.  The reader doesn't even have to know  how to square a number, and yet Feynman manages to explain how to use the  method of stationary phase in path integrals. Yeow!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARP43WC0WA76H"
                },
                "Date": "on October 26, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Feynman picks the thing that is simplest in the quantum world, a single particle, and explains it using no math.  Instead of equations, the quantum theory in this book consists entirely of pictures.  But this is not a popularization in the usual sense.  This is not gossip about science.  This actually is quantum theory in a very simple case.  For anyone who wants to know how the universe is put together, this is an astonishing mind opener."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on August 3, 1999",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": "I'm halfway through the book, it's unbelievably lucid, witty, light-hearted, and modest, and explains QED, and actually quantum physics through the phenomenon of light, better than anything I've come across.  It  helps me grasp the almost un-graspable."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TRPVAGT3NWBS"
                },
                "Date": "on November 24, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 20, 1999",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "In my opinion, a scientist who gives you the  oppurtunity to delve into his mind and understand what he understands is a privilege both to the reader and to the cause of science. Feymann's QED does just that. It MAKES  you understand what QED is all about and helps to understand the  famous  wave/particle duality in physics. This book can clearly be enjoyed by  non-physicists and very easily understood. A good deal!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16W8HTCIWYDZ6"
                },
                "Date": "on December 27, 2001",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AOO8YTBQ3AO2"
                },
                "Date": "on August 4, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2N786KHIFCKJ8"
                },
                "Date": "on January 16, 2003",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UAKWMXR1WBI7"
                },
                "Date": "on July 20, 2005",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Finally a piece of writing that explains QED in a manner understandable to me. Fully recommendable."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NG2B1STZ0VQG"
                },
                "Date": "on October 23, 1997",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on April 26, 1998",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "How on earth can someone teach QED to a person who hasn't had much (or any) math or physics?  Most authors dumb down the material, so key concepts are overlooked or over over simplified.  And none are usually willing to attack such a complex subject. Feynman has done it.  It's amazing, and it's fun."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SZYNGBOBFGXW"
                },
                "Date": "on April 4, 2005",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": "If you ever wondered about what really goes on inside things; whether golf balls, or transistor radio batteries, read this, a book that describes, in lay language a theory that explains nearly everything.  You will wonder, as you read, at the mysterious behavior of particles at the quantum level.  And when you read how light really reflects off a mirror, you will be tempted to shout, \"Aha\"!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKVZXKGL91HE7"
                },
                "Date": "on July 23, 1999",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Feynman's version of QED (which he helped develop) is the most clever and lucid way of explaining QED phenomena.  I can't praise this book enought.  Feynman is reknowned for his lectures and he does not disappoint here.  it  may take a few readings to get it all but it is worth it."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on November 30, 1998",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is the kind of book that makes you want to go back to school and actually pay attention.  It was fascinating and stimulating.  I found myself thinking about it for weeks after I read it.  I look forward to my  2nd and 3d read of it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WXFHID72Z5Z1"
                },
                "Date": "on March 28, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "In QED, Feynman uses a novel approach to describing and quantifying sets of light rays (light rays from the same source, leaving at the same time, but following different paths.) The result, a straightforward symmetry of constructively and destructively interfering waves, yields all the phenomenon most students were instructed to memorize, in high school and as undergrads, without really knowing or understanding why, including optical phenomena (focusing lenses, mirages, rainbows, reflection and refraction) and single-slit and double-slit diffraction. Highly-recommended reading for any student of physics, regardless of a priori (mathematical) skills or knowledge."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMFUPHOWZ4QKC"
                },
                "Date": "on November 5, 2000",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 28, 1997",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "QED is one of the clearest books on particle physics I have seen.  The beauty of the book lies in Dr. Feynman's approach; he explains concepts in ways that even amateur physics students can understand, and he is not afraid to tell the reader that there are things science can quantify but not explain.  Note: Feynman touches on quantum chromodynamic (QCD) theory, and there is another book that further clarifies the relationship between the two theories: look for The Quark and the Jaguar by Murray Gell-Mann.  Amazon lists the book, and it is widely available"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3590XQQ2DWOM7"
                },
                "Date": "on January 1, 2002",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "When I was a physics dummy as a freshman in college, I read this book and found it so interesting: I can understand the so-called \"Quantum ElectroDynamics\" without studying any advanced physics! Although there is no quantitive stuff in this book, it's really a good feeling to know the physics ideas. If you have some interest in Physics, just find this book and read it: the book will make you sure that you have talent in physics:)"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on December 1, 1997",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "What a pleasure it is  to find a concise explaination of QED that I can actually understand. I enjoy physiscs as a hobby and don't wish to be burried deep in mathimatical calculations.  This delightful book explains  many interesting effects of light in our everyday world  based on those simple little arrows. I wish physiscs had this much fun when I was in school."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 19, 1997",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "QED, or Quantum Electrodynamics, provides insight into a subject that even physics graduate students have trouble understanding. Richard Feynman, one of the greatest physicists of this century, has a lucid style of explanation that leaves no ambiguities"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1S66YT491XJV6"
                },
                "Date": "on October 23, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PE2FA0BVY8AW"
                },
                "Date": "on December 19, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "You'll learn more about quantum physics from this book than from any other, short of a college course with mathematical content.  Read it.  Give it to children.  Amplify it's educational effect.  Make the world a better place."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZ2L10YE991K5"
                },
                "Date": "on September 7, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XC03VF2102X2"
                },
                "Date": "on March 19, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TYCF6Y26JJQ2"
                },
                "Date": "on November 5, 2000",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MDT7LWLQ8UW8"
                },
                "Date": "on August 19, 2001",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "*QED* is an edited version of four lectures delivered to a lay audience at UCLA in 1983.  It conveys Feynman's unique combination of earnest enthusiasm and elfish delight at the fact that \"the way we have to describe Nature is generally incomprehensible to us.\" (p. 77)  It is probably true that the book can be profitably read by every class of reader, from Feynman's physicist peers to street people (if this is not the contemporary equivalent of \"the man in the street,\" why isn't it??) who have never studied physics.  Feynman was a great communicator, and knew how to throw out a lifeline of wit, reason, or good sense in the midst of the most bewildering complexities.  Twenty-first century humanity urgently needs to integrate something of the quantum view of reality into its common understanding of things, and Feynman's work is a precious contribution toward that end.  Highly recommended!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1U0HJYMGZ7D87"
                },
                "Date": "on May 25, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book gives the reader not the most in depth and mathematical explanation, but provides a basis for understanding the concepts behind the interactions of light and electrons. The first time through, the third and fourth lectures gave me some confusion, but I ascribe that confusion to the large quantity of information provided. With each successive reading you learn more and more, so my recommendation is you read the last 2 lectures at least two times, but I recommend reading them 3+ times to grasp the ideas in a much stronger fashion. By far my favorite \"theoretical\" physics book, I plan on reading it again, and would recommend it to anyone interested in learning the inner working of our world and the entire universe. Be ready to be amazed by the wonderful and well-broken down concepts presented by Mr. Richard Feynman"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XQDPKE7RCEL"
                },
                "Date": "on May 20, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9GZ363QV1VEU"
                },
                "Date": "on October 2, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "To someone with a gnawing interest in quantum physics but difficulty understanding highly-theoretical text, Feynman is something of a frightening name.  As such, I picked up this book with a bit of apprehension, but my fears were immediately assuaged.  Feynman's lecture are, indeed, for the layman.  Without sacrificing any truth for the sake of simplicity, he describes the strange theory regarding light and matter and everything in between.  The writing is such that anyone should be able to follow along, and therefore I strongly suggest this to anyone with even a cursory interest in the subject matter."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AU9UGBD3L2AVU"
                },
                "Date": "on February 15, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book thoroughly explains the fundamental principles of light wave propagation through various mediums. Though the ideas presented utilizes particle nature of light, the explanation can be applied for wave model of light as well. The book explicates reflection and transmission of light through glass and other medium using three basic actions between light quantum ( A termed coined by me in True Physics of Light... etc.) and electron interactions inside nucleus of atoms. This is an excellent book and I highly recommend to students learnig  optics and fundamental science."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3C68ZL09YEO4G"
                },
                "Date": "on December 28, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book is intriguing, which is odd because I'm not a physics major and certainly know very little of the subject.That being said, however, I can't help but feel interest when I read the book because it is intuitively explained and for a novice, that's a big thing.There are times when the things simply can't be explained that well given their difficulty and that's acceptable because this book succeeds in everything else it attempts to do, which is to inform the reader of something which we encounter and yet do not normally think about."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QHBX5JAXWSR9"
                },
                "Date": "on January 31, 2010",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "If you are a physicist it is a must have.  If you are an artist and want to know more about light, you can handle it.  It was written for a non-physicist friend to explain this portion of the world in terms anyone willing to put forth the time and effort can understand.  A small but powerful book.  You will think of it every time you see a colorful bird, a mirage, a sunset or sunrise, and a lot of time in between."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3637XW4AJL9OI"
                },
                "Date": "on October 17, 2001",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "4",
                "Text": "This book is not as well written as his book on physical laws, but is well worth the struggle.  There will come that moment when you actually believe that you understand quantum theory.  It won't last long, but then nothing does in this quantum world!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34MIFFGKD2E1H"
                },
                "Date": "on March 12, 2009",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I thouroughly enjoyed this book.  Very simple explanation of the essence of \"e to ix\" to any one not exposed to math.  I passed the book on to an uncle.  Then I was sorry I did it as soon as I handed the book because I remembered it's now out of publication. In the end still happy to have an English teacher exposed to this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LHMWMCGBKUP2"
                },
                "Date": "on May 12, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Absolutely incredible. It will suck you in and you will be amazed at how clearly Feynman can explain concepts without making you feel like a moron. While some paragraphs will require a couple glances the material is easy (for the most part) to understand and follow. Absolute must for those who enjoy science and physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2M7HTUSPIS2CD"
                },
                "Date": "on June 27, 2001",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "I found this to be one of the most thought-provoking books I ever read. Feynman addresses an extremely weird subject in a simple straight-forward way. I recommend it to anyone interested in Quantum mechanics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKUTXPC9F72TW"
                },
                "Date": "on March 9, 2008",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is the shortest book about quantum electrodynamics I've ever read, but it is still full of profound revelations (for instance, electrical charge is really nothing more than the square root of the probability that an electron will couple to a photon, etc)..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HUAWSIE84QSL"
                },
                "Date": "on May 23, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2O2GNN3N5LFFN"
                },
                "Date": "on April 4, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Feynman is the best author in the field of physics. In his easy-going, humorous style, he covers the sticky topic of Quantum ElectroDynamics.  I read this book when I was 16, with a little bit of high school physics under my belt.  It is very accessible."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NPU24LLSAL1L"
                },
                "Date": "on November 12, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Perfect for any current or potential physics students. The subject matter of this book is of a certain complexity and will most likely be grasped only by those whose minds are sharp enough to tackle the severe challenge of quantum physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FVVU11EVYZ8A"
                },
                "Date": "on April 16, 2008",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "To me Feynman is right up there with Albert Einstein. I love is fearlessness and is desire to see the truth. The Buddha and Feynman are probably enjoying a good laugh. I recommend his other book \" What do you care what other people think\"."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AB9MEUOBKUESP"
                },
                "Date": "on February 5, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Book explains a simplied version of rigourous mathamatical models about quantum mechanics and E&M.; While  interesting, it is difficult to understand the assumptions the author poses to explain physics"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AS56GF9V4W7FK"
                },
                "Date": "on April 22, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Feynman always tried to bring down complex items to the level where  students and the curious could understand.  He even thought that the Nobel prize was more of a hinderence than a value to teaching."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2G90J4PELWGMN"
                },
                "Date": "on December 16, 2003",
                "Helpfulness": 0.6,
                "StarRating": "5",
                "Text": "This book is great!  There isn't much to say here that hasn't already been said.  If you have a desire to learn about quantum mechanics but you lack a science background, this book simply cannot be beat.  This is the only book that gives you the real deal.  A Brief History, Elegant Universe, etc. all gloss over the topic.  But don't fool yourself.  Even though Feynman is a great teacher, this is not easy stuff.  If you hope to really grasp what Prof. Feynman is saying you are going to have to really think about it.  I remember reading one page over and over again for an hour until I grasped one concept.  But it is definitely worth it in the end.  I believe that anyone of above average intelligence (which I believe most people who read this sort of book are) should be able to fully grasp the ideas presented in this book.  Enjoy."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FFXMQB57RASW"
                },
                "Date": "on December 9, 2006",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Feynman makes it easy for the curious amateur to understand.  This book is accessible and mind-blowing.  Everyone should read it. And there is little if any math so don't be intimidated."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DJ69GO74XX"
                },
                "Date": "on December 25, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3A7OR8GUSGHRA"
                },
                "Date": "on November 30, 1999",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Feynman treates physics in the proper manner. He takes all of the jargon out and makes very complicated arguements available to a more general reader."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24F3T7DEHJTXO"
                },
                "Date": "on April 21, 2004",
                "Helpfulness": 0.6,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UDATKE6ABXN8"
                },
                "Date": "on November 2, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Everyone should read the first two chapters of this book, it will change they way you look at the world."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on December 6, 2001",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "This is a great book for anyone who is slightly intrested in physics.  This is the best book that I have ever read at relating the subject of the book to everyday life.  While the book starts out quite simple, the end of the book gets more in depth, therefore, there is something in this book for everyone."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ELYGBTWY38DH"
                },
                "Date": "on June 1, 2004",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on August 7, 2002",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADBGLDCO1TVHX"
                },
                "Date": "on June 18, 2002",
                "Helpfulness": 0.5555555555555556,
                "StarRating": "4",
                "Text": "I'm not really sure why I bought this book, or exactly why I read it cover to cover. I was strolling through the bookstore, and came across it, and the next thing you know I was at the checkout stand with it in my hand. I have a degree in business, not physics, math, or any other \"physical\" science degree. Just found it really interesting. Sick, huh?"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BQMV9YN9G6NX"
                },
                "Date": "on July 20, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "excellent"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AK8OIQRD64SNG"
                },
                "Date": "on February 6, 2014",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "Good quality product.  Good price. VERY slow delivery.  I bought a \"used book.\"  WHat I received looks new.  Maybe what took so long was figuring out that they had to substitute new for used."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on September 12, 1999",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "I am studying A-Level Physics, and find this book truly inspirational.  Though not on the syllabus, QED certainly should be  An incredible man, and an incredible book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AI1U11HEFZQP"
                },
                "Date": "on January 14, 2003",
                "Helpfulness": 0.4,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMFUPHOWZ4QKC"
                },
                "Date": "on November 5, 2000",
                "Helpfulness": 0.25,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 26, 1998",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I've started read this book, and i couldn't stopped. Concise, simply to read, it's a good friend - always there when you need it!!! Well done!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQ8X60RD5WXC2"
                },
                "Date": "on February 16, 2014",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YSUQ5LHAT9IF"
                },
                "Date": "on June 3, 2001",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": "If you'd like to know how reality REALLY works, and don't know much about Quantum Mechanics, this is probably the best place to start. If you don't care, and want to live the rest of your life in ignorance, avoid this book like the plague :-) After reading this, I suggest picking up a copy of \"The Fabric of Reality\" by David Deutsch. While you're at it, it won't hurt to read the classic \"Godel, Escher, Bach\" by Hofstadter. Caveat: reality is nothing like you imagined, and seeing it for the first time can have adverse psychological effects."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 25, 1999",
                "Helpfulness": 0.2,
                "StarRating": "5",
                "Text": "i am a big physics fan, i love it. this book really interested me, though i give it four stars because though it was written with amazing wit and understanding, it is not the best of feynmann's books. though when i think  of it he really couldnt of written it better. the book basically goes over  the fact that you cant really know exactly how the light gets to its final  position but you can most certainlly predict it, to tell you the truth, it  really is a five star book, i think that i have just convinced myself.  feynmann was brilliant, and me, an 18yr old former american presently  israeli, and hoping to make the hard way into the IDF air force. i really  think it gave me alot of knowledge about qed. it taught me that i need to  go into other fields of physics before i decide my final destination. if  you have any doubts, BUY THE BOOK IT WILL NOT LET YOU DOWN!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1B76R2J317T69"
                },
                "Date": "on July 15, 1998",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Dick Feynman is unbelievable.  He pretty much rapped up QED - the contemporary theory of light in a book that isn't even thick enough to take the wobble out of my nightstand.  Even if you're the lay off the street with even no elementary school education, you HAVE TO read this book.  For ever afterwards you will literaly see light differently."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AF59DVFPXJUWD"
                },
                "Date": "on September 5, 2005",
                "Helpfulness": 0.2857142857142857,
                "StarRating": "5",
                "Text": "I read this book about 8 years ago (1997) and found it both very interesting and very frustrating. It is well written and the relation to simple experiments is cool. However, I found it frustrating that he assumes there is no way to provide a sensible theory of physical reality when there is actually a simple solution to the problems of particle wave duality that are far better explained with the Wave Structure of Matter (WSM). i.e. Standing wave interactions only occur at discrete frequencies which explain the discrete 'particle' properties of both light and matter. For more information search Milo Wolff or Geoff Haselhurst."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2E0N4JR8M3M5O"
                },
                "Date": "on August 6, 2006",
                "Helpfulness": 0.36363636363636365,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on September 2, 1998",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "To understand why RPF is a genius, read his books - especially this one."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on September 2, 2001",
                "Helpfulness": 0.2,
                "StarRating": "5",
                "Text": "Whereas once I was blind, now I can see.  Thank you Dr. Feynman!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HA8JOXNVDAL8"
                },
                "Date": "on December 23, 2002",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AI3YVF2LQ2KPE"
                },
                "Date": "on April 6, 2013",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "good stuff . would buy it agan. well satisfied with product.cust support good, i would tell a friend about it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32IMEZ02OOLNI"
                },
                "Date": "on May 31, 2001",
                "Helpfulness": 0.36666666666666664,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MGIM1NIV8B26"
                },
                "Date": "on November 29, 1999",
                "Helpfulness": 0.1,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AKES5GGFFKXX"
                },
                "Date": "on November 24, 2000",
                "Helpfulness": 0.16981132075471697,
                "StarRating": "1",
                "Text": "I am actually borrowing this book from a friend. But the way things look, I will need a copy for myself. I love reading fiction, and have often found non-fiction books boring and lose interest in them. However, once I started reading this book I was hooked, I would rather read QED than that excellent Stephen Baxter book sitting on my bookshelf. Feynman lets the reader understand the many aspects of the concept before moving on, and then he develops the concept to introduce his next point. I am more interested in quantum mechanics than ever before. I highly recommend this title!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A126KX6FVI4T66"
                },
                "Date": "on August 3, 2001",
                "Helpfulness": 0.034482758620689655,
                "StarRating": "3",
                "Text": "Physics at the \" Oh, Golly!\" level... So why do I go bck to this book almost as  much as Pauli's Relativity? I suppose it is his neat process graphs or his homey style? The neutron decay beta process: d(-1/3)-> u(2/3)+W(-1); W(-1)->e(-1)+v(0) Even looks good until you start adding up the masses! If nonlinear renormalization is a dippy process, then so is QED."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on May 14, 2003",
                "Helpfulness": 0.02247191011235955,
                "StarRating": "5",
                "Text": "I personally did not actually read this book although i am positive it is excellent. I may not be a physicist (although i wish to become one... and richard P. feynman is who i can only dream to become like) but i did discuss quantum electrodynamics with a physicist and ironically he could not even pronounce it and i could. i also have a question for future people who post and know alot about feynman; did he work on \"enigma\" during world war 2?"
            }
        ],
        "ReviewUrl": "http://www.amazon.com/QED-Strange-Theory-Light-Matter/product-reviews/0691024170/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "95"
    },
    "Salesrank": "#62,037",
    "Timestamp": "2015-05-24 15:21:25.344116",
    "itemurl": "http://www.amazon.com/QED-Strange-Theory-Light-Matter/dp/0691024170"
}
