{
    "Category": "in Books (",
    "ListPrice": "$12.25",
    "Name": [
        "The Chilling Stars: A Cosmic View of Climate Change"
    ],
    "OfferPrice": "$11.03",
    "Reviews": {
        "AverageStarRating": "4.5 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1S60W4KWFX1Y9"
                },
                "Date": "on October 31, 2008",
                "Helpfulness": 0.9642857142857143,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NNOTZUB56O04"
                },
                "Date": "on September 8, 2008",
                "Helpfulness": 0.9482758620689655,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A162CQ2W381QYT"
                },
                "Date": "on November 1, 2008",
                "Helpfulness": 0.9111111111111111,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AZEZY71T4DP5"
                },
                "Date": "on October 5, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book requires an open mind, some critical thinking, and eyes open to new concepts. An old proverb states: all progress stems from unpopular decisions - so if you're an avid believer of Al Gore and the UN's IPCC you're wasting your time. When comparing Svensmark's advanced thinking to Pythagoras discovering a round earth in 500 BC, you will be amazed at how organized and logical his perception of our climate is, similar to Pythagoras actually having accurately computed the earths circumference in 500 BC. Both were unpopular as their work didn't fit into political agendas of their time - however, I commend their persistance in persuing science without an agenda. The book is a fascinating and worthwhile read and is written for a general audience, though parts of it require some pondering to digest the concepts. Svensmark was not entirely alone in his discoveries as previous work has contributed to his; however his work has become a milestone through his own contributions as well as enjoining other evidence into a predictable scientific basis of climate change."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TMFQU22GNMF2"
                },
                "Date": "on August 1, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3F9OE03MCDEF5"
                },
                "Date": "on July 11, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MGTC5QLHMOWA"
                },
                "Date": "on October 18, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWFUUQ3R0AYPI"
                },
                "Date": "on October 16, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2A6WJGHS5ZO0X"
                },
                "Date": "on December 27, 2012",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "To a layman, it seems to have a ring of logic.  The effect of cosmic radiation on the formation of subatomic particles and nuclei affecting cloud cover seems more logical than Al Gore's green world government agenda."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QM7D6Q5YRDRK"
                },
                "Date": "on October 14, 2011",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2E766N98VRUB6"
                },
                "Date": "on September 27, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "A scientific theory is at best a \"best guess\" based on, one would trust, education and some intelligence. This book takes the global warming discussion to a higher level presenting a theory that goes way beyond the view that has been waxing for the past 20 years. Read carefully for a better understanding of the issues and theories."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28ODG1AXSAY2D"
                },
                "Date": "on January 13, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1O3TBHIP3A6MO"
                },
                "Date": "on August 8, 2010",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "A well written book with a stream of new and interesting theories and facts.  As is so often the case the dogmatic status quo has fiercely resisted accepting  the effects of comic rays.... Buy the book, to learn and support this brave pursuit!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TUHX302NQ7XI"
                },
                "Date": "on January 10, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Learn about the true mechanism behind climate change - the Sun's variability and its influence on the flux of Galactic Cosmic Rays and its impact on low altitude cloud formation. CO2 and other non-condensing greenhouse gases are bit players. Excellent antidote to the current fixation with anthropogenic (i.e., man-made) climate change. Nature is still in charge."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AV20D8PBJCH6K"
                },
                "Date": "on May 12, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A63UVTZS1Q532"
                },
                "Date": "on September 8, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AV3CZBGT4TG2I"
                },
                "Date": "on September 15, 2012",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AWLLWDXD3AQC"
                },
                "Date": "on September 25, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29ILQHKEGK9XC"
                },
                "Date": "on August 7, 2012",
                "Helpfulness": 0.75,
                "StarRating": "4",
                "Text": "Very thoughtful presentation to an alternate climate proposal based on the effects of Cosmic Rays on the cloudiness of the atmosphere.  Presents interesting theories and data from scientific experiments by two people who think outside the box on matters of climate.  A good read for anyone interested in Climate Change and its causes."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AD71YN0O07VQC"
                },
                "Date": "on May 13, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATPCO8DCGB1BY"
                },
                "Date": "on January 27, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Intriguing theory with lots of supporting background. Svensmark and Calder show with great persistence that other factors may be involved in climate change."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YQA1YNPQ1N1F"
                },
                "Date": "on November 17, 2014",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "This book is compelling. Gives a much larger examination and explanation to the occurrence of climate change over thousands of years and not just in the last 150 years. The earth has been warming and cooling since it came into being and before there were influences by mankind. Carbon dioxide makes up 0.03% of the atmosphere. It is hard for me or anyone else who has a scientific background to believe that CO2 can have the impact suggested by some in the \"anthropogenic community.\" Read the book and I think you'll find a compelling reason for what Dr. Svensmark and Dr. Calder have observed for the change in our climate before, now and in the future."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39D79CRFUZNH8"
                },
                "Date": "on April 16, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A terrific coverage of billions of years of galaxy effect on the earth's climate and life. If you are interested in astronomy, or not, this book is exciting and educational. The theories and data are thoroughly researched and the data supported by astrophysicists. It is no wonder that the global warming alarmists and crony government funding shakers choose to exclude the science of astronomy in their  claims of \"scientific consensus\" in advancing their agenda."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UI5ODGOLAXEI"
                },
                "Date": "on December 7, 2008",
                "Helpfulness": 0.10204081632653061,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANU2057VWG2SN"
                },
                "Date": "on February 7, 2009",
                "Helpfulness": 0.18,
                "StarRating": "1",
                "Text": "Save your money.  The theory is this:  Cosmic rays (which are real; they are emitted by super novas, which are large, exploding stars) travel to the Earth and particles in the rays are transformed (it's not important to know how) into something Henrik Svensmark calls \"muons\".  These muons pierce the Earth's atmosphere and cause cloud formation.  Svensmark claims that cloud cover cools the earth.  In periods of greater cosmic ray production, the earth will cool because of increased cloud cover.  In periods of lesser cosmic ray production, the earth will warm.  Global warming now is caused by reduction in clouds, which in turn leads to warming.  That's the theory in a nutshell.  Additional pages are devoted to portraying Svensmark as the lone hero in a hostile scientific community which doesn't want to admit that his patently valid theory is the right theory for explaining global warming.  Many pages are devoted to attempting to link past ice ages with increased cosmic ray activity.  This is one effort that is dubious.  Applying only common sense, the whole theory is dubious.  If  decreased cloud formation were causing global temperatures to rise, I would think we might notice something going on.  Likewise if cloud cover were causing an ice age, one would think that residents of the earth might have noticed something.  Again, on the basis of common sense alone, pouring over 800 gigatons of carbon dioxide per year into the atmosphere, as we now do, should have an effect.  Would you think you could do that without consequence?  I don't.  The book is written in a melodramatic style which obscures serious scientific thought by a promoter of Svensmark.  It is not a balanced consideration of the pros and cons of the theory as science and even the author qualifies the assertions it makes.  Don't waste your money."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Chilling-Stars-Cosmic-Climate-Change/product-reviews/1840468661/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "25"
    },
    "Salesrank": "#333,423",
    "Timestamp": "2015-05-24 15:16:31.399743",
    "itemurl": "http://www.amazon.com/Chilling-Stars-Cosmic-Climate-Change/dp/1840468661"
}
