{
    "Category": "in Books (",
    "ListPrice": "$346.95",
    "Name": [
        "Introduction to Spectroscopy"
    ],
    "OfferPrice": "$119.95",
    "Reviews": {
        "AverageStarRating": "4.1 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACTAEKTNJUUDD"
                },
                "Date": "on May 22, 2001",
                "Helpfulness": 0.9285714285714286,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 4, 1999",
                "Helpfulness": 0.8421052631578947,
                "StarRating": "4",
                "Text": "I have found this book to a great tool for students of organic chemistry especially those wanting to further their education in graduate school or medical school.It is eay to read and can also be used a \"teach  yourself\" book. I recomend this book to anyone who is a bit shaky in  interpreting NMR, IR, and Mass Spec."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ARA52HB238HT"
                },
                "Date": "on August 23, 2001",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "The new edition of Pavis might be the twin to Crews' Organic Structural Analysis.  This text discusses the fundamentals of 1H NMR, carbon-13 NMR, infrared spectroscopy, UV spectroscopy.  The book also includes a section on 2D NMR.  Pavia should not be missed by advanced undergraduate students who pursue research and practicing chemists who need quick reference on interpreting spectra."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on April 11, 2003",
                "Helpfulness": 0.8125,
                "StarRating": "2",
                "Text": "Standard textbook outlining most spectroscopic techniques as taught at undergraduate level. However, contains an embarrassingly dated treatment of mass spectrometry which can not have been rewritten since the 1970s. No mention of the biggest MS techniques in use today (electrospray and MALDI), a glaring oversight especially in light of Fenn & Tanaka winning Nobel Prizes in 2002 for just these developments. And time-of-flight instruments having a mass range of 5000 and resolution of 200? Several years before this book was published, commercial machines were available with mass ranges well over 100,000 Da and resolutions of 10,000+. Not only poor, but misleading. Overall, a rather derivative book that seems to have been written largely by consultation of more authoritative work (probably an early edition of Williams & Fleming)."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHBXYLIVJU949"
                },
                "Date": "on April 7, 2010",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "I had to use this book for my organic spec class. Its a great book to help you get the main ideas. However, it needs additional references. It pairs very well with the Silverstein book. Also, buy the international edition of the book elsewhere. Its only about forty bucks and it is spot on identical."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYBJNDKFGAIPH"
                },
                "Date": "on August 17, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I absolutely LOVE this book. I first bought it for my Junior year analytical chemistry class, and I still use it today in grad school. It is VERY good at explaining NMR theory. Anything I ever needed related to NMR or IR I found in this book. It is by far the most useful chemistry book I own."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SJHSB8J8C72Z"
                },
                "Date": "on January 24, 2010",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is the most important book anybody who has any associate with spectroscopy will ever buy. It has beautiful spectroscopy tables in the back so that you know exactly what comes at that frequency, the text is terrific, and they have examples in the back to help solidify the knowledge. If you're taking spectroscopy or just need a lab IR, NMR, MS reference, buy it. If you hate books and want to fail, shoot for another text."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23XTMREJEODQM"
                },
                "Date": "on April 27, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This came quickly and in good condition.  However, it would be nice if science books were cheaper.  This is in color, which is nice but adds to the cost of printing (and ultimately your price).  Being a science major is expensive when you have to buy books each semester. This was better priced than in my college bookstore, but still a lot.  The book itself was written well, and helped with the class (analytical chemistry)."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ELY5MF2I6ZJS"
                },
                "Date": "on April 17, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I thought that this book was actually really expensive for being a paperback but now I realize that the value is not in the construction of the book but the construction of the material inside. This book takes a rather difficult and intense subject matter and breaks it down into an easy and digestible concept. I would recommend this book to any aspiring chemist."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37Z90MIFYGO1V"
                },
                "Date": "on February 25, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A great book for anyone who has dabbled in spectroscopy and would like to learn. Extremely useful for identifying NMR peaks caused by heteroatoms. The older editions are just as good as the new one and for a better price. I had one copy stolen during the semester. I didn't blink an eye at buying a new copy."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVMLMV2SSPY65"
                },
                "Date": "on July 20, 2010",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3O1486FIZZSVJ"
                },
                "Date": "on November 8, 2013",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": "The book /initially/ looked in good condition. After one week of use the a few pages fell out...and a few weeks later a handful of pages fell out. The entire book is falling apart. Not worth $150..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QADMIRABHOVV"
                },
                "Date": "on December 10, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Very helpful & great for learning the different spectroscopic techniques that are most frequently used by chemists. Lots of spectra & problems to test your knowledge & gauge where you are."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31N41N2FGA3PB"
                },
                "Date": "on June 8, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Superb book. Goes into great detail about HNMR, 13C NMR, Infrared, ultraviolet. Pretty much anything you could ever want to know about the theory"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3T43HNFI0MEPE"
                },
                "Date": "on November 22, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Needed this book for my school's Ochem 1. course. Great condition. IR explanation goes in depth; an overall great product."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24Y0LNBLH1T21"
                },
                "Date": "on March 14, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "the book came very helpful when i was taking this course as an undergrad, I still use the book to refresh"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3T5XOZ735FB3"
                },
                "Date": "on January 26, 2015",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "what was needed"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYXU47ZUQ7XRE"
                },
                "Date": "on July 27, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "As Described"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWOXH3YMCU529"
                },
                "Date": "on September 28, 2011",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "I got this for a few bucks so hard to pass. You can get most of the updated information on wikipedia. Knowing which is the best one to use is better resolved with a quick call to a lab."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3Q84C82Z6AG9J"
                },
                "Date": "on February 22, 2011",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": "The book is really expensive for an international edition. The seller needs to state it clearly on the main advertizing page that it's an intl. edition. The caption it's like new for a price of $95 is very deceptive since the actual intl edition ranges between $55-$70. I bought the book at the advertised price with the thinking that it was the US edition."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Introduction-Spectroscopy-Donald-L-Pavia/product-reviews/0495114782/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "20"
    },
    "Salesrank": "#228,085",
    "Timestamp": "2015-05-24 15:23:31.617369",
    "itemurl": "http://www.amazon.com/Introduction-Spectroscopy-Donald-L-Pavia/dp/0495114782"
}
