{
    "Category": "in Books (",
    "ListPrice": "$25.95",
    "Name": [
        "Fire from Ice: Searching for the Truth Behind the Cold Fusion Furor"
    ],
    "OfferPrice": "$19.20",
    "Reviews": {
        "AverageStarRating": "4.4 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMZPTAHUMLX9U"
                },
                "Date": "on November 7, 2004",
                "Helpfulness": 0.95,
                "StarRating": "5",
                "Text": "Eugene Mallove tragically lost his life earlier this year in a simple act of barbarism.  So odd that a man who devoted his life to one of the most neglected and abstract fields of science in the late 20th Century would die in such a senseless manner.  Luckily, Gene's lifes work will not be a waste, as Cold Fusion is finally starting to achieve the recognition it rightly deserves.  It will be pinoneers like Dr. Mallove who will be remembered for keeping the Cold Fusion flame alive during some of its darkest moments.  Buy and read this book, it's sure to be a collectors item soon, as Cold Fusion will soon emerge as a mainstream field of science and Dr. Mallove will be exonerated for persuing such a taboo field of science."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 28, 1998",
                "Helpfulness": 0.8823529411764706,
                "StarRating": "5",
                "Text": "Great boot about cold fusion. Mallove is not a crackpot that the cold fusion skeptics can throw under the rug. Gives the general picture about cold fusion and findings from \"respected labs\". Very good."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DQ7M3UVCR05E"
                },
                "Date": "on December 22, 2011",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "The focus of the book is on cold fusion's statistically impossible anomalies. The author shows that such data can be just as important as repeatable experiments even though it is not accepted by mainstream scientists for some stubborn reason. If you all have a chance, check out the 60 minutes special on cold fusion on youtube where a skeptical scientist recants his original statements upon witnessing unexplainable anomalies at a facility which was carefully set up with his supervision. I really feel this book shows the promise of cold fusion without getting speculative or cultish. It's a wonderful book. Buy it if you want a good read on how peer reviewed conventional science can still fail us. Buy it if you have a fascination with cold fusion as it goes into the history of all fusion and has illustrations/photos to boot."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on April 2, 2000",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "I thought this was a great book.  If you want an intriguing book about the controversial energy source of the future you must read this book.  It is an excellent read!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11BY7397TN7T2"
                },
                "Date": "on May 26, 2004",
                "Helpfulness": 0.7272727272727273,
                "StarRating": "5",
                "Text": "I am a Coast to Coast AM listener. I would like to have everyone read his book. It is remarkable. I think that the leaders of the world should all have a copy! I would also like to send my deepest prayers to the family of this beloved author, Eugene Mallove. He and his work will be greatly missed. Blessings to his family and friends."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on November 4, 1998",
                "Helpfulness": 0.6875,
                "StarRating": "5",
                "Text": "Mallove has produced a fine documentary of the early days of the cold fusion controversy, which has developed into an underground science.  Ignorance of this discovery will be viewed with the kind of curiosity that  causes us to wonder why the discovery of the 'cat's wisker' transistor in  the 20's did not lead to any kind of serious research effort for several  decades in a world that desperately needs clean energy."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3E1VP5IU5UNHX"
                },
                "Date": "on April 29, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on September 23, 1999",
                "Helpfulness": 0.1527777777777778,
                "StarRating": "1",
                "Text": "As far as style of thinking is concerned, Dr. Mallove is far closer to, e.g., creationists than to, e.g., Carl Sagan.  He has let his intense messianic desire that cold fusion be a reality completely cloud his  scientific judgement.  The loony, physics-ignorant hordes of cold-fusion  advocates include such worthies as a fellow in Australia who has sold kits  of magnets and a ball-bearing which he has claimed will roll around a  closed track forever with no visible means of propulsion.  Dr. Mallove does  not refute such garbage.  In this reviewer's opinion he is either  delusional or simply a con man on a par with Erich von Daniken or Whitley  Strieber."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Fire-Ice-Searching-Behind-Fusion/product-reviews/1892925028/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "8"
    },
    "Salesrank": "#730,313",
    "Timestamp": "2015-05-24 15:34:55.122404",
    "itemurl": "http://www.amazon.com/Fire-Ice-Searching-Behind-Fusion/dp/1892925028"
}
