{
    "Category": "in Books (",
    "ListPrice": "$14.95",
    "Name": [
        "Obsessive Genius: The Inner World of Marie Curie (Great Discoveries)"
    ],
    "OfferPrice": "$13.14",
    "Reviews": {
        "AverageStarRating": "4.4 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOM98X5SSG8KU"
                },
                "Date": "on October 28, 2009",
                "Helpfulness": 1.0,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29JJJ7SPAMBRQ"
                },
                "Date": "on November 28, 2004",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": "Obsessive Genius is an utterly fascinating portrait of a hallowed and difficult subject. If you are a fan of Goldsmith's work, (I am) you will immediately see that she is the perfect person to give Curie the complexity and dimension she deserves --as a scientist and as a woman. It's a short book which is by turns moving, informative, and intriguingly unexpected. I couldn't put it down."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADFEVWV4EF2IF"
                },
                "Date": "on December 23, 2004",
                "Helpfulness": 0.9285714285714286,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3J8U4UA4QBZBW"
                },
                "Date": "on November 29, 2004",
                "Helpfulness": 0.8055555555555556,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3R7NLLM1OWR1X"
                },
                "Date": "on December 5, 2004",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "5",
                "Text": "Kudos to social historian and biographer Barbara Goldsmith for her newest achievement, the insightful and compelling \"Obsessive Genius:  The Inner World of Marie Curie.\"  This is no dry scientific treatise merely listing Curie's accomplishments in science, but an in-depth study of the very human side of this extraordinary woman and subsequently, the coterie of family, friends and peers who entered her realm.  Ms. Goldsmith does make complicated scientific material accessible, indeed, understandable;  however, she goes much further, examining the forces which aligned to create the eponymous Curie's character and enormous drive to achieve, which directed every aspect of her life.  Through access to Curie's personal diaries and papers, previously unavailable for the past 60 years, as well as copious additional material, Ms. Goldsmith has culled a most fascinating portrait of a most fascinating personality.  This book demands that yet another feather be placed in Barbara Goldsmith's literary cap (her previous titles include: \"Other Powers: The Age of Suffrage, Spiritualism, and the Scandalous Victoria Woodhull,\" \"Little Gloria...Happy At Last,\" \"Johnson vs. Johnson,\" and \"The Straw Man\").  I highly recommend this biography to anyone interested in science, women's struggle for equal rights, the psychology of genius.......in short, anyone interested in an informative and thrilling \"read!\""
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XXJ6I7K2I7SI"
                },
                "Date": "on December 30, 2004",
                "Helpfulness": 0.76,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JHNPMQGGQVSJ"
                },
                "Date": "on July 25, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VP7JOT3K7PFM"
                },
                "Date": "on March 18, 2005",
                "Helpfulness": 0.7777777777777778,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AV012HC29JEBB"
                },
                "Date": "on April 17, 2006",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2U5RCCY18CFOC"
                },
                "Date": "on December 28, 2004",
                "Helpfulness": 0.7777777777777778,
                "StarRating": "4",
                "Text": "This is a comprehensive and insightful look into the life of a brilliant scientist, Marie Curie. It is an intimate portrait of her triumphs and hard times. Blessed with superior intellect and a knack for science, she was determined not to let sexist trends of the time hold her back. Curie learned complicated math and science at a young age with her father's help and her fierce study habits. Science was everything to her. Although this book is melodramatic at times, the psychology of Marie Curie is very interesting; she led a wonderful and tragic life. Goldsmith effectively describes the intensity of her achievements against the odds, and reveals her inner world.  Her husband Pierre was her flame, her partner in science and in life; once that flame went out, she lost her spirit. Reading this book will make you see her in a totally different way."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2I8T40ENVWSUI"
                },
                "Date": "on April 2, 2011",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33308WABP18VX"
                },
                "Date": "on April 17, 2006",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RX9706A2ZP8F"
                },
                "Date": "on May 30, 2009",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JLQE7D1Q4SS2"
                },
                "Date": "on April 17, 2006",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Obsessive Genius a well-written account of both Marie Curie's personal life, as well as her scientific achievements.  Barbara Goldsmith makes Marie Curie a real person, with faults just like the rest of us, but still a woman whom nobody should fear being unjustified in idolizing.  I feel that is the purpose the author had behind writing this book, learning why we idolize Marie Curie to this day, and whether or not we truly should, how much of it is myth and how much it is truth.  The book starts with Marie Curie as the fifth child in a poor family in Poland, who barely knew her mother because of tuberculosis.  The book paints a portrait of a woman who had to work non-stop just to go to attend a university, a woman who throughout her life worked obsessively to the point where she would forget to eat.  The book also does a good job of portraying how difficult it was for her to work in a community that did not want to accept a woman as a brilliant scientist.  So much was denied to her because of her gender, but she worked through it to reach her goals.  This truly is an inspiring book that describes a woman's life, her goals, desires, emotions, triumphs, and downfalls."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YWZ3FU1RIAJR"
                },
                "Date": "on February 25, 2006",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Z8626QC8DIH4"
                },
                "Date": "on October 18, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJ1QP2E3V6RQB"
                },
                "Date": "on June 24, 2005",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "I only had a general idea of Mme Curie's contribution to science was, and my own understanding of the \"time\" allowed me to understand some of the challenges she faced breaking the glass ceiling in the world of science, but this biography brought her struggles and contributions to life.  What I found quite interesting was her contributions to WWI:  a portable x-ray machine for the field doctors.  History mentions time and again how planes and other \"new\" technologies were used for the first time in WWI, but this tidbit has been noticeably absent.  And that she literally gave her life so that others could truly benefit is and will continue to be her legacy."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NMW3XM1G7OTQ"
                },
                "Date": "on November 15, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "This book is a fascinating look at an unusual woman and gives some insight into what it is like to be a woman in science."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZW2DYDB9328L"
                },
                "Date": "on February 14, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "It was a wonderful biography of Marie Curie and very interesting but there were times I got lost in all the technology and chemistry of it.  I would rate it a 4 1/2 but the stars above wouldn't let me rate it that way.  What an amazing woman and what amazing accomplishments and contributions she made especially in that time."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHL11KWSWPVHJ"
                },
                "Date": "on October 7, 2006",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I just have good words for this wonderful book. A concise book with just the information you need to know and a story, the real story of this remarkable woman. The life of Marie is kind of sad, but the accomplisment she made, outstanding.  This books is also, a good portrait of the story of particles and radioactivity."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2L59KP0QA5RWE"
                },
                "Date": "on January 31, 2007",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ECG521QF7KUS"
                },
                "Date": "on April 1, 2005",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UWGR88UD16Z6"
                },
                "Date": "on March 20, 2009",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20O4507LS9T36"
                },
                "Date": "on January 28, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I thoguht this book was fantastic!  It portrayed Marie Curie as a genius but unlike Eva Curie's biography, we learned all sides of Curie's character and life.  The true romance bewteen Marie and Pierre is not lessoned by the absence of Eve's cloying desire to make Marie perfect.  Descriptions of the experiments were complete and exciting.  I recommend this book highlyl."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25M82TXYHZY9Q"
                },
                "Date": "on August 28, 2013",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": "The only thing more boring then actually doing experiments for years in a cold lab is reading about it. I love science but the torture attached to every little discovery does not make for great reading. Not a book I would recommend."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38Y6W9A85XUZW"
                },
                "Date": "on May 5, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Complicated, brilliant, pioneer!  This book brings to mind so many different ways of describing this phenomenal scientist!  A must read for anyone that appreciates science."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXDTN67YVQSZY"
                },
                "Date": "on April 1, 2005",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BX8AQZI0RILP"
                },
                "Date": "on April 11, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book is a fantastic look at the life of Marie Curie. The book not only discusses her life but delves into the life of her family and colleagues in a way that provides a well rounded picture of Mrs. Curie's life. If you're at all interested in Marie Curie I highly recommend this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DW700HEBQC4P"
                },
                "Date": "on September 24, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Short and sweet.  There's plenty of opportunity for the author to exploit the adulterous affair with a married man and other areas open to speculation, but she never extrapolates beyond the research."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KQEOY4H17KYM"
                },
                "Date": "on October 25, 2014",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": "Not a fan .  The story spoke as much about the men that surrounded Madame Curie as the woman herself.  I suppose it was the authors attempt to explain the difficulties for the woman of the time."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A288WLCSHKMY2P"
                },
                "Date": "on December 1, 2007",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is one of the most wonderful biographies I've ever read. It is not a dry listing of dates but rather a tender telling of the lives of the Curies. I highly recommend it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5QDYEN1IYQER"
                },
                "Date": "on May 11, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I have read many biographies about Marie Curie. This is by far the most intimate and detailed. I couldn't put it down. My 15 year old daughter enjoyed it as much as I did."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UP4AV1A8Y6XH"
                },
                "Date": "on September 19, 2008",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Very good book for someone interested in Marie Curie's life. I recommend it for students and teachers of chemistry, physics, nuclear sciences and history of science."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SL3ZKZQANLWI"
                },
                "Date": "on May 20, 2008",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "The life of the Curie was incredible. Her deep passion to her work and alinating herself from life and pain was breathtaking."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HAHFZYFRWB72"
                },
                "Date": "on September 10, 2005",
                "Helpfulness": 0.6,
                "StarRating": "5",
                "Text": "I found this book to be most interesting because it touched on the personal life of Marie Curie.  She was a dedicated and brilliant scientist but a sensitive and sometimes \"wanting\" person.  The loves of her life were encompassing and she struggled through the most difficult times.  I thoroughly enjoyed the book,  writing and chronology of her life."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Z87398O5JDVX"
                },
                "Date": "on March 28, 2006",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I loved this book.  The further I read the more fascinated I became.  I would highly recommend it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AF42NMY0DFDRQ"
                },
                "Date": "on July 9, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "My niece loved this book and used it for a book report for school."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D2VIUT2HWP0Z"
                },
                "Date": "on April 13, 2005",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WU2I9UNT8JL3"
                },
                "Date": "on March 31, 2005",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3G6JJBA2RM48Y"
                },
                "Date": "on March 26, 2007",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "I read this book for background on Marie Curie because I'm working on a project related to her - this book far surpassed my expectations. It was engaging, informative, and a great story."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PC4K7X0TP4M1"
                },
                "Date": "on February 22, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Very interesting biography"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23VWYKQL91I7L"
                },
                "Date": "on January 21, 2006",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Reading this book was extremely interesting for me. I was inspired by this genius woman."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Z60T6ZSJ4DYN"
                },
                "Date": "on May 9, 2005",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3B94NVLCRBXRD"
                },
                "Date": "on March 30, 2008",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "As seen in Goldsmith's poignant -- and scientifically lucid -- portrait, she was a depressed, obsessive genius. Life itself was less important than the work. Could Marie Curie have achieved so much without the depression? Probably. Without the obsession? Probably not."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FH0PFKDWL3R7"
                },
                "Date": "on September 1, 2005",
                "Helpfulness": 0.5588235294117647,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30TK6U7DNS82R"
                },
                "Date": "on April 21, 2005",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23OLHL5RPQKLP"
                },
                "Date": "on May 22, 2005",
                "Helpfulness": 0.4782608695652174,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34KTXD3UPF9B8"
                },
                "Date": "on December 5, 2004",
                "Helpfulness": 0.3125,
                "StarRating": "5",
                "Text": "This book should be in every library and under every Christmas tree or Hunakah bush!It is the perfect gift."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2F3SXHT6RBV81"
                },
                "Date": "on January 24, 2005",
                "Helpfulness": 0.25,
                "StarRating": "3",
                "Text": null
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Obsessive-Genius-Inner-World-Discoveries/product-reviews/0393327485/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "49"
    },
    "Salesrank": "#405,390",
    "Timestamp": "2015-05-24 15:18:16.784131",
    "itemurl": "http://www.amazon.com/Obsessive-Genius-Inner-World-Discoveries/dp/0393327485"
}
