{
    "Category": "in Books (",
    "ListPrice": "",
    "Name": [
        "Methods in Modern Biophysics"
    ],
    "OfferPrice": "$69.95",
    "Reviews": {
        "AverageStarRating": "4.8 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1V81KU11G2HYW"
                },
                "Date": "on March 9, 2004",
                "Helpfulness": 0.9130434782608695,
                "StarRating": "5",
                "Text": "If you are looking for a spectacular, brand new textbook for an introductory or advanced course in biophysics, this book is highly recommended. I found that the book with its unique scope covers all the essential subjects of biophysics methods needed for the biophysics/biochemistry/medical student. A few years ago I was looking for all those methods in one book - but there was none available. I had to extract the information from 5 different books which was quite time consuming. So this book really fills a gap. Also, compared to other biophysics books it has far more graphics and contains a large amount of essential, previously unpublished information. The book is pleasant reading from beginning to the end and will give you a comprehensive picture of biophysics in a very educative fashion. In my opinion there is no cheaper way of education than reading a good book like this one."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZNE9MRVY0FB"
                },
                "Date": "on May 15, 2004",
                "Helpfulness": 0.8947368421052632,
                "StarRating": "5",
                "Text": "This is an outstanding overview of the entire field of biophysics methods. The textbook presents the most important biophysics topics including fascinating biophysical nanotechnology and proteomics methods. The author uses lots of figures and does a marvelous job describing complex issues in fairly easy to comprehend terms. It is fun to read this book."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 26, 2004",
                "Helpfulness": 0.8461538461538461,
                "StarRating": "5",
                "Text": "\"Methods in Modern Biophysics\" is a comprehensive resource on the current areas of focus in cutting-edge biophysics methods and technology. This truly exceptional biophysics book distinguishes itself by a great clarity of the explanation of each technique and a very strong usage of diagrams and illustrations. More than 260 detailed figures make the most advanced topics easy to visualize and understand. So even the beginner can comprehend ingenious biophysics methods at an advanced level. The graphics can also nicely be used for teaching. Everything is reader-friendly cross-referenced. After thoroughly reading this marvelous book, I was particularly amazed by the outstanding presentation of exciting developments in mass spectrometric analysis, X-ray methods for the structural characterization of biomolecules, infrared spectroscopic methods, electron microscopy, atomic force microscopy, scanning tunneling microscopy, scanning near-field microscopy, biophysical nanotechnology including force measurements in single biomolecules, proteomics, ion mobility-spectrometric analysis, and microwave effects. I highly recommend this most up-to-date biophysics textbook available to both students and experts seeking detailed, accurate and reader-friendly scientific information on recent developments of novel biophysical methods and who want to gain speed in this fascinating field. This text is an essential cornerstone of information - a must have for biophysicists and biochemists !"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 18, 2004",
                "Helpfulness": 0.8888888888888888,
                "StarRating": "5",
                "Text": "I have long looked for a book that gave me a summary of existing modern technologies for biophysical studies. This book offers a comprehensive overview of a wide variety of methods ranging from traditional methods such as X-ray to current state of art techniques such as microarrays. The methods are clearly described by many schematic figures. It is easy to read. The book also provides a comprehensive list of references for further details. It is highly recommended for anyone working in biophysics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AK6VT8LHTDXAI"
                },
                "Date": "on April 29, 2004",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": "This is a fantastic textbook on biophysics methods and techniques. I found it particularly useful for those who are theoreticians and computer modelers. As a theoretical biophysicist, I work on protein folding, protein structure prediction and ligand-receptor binding studies, and I was constantly looking for a book which contains all important and up-to-date experimental methods and techniques to better understand our experimental colleagues' work. Now I found it! If you are also looking for a book for introductory as well as advanced topics in biophysics methods, this book might be the one you are looking for. It essentially covers all the new and important subjects of this field. I found the chapters about proteomics, ion mobility spectrometry, and mass spectrometry, particularly interesting. I will try to include some of the material in the course \"Biophysical Chemistry\"(a graduate level course) that I am co-teaching, and I will strongly recommend this book to those who are interested in biophysics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQKAJVWVVEUKT"
                },
                "Date": "on April 26, 2004",
                "Helpfulness": 0.85,
                "StarRating": "5",
                "Text": "Read this book before you start PhD program! Wish I have had this book earlier. Inspires you to aim higher than you might have otherwise attempted."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 11, 2004",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "5",
                "Text": "Methods in Modern Biophysics is one of the best surveys available on the status of modern biophysics, biophysical methods and instrumentation. The book is clear and well-written and covers all the essential methods in biophysics and similar fields of science. It takes a non-mathematical approach toward the subject, so you don't have to be an expert at mathematics. Illustrations on almost every page assist in the task of presenting much detail while conveying the excitement of this dynamic field."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2K7HW60Y26V3J"
                },
                "Date": "on June 6, 2004",
                "Helpfulness": 0.8125,
                "StarRating": "5",
                "Text": "The book presents a lot of novel methods, in particular those related to biophysical nanotechnology and microwave technologies, that cannot be found in other textbooks."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZH5NZBIE8W88"
                },
                "Date": "on October 6, 2004",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "I highly evaluate this book as an important contribution to biophysics. There are many students interested in this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TFDBHG1WYNV0"
                },
                "Date": "on May 16, 2005",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "This book presents a review of various biophysical methods, most of them developed or significantly revised in recent years, for the use of studying biomolecules. The author illustrates each technique with lots of figures (makes me to remember the old phrase \"one figure is worth more than thousand words\") and also provides a good bibliography for each technique. The book also assembles the information that is hard to find from a single source. I enjoyed reading the book and recommend it for beginners as well as advanced users."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Methods-Modern-Biophysics-Bengt-N%C3%B6lting/product-reviews/3642030211/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "11"
    },
    "Salesrank": "#3,124,211",
    "Timestamp": "2015-05-24 15:50:17.404532",
    "itemurl": "http://www.amazon.com/Methods-Modern-Biophysics-Bengt-N%C3%B6lting/dp/3642030211"
}
