{
    "Category": "in Books (",
    "ListPrice": "",
    "Name": [
        "The Chilling Stars: A New Theory of Climate Change"
    ],
    "OfferPrice": "",
    "Reviews": {
        "AverageStarRating": "4.6 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OGXR0166Q0XJ"
                },
                "Date": "on April 25, 2007",
                "Helpfulness": 0.9432314410480349,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AN094WKYK3HJE"
                },
                "Date": "on April 14, 2007",
                "Helpfulness": 0.9009009009009009,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3I51WW2SB1CKN"
                },
                "Date": "on March 3, 2007",
                "Helpfulness": 0.8717948717948718,
                "StarRating": "5",
                "Text": "Science writer Nigel Calder does an admirable job of explaining Henik Svensmark climate change observations and theories.  He makes Henik's sun-earth climate change connection very understandable to the lay person. Unlike the current anthropogenic forcing theory of global warming which is based on just a few decades of measurements and unproven computer models, Svensmark's hard data spanning thousands of years of observation and analysis.  It's surprising that so much research has been done in this area, but has been largely ignored by the media and politicians.  I guess if they cannot assign responsibilty for global warming to people its not worth pursuing. The important point is that this book reveals clear investment opportunities for significant profit as people and governments continue to make economic decisions based on faulty assumptions with regard to the cause and effect relationships of global warming.  I would recommend this book strongly to any serious long range investor."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQ4GVWJJFI6EH"
                },
                "Date": "on April 19, 2007",
                "Helpfulness": 0.828125,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PMUN0HY3VACT"
                },
                "Date": "on April 9, 2007",
                "Helpfulness": 0.8666666666666667,
                "StarRating": "5",
                "Text": "First things first: this is a scientific book not a novel.  Some of it will be over your head and as long as you are comfortable with that you will be okay.  That being said I thoroughly enjoyed this book.  Why is a bit more vague.  This book outlines the formulation and testing of a thesis that cosmic rays affect cloud formation and it is that cloud formation that is the primary motivator of the Earth's climate.  This is a politically charged issue as all one hears is greenhouse gases in the media.  As such I have to admit I may be fond of this book simply because it is against the status quo.  Let's face it if somebody doesn't take an opposing view in science and test it you cannot be sure the validity of an argument.  Read it, you won't regret it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7RU2M0JV82LM"
                },
                "Date": "on June 14, 2007",
                "Helpfulness": 0.88,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4C6X940PJJSG"
                },
                "Date": "on April 17, 2007",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": "Henrik Svensmark is one of the great scientist of our age.  His groundbreaking research has lead to an understanding of how cosmic rays are a major force driver in cooling the planet through low-cloud creation.  When the sun's magnetic field is strong, cosmic rays are deflected, less clouds are created and the Earth warms naturally.  The amplitude of this forcing is of the same magnitude as that attributed in theory to the warming from carbon dioxide.  So which driver is in control?  Svensmark has proven his theories experimentally.  The man-made global warming theory is based on computer models."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29AD1KFS68146"
                },
                "Date": "on May 14, 2007",
                "Helpfulness": 0.8387096774193549,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32KAMWV31JB5O"
                },
                "Date": "on March 6, 2008",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27BUSBGKJUM0"
                },
                "Date": "on May 12, 2007",
                "Helpfulness": 0.8461538461538461,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A84RACMEA5ZNQ"
                },
                "Date": "on April 21, 2008",
                "Helpfulness": 0.875,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PEVP36Y5A2EQ"
                },
                "Date": "on July 30, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEE7WX3KA9689"
                },
                "Date": "on April 28, 2007",
                "Helpfulness": 0.7727272727272727,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26IUTQ77RCPW6"
                },
                "Date": "on February 22, 2008",
                "Helpfulness": 0.875,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALA9URW8ED0OG"
                },
                "Date": "on July 24, 2007",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": "Authors present a fresh theory about solar cosmic rays effect on global temperatures.  Hypothesis suggests that cosmic rays from exploding stars create low terrestrial cloud formations that cover 60% of Earth and that this, far more than industrial carbon dioxide production, determines global temperatures.  Earth is basically still too large for industrial pollution to be the driving force of world temperature.  The story illustrates well the introduction and evolutionary acceptance of a new idea that is contrary to an existing conventional wisdom that is already considered \"politically correct.\"  Although the authors conclude that their observations could be all wrong, this book will, in my opinion, become a new cornerstone to astrophysics and the establishment of governmental policy that will influence space policy and future nuclear research."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DZ3W61BGE77F"
                },
                "Date": "on April 13, 2008",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VX6A9UZBLEPI"
                },
                "Date": "on July 16, 2007",
                "Helpfulness": 0.7857142857142857,
                "StarRating": "5",
                "Text": "In a time where politicians and scientists argue about whether global warming is mainly due to mankind's continuing introduction of greenhouse gases into the atmosphere, it is interesting to read other viable scientific explanations for the earth's increasing temperatures. In this excellent book the authors provide a good example of the latter. Their thesis is that galactic cosmic rays play a very important role in affecting the earth's climate - both warming and cooling. Not only is their line of scientific reasoning (and the scientific principles involved) very clearly explained, but the authors also present much evidence from both the recent (centuries) and the distant (millions of years) past to support this theory. The book is very well written in a most authoritative yet friendly, accessible and engaging style. This exceptional work should be recommended reading for all those who are interested in global warming issues and are curious as to what some of the alternate scientific explanations might be. However, the book will likely be relished the most by science buffs."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HAREI9MW1UTH"
                },
                "Date": "on February 2, 2008",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3I9DM8V0M6U6H"
                },
                "Date": "on August 25, 2009",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AL3S43YVHVMNM"
                },
                "Date": "on May 13, 2007",
                "Helpfulness": 0.7647058823529411,
                "StarRating": "5",
                "Text": "I have long been a student of the Solar and universe effect on the Earths climate.  This book is an excellent read about a fairly dry but extremely important subject.  It avoids the politics of climate change and stays on the straight and narrow path of Science.  One would hope that it may help us to avoid the rush to stupidity that books like Al Gore is out selling."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5MAJV5IQOKM"
                },
                "Date": "on June 5, 2007",
                "Helpfulness": 0.7857142857142857,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RGYZ2RRURG3A"
                },
                "Date": "on October 12, 2007",
                "Helpfulness": 0.7692307692307693,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AFH6XDWQ6SY8"
                },
                "Date": "on August 29, 2008",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1E1O0EEQRQB26"
                },
                "Date": "on January 16, 2008",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10G0UV69NCHXB"
                },
                "Date": "on February 25, 2008",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UVMHGO7FZAC1"
                },
                "Date": "on November 10, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is one of the best books I've read in years. Eye opening, insightful and brilliant. The notion that we are connected in such an intimate way to the universe and distant exploding stars is not only an elegant theory, but a very plausible explanation of climate change and much more realistic than other \"hockey stick\" theories being suggested by the politically correct media and liberal establishment."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GA8HU27UO4D7"
                },
                "Date": "on December 19, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24PTVSZSM8968"
                },
                "Date": "on June 28, 2008",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AC3BYMWHHCD2L"
                },
                "Date": "on April 7, 2009",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QA51IWKH943D"
                },
                "Date": "on May 5, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Could not believe the condition and price of one cent. Reading on both sides of the global warming subject to make up my mind. There is a lot of dirty money on both sides of the isle."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AD71YN0O07VQC"
                },
                "Date": "on May 13, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHL11KWSWPVHJ"
                },
                "Date": "on July 30, 2007",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "I read this book not because I like controversial theories but just because I wanted to have a new perspective on climate change. The idea of cosmic rays affecting cloud formation is very interesting indeed since water vapor is the major player in the albedo of the planet and is the largest contributor to the greenhouse effect. Latest investigations though, shows that in the last 20 years cosmic rays have increased, and temperatures in earth continue rising but I wonder if 20 years can settle this debate since I'm not sure changes in some variable are reflected immediately in temperature. I agree that anthropogenic changes have affected earth climate, but I'm not very convinced that is the sole reason. We need to learn more about climate because, for instance, the ices ages cannot be explained just by the Milankovich cycles. In my opinion there is something else and we need to continue monitoring all the variables involved in order to have a better understanding of this important issue."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19RMDSYFNL433"
                },
                "Date": "on August 22, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Just finished this book. If you're interested in a different and (at least seemingly) objective look at facts (science), you wont be disappointed."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FYG9XCEK7HEV"
                },
                "Date": "on December 28, 2007",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "4",
                "Text": "Well written book with reasoned explanations of time association with glaciation.  Proof will take considerable collection of evidence for casual relationships.  The sulfuric acid specs if shown to be casually related to cloud formation in the lower 3 Km of the atmosphere by high energy particles at CERN could go a long way to explain the real reason for climate change.  Even though still a theory, it seems much more plausible than the political pseudoscience of climate change.  To think that 0.28% of greenhouse gases could initiate warming or cooling of the earth's climate is ignoring the natural sources of CO2, CO2 reservoirs, and plant growth with animal habitat increases. I believe Henrik Svensmark has it right."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21O5HV0YESZV4"
                },
                "Date": "on April 20, 2008",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "The Chilling Stars will embarrass the committee that awarded Al Gore the Nobel Prize.  Here is hard science, not pseudoscience.  If this were four centuries ago Al Gore would declare a \"consensus\" that the Earth is the center of the universe.  Henrik Svensmark would play the part of Galileo.  Challenging the majority is often met with censure and ridicule but that is how science advances.  Fortunately, the Pope isn't Urban VIII, threatening to burn Svensmark at the stake for heresy."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1V0RD2NQI3X37"
                },
                "Date": "on January 2, 2008",
                "Helpfulness": 0.6363636363636364,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1C4TVXDL6ZTJL"
                },
                "Date": "on July 4, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "One of those inconvenient realities - a good example of one of the climate drivers completely external to the Earth's atmosphere, as are most of them. A must read for a reality check on \"climate change\" propaganda!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AF67DA25PQCU"
                },
                "Date": "on September 24, 2007",
                "Helpfulness": 0.6363636363636364,
                "StarRating": "5",
                "Text": "Introducing a new theory about climate changing and global warming, the book brings lots of new information about the Earth, the Solar System and our galaxy, the Milky Way, their behavior and relationship with the climate on our planet. An interesting reading that busters the myths about carbon gas emissions and its consequence."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AU32WZV89J04V"
                },
                "Date": "on December 24, 2008",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Anyone who is seriously interested in climate change should read this book. It is very well written for the the lay person, extremely interesting, entertaining, and convincing. The role of cosmic rays related to the earth's climate is traced through geologic time to the present with overwhelming evidence (including current experimental data) to back it up. Whatever one's view is of the subject of global warming, this is a must read for those who wish to enter the debate."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AO8X29JZ1S2ZX"
                },
                "Date": "on December 19, 2011",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3F9OE03MCDEF5"
                },
                "Date": "on July 11, 2010",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3C4XLQSOUWCBP"
                },
                "Date": "on May 24, 2007",
                "Helpfulness": 0.6,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8XAI8QG7HOFV"
                },
                "Date": "on November 8, 2014",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": "No relevant data was presented to support the hipothesis."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UI5ODGOLAXEI"
                },
                "Date": "on December 21, 2007",
                "Helpfulness": 0.3793103448275862,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKT8TGIT6VVZ5"
                },
                "Date": "on July 21, 2007",
                "Helpfulness": 0.18811881188118812,
                "StarRating": "1",
                "Text": "Swedish astrophysicist Henrik Svensmark has collaborated with veteran British science journalist Nigel Calder in this book, \"The Chilling Stars: The New Theory of Climate Change\", which emphasizes Svensmark's hypothesis that a declining trend in cosmic rays entering the solar system is tied directly with decreasing cloud cover on Earth, resulting in global warming via solar radiation. While this is an intriguing hypothesis, it is also, regrettably, a rather simplistic one, which ignores the complex interaction of energy exchange between the world's oceans and Earth's atmosphere; an interaction that's been recognized by meteorologists, other climatologists, oceanographers, and geologists. Nor does it take into account the strong possibility that increased carbon dioxide - and aerosol - emissions from artificial, man-made sources have had an important impact on this complex interaction between the oceans and atmosphere, and have contributed deleteriously to global warming. Instead of this book, I strongly recommend Chris Mooney's recently published \"Storm World: Hurricanes, Politics, and the Battle Over Global Warming\" which does an admirable job in discussing the complex roles that both the oceans and the atmosphere play in affecting not only our daily weather, but more importantly, long-term trends in Earth's climate. There are other, more notable, instances where extraterrestrial matter has had a profound impact on not only Earth's climate, but also its biodiversity, as evidenced by the terminal Cretaceous asteroid impact (the \"K/T impact event\") approximately 65 million years ago which wiped out much of Earth's biota, including many marine organisms, and especially, on land, the non-avian dinosaurs (Moreover, it is quite probable that most of Earth's mass extinctions may have had extraterrestrial origins via asteroid impacts.). Regrettably for Henrik Svensmark, cosmic radiation isn't one of these notable instances."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Chilling-Stars-Theory-Climate-Change/product-reviews/1840468157/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "45"
    },
    "Salesrank": "#1,064,198",
    "Timestamp": "2015-05-24 15:23:25.135967",
    "itemurl": "http://www.amazon.com/Chilling-Stars-Theory-Climate-Change/dp/1840468157"
}
