{
    "Category": "in Books (",
    "ListPrice": "$37.50",
    "Name": [
        "Powering Planet Earth: Energy Solutions for the Future"
    ],
    "OfferPrice": "$33.57",
    "Reviews": {
        "AverageStarRating": "4.2 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GK9LT41X73NC"
                },
                "Date": "on June 26, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "In the preface, the authors state their target audience,ie: non-experts seeking to discover energy matters and policy, and significantly broaden their horizons and understanding of the field, and attempting to look into the future as well. Obviously, this book meets this objective and lots more! Divided into 15 interconnecting chapters, it is best to read from the beginning to finish (instead of picking your favorite subject first), since each is a building block into the next. Starting out with literally explaining how energy is consumed by all of us in each of our actions (title: \"What is Energy?\" including a really fine and down to earth description of E=Mc2, one even very young people can probably understand!)it then elaborates into just about any/all types of energy; including nuclear and solar energy, their histories, and future potential potential. IMHO, the best chapter is #9 \"Fukushima and the Future of Nuclear Energy\", about the recent catastrophe in Japan , triggered by an earthquake. After a lengthy description of this catastrophic event, the authors raise many questions about the future of nuclear energy world-wide, as we learn how nations reacted to this in their own nuclear power plants and plans. But this book is much more than that! The last segment \"Scenarios for the Future\" is about as good as it gets, and like the book itself, though scientific, is actually written for any curious reader, even exceptional high-schoolers. Frankly, any longer analysis by this reviewer may not give this book full justice, so I'll just say it's an absolute timeless subject, beautifully written and organized, at times even entertaining; and one that surely be relevent well into the future!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FOSLM5G1BO63"
                },
                "Date": "on October 16, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34CSXOGVYF94S"
                },
                "Date": "on September 9, 2013",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A54Z1TYIQPFR8"
                },
                "Date": "on September 29, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AB399AECXCDT8"
                },
                "Date": "on August 4, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Powering Planet Earth is a review of power sources available to us to use to meet our voracious need for power the world over. One thing I like about this book is that the authors take a balanced approach to presenting each type of energy that we could use (nuclear, solar fossil fuels, etc.) each one is compared to the others along the lines of efficiency, cost and degree of degradation to the environment. One chapter that was particularly useful for me was the chapter on nuclear energy. While I knew about the risks of a meltdown at a nuclear power plant and the need to store nuclear waste, I had always thought that, otherwise, nuclear power was pretty environmentally friendly. It turns out, however, that, between the mining of uranium and all the preparation that goes into getting it ready for use in a nuclear power plant, nuclear energy is not only dangerous but also destructive to the environment other ways. While I feel that the former argument was enough, it was helpful to see the whole picture and, indeed, that is just what the authors do for each type of energy they devote a chapter to in this book. If you want a fairly non technical but informative tutorial on our past and future uses of energy, I heartily recommend that you read this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1R4BL5MYUDNDJ"
                },
                "Date": "on August 15, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YVO5V1SO18DZ"
                },
                "Date": "on September 26, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "The field of energy sources and sustainability has been a hot topic since the OPEC oil crisis in the early 70s, and it has never been more important for energy consumers to better understand the road ahead. Our economy is significantly impacted by the availability and supply of energy, and the more we know as consumers, the better the choices we will make in terms of how we consume, how we conserve, how we influence public policy, how we vote, and a host of other activities that our within our control.  That's why I am so pleased to find a book like \"Powering Planet Earth: Energy Solutions for the Future.\" It provides an excellent survey of the field of energy solutions, and does so in a way that is neither heavy handed nor pandering. The authors don't cover every last potential energy source. Instead, they focus on areas that are under development or on the horizon. This seems like a good, balanced approach and avoids the \"pie in the sky\" hype that infects too many magazine articles and news stories these days."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YQ7M9GFU3Z65"
                },
                "Date": "on August 26, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2X9TSWP9AZFS4"
                },
                "Date": "on July 26, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A323VOBUO10557"
                },
                "Date": "on August 30, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is an informative exploration of the challenge to provide adequate energy supplies to the human race in the face of global warming. The three Italian authors hope we may thread this needle by presenting the case for the transition to renewables. The English translation is not perfect but is understandable. The presentation is logical, compelling, to-the-point, and consistent with climate science. Their rejection of nuclear energy as a means of replacing fossil fuels may be controversial, but they marshall supporting facts. A high school graduate could perhaps handle the content, but college graduates will find it more accessible."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QEA1RKT5N09I"
                },
                "Date": "on August 19, 2013",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30IP5D5DLHRPA"
                },
                "Date": "on July 18, 2013",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UE0PQHLCRO08"
                },
                "Date": "on February 19, 2014",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": null
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Powering-Planet-Earth-Energy-Solutions/product-reviews/3527334092/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "13"
    },
    "Salesrank": "#1,709,464",
    "Timestamp": "2015-05-24 15:43:25.922957",
    "itemurl": "http://www.amazon.com/Powering-Planet-Earth-Energy-Solutions/dp/3527334092"
}
