{
    "Category": "in Books (",
    "ListPrice": "$17.00",
    "Name": [
        "Atom: Journey Across the Subatomic Cosmos (Truman Talley)"
    ],
    "OfferPrice": "$15.13",
    "Reviews": {
        "AverageStarRating": "4.7 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHEW91ZUQDSKR"
                },
                "Date": "on December 9, 2004",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book is an excellent summation of the progress made in discovering sub-atomic particles, It may not now be up to date (it was printed in 1991), but I would not forgo the learning within, or the Asimov method of presenting it.  Isaac Asimov specialty was explaining difficult subjects to his readers.  He did an admiral job keeping the subject matter interesting.  Each short chapter is dedicated to a particle, ex. mesons, quarks, bosons. Each chapter also gives a little historical background of the search and discovery behind each particle and how it fits within the sub-atomic world. Nuclear physicists may have progressed far beyond this by now, but this is still a good book for piecing together the subatomic puzzle of particles."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 24, 1999",
                "Helpfulness": 0.9545454545454546,
                "StarRating": "5",
                "Text": "i'm 15 this year and i am studying physics in school. after reading this book, i have understood more concepts much more easily. the diagrams included are great. Asimov is really a great writer ad i strongly recommend  it to anyonee interested in physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKLJVPILAYGO"
                },
                "Date": "on October 3, 1998",
                "Helpfulness": 0.9473684210526315,
                "StarRating": "5",
                "Text": "'Atom' is very easy to read.  I have not had any calculus and therefore  could not take physics in college.  But the author presents the information  without using anything more than everyday math!  Also, I was taking a  101-level Physical Science class and the class's textbook gave a bit of  information about an atom here, and another bit there, and it was nearly  impossible to pull the facts together into a single conceptual  \"model\".  However, this book does the job quite nicely (by the  way, 'Atom' also presents some other physical science material, such as  properties of light and electomagnetic radiation and the four fundamental  forces,  in easier-to-understand language than the college book).  I now  have a clear understanding of the components of an atom - the oribiting  electrons that form a \"cloud\" and the nucleus (composed of  neutrons and protons - and their buliding blocks: quarks), other subatomic  particles (leptons, hadrons, baryons, mesons, neutrinos, etc), the 2  fundamental forces that hold atomic nuclei together (the weak and strong  nuclear force), and the concept of exchange particles that transmit the  fundamental forces.  I would have never obtained this kind of clarity from  the college text.  The author not only informs the reader of the facts, but  also explains how they were discovered - this helps to increase the  retention of the facts."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13JNP8LSEP524"
                },
                "Date": "on January 23, 2001",
                "Helpfulness": 0.8666666666666667,
                "StarRating": "5",
                "Text": "This is an excellent book for students of almost all ages (14 up). I was 14 when I read it, with no education in atoms, and I understood it perfectly. Asimov writes in a way that is extremely provocative and very informative. I highly recommed this book."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on April 16, 1999",
                "Helpfulness": 0.8888888888888888,
                "StarRating": "5",
                "Text": "i enjoyed the book. it is easy to read except for the chapter on quarks, which is difficult to comprehend. i will recommend this book to every one who wishes to learn about the subatomic world. there is only one drawback  for this book. it was published in 1991 and there have been more additions  to the subatomic world since then. the history of the search for atom and  its constituents is splendid. I love mathematics but i am too lazy to do  it. so for folks who don't like to dwell in mathematics to understand  particle physics, this is the right book for you"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2X7F0D66LK2WN"
                },
                "Date": "on January 24, 2008",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Overall Asimov did an excellent job explaining some pretty difficult concepts.  I most especially enjoyed the discussion of nuclear breakdown, ie, the conversion of one radioactive isotope into a completely different element.  I never really understood the relationship between mass and energy and now I believe I do.  Fascinating to say the least.  My only problem was the amount of material covered in the book.  I was not really interested in that much history and the discussion of the antiparticle.  However, I knew what I was getting into prior to buying the book."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 16, 1996",
                "Helpfulness": 0.875,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on April 5, 1997",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I love Physics,but my math is a little rusty, and this book is perfect for anyone who likes to wonder what those little things are.  (I mean atoms).  And as I was taking chemistry (I haven't had physics yet)  I actually used some stuff fromthe book to help me in the class.  And it is a quick read"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AW0GS58YXHNW8"
                },
                "Date": "on December 24, 2007",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FYP339SCGKFV"
                },
                "Date": "on April 8, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I've read a lot of popular science books and the first half or so of this book was mostly a repeat of things that I've already read. But the last two chapters are amazing. He has a way of explaining things that makes it clear and interesting, and also of telling the story of the discovery, and the initial reactions to assertions. His side comments will make you laugh out loud and his explanations will help you come to an understanding of the topic."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZHL7PH8GML0"
                },
                "Date": "on July 18, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A169CQVBBTFEF1"
                },
                "Date": "on November 10, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is the most interesting book out there for learning about how atoms work.  Issac Asimov is hands down the best non-fiction writer of all time.  He will take a complex subject and put it into terms that everyone can understand."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1536XISMJDBPI"
                },
                "Date": "on September 17, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on April 15, 1999",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "i enjoyed the book. it is easy to read except for the chapter on quarks, which is difficult to comprehend. i will recommend this book to every one who wishes to learn about the subatomic world. there is only one drawback  for this book. it was published in 1991 and there have been more additions  to the subatomic world since then. the history of the search for atom and  its constituents is splendid."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVJQWNKIU4B59"
                },
                "Date": "on March 1, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "An excellent review of particle physics for someone interested in the subject. Asimov is an excellent writer, of course, and he gives good historical perspective of the accomplishments made by physicists throughout the centuries. Becoming a little dated as physics continues to march forward. But an excellent non-math review of particle physics at the high school level. Highly recommend."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MLV6JOPCOJAA"
                },
                "Date": "on March 5, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "As always, Isaac does not obviate little details that turn to be important for the understanding of the subjet. I recomend this book for those who love physics. The emphasis is in how the puzzle of the subatomic world knowledge evolved and the imaginative minds that had built current knowledge. Try also \"What is Quantu Mwchanics? a Physics Adventure form Transaction College of LEX.."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1P7TYJWW1IQHW"
                },
                "Date": "on September 5, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I bought this book for my son who lives for anything science especially Atoms. He has already read it twice. It is a full of facts that my science lover. He can't stop singing the praises of this wonderful this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ICDLUQ3V2QY2"
                },
                "Date": "on January 28, 2000",
                "Helpfulness": 0.6428571428571429,
                "StarRating": "5",
                "Text": "I'm a hobby science-fiction writer, and you can't do that plausibly without knowing the facts of the subject matter.  Everything I know about physics I drew from this book and from Richard Feynman's \"Six Easy  Pieces,\" which I also recommend.  When I sell things and you like  them, you'll be able to go to this book and say, \"so that's where he  got it from.\""
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XL1WKRIGSTGE"
                },
                "Date": "on May 4, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Came in perfect condition.  Couldn't be happier."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QVSX7A6AAJR6"
                },
                "Date": "on April 21, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Just what I wanted!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15B5DO3A3A30C"
                },
                "Date": "on May 18, 2000",
                "Helpfulness": 0.5833333333333334,
                "StarRating": "5",
                "Text": "This book reveals a part of Isaac Asimov that I have never realized before: the Detective.  His journey across the subatomic cosmos is that of a detective, whether he is analyzing electrons, light, neutrons, quasars,  antimatter, neutrinos, interactions, or the universe.  He presents a  mystery, a problem, that stumps the experts in physics or chemistry or  mathematics, and then begins eliminating the suspects one by one until the  only possible solution is revealed.  He has done the same thing in his  science fiction, for example in his Foundation Series and Robot Series (see  my Amazon.com reviews of various of his books) - in fact, the heroes of his  robot series were a human detective and a robot or android detective.  I  grew up reading the science fiction of Asimov and/or his colleagues, and my  wife Dr. Marleen Josie Doctorow used Asimov's book on psychological science  fiction in her university psychology courses.  Asimov, by a remarkable  coincidence, was married to a psychiatrist, Dr. Janet Jeppson, and she  continued his Foundation Series after his death via his Estate and the  great writers Brin, Bear, and Benford.  When I read the front page  headlines recently in newspapers attacking psychiatrists and psychologists  like Freud, I wonder whether the journalists realize that all of science  and medicine and journalism involve detective stories.  The greatest  detectives also have something called intuition, which also goes by the  name of ESP, and in theology is considered to be a quality of the Divine.  Asimov had it, Saint Thomas Acquinas had it, the Old Testament Prophets and  Mohammed had it, Buddha had it, Einstein had it, Field Marshall Montgomery  had it.  It leaves us humble and grateful for the miracles of our and their  existence."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VW4XVM0BIP92"
                },
                "Date": "on December 3, 2009",
                "Helpfulness": 0.125,
                "StarRating": "3",
                "Text": "Isaax Asimov is a science fiction writer, but he also writes non fiction, science books.  He writes in a way that makes the average person understand what he is explaining.  None the less, I found this book way over my head.  I think I need something a little less complex.  The subject I know is complex, but I could have used an easier explanation.  I was a little disappointed with it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QJC4OTICYGJY"
                },
                "Date": "on October 8, 2002",
                "Helpfulness": 0.09523809523809523,
                "StarRating": "1",
                "Text": null
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Atom-Journey-Across-Subatomic-Cosmos/product-reviews/0452268346/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "23"
    },
    "Salesrank": "#96,869",
    "Timestamp": "2015-05-24 15:27:42.839766",
    "itemurl": "http://www.amazon.com/Atom-Journey-Across-Subatomic-Cosmos/dp/0452268346"
}
