{
    "Category": "in Books (",
    "ListPrice": "$99.00",
    "Name": [
        "Nanostructures and Nanomaterials: Synthesis, Properties, and Applications (2nd Edition) (World Scientific Series in Nanoscience and Nanotechnology)"
    ],
    "OfferPrice": "$89.10",
    "Reviews": {
        "AverageStarRating": "4.6 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Q0GJXNT4D7W0"
                },
                "Date": "on January 10, 2005",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book is intended to give an overview to those entering the field on how to fabricate nanostructures and their underlying chemistry. The main focus is on the fundamentals such as synthes and fabrication and covers as large range of toptics: nanoparticles, nanowires, nanorods, thin films, and carbon nanotubes as well as a diverse range of patterning techniques (AFM, self-assembly through conventional lithographic techniques). The last chapter of about 20 pages on applications is a bit short and only gives a general feel. The book should be suitable to both advanced undergrads or grad. students in chemistry, material science, physics, and EE. I myself found it quite accessible for self-study. I especially, liked the first ~50 pags explaining the fundamental such as surface chemistry and excellent explanation of surface tension."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17V23ETG28QUC"
                },
                "Date": "on September 16, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Many books in this area are too concerned with the nano hype and less focused on the science behind it. Others present several chapters, each written by a specific set of authors, that are not necessarily correlated and seem more like a collection of review papers instead of a book. In this context, in my opinion, this book is one of the best books covering the subject (together with ozin's nano chemistry). It covers the real fundamentals and the science that drives the field together with current relevant advances and applications. The only negative aspect of the book is the illustrations, that could be colored and more eye-catching....I was hoping for that in this new edition...Even then, I will give it 5 stars..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOXTXF6UGBQKP"
                },
                "Date": "on February 7, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "looks like a good book"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TUVDR5TPHPXX"
                },
                "Date": "on September 8, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Thanks.."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A141HRJW8JKTOU"
                },
                "Date": "on July 19, 2008",
                "Helpfulness": 0.4,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QV0OG0URXA60"
                },
                "Date": "on October 3, 2012",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A299KB3UQSMICQ"
                },
                "Date": "on October 17, 2011",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "The product arrived in excellent conditions and in time. I would like to know if you make deliveries outside US, because it would be easier for me to buy many other products. Thanks!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OIZYSJLLZOQZ"
                },
                "Date": "on October 19, 2011",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "The amazon website provides me this great book with reasonably price or I would say very cheap in a little period of time"
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Nanostructures-Nanomaterials-Applications-Nanoscience-Nanotechnology/product-reviews/9814324558/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "8"
    },
    "Salesrank": "#403,090",
    "Timestamp": "2015-05-24 15:30:58.496651",
    "itemurl": "http://www.amazon.com/Nanostructures-Nanomaterials-Applications-Nanoscience-Nanotechnology/dp/9814324558"
}
