{
    "Category": "in Books (",
    "ListPrice": "$96.00",
    "Name": [
        "The Meaning of Quantum Theory: A Guide for Students of Chemistry and Physics (Oxford Science Publications)"
    ],
    "OfferPrice": "$81.60",
    "Reviews": {
        "AverageStarRating": "4.6 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A258HDMERSI6WJ"
                },
                "Date": "on June 9, 2003",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ARA52HB238HT"
                },
                "Date": "on August 24, 2000",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "A book devoted to the development of quantum theory, Jim Baggott gives  readers a much-desired rest from the mathematical rigidity of the subject.  This book is fun, pleasant, and easy to read.  It introduces the  fundamental and key ideas of quantum theory through clever, to-the-point  analogies and diagrams.  Many physical chemistry students, or just science  audience, will welcome this plain approach of the subject.  Landmark  concepts such as operators, postulates, Pauli principle, Bohr-Einstein  debate and Bell's theorem are covered with a lucid and thoughtful account."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2N786KHIFCKJ8"
                },
                "Date": "on February 12, 2003",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book concentrates more on the philosophical aspects of quantum theory rather than formalism and problem solving, though some simple and easy to follow derivations are presented that give real insights into the guts of the theory, which will help a reader who goes on to pursue quantum  theory in greater detail. The historical debate between the positivists and realists during the theories development is presented in a very readable and entertaining way.  A very well written and researched book that you will be glad you read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KJO5VP4K3CHU"
                },
                "Date": "on December 11, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3R3OQZ2SVXZR7"
                },
                "Date": "on November 16, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "For those interested in modern physics, you could do far worse than read The Meaning of Quantum Theory. This is by far the most intelligable and complete look at Quatum Theory that I have come across. Bagott has written this book for the technically litterate, but has avoided using mathematics for anything other than illustration of some of the finer points of the theory. Whether you have a degree in the physical sciences or not, you will probably find that this book make Quantum Theory as clear as it can be.  Having read it at the same time I was taking an undergraduate quantum mechanics course, I found this book helped me make sense of the mathematics. Students who have been, are being, or expect to be exposed to the theory should buy this book and read it; everything will make much more sense."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on December 30, 1999",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 29, 1999",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book prepares the physics major for quantum.  The author is honest about the debate over the meaning of quantum theory, something that most text books ignore.  The introduction to the mathematics of quantum  mechanics is extremely helpful.  If you read this before taking the course,  you might actually understand the math on the board!  Just remember the  quote from Richard Feynman, \"...I think I can safely say that nobody  understands quantum mechanics.\""
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKBXOD1X1KUG1"
                },
                "Date": "on September 26, 2006",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Succinctly: if you want more than descriptive science popularizations and are ready to tackle the math then this is, quite simply, the best book there is.  Jim Baggott introduces the notation and the concepts in an engaging and untiring style and after a careful reading (or three) one is ready to read the original papers.  Cannot recommend highly enough."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LLPZ0QL28SZX"
                },
                "Date": "on March 3, 1999",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "FINALLY!! Of all the Quantum books I have seen, this book is the most helpful and clear book I have ever read on this subject.  I have a difficult time understanding Quantum from the math that most books use to  describe it;  this book gives historical background and philosophy of the  theory which makes it not only understandable, but EASY."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AO6OFEFDBZG3R"
                },
                "Date": "on February 7, 2006",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This was the first book I ever read about quantum theory-and I found it utterly fascinating. The book is written with a great style-its like he communicates a sense of urgency in the scientific exploration that led to the development of quantum mechanics. He begins with a very well written historical intro that covers Planck's blackbody radiation, the photoelectric effect etc. In the second chapter Baggot takes a surprising turn and lays out some of the mathematical tools of quantum mechanics but in a very basic way. From here he goes into the Bohr-Einstein debates of the 20s and 30s. This part was absolutely fascinating, if you haven't read about this before you'll be blown away by the amazing intellectual challenge fought between these two geniuses. The rest of the book is devoted to the fascinating topic of Bell's theorem, entanglement and hidden variables. The book absolutely blew me away because at the time I didn't know anything about quantum mechanics. If a small bit of math doesn't put you off, I highly recommend the book. If you're a physics, math or engineering student I definitely recommend it."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on January 2, 1998",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Jim Baggott has done a real service to the community of questing souls...He gives a lucid, thoughtful and helpful account of one of this century's great conundrums. (The Times Higher Education Supplement.)  Baggott has an entertaining style, with clever use of analogies and diagrams...[The book's] realist honesty shines like a beacon through the fog of contemporary mystical speculations. (New Scientist.)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AN2O0XRWK8Y0"
                },
                "Date": "on July 13, 2009",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ICVVK1O48Y8Y"
                },
                "Date": "on July 9, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is really great material on Quantum Theory for the general  reader(excluding the math).Also, any student of physical sciences or  R&D engineering will find Baggott's treatment of the subject to be  lively and fully comprehensive."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EC1IG3LOB0NF"
                },
                "Date": "on May 28, 2001",
                "Helpfulness": 0.75,
                "StarRating": "4",
                "Text": "This is one of the best books I came across to read. It goes direct into the hearth of the subject without too much Mathematics or formalism. Concepts are described clearly. There are no frills. Written by a person who claims himself not a Physicist or Mathematician and therefore easy on reader. Author starts with background history of foundations, than introduce some operators, I wish they were more clearly defined, \"Bracket\"'s were not clearly defined. Than comes the interpretation issues, Bohr, Einstain debates, hidden variables. Here I believe littel more elaboration of the debates or rather \"thougth experiments\" could be expanded more for clarity. A chapter is dedicated to Bell theorem and Aspect experiment, brief but you get the idea. Book is finalized with various aspects of the theory including a short paragraph on arrow of time. Overall it is a good book once started I could not drop the book before finishing it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IQEAOND8POI0"
                },
                "Date": "on April 16, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1M244AG9VB81E"
                },
                "Date": "on December 27, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I ordered this for my son who is majoring in math & physics.  The book is used but in excellent condition.  It was a great bargain and my son loves it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TEOGZP89HECY"
                },
                "Date": "on March 20, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16GAIJJE39T1S"
                },
                "Date": "on December 4, 2011",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXKGTS9MJ2Z4S"
                },
                "Date": "on March 5, 2006",
                "Helpfulness": 0.0967741935483871,
                "StarRating": "2",
                "Text": null
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Meaning-Quantum-Theory-Chemistry-Publications/product-reviews/019855575X/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "19"
    },
    "Salesrank": "#763,513",
    "Timestamp": "2015-05-24 15:18:46.765891",
    "itemurl": "http://www.amazon.com/Meaning-Quantum-Theory-Chemistry-Publications/dp/019855575X"
}
