{
    "Category": "in Books (",
    "ListPrice": "$24.50",
    "Name": [
        "Driving Force: The Natural Magic of Magnets"
    ],
    "OfferPrice": "$16.92",
    "Reviews": {
        "AverageStarRating": "4.6 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GZTFVDANOAFW"
                },
                "Date": "on August 31, 2000",
                "Helpfulness": 0.9583333333333334,
                "StarRating": "5",
                "Text": "The author starts this book by the story of Albert Einstein at the age of  four or five, when his father showed him a compass needle. The behavior of  the needle gave a deep and lasting impression on young Einstein. Then the  author describes ten facts about the magnetic force in earlier chapters.  Using these facts, he gives detailed explanations on the workings of  various magnetic devices and the modern technologies of magnets in plain  words. The topics covered includes superconducting magnets, magnets in  motors, speakers, TVs, toys, fiction, magic and weapons, magnetic  recording, magnets in medicine, biomagnetism, and so on, namely everything  about magnets. The book is also interspersed with humorous comments. In the  last chapter the author goes back again to young Einstein's wondering at a  compass needle. The reader notices here that the title of the book has the  triple meaning. This is one of the most educational and well written books  I have ever read in the genre of science for laypersons."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AENO633EZJ0SM"
                },
                "Date": "on February 17, 2000",
                "Helpfulness": 0.9090909090909091,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1E7KZBD1S31PP"
                },
                "Date": "on November 25, 2006",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 10, 1997",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "As someone who works professionally with magnets, I thought finding this book was too good to be true.  However, anyone interested in science and technology will enjoy this book.  Very enthusiastically written covering a wide range of subjects.  Explains some deep concepts in micro-magnetics in a very understandable style. In that way, both beginners in magnetics and experienced hands can get a lot out of reading it.  -Derrick Peterman"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 13, 1998",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3K2VF96CD06X0"
                },
                "Date": "on July 22, 2007",
                "Helpfulness": 0.8,
                "StarRating": "4",
                "Text": "I very much enjoyed this book. The writing style made it a pleasure to read. I downgraded it one star because it doesn't much cover the newer neodymium magnets nor how magnet manufacture has shifted to Japan and primarily China."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OJJ70TFE3WZN"
                },
                "Date": "on January 1, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book is very good at stating the principles of magnetism and how they apply to modern technology.  I found it very easy to understand, yet not \"dumbed down\".  It is an enjoyable read and the author has a subtle sense of humor.  I would recommend it for HS and college freshman physics students when they are studying electricity and magnetism."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A70XBXCKK6PRM"
                },
                "Date": "on April 28, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book is easy to read and easy to understand. I love it. I am glad to have it in my personal bookshelf"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHL11KWSWPVHJ"
                },
                "Date": "on October 26, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book is pure entertaining, covering a really interesting subject like magnets and electromagnetism. The descriptions are for the layman and although I have a previous knowledge of magnetism and physics, these pages capture your attention with the right mixture of knowledge, history, passion in the writing, good figures and interesting chapters, like the one that deals with \"Superconducting Magnets\" and \"MRI\". Higly commendable."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CMA8NGO2RZVS"
                },
                "Date": "on December 7, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VVPC5NAND1NI"
                },
                "Date": "on October 25, 1999",
                "Helpfulness": 0.6,
                "StarRating": "5",
                "Text": "Please see my review of this book, \"Fields of Influence,\" in Nature, Vol. 380, 25 April 1996, p. 679.  I wish it had been around when I  was in high school...or even years later as a graduate student in physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ICYVF52NS1XQ"
                },
                "Date": "on January 6, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Interesting book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2885MCMGCFR0L"
                },
                "Date": "on September 7, 2014",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": "The book was sent to a different address. The person who received it decided to forward it to us! We had ordered two books. One copy was fine. The other had printing issues. Certain pages appeared twice. Other pages were missing. Since we got two. We decided to copy the missing pages rather than return the bad copy."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Driving-Force-Natural-Magic-Magnets/product-reviews/0674216458/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "13"
    },
    "Salesrank": "#555,745",
    "Timestamp": "2015-05-24 15:23:48.607033",
    "itemurl": "http://www.amazon.com/Driving-Force-Natural-Magic-Magnets/dp/0674216458"
}
