{
    "Category": "in Books (",
    "ListPrice": "$160.00",
    "Name": [
        "Thermodynamics and Its Applications (3rd Edition)"
    ],
    "OfferPrice": "$130.20",
    "Reviews": {
        "AverageStarRating": "2.6 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on December 9, 2002",
                "Helpfulness": 0.7692307692307693,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 15, 2004",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1179PBHYTYZWH"
                },
                "Date": "on July 22, 2004",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "1",
                "Text": "I have taken 3 years of thermodynamics with different books. This book being the worst! I felt I 'delearned' after trying to read some of the chapters. The early chapters were good in explaining the basis of thermodynamics. The rest of the book is way too general, the equations are derived for extremely general cases and it makes trying to relate to real world situations near impossible. The problems at the end of the chapters are not easy and there are NO good examples within the chapters. The problems are written poorly and often open to interpretation so students can get 5 or 6 different answers to one problem. If you are forced to use this book I would recommend that you do NOT read the chapters, only work the problems. Buy a different book to study thermodynamics from."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WB7BAD7NBZG8"
                },
                "Date": "on October 1, 2010",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "In grad school, I saw my supervisor had this book on his table. It is his favorite. He used this book teaching one of the classes I took. I solved some problems from the book. The problems were very challenging, but going through the process of solving such problems was really enjoying and rewarding. Thermodynamics itself is not intuitive and very easy to misunderstand. The book was not written for beginners but for those who have already learned an introductory course. If you want to reach a very high level in thermodynamics, it won't disappoint you."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 6, 2002",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "1",
                "Text": "I found this book to be almost worthless in my efforts to learn thermodynamics at a graduate level.  Even concepts that I understood were not clear to me after reading this text.  Only buy this book if it is required for your course, and even then do not expect it to be useful."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 19, 1997",
                "Helpfulness": 0.6428571428571429,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARCDJMPNQLJXV"
                },
                "Date": "on September 9, 2013",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "Our professor recommended this book to us for chemical engineering thermodynamics. Got a lot of appendix, charts, equations there. Very useful and much more than you need. But I have to say it is not very readable. Too much words."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RYKWA9A77T6W"
                },
                "Date": "on January 27, 2006",
                "Helpfulness": 0.625,
                "StarRating": "1",
                "Text": "It is impossible to understand how a prof can choose this book. I am an grad student and forced to buy this book. This book contains no useful engineering applications whatsoever. It is very confusing and hard to follow. I had to purchase two other thermo books to finally understand what was going on. End of chapter problems are very hard and not enough sample problems. I have too much negative things to say about this book than positive."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18YULFGJ0LI3V"
                },
                "Date": "on October 8, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Great book, although what I want is the 3rd edition and this one is 2nd."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEKFM17N363U3"
                },
                "Date": "on January 12, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A really nice book in the 'big desert' of thermodynamics ..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SFCM9GLA06NR"
                },
                "Date": "on November 23, 2004",
                "Helpfulness": 0.6,
                "StarRating": "1",
                "Text": "I am taking this course as a graduate student and I have taken three previous courses in Thermodynamics.  I know less about this subject and am more confused then I was before I read this book.  In my undergraduate degree I did really well in the thermodynamics courses I took and felt like I had a good understanding of the topic.  You wouldn't think one book could undo three solid semesters of learning Thermodynamics, but it did for me.  The title of this book implies that it is application based, but it is just a pure lie.  I am completely unsatisfied with this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39WZ1RE8S33NG"
                },
                "Date": "on April 14, 2005",
                "Helpfulness": 0.5,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6HR6UXJWYZD2"
                },
                "Date": "on November 25, 2009",
                "Helpfulness": 0.4,
                "StarRating": "1",
                "Text": "This book was the assigned text for a graduate class in Thermodynamics for Chemical Engineering.  It was awful.  The text was very poor at explaining the concepts.  The questions in the book were poorly worded, making solving them a matter of interpretation.  I am giving feedback to my professor that will be critical of this choice of text for the class.  It looks like there are better texts in the field."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2I70ZVEDCD0MT"
                },
                "Date": "on October 2, 2010",
                "Helpfulness": 0.14285714285714285,
                "StarRating": "5",
                "Text": "I ordered this a long time ago and i just want amazon to stop pestering me"
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Thermodynamics-Its-Applications-Jefferson-Tester/product-reviews/013915356X/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "14"
    },
    "Salesrank": "#647,163",
    "Timestamp": "2015-05-24 15:31:00.997888",
    "itemurl": "http://www.amazon.com/Thermodynamics-Its-Applications-Jefferson-Tester/dp/013915356X"
}
