{
    "Category": "in Books (",
    "ListPrice": "$38.00",
    "Name": [
        "Creating a Sustainable and Desirable Future: Insights from 45 Global Thought Leaders"
    ],
    "OfferPrice": "$31.24",
    "Reviews": {
        "AverageStarRating": "4.2 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TI016XTSGR6B"
                },
                "Date": "on May 1, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Reduce your carbon footprint, be happier, rethink education, ponder the great questions.  Visonary authors tell you how and WHY! Book for everyone! I could imagine this book being adopted in environmental studies departments, philosophy departments, interdisciplinary courses, Advanced Placement courses in high schools. Please \"look inside\" to see the list of prestigious thinker-authors and the wide range of subjects covered. Full disclosure, my essay \"Envision Gender Equality: Nothing Else is Working\" comprises 4 small pages of this 357 page volume. Frankly I find it unbelievable that this retired French teacher/tennis coach had her essay written on a whim 4 years ago for The Solutions Journal wend its way into this book. I wish the book were less expensive. But I am going to buy several copies and give it as gifts to people I love and to the Redlands, CA Sustainability Network."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AN2WCDXNBRQC8"
                },
                "Date": "on June 21, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Nothing is more important to our shared future than making the transition to a sustainable world. Robert Costanza is an outstanding leader in this effort, and he's gathered together the best ideas from those who, like him, have devoted years of thought and commitment to the field. It's a must-read for anyone who wants our children and grandchildren to inherit a healthy planet."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RYFKGDKYWEBC"
                },
                "Date": "on August 6, 2014",
                "Helpfulness": 1.0,
                "StarRating": "1",
                "Text": "Despite the great names of outstanding ecologists who've written pieces in this book, there is nothing about peak oil, peak phosphorous, peak coal, peak natural gas and the utter impossibility of alternative or renewable resources to substitute given the laws of physics and thermodynamics (see energyskeptic website, resilience dot org, the oil drum, and so on).  I know that there is a feeling among many activists that you must give people hope, but at this late date, what good does false hope do? Yes, folks may despair initially, fall into a deep depression like I did for a few months when I read about Hubbert's Peak back in 2000 and all the implications.  But then I learned to garden, mill whole grains (which can be stored up to 25 years, see wholegrainalice), and much much more.  This book is just too optimistic at this late stage, what's the point?  Is there ever a time to get realistic or are Americans just too addicted to Happy Endings to let them see the world realistically? Why do scientists treat us all like big blubbering babies?  Where's the demand that nuclear wastes be disposed of NOW while we still have the energy resources to do so and other important, more realistic endeavors we should take for the sake of our descendants?"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APJ6KTMJVZS9O"
                },
                "Date": "on July 16, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Read every piece in this book, and it was very informative and powerful. Best part is that it focuses on solutions to problems- real actions that people are taking to confront our global challenges. The variety of voices keeps it a moving read.  Students and professors will particularly find this of use."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1O24TLZTY931Q"
                },
                "Date": "on December 21, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Creating-Sustainable-Desirable-Future-Insights/product-reviews/981463025X/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "5"
    },
    "Salesrank": "#379,950",
    "Timestamp": "2015-05-24 15:35:09.229412",
    "itemurl": "http://www.amazon.com/Creating-Sustainable-Desirable-Future-Insights/dp/981463025X"
}
