{
    "Category": "in Books (",
    "ListPrice": "$24.95",
    "Name": [
        "Symmetry"
    ],
    "OfferPrice": "$19.50",
    "Reviews": {
        "AverageStarRating": "4.8 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D7XC7USJ9X7J"
                },
                "Date": "on July 22, 1998",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This delightful booklet motivates the study of symmetry by showing its presence in art and nature. This is a work of love, frequently bordering poetry. Yet, it is a scientific book of high class. Hermann Weyl, one of the very great mathematicians of this century, then explains the mathematics behind symmetry, mostly group theory, and obtains all forms that, by repetition, completely fill the plane and the space (the crystallographic groups). This is wonderful reading. After it, the reader should be prepared for a beautiful recent discovery by R. Penrose, that there are aperiodical forms that completely fill the space, and, still more surprising, that Nature makes use of them. They are the quasi-crystals (not treated in Weyl's book, of course)."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NF2Y5WSC4KM8"
                },
                "Date": "on July 6, 2000",
                "Helpfulness": 0.9487179487179487,
                "StarRating": "4",
                "Text": "Be forewarned this book is technical and mathematical. Though you can definitely read it without going through all the math and thinking it through it won't be nearly as valuable to you as it would be if you spent  some time and actually thought things out and figured them out rather than  just speeding through. That being said this is probably the best  examination of symmetry out there that I have read. Weyl starts from very  simple concepts and eventually works his way up to examining even complex  ornamental symmetry. Of course much of what he says about symmetry is true  of aesthetics and beauty in general and many parallels can be drawn between  what he is saying and other items like music that may not appear to have  clear symmetry right off the bat. Unfortunately in the version I have the  citations that Weyl makes are not clearly listed, but many of the authors  are fairly prominent and easy to look up. If you like this book I might  also reccomend G. D. Birkhoff's Aesthetic Measures. Where, Weyl is  interested more in just symmetry Birkhoff is interested in mathematical  aesthetic examination in general. Overall this book is a must read for  anyone interested in aesthetics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AB399AECXCDT8"
                },
                "Date": "on January 11, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Symmetry is about the mathematical underpinnings of symmetry as it appears in nature and art. The book is divided into 4 sections, the first Bilateral Symmetry covers reflection. This lecture goes into biology and art. The next lecture is about rotational symmetry. I was able to follow the math presented in this lecture but had trouble in the 3rd lecture titled Ornamental Symmetry. Ornamental symmetry is mostly about tilings of the plane. There is a lot of math presented in this lecture. I had to fall back on my rudimentary knowledge or abstract algebra and linear algebra to understand it. My point is that without this knowledge this lecture and the next one The General Idea of Mathematical Symmetry would have been impossible for me to follow. However, I still recommend this book to people who don't have any of the above background. Symmetry covers the concepts behind symmetry well, and it's applications to nature and art can be followed by anyone."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1S3C5OFU508P3"
                },
                "Date": "on June 6, 2006",
                "Helpfulness": 0.875,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RBGEV4IHL1XM"
                },
                "Date": "on October 19, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I thoroughly enjoyed reading this book.  It offers very deep insights on the use and implications of symmetry, not only in art, but in physics, chemistry, and other sciences.  It also provides a comprehensive mathematical treatment at an accessible level.  The reason I did not give it a full 5 stars is that sometimes the mathematical steps were not fully spelled out, or the explanation was vague, so a few passages left me wondering what he really means.  More examples, figures, and details would have helped.  Still, it was an exciting read - for the first time I really understood the theory of relativity and what it means in terms of symmetry.  The author also impresses with his breadth of knowledge, being equally comfortable with the latest mathematical methods as he is with historical development of the field, all the way back to the Egyptians and Greeks.  The book is fairly slim and I read it fast, yet learned a lot."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3STUU6SA6ECR2"
                },
                "Date": "on May 26, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6QV27T3BAOEO"
                },
                "Date": "on March 27, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QBJFAUAL174I"
                },
                "Date": "on December 10, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Weyl, a world renown mathematician, wrote this nice book on symmetry in 1951, just four years before passing away. He introduces the concept of symmetry starting from a discussion of bilateral symmetry which characterizes human beings and moving on to symmetric objects and symbols such as the triquetrum, an old magic symbol which is used in the flags of both Sicily and the Isle of Man. The last part is concerned with the symmetry in crystals and with introductory aspects of algebraic geometry. The book, despite being 60+ years old, can be recommended to every one interested in understanding the meaning of symmetry and how it appears in every day life. A book that also explores the concept of symmetry in the objects that surround us as well as in molecules is Hargittai & Hargittai 'Symmetry through the Eyes of a Chemist'."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GIU8D5SJGZ09"
                },
                "Date": "on August 28, 2010",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "One of the most enjoyable books I have ever read. Not very long. Requires some knowledge of basic geometry. Good intro book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGLQGLPHLWJ2C"
                },
                "Date": "on January 17, 2011",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "This is a tough read for an amateur, but still worth the effort. Fractal Geometry is cutting edge stuff that exposes the connections between nature and math. Well written."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Symmetry-Hermann-Weyl/product-reviews/0691023743/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "10"
    },
    "Salesrank": "#407,265",
    "Timestamp": "2015-05-24 15:38:09.255289",
    "itemurl": "http://www.amazon.com/Symmetry-Hermann-Weyl/dp/0691023743"
}
