{
    "Category": "in Books (",
    "ListPrice": "$20.00",
    "Name": [
        "Green: Your Place in the New Energy Revolution"
    ],
    "OfferPrice": "$15.95",
    "Reviews": {
        "AverageStarRating": "4.5 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HJYVE9Y8UF2M"
                },
                "Date": "on August 6, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book does an excellent job of explaining developments and investment opportunities within the U.S. renewable energy sector in a way that is easy to understand and relate to. With energy emerging as a major 2008 presidential campaign issue, this book could bring someone with limited knowledge of renewable energy up to speed on all the major issues."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IW5CIF0CSPBF"
                },
                "Date": "on July 16, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35II07IBS26QF"
                },
                "Date": "on July 22, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I am inspired by the illuminating and clear information that the Hoffman team has compiled, Green is a masterful book.  It is informative and entertaining.  I highly recommend Green, because we all have a place in the New Energy Revolution. An exceptional book"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25S40J7AU6M5M"
                },
                "Date": "on September 19, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book is well written by people with experience in the field.  It provides a very comprehensive review of the three pillars of the energy crisis, conservation, development and utilization of existing energy forms, plus new technology with extensive advantages.  I only wish I was forty years younger so I could make some contribution to the solution of our energy needs for the future."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOTNXF92IEHZ3"
                },
                "Date": "on November 3, 2010",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "This book gave me some good relative insight to what green energy is all about. Hoffman really does a good job in explaning the three pillars of green energy crisi, and how it will help in the future.  In the green energy, we all have the power to make a difference in the future.  With us in the driver seat as the book mentions, all we can do is better prepare ourselves for green energy.  The book explains how the damage that has already been done is more than anyone could have expected.  With the three pillars of the energy crisis, which are conservation, development, utilization, and other technology adavances, we now know we have a problem that is spotted.  The states that with energy crisis being such an important factor in the world today, elections and bills that will be passed in upcoming elections will make a big impact on whether we can prevent anymore damage to our beloved world, or it will decide if we make things worse. I would highly recommend this book to anyone who is worried and takes green energy seriously."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CWA6ELINOUW7"
                },
                "Date": "on September 29, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I opened Green fearing that it might be too simplistic or have an agenda. Nothing could be further from the truth. It is concise and addresses the key issues, from the local to the global level, but without unnecessary simplificaton or talking down to the reader. The Hoffmans spell out the governmental policy changes necessary to make going green palatable, and more important, profitable for private enterprise, so that the invisible hand can do its magical work.  This is a must read for people of all ages who care about the planet and their place in it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3O0W97Y9GOM14"
                },
                "Date": "on October 1, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "You have to read this book now!  It is very informative and quite exciting, as more is happening in the world than at least I knew.  It is also practical and inspiring action and change."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUATN3YRWG0EJ"
                },
                "Date": "on November 10, 2008",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": "This book is a good place to start if you want to educate yourself more about alternatives to fossil fuels. We all have this growing sense that this is important, but I admit I didn't even know what geothermal energy was, or whether biofueled cars are as practical as the idea of flying cars! This book is an easy read with plain language any layman can understand; you don't need an engineering degree. The authors cover the, \"What's in it for me?\" angle with how the average home can save money on energy expenditures as well as how we'll save our planet. It's not gloom and doom, although the first few chapters are a little heavy on socio-political commentary and I felt that it didn't get to the \"meat\" fast enough for my impatient tastes. Once it gets rolling, however, it's informative, easy to understand, and a good jumping off point. If you knew little about these issues when you opened the book, you'll at lease emerge with a list of questions and things you want to research in detail. Admittedly I checked this book out from my public library. It was worth reading once, but I don't think I'd have liked to own this book and refer back to it again and again. It's worth buying and donating to your library if they do not have their own copy, however. I'll certainly recommend it to friends to read."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Green-Your-Place-Energy-Revolution/product-reviews/0230605443/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "8"
    },
    "Salesrank": "#2,243,812",
    "Timestamp": "2015-05-24 15:46:08.627658",
    "itemurl": "http://www.amazon.com/Green-Your-Place-Energy-Revolution/dp/0230605443"
}
