{
    "Category": "in Books (",
    "ListPrice": "$45.00",
    "Name": [
        "Molecular Symmetry and Group Theory : A Programmed Introduction to Chemical Applications, 2nd Edition"
    ],
    "OfferPrice": "$34.83",
    "Reviews": {
        "AverageStarRating": "3.8 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FUNBX78X5XY9"
                },
                "Date": "on June 29, 2011",
                "Helpfulness": 1.0,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1V9BSK8DYEF7I"
                },
                "Date": "on May 24, 2000",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "If you don't have the math background it often takes to penetrate Cotton, this book could be the answer.  For learning the quick and dirty basics of the use of group theory for molecules, this is the book.  The only problems  are its sparseness and the high price for a 156 page book.  Excellent for  self-teaching, though."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A130DWI6FXQZ4M"
                },
                "Date": "on March 27, 2006",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19CZ2AA0519W1"
                },
                "Date": "on January 6, 2012",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on September 26, 1999",
                "Helpfulness": 0.75,
                "StarRating": "4",
                "Text": "Cotton's(or Bishop's or like that...) book on group theory is too wonderful for me to grade. But, you may agree with me, in that it really takes times! You must read those books to understand the internal structure  of group theory, but if you have exam tomorrow, Vincent's will be an  emergency measure. Just follow him about 5 hours. Then you can solve some  crucial spectroscopy problems, make MO's, and so third. But don't forget to  check the books of details. This book is just for an emergency measure. But  truly great enough for that."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30E2IJQ5CMHBG"
                },
                "Date": "on October 26, 2010",
                "Helpfulness": 0.8,
                "StarRating": "4",
                "Text": "Molecular Symmetry and Group Theory is a nice guide for students to evaluate symmetry of molecules and their implications on molecular vibrations. It's structure in programmes and it's approach are so helpful."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KPXQEA56GSGW"
                },
                "Date": "on September 15, 2012",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TWG81N41YIE9"
                },
                "Date": "on June 30, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "This book provides a good overview of group theory and a great introduction to the field. It is easy to read and contains numerous exercises to demonstrate the key points  throughout. Consequently, this makes it a good text for a course that involves group theory. It also contains some useful hints not found in other texts. I surveyed several books on group theory, and this was the best one overall. The text by Cotton is more complete and exhaustive, but for basic knowledge I prefer this book because it is simply written."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1J007BT1OE3TY"
                },
                "Date": "on July 1, 2013",
                "Helpfulness": 1.0,
                "StarRating": "1",
                "Text": "The book starts easy but makes huge jumps in each subsequent chapter. In the end, you'll be left with enormous gaps of knowledge which the authors pretends to have addressed in his previous chapters. I spent minutes rereading a page in search of some information that I thought I had missed, only to find out there was nothing there. I recommend Robert Carter's book rather than this too-short-to-be-useful book. The low price isn't really worth it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASNL9S3KLE45S"
                },
                "Date": "on January 22, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Our professor had us but this and a few other books to cover all the topics we needed to for Advanced Inorganic Chemistry. This book is great. It walks you through the coordination really nicely and is very interactive with it's little mid-reading quizzes. Probably one of the most spot on valuable books I've owned."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CM3XRN86V3EP"
                },
                "Date": "on February 12, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MYL9MQE7DORF"
                },
                "Date": "on February 12, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "So far this is the best introductory book that is available in the topic. The style of presentation is lucid such that a student with minimum knowledge in geometry can master group theory in 2 weeks. Traditionally Group theory in Chemistry is considered as very abstract and therefore complex subject. But after reading from first page to the last, I felt that this opinion is wrong and Group theory can be presented in easy way as Vincent did. I strongly recommend this book for undergraduate and graduate courses!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LWQVQI6O03GI"
                },
                "Date": "on September 27, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Thank you! Good condition. Fast shipping. No marks on it."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Molecular-Symmetry-Group-Theory-Introduction/product-reviews/0471489395/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "13"
    },
    "Salesrank": "#369,034",
    "Timestamp": "2015-05-24 15:18:50.621793",
    "itemurl": "http://www.amazon.com/Molecular-Symmetry-Group-Theory-Introduction/dp/0471489395"
}
