{
    "Category": "in Books (",
    "ListPrice": "$34.95",
    "Name": [
        "The Science of Life: Philosophical Equations of Physics, Chemistry, Biology and Religion"
    ],
    "OfferPrice": "$3.12",
    "Reviews": {
        "AverageStarRating": "5.0 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14OJS0VWMOSWO"
                },
                "Date": "on October 8, 2010",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Some things in life can't be quantified by numbers. \"The Science of Life: Philosophical Equations of Physics, Chemistry, Biology, and Religion\" is a discussion that seeks to blend science with philosophy and religion, with a unique format from Ronnie Lee, a Chinese poet and philosopher. Giving readers a lot to ponder and think about and discussing major scientific breakthroughs and discoveries, done in a poetic style, \"The Science of Life\" is a unique experience that will be hard to match."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3Q8JKUVUH88KX"
                },
                "Date": "on September 9, 2010",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "This is my eighth book and it holds insights into advanced yet simple, new and fundamental laws of classical and quantum physics including entanglement, quantum dots, gravity and relativity. These hold practical inventions that can be created like teleportation, engines and other tools like better cameras and scanners etc. With different approaches in equations and logics, this book shows new perspectives and theories to underline the mechanisms of the physics of the universe. It also hold clues, theories and logics to the origin of life and to some equations to understand AIDS, Cancer and Schizophrenia. By adapting standard rules, equations and logics, the procedure to analyzing complex systems from isolated systems on chemistry, physics and biology to the universe itself can be understood, used and measured to find practicality for human success in science to reach our technological capacity as creators. With a chapter on religion and the importance of moral balance that must be stabilized with the technological reality, we must gain faith and advice from God, allowing truth from the Holy Spirit to guide us for survival, health and worth with Jesus being the path where unjust dangers on Earth must unite with the just peace of Heaven and only through the narrow door can evil gain the wealth of the good through Jesus Christ. The religious story of life has long been told and so has their prophecies. This book may fulfill some prophecies and start some new ones too. It is a book of science for the success of life."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Science-Life-Philosophical-Equations-Chemistry/product-reviews/1432758632/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "2"
    },
    "Salesrank": "#7,411,738",
    "Timestamp": "2015-05-24 15:31:20.406756",
    "itemurl": "http://www.amazon.com/Science-Life-Philosophical-Equations-Chemistry/dp/1432758632"
}
