{
    "Category": "in Books (",
    "ListPrice": "$17.00",
    "Name": [
        "E=mc2: A Biography of the World's Most Famous Equation"
    ],
    "OfferPrice": "$13.80",
    "Reviews": {
        "AverageStarRating": "4.1 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AITIU2DG1MM4A"
                },
                "Date": "on May 21, 2001",
                "Helpfulness": 0.9655172413793104,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVNBXY3K3GKOM"
                },
                "Date": "on March 5, 2002",
                "Helpfulness": 0.9294117647058824,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACMR9ZYT3F0SB"
                },
                "Date": "on November 13, 2000",
                "Helpfulness": 0.9047619047619048,
                "StarRating": "5",
                "Text": "i have been a long time fan of bodanis's entertaining way of exposing (i.e. the human body or the garden) the mundane in novel ways; this time around, he exposes the abstract in a marvelously mundane way. i finally understand the basics of e=mc2. i thank him so much. this book is a gem of a biography of the equation that we know but don't know. physics and the scientists behind the formulation come to life in exciting, vivid, anecdotal ways. i simply didn't want this book to end. now, can we ever really say that about other books on physics and science?  i haven't taken a calculus class in 25 years, but i was able to follow the reasoning and narrative flow with great ease. the hard stuff is thoughtfully stuck in the back in an appendix that is almost one half the length of the main section. bodanis has cracked this subject matter with perfect skill. and yes, i felt energized reading this book. hence, einstein's equation lives in yet another dimension!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1M8PP7MLHNBQB"
                },
                "Date": "on October 17, 2005",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATN1SSKTJD8Z8"
                },
                "Date": "on February 23, 2005",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AW2QJQ6TWBNQW"
                },
                "Date": "on November 10, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I loved this book.  It is a first rate physics primer that reads like a great mystery.  David Bodanis ( author of The Secret House and The Secret Family, which I also recommend )has a way of ending chapters with intriguing statements or questions that make it difficult to stop reading.  His treatment of the Allied Forces' attempts to sabbotage the heavy water facility at Vermork, Norway during WWII is a lot like a short Ken Follett novel.  Since finishing the book, I find myself looking for ways to bring up E=mc2 topics in conversations ( \"...speaking of smoke detectors, did you know that they derive the power to generate their smoke-sensitive beams from the radioactive decay of americium?\" or \"...just imagine, the glare from the explosion over Hiroshima would have been viewable from Jupiter\" ). This is popular science writing at its best."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASXAHFHLNK3JY"
                },
                "Date": "on April 4, 2005",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "The author of E=mc2: A Biography of the World's Most Famous Equation, David Bodanis, has a writing style that is both engaging and informative. Not only does Bodanis manage to thoroughly explain the equation E=mc2 in a straightforward matter, but he also explains the history, and the results, of the equation itself. All the terms of the equation, energy, the equal sign, celeritas, and even squared, are described. The development of the equation and its various results are explained as well: the discovery of the atom, the details of the Bomb Race of World War Two, and the theory of black holes and stars. Bodanis felt the need to write this story because, \"Everyone knows that E=mc2 is really important, but they usually don't know what it means...There are plenty of books that try to explain it, but who can honestly say they understand them?\" This book is worth a read if you're interested in learning what E=mc2 really means, and don't want to become bored. Bodanis has taken a different approach to the equation; he doesn't write about the theory of relativity or Einstein, but writes about the equation itself."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IPZPMRLJPTP5"
                },
                "Date": "on December 13, 2000",
                "Helpfulness": 0.9333333333333333,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANJIB0JKVINKB"
                },
                "Date": "on December 22, 2000",
                "Helpfulness": 0.875,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12D25ULGBTCZN"
                },
                "Date": "on December 28, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KJO5VP4K3CHU"
                },
                "Date": "on February 22, 2006",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABN5K7K1TM1QA"
                },
                "Date": "on August 1, 2001",
                "Helpfulness": 0.9090909090909091,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AEGRG5TJX8M9"
                },
                "Date": "on March 26, 2006",
                "Helpfulness": 0.9166666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3INVHNCS10T1Y"
                },
                "Date": "on January 3, 2001",
                "Helpfulness": 0.7761194029850746,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KA30PV7EOI16"
                },
                "Date": "on August 27, 2006",
                "Helpfulness": 0.8260869565217391,
                "StarRating": "1",
                "Text": "I don't know how David Bodanis has garnered any praise with his book as it is not only full of poor explanations, but also completely incorrect ones.  Describing electricity as \"crackling\", mass as \"squeezing\" across an equals sign to be magnified into energy, and the product of fusion as \"ash\" is simply appalling.  His explanation as to why energy is proportional to velocity squared is merely an explanation of the concept of mathematically squaring a number, and his explanation of time dilation and length contraction describes the effects in slow motion without ever addressing why it happens.  Bodanis uses sources such as Goudsmit (a widely dismissed text) to depict Heisenberg as an ardent Nazi, and he completely skips Rutherford's experiment only to provide a ridiculously inaccurate description of his conclusions about atomic structure and the nucleus of an atom.  I am a physics and math teacher and have a degree in Aerospace engineering and I can confidently say that David Bodanis does not understand enough about his topic to presume to write with any authority and I discourage anyone from buying it as it is misleading and a waste of money."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AN2WCDXNBRQC8"
                },
                "Date": "on August 17, 2004",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DMK43KSF83JA"
                },
                "Date": "on May 7, 2010",
                "Helpfulness": 1.0,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VVY9IHMGYJ8Y"
                },
                "Date": "on January 8, 2001",
                "Helpfulness": 0.8181818181818182,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A163TW45ZWH82T"
                },
                "Date": "on November 13, 2000",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGYGK7XJ0L5TJ"
                },
                "Date": "on February 17, 2006",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACQENJKERL9OU"
                },
                "Date": "on November 8, 2007",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOB01N3373YVK"
                },
                "Date": "on December 5, 2000",
                "Helpfulness": 0.7647058823529411,
                "StarRating": "1",
                "Text": "The best thing I can say about this incoherent, confused and ignorant book is that it is bad from the beginning.  One need read only a few pages to discover that there is no point in reading any more.  I read the first 80 pages, out of cussedness, but gave up when I read that alpha radiation does not decrease the mass (he says \"weight\") of the radiating object.  There are errors like that on every page."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BZD0DZJXC6R"
                },
                "Date": "on December 4, 2003",
                "Helpfulness": 0.8181818181818182,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11PKVBGCKRVEK"
                },
                "Date": "on January 10, 2007",
                "Helpfulness": 0.7777777777777778,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NRLGC7MGFAYP"
                },
                "Date": "on November 28, 2005",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2E6GG81WYC1OG"
                },
                "Date": "on June 29, 2008",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGYGVU3KGB81L"
                },
                "Date": "on October 17, 2001",
                "Helpfulness": 0.7857142857142857,
                "StarRating": "3",
                "Text": "I would give him five stars for his comprehensible explanation of the physics and the time he spent thinking of metaphors for the equation that make its effects understandable.  However, his portraits of figures like Oppenheimer and Heisenberg are way off--extreme readings of uncited evidence that is frankly in conflict with both the historical record and the way that contemporary historians interpret it.  Heisenberg was NOT a convinced Nazi--he was a German nationalist.  There's a difference.  Oppenheimer's personality problems were not at the basis of his later exclusion from further government nuclear research--his communist sympathies were the reason.  Bodanis makes Teller sound like a crazy and not like the venerable scientist he was.  What's sad about all of these misportraits is that they cast doubt on things I want to believe, about Lise Meitner and Celia Payne, for example.  Read with care, and compare to a real book about the Manhattan Project (like Richard Rhodes' \"Making of the Atomic Bomb\") before you swallow this picture whole. For a much more balanced picture of some of the personalities involved that includes a readable account of the science, check out Freeman Dyson's \"Disturbing the Universe.\""
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AB8R8P4RBQPNQ"
                },
                "Date": "on July 31, 2004",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EEOCZ14R1GQB"
                },
                "Date": "on January 2, 2007",
                "Helpfulness": 0.8,
                "StarRating": "1",
                "Text": "I have to agree with the aerospace engineer/math & science teacher's review and disagree with Joe Swiss who commented that the teacher \"sacrificed accuracy to make an overblown criticism.\"  Such criticsm was not overblown but dead-on.  This book has the worst scientific explanations I've ever come across (I'm a history graduate student with a focus on science and technology so I have a good deal of experience in this area).  His descriptions are inaccurate and misleading but with enough of a veneer of credible-sounding science to make this book a true danger to the uninformed--readers will accept it without knowing how wrong it is.  Furthermore, but perhaps this is just me, his writing was incredibly irritating.  The tone he used was amazingly condescending and patronizing, which really annoyed me since it was clear he, himself, had no real clue as to what he was talking about.  According to his bio he is an intellectual historian--perhaps he should just stick to his own field rather than venturing into an area he has little understanding of.  If someone wants to read a truly excellent scientific history that makes difficult concepts easier to grasp, I would recommend Bill Bryson's _A Short History of Nearly Everything_, a hilarious read full of fun biographies of scientists and well-described and -explained science.  Bryson is also not a specialist and therefore has some errors as well, but they are rarely glaring or significant and for those with little scientific background, the basics of many fields of science will be delightfully illuminated."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ENVPPKAY81KL"
                },
                "Date": "on January 3, 2001",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "As an explanation of the equation, I give this book high marks for almost getting through to me. As a biography, its nearly perfect, mixing people, science, and history together in a fascinating blend of fact, speculation, and relationships. This is a great book for gifts, and someday, I may just get the equation right."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1K3LEZ9UPX7X2"
                },
                "Date": "on March 9, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book caught my eye with the opening paragraphs where the author talked about reading an interview with Cameron Diaz and she said that one thing she'd really like to understand is the equation e-mc2.  From that the author became inspired to write this book.  I love the approach.  Each chapter is devoted to part of the equation and it explains the people behind it.  For example, \"e\" for energy.  Who were the people that made some of the early discoveries and connections in the field of energy... the book takes a biographical approach and includes a lot of women who were part of the science discoveries over the years, but didn't get recognition because they are women.  I am still reading it, but fascinated by the book and I know it will be one I keep going back to in my quest to truly understand what e=mc2 means.  It is a relatively \"easy\" read because the author approaches the science through the subject of the people and their interesting lives and stories.  a great read even for people who are not big science nuts (which i am not)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2B9Y0WXNSN17U"
                },
                "Date": "on April 8, 2002",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "3",
                "Text": "Bodanis is an expert on intellectual history, not on any one type of science, and that explains the structure of this book. The theme of this book is one of the most creative ideas I've seen in a long time - writing the biography of an idea (Einstein's e=mc^2) as if it were a person cruising through history. Hence the story is not about Einstein's life, or even developments in particular areas of science, but how this equation has worked its way into the public consciousness. Bodanis' coverage of each part of the equation, E, the \"equals\" sign, M, C, and \"squared\" is also a very creative concept. Unfortunately, Bodanis can't quite pull off the story without a background in hard science, so the book merely points out the gaps in his non-scientific presentation style. Bodanis quickly rushes through many scientific disciplines, sometimes in just a few paragraphs, that would require many textbooks to adequately explain. And the accuracy of many of his scientific explanations is suspect. You can see several of the other reviews here at Amazon for examples of his faulty science. I would like to add that Bodanis' descriptions of sub-atomic processes (see especially chapter 8) are suspiciously evasive and lacking on details, and show a complete lack of acknowledgement for quantum mechanics. Also, his quick description of the end of the universe (sputtering out as all energy is all used up) is only one of many viable theories on cosmology, though Bodanis does not acknowledge this, except for an extremely brief mention in the footnotes. Most annoyingly, Bodanis does a lot of stretching in this book, trying to add suspense to the history of e=mc^2 in the development of the atomic bomb, and trying to connect the equation to every single branch of science, even plate tectonics in one example. These are indirect connections at best, but the author tries to give them full significance anyway.  In fact, Bodanis can hardly get through two paragraphs without mentioning the equation. So while the unusual \"biography\" idea behind this book is highly creative and original, the results just don't add up."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18OBUSMXVE8R0"
                },
                "Date": "on September 6, 2004",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJRLTNPJG0BJ1"
                },
                "Date": "on August 21, 2004",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OPX1ECUV1O6S"
                },
                "Date": "on June 23, 2008",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QLXL8054EQTY"
                },
                "Date": "on December 14, 2005",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XQ5LZHTD4AFT"
                },
                "Date": "on February 17, 2003",
                "Helpfulness": 0.7777777777777778,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2U5GT3L6ZD2T2"
                },
                "Date": "on April 18, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKU5DF4MIBIT1"
                },
                "Date": "on February 17, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "THis book is a really entertaining historical account of the way this equation came about, and has a short commentary on what it has done since, and what it may bring later.  It was an eye opener on some of the implications of what the equation really means.  Very readable, not a thick text book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IO3J7OV57T11"
                },
                "Date": "on January 23, 2003",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OHEM9J2QTX0R"
                },
                "Date": "on May 15, 2001",
                "Helpfulness": 0.8,
                "StarRating": "4",
                "Text": "I picked this book up at the Book Expo America show in 2000, so I have an advance reading copy that still needed some editing. Regardless, the book is very entertaining and simple to understand. I'm not really interested in the specifics of physics or math, but I am interested in the humanity behind science which is exactly what you get with this book. It gives an interesting, logical, background of the history behind this famous equation. Amusing anecdotes give the book some humor and relevence. If you read \"Einstein For Beginners\" you'll enjoy this step up.  I think this would be a great book for students to read as it is a well-written story that adds depth to science."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12SMKN3KM2AJR"
                },
                "Date": "on July 6, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book is wonderful and easy to read. I found it to be quite a spiritual read for me, though I don't think that's what the author intended. I find God in nature, and this book easily explains nature's law, and therefore God's law, in my opinion. Very interesting historical data included as well...finally giving many overlooked scientists and inventors their long overdue credit. Great book!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASW77A8J0I068"
                },
                "Date": "on March 1, 2012",
                "Helpfulness": 1.0,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SNE4SSBBO1IL"
                },
                "Date": "on November 6, 2001",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1U8DHSI18EEJ1"
                },
                "Date": "on July 4, 2008",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RMHZSWZ7ZEQO"
                },
                "Date": "on February 20, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16NBK9EZKLR91"
                },
                "Date": "on March 9, 2006",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2L12L13HKKC91"
                },
                "Date": "on July 19, 2003",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "We've all heard of it, can recite it but most of us couldn't explain it. And rather than explaining it directly, Bodanis shows us a bit where Einstein was coming from, and how science came to view the various component of the equation. These history lessons give the reader what he or she needs to understand what the equation is trying to say and then are shown the equation is action here at home and in the cosmos. This book is surprisingly well written and accessible to the reader and never makes him or her feel stupid. This is probably the most lucid explanation of the theory of relativity, and introduction to some basic physics that I have seen. You won't be ready to tackle that college physics lab after reading this, but you may have something to talk about at the next cocktail party. Well worth the reader's time."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1E77E66RJ73ZW"
                },
                "Date": "on July 1, 2012",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "A good review of people involved in the story before, during and after Einstein's famous equation, with a little physics thrown in.  The problem is that the section about Chandrasekar makes it sound like he was the first to conceptualize black holes, which he certainly wasn't -- Newton considered the possibility and Einstein was initially surprised and doubtful when it was pointed out to him by Schwarzschild  that his field equations led to the inevitable conclusion of black holes.  What Chandrasekar did on his voyage to England, which was no small feat was to prove mathematically the largest white dwarf that could resist becoming a black hole (the 'Chandrasekar limit' which is about 1.4 solar masses).  This error in the book sort of poisons the well and makes me wonder what other historical 'facts' were not quite."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12STDB0FHUTUZ"
                },
                "Date": "on December 31, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17NRWQ05ZLM7W"
                },
                "Date": "on May 11, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Wonderful book. A teacher of mine showed the movie in class, and I was spellbound, so I proceeded to buy the book; I was not disappointed. This book is quite captivating, and I found it difficult to put down. It splits the equation up into five different sections: E for energy, = for equals, m for motion, c for celeritas or the speed of light, and 2 for squared. Keep in mind this book is not for those wishing to learn the exact mathematical development of this formula; it is more of a history of the people and events that led to Einstein's brilliant revelation and final development of the theory. I would recommend it to anyone."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQ23JXAGYX5C0"
                },
                "Date": "on August 30, 2004",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "This book took a very unique perspective explaining the world's most famous equation. He explains every part of the equation (even the history of the = sign). For example, for E (energy) he explains what it is, the history of it's discovery and use, etc. and how it fits into Einstein's equation. He does the same for mass (m) and the speed of light (c) and even explains why c has to be squared. It is not difficult to understand, he thouroughly explains everything and at the same time isn't too lengthy or boring. I borrowed the book from the library initially but loved it so much that I bought a copy to keep for myself. It was absolutely wonderful!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A399AVL9LENO51"
                },
                "Date": "on December 20, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "The idea of writing this book in the format to which it is written was brilliant.  Totally loved the movie that introduced me to the book which is made by PBS Nova I think.  Any way, get through the book and you will have a working idea of the equation that everyone knows but know one knows what it means.  I was always curious and now my curiousity has been satisfied.  I don't understand the idea indepth but I understand it to a point that I am very satisfied.  This book is not heavy and very enjoyable to read.  I recommend it highly."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMKZHBOK7VMQR"
                },
                "Date": "on February 10, 2001",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book approaches the explanation of e=mc2 by examining each of the equation's components and the historical developments surrounding the understanding of each seperately. It then goes on to provide a lucid and highly readable account of how they are linked through Einstein's work and the historical significance of that linkage in our own century. I found this approach extremely entertaining and at the same time highly enlightening. Overall this is a wonderful book. Highly recommended."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23KTSDYCOI3UC"
                },
                "Date": "on April 14, 2007",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGT1Q77O4ZHOR"
                },
                "Date": "on October 4, 2008",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "1",
                "Text": "The point is that ALL energy has a mass equivalence, not just nuclear/subatomic energy. Einstein knew this, although he had trouble proving it (see Einstein's Miraculous Year). By repeatedly and incorrectly stating that only nuclear/subatomic energy has a mass equivalence, Bodanis misses the great universality and majesty of Einstein's equation. He should have shown his book to a physicist before sending it to the publisher. As for me, I'll stick to reading science books written by scientists."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1L9M0E7S8H5DJ"
                },
                "Date": "on November 30, 2000",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "5",
                "Text": "The book reveals the biography of E=mc2.  As a biography, it starts with the origins of E, =, m, c, and 2.  The story describes how these terms came together in a single equation and how the equation has affected human events.  Through it all, the reader gains an understanding of the people involved--their successes, betrayals, and beheadings.  Who knew that 'spin doctors' were practicing their craft as early as the 1600s?  It is a great and very human story."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AA0DZUXXOJ9BC"
                },
                "Date": "on April 27, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I still talk about this book and I read it over a decade ago. I will have to read it again. I remember loving the historical stories and the tie-in to the larger picture of the development of this formula. Really well done - I have not read a book as good as this in this genre yet - but I've tried!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KW2UQUDF2YB0"
                },
                "Date": "on March 27, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A288S46QZNC3TX"
                },
                "Date": "on December 24, 2009",
                "Helpfulness": 0.75,
                "StarRating": "3",
                "Text": "Fascinating book, engrossing story. Highly recommended for sci-lovers & lay readers alike. HOWEVER, I bought the Kindle version & was disappointed to find that all of the photos are missing! The captions are there, but no photos display. Bummer. (hey Amazon, what gives??)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APJEREZ6QMK3Q"
                },
                "Date": "on November 20, 2001",
                "Helpfulness": 0.6818181818181818,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7VUQY4DU973M"
                },
                "Date": "on May 20, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22JBKKHCCLO86"
                },
                "Date": "on January 5, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WJXUWSXCJ98T"
                },
                "Date": "on November 7, 2012",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14YUS9BRI0MMK"
                },
                "Date": "on July 9, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2F173B4LMOJZ4"
                },
                "Date": "on May 20, 2011",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAUOAS78I3BUW"
                },
                "Date": "on October 28, 2008",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on November 13, 2000",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Unbeknownst to their authors, almost all books on 'physics for the layperson'are maddeningly frustrating for the average reader.  That's because they all, without exception, restate certain fundamental physics concepts without really explaining them in detail. (The authors would probably counter-argue that that is the nature of our quantum world, right? Gaps without explanation.) But nevertheless, those of us who are unschooled in these matters need step-by-baby-step instructions.  Bodanis' book commits the same error with respect to electricity and magnetism (a disembodied wire of some sort goes 'round a setup magnet, somehow suggesting a field; then the wire gets connected to a 'battery' of some sort- what kind I don't know, is it the potato of my elementary school yore, or what,--anyway, and voila! the field,--again, whatever that is--is proven. But wait a minute, I thought a battery, if not the potato variety, WAS an advanced electrical device already?) If you don't know what electricity or magnetism is, as I don't, this description of Farady's experiment is truly baffling. Additionally, Bodanis does what all other physics writers do in describing the effects of lightspeed, and that is to state the following:  at once objects gain mass and look bigger, but appear foreshortened, smaller, and slower.  BUT WHY AND HOW CAN THEY APPEAR BOTH??  He simply states these two contradictory effects in adjoining paragraphs without explanation.  But the saving grace of this book is, indeed, its explanation of c squared.  Again, it may surprise the experts that the uninitiated have wondered for years why, if nothing can go faster than the speed of light, there's that c squared in the equation - if nothing indeed can go faster than c, how in the world (or outside it even) can something go c squared??  Conventional explanation of c squared--that it's a \"really big number\" and that it's \"just a conversion factor\" have been heretofore singularly unsatisfactory. Bodanis finally explains it, and for that I am grateful.  The description of the heavy water factory in Norway and its destruction are fascinating as well, in addition to anecdotes about Einstein that I hadn't heard before.  Herr Bodanis indeed.  Herr PROFESSOR Bodanis - thanks for writing this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DOZ3IL6UVG84"
                },
                "Date": "on March 28, 2003",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LICSQ2IFE3C5"
                },
                "Date": "on June 11, 2004",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39ZZYH8U7LQRQ"
                },
                "Date": "on July 19, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "David Bodanis as a way of writing that one can enjoy. I love all his work and this book was no disappointment. A masterful mix of history and physics that makes science come alive. I can recommend all Bodanis's books."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OI4N0IG73GKZ"
                },
                "Date": "on March 14, 2002",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2P31QAO16JUEK"
                },
                "Date": "on September 30, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VLXB7H9UYCLT"
                },
                "Date": "on September 29, 2008",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Amazing story of the discovery and then application of the most powerful equation the world has known.  Beautifully written by David Bodanis the book provides very good scientific understanding to the educated layman but also presents in a way that makes it difficult to put down.  The chapter on the microsecond by microsecond events when the first atomic bomb were dropped are truly frightening.  The chapter on Lise Meitner and her nephew on holiday in Sweeden discovering nuclear fission was a true detective story.  The final chapter (Where are they now) gave some happy and sad stories to the many characters of the book.  Some who did so much but may not have received credit due to their unconventional education (Faraday), gender (Payne, Meitner) or skin color (Chandrasekhar) begin to get their deserved credit.  Finally, the man at the center of it all who unwillingly became a popular icon spent much of his later years trying to live up to his earlier scientific fame from the special and general theories of relativity.  The book has so much more in it but I believe I will need to read it again as it contains so much!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Q8GTBIN6780F"
                },
                "Date": "on November 14, 2002",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WLTH3ZFRBM1Q"
                },
                "Date": "on September 20, 2004",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OW7ANKY2YV6Y"
                },
                "Date": "on June 5, 2008",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GT00AAI8LUXF"
                },
                "Date": "on March 2, 2001",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALU9YF6LE9AQ3"
                },
                "Date": "on January 14, 2001",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "4",
                "Text": "I thoroughly enjoyed the book.  It offers a unique view of Einstein, but more importantly, as the title infers, discusses the equation and the role of general and special relativity in today's society. The text is not by any means laden with mathematics so it should be generally available to all.  Avoiding the complications of thick mathematics, Bodanis does an excellent job of clarifying the significance of Einstein's perception of energy and mass and, importantly, denotes the role of Newtonian thought and clearly presents other significant post-Newton, pre-Einstein age thinkers and their role. I, personally, found the discussion of special relativity and the lack of elaboration on space-time as it relates to E=mc2 a bit lacking, but still very good reading. I would recommend this book to anyone who has an interest in better understanding concepts such as atoms, nuclear power, nuclear weaponary, Star Trek and speed of light travel,  etc."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BR76XK87ZS2D"
                },
                "Date": "on December 29, 2011",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This book peaked my interest. It left me with more questions than answers. As an engineer, I am familiar with each of the terms in the equation. I understood that mass could be converted to energy and that this is the fundamental equation behind the atomic bomb, but I must admit that I had never really thought beyond that. Like for instance, what in world does the speed of light have to do with the relationship between mass and energy? And what part of mass actually disappears to become energy? The book didn't answer these questions to my satisfaction but did get me thinking. (Hopefully, one of the eight physics books I found at the library will enlighten me further). Bodanis does a good job putting Einstein's equation into context. I loved learning about Faraday, Lavoisier, and others. I remember the names from school but they are so much more interesting here than in textbooks. Hopefully, more science texts and teachers can implement the engaging style of Bodanis and other such science writers."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31GGVIAFBPGA7"
                },
                "Date": "on October 21, 2010",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I can't begin to describe how interesting this book is. I started out mainly wanting to know what the speed of light has to do with anything, and Bodanis takes us back to the beginning, describing not only the relevance of the speed of light, but also the earliest discoveries involving energy, the equals sign, and mass. Bodanis's writing style is very easy and engaging. If I have one complaint, it's that I would have preferred a chronological treatment of energy, mass, and the speed of light, not a treatment in that order. Still, the book is completely understandable and is chockfull of fascinating history, such as the importance of Emilie du Chatelet, Voltaire, and Lise Meitner. It's probably also the best brief history of the Manhattan Project. At a little over 200 pages, this book is a quick read, but the reader comes away with lots of historical and scientific knowledge. I'm definitely going to have to read more David Bodanis publications!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31MUO4RO5P2KC"
                },
                "Date": "on December 10, 2004",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XF6BA3TNKY2"
                },
                "Date": "on September 15, 2005",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20K13HVYP2ZQL"
                },
                "Date": "on April 17, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Starting with each of the letters and symbols in the famous equation, the author tracks down the origin of each. Having explained those them, he charts the path of individuals and breakthroughs that led the the first atomic bombs. while that latter part is a little hard to read, knowing the tragedy and death that will follow the development of the bomb, overall this is an enjoyable and informative read. It provided the clearest explanation of the atomic chain reaction that creates the mushroom cloud I've ever read. It's so good, I had to share it with others. \"Hey, do you know...\" Perhaps other reviewers are correct in saying that it's too simplistic and too interested in flouting authority and supporting the underdog (and women). But this book will create interest that could grow beyond this introduction. In that way, it is completely worth your time."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOOZD3SGGDXUT"
                },
                "Date": "on September 13, 2010",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASY77MV24WF8Z"
                },
                "Date": "on April 27, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2X3S7V4SC4T0W"
                },
                "Date": "on December 21, 2010",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I enjoyed this book. It was written from the perspective of a biography of the equation E=MC2, rather than a biography of Einstein himself. This was a unique approach to the idea, and I felt like it worked pretty well. It introduces the scientific advances that lead up to the equation, followed by where mankind has taken this new found knowledge. It discusses the idea's applications in the atomic bomb, medical equipment, and the formation of the universe. The author offers good analogies and simplifies concepts so they can be easily understood. It was written on a basic level that lent itself to be easily understood by the lay audience, and so it probably isn't as accurate as a Ph.D. dissertation would be, but it was a good introduction to the idea and the history behind it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GK0QMCSKTNK1"
                },
                "Date": "on October 18, 2007",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I wasn't sure what to think when I picked this book up, but David Bodanis takes us on a very interesting journey to get to Einstein's famous equation, giving us a history of the various bits that go into it and showing how those bits were welded together by Einstein to unlock the secret of matter and energy. And it doesn't stop there, because like any biography, it follows the equation from its inception to the various paths it has taken throughout its life, including its use in the atomic bomb, as an answer to how the sun shines, and as a way at looking at the structure of the universe. Best of all, it is not bogged down in the nitty-gritty of science -- no math degree is required to follow the story. Very entertaining and thought-provoking"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UT063XWH0KWQ"
                },
                "Date": "on November 15, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I originally picked this book up at a used book store in the UP of Michigan. What an amazing history behind an equation we've all heard about, but many don't take the time to truly understand. I teach Natural Science at a community college and I LOVE how Bodanis writes in a way that makes very complicated information accessible to all. I wish I had time to have my students read this because I think it would give them a greater appreciation for the fact that scientists are real people, with real struggles who have to work together and rely on what knowledge has come before them. I bought this copy as a gift for one of my fellow faculty members who also teaches Natural Science. I'm sure they will like it as much as I did."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2V157AK6XTJAZ"
                },
                "Date": "on November 29, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3L0UYQ36ILHN2"
                },
                "Date": "on June 26, 2006",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36KFTXBOZR63B"
                },
                "Date": "on January 13, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is by far the best popular science book I have ever read! It's exciting and easy to read. No matter what your level of knowledge about physics is, you can get something out of it. Everyone in my family from the 87 year old matriarch who has never taken any physics course to a person with an PhD in mathematics loved it. Pay no attention to the detractors who complain about the lack of equations. The author has a website containing all the gory details if you care to get into them. I found the book so wonderful that I have read it 10 times and have read another book about one of its topics- the heavy water plant in Norway during WW II. Try it; you'll love it!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XJI13JNZXNMZ"
                },
                "Date": "on January 7, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I am researching Einstein's special theory of relativity basis and this book by Einstien provides more of a complete set of information. I am aware that Einstein's world view was different as his view of the cosmos was much smaller. In his day technology had not developed to view the cosmos and find trillions of Galaxies. They thought many of the sparking were stars; but in reality they were whole galaxies. With that view he projected other theories about space travel that were in error. Thus, one should examine his special theory of relativity as well. Dr. Ronald Cutburth, Management of engineering science operations, Engineering Scientist."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A91U6G845YJSH"
                },
                "Date": "on November 12, 2000",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A73EO51UK010P"
                },
                "Date": "on December 20, 2000",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is an extremely readable book on a subject that at first glance might seem intimidating. It does not spend much time on the intricisies of atomic science but, instead, is truly a history of what led up to this incredibly influential equation, who were the folks involved, and its uses beyond the bomb. Anyone interested in science will find it an engrossing read. Some \"Gee-whiz\" facts like how much energy is released in the fusion process and how much hydrogen the sun burns up keep the reader engaged. You can buy this for anyone from a high schooler to any scientificly curious adult. Highly recomended."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Z00Q7MFMM4VI"
                },
                "Date": "on November 15, 2006",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "4",
                "Text": "I'm no Einstein, but I do know a good book when I read one, and this one qualifies.  Bodanis uses the famous equation to share biographical sketches of fascinating scientists working toward the discovery and application of the 20th century's great scientific breakthrough.  With any popular science writing success can be measured by how well the author can take the obscure and esoteric come alive and show science to be what it ultimately is, a compelling human story.  Without question the author succeeds."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AJ4QP5SOCJZ2"
                },
                "Date": "on November 2, 2006",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is a wonderfull science history book, with the famous equation being the common denominator of the people and topics covered. This book will educate you on mass, energy, and the speed of light individually, and then teach you how they all relate within the equation. Best of all, you will learn the personal stories of all the characters who were involved along the way. You don't need to be physics major to read this book. If you have a passing interest in the topics, you will completely enjoy the skilled writings of this author."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NLSEIJGONCGT"
                },
                "Date": "on September 11, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I enjoyed another of his books on the history of electricity which was well written and understandable even if a person didn't have an extensive science background. I found this book written in a similar fashion, although I was familiar with most of the content; hence the four stars. Mr. Bodanis does have a gift for writing and storytelling about somewhat complicated subjects in a manner that makes them highly readable. I hope he keeps writing books on scientific subjects because of the passion brings to his storytelling."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18J40L77AD42I"
                },
                "Date": "on March 9, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I ordered several copies of this book for my 8th grade gifted science class.  Students viewed the Nova Movie Einstien's Big Idea based on this book first.  Students loved learning about all of the scientists and how this famous equation affects them today.  Great book to teach across all curriculum areas---language arts, math, social studies. This book is well written and easy to comprehend. Lots of notes, references, suggestions for further study.  Don't let the boring cover fool you.  It is a great read!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19Q4LR7LD7FMS"
                },
                "Date": "on March 28, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A246ZHTG1SJ9MJ"
                },
                "Date": "on April 1, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I needed to get this book for a chemistry class, and it turned out to be a pretty good book. It is a biography of Einstein's famous equation, e = mc^2. The author does a great job explaining the equation and Einstein's life and work in a way that anybody can understand. It is not a book that has a bunch of scientific language that is boring and difficult to read or understand.The author uses a more lighthearted and witty tone, which is nice because it makes it more enjoyable and easier to read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DP9G81PANNGN"
                },
                "Date": "on February 7, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A353RD5EVUCBEH"
                },
                "Date": "on November 28, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IX8SYI2DDF3A"
                },
                "Date": "on June 24, 2013",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27KWKFBW6D3LL"
                },
                "Date": "on September 21, 2007",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is not a book for people who are looking to learn science.  It is a book for people who want to learn about scientists.  Bodanis includes lots of fascinating biographical snippets, some about people, such as Emilie du Châtelet, who are entirely overlooked in most textbook histories.  His book is a great introduction for those who want to fill in some of the gaps in their knowledge about the people who created modern civilization."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NTHOG0XIY40M"
                },
                "Date": "on September 25, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2E6GG81WYC1OG"
                },
                "Date": "on June 29, 2008",
                "Helpfulness": 0.625,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KWQ2ID3VIAAZ"
                },
                "Date": "on December 4, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I love biographies, but I wasn't sure what to think about the biography of a formula. As I read the book, I began to understand why they gave the book this title. Many people contributed to this formula over many years. One of the best parts was the large amount of content focusing on dispelling misunderstandings and giving credit to some of the lesser known contributors."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YF4ZMECJVLK9"
                },
                "Date": "on January 31, 2003",
                "Helpfulness": 0.6,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34YTCGJCKP5B"
                },
                "Date": "on July 15, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great Read. Kept me engaged the whole time. Learned tons about the background of so many physicists I heard about in College and high school. You don't need a significant knowledge in physics to understand this book, and he does a great job of explaining the principles that are involved. An excellent read for that special Nerd in your life."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABXZ45A4TQ0M0"
                },
                "Date": "on October 17, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I've enjoyed this book so much, that I have -- no bull -- purchased copies for several friends as gifts. Bodanis tells the story of the people who contributed to the underlying principles on which Einstein drew. It is part human interest history, part gee-whiz discovery, all written very engagingly. I recommend it without hesitation."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31LHX8FY63MVJ"
                },
                "Date": "on December 31, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ENVPPKAY81KL"
                },
                "Date": "on January 3, 2001",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "As an explanation of the equation, I give this book high marks for almost getting through to me. As a biography, its nearly perfect, mixing people, science, and history together in a fascinating blend of fact, speculation, and relationships. This is a great book for gifts, and someday, I may just get the equation right."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAXD22CSEE6RY"
                },
                "Date": "on January 13, 2014",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": "There are a lot of interesting stories about physics here, but readers will not get an explanation of why e=mc2. And that is unfortunate in a book that purports to tell the biography of the equation. It's sort of like reading a biography of a person without learning anything about his/her background."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VEAIDEEL20NK"
                },
                "Date": "on May 27, 2002",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUSQTXM16XKPL"
                },
                "Date": "on March 23, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AO7G1SUI4ILSV"
                },
                "Date": "on February 17, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "In addition to the obvious consequences of Einstein's theory, we are introduced to the scientists and ideas that laid the stage for this insight. Interesting people and the influences I'm their lives that may have shaped their perspectives."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PG9AISTFAG7C"
                },
                "Date": "on December 22, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "The development of scientific knowledge was presented in a way that allowed a person like me, who has practically no understanding of physics, to see how ideas that preceded Einstein come to develop his equation."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAVCPZINJDEMQ"
                },
                "Date": "on April 10, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I recommend this book to anyone who wants to learn not only what and how the equation applies to all of our lives, but also to those who have little knowledge of the turbulent years leading up to WWII."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DL5A47G3MR6M"
                },
                "Date": "on May 1, 2002",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2J12O0KDRXXYM"
                },
                "Date": "on October 8, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A gripping story of how the equation came about and the affects on World history. Couldn't put this down, have given a copy as a gift and recommending the read to all."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ADUIBRDDV95L"
                },
                "Date": "on January 31, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "It was interesting to read about the background and what led to this great idea. It is easy to read even though it touches a technical subject. It is a great book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACN12A5BGIZBF"
                },
                "Date": "on July 1, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This book gave me great insight on the equation, the man and solidified what I thought: the universe is finite..it just constantly goes between matter and energy."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QSD7OPNBO9XT"
                },
                "Date": "on October 4, 2009",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVUXUMG8ENYTR"
                },
                "Date": "on November 6, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Science that's readable for the non-science, non-math person.  It's not dumbed down, but focuses on the human achievements and struggles behind the equation."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VFCSKS0SCWV7"
                },
                "Date": "on July 21, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The book I received is everything I expected and more.  Will order again from  Amazon.  this book should be required reading for all students in high school."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10G0UV69NCHXB"
                },
                "Date": "on September 12, 2007",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A well written story about this famous equation, its history, and perhaps it's future. I STILL don't fully understand it all, but hey, the author tried."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LU647B6LJ03L"
                },
                "Date": "on March 20, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "As a non-math person, I thoroughly enjoyed this excellent book by David Bodanis.  He made the meaning and history of the equation a facinating read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2B9R61CUG83S9"
                },
                "Date": "on November 18, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I appreciate Mr Bodanis effort at enlightening a laymen (woman) such as myself. This book is relevant on a scientific as well as historical level."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OEJEI85U0V3P"
                },
                "Date": "on June 27, 2003",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "I really lucked into finding this book. It's one of those books I recommend to everyone--in fact, four of my friends are reading it right now because I've been raving about it. :) As a word person, math and science have always made me nervous. But David Bodanis has a real gift for taking complicated concepts and using real-world examples to make them easy to understand and entertaining to read. The storytelling approach he uses to show how discoveries by different physicists contributed to E=mc2 is fabulous. His grasp of human nature and motivation is amazing. I loved his characterizations of everyone, from Voltaire to Faraday to Einstein himself. This book is captivating and compelling reading, even for those of us who never got higher than Cs in Chemistry. :)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOP9O6F1X8VGU"
                },
                "Date": "on February 8, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Love this book. It makes it to where even a simpleton like me can understand. PBS even made a special on this book. Highly recommend this."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AP88SCJ5DNV2F"
                },
                "Date": "on October 10, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Loved the human element of this book.  Subjects that could be dawnting, revealed a the human side and the history.  Fascinating."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A179U6VFEPJNTW"
                },
                "Date": "on May 2, 2001",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "This book is excellent; the best I have read on this subject. It brings Einstein, science, and physics to life.  It presents science and history in such a clear fashion that it reads like a historical novel, yet when you are finished with the book, you find yourself enriched with a better understanding of our universe, and a greater appreciation for science and the scientists (like Einstein) that brought us our understanding.  If you have a desire to understand the basics for how matter and energy connect in our universe, and want a simple history lesson for how Einstein (and the scientific community) developed and explored nuclear energy, this is the book for you. I highly recommend this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9F2E886K90QI"
                },
                "Date": "on March 9, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Really informative and easy to understand. Great research and historical data! I really enjoyed this book and happy I read it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XS47MLUWQL0U"
                },
                "Date": "on January 18, 2008",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Bought as a gift for my husband.  He loved it, so I read it.  It's incredibly interesting and thought provoking."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXWEP7NQ7TFTC"
                },
                "Date": "on September 8, 2003",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2P6W73ASNQIAA"
                },
                "Date": "on January 26, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Didn't read it myself, but it arrived in time for my son to read it for school.  Packaging was great!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1398C3BIW1H68"
                },
                "Date": "on June 7, 2002",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": "The secret to enjoying this book is to take it for what it is: a quick, entertaining read to introduce the ideas and history surrounding the revelation that mass and energy are different manifestations of the same basic stuff. If you are looking for any kind of depth, or complete scientific accuracy, or full historical colour, then you are going to be disappointed. On the other hand, if you start with the idea that this book is a sketch, not a painting, then you'll have a fun few hours cruising through it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CPVCS9ZNYE79"
                },
                "Date": "on December 18, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I have yet to finish this book. I enjoy the subject and so far the book is holding my interest."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 4, 2002",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A680RUE1FDO8B"
                },
                "Date": "on July 3, 2001",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on May 3, 2001",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Prepare to be amazed by events before and after Einstein published his energy-mass formula. This is no primer. Rather E=mc2 flies high and wide about people, places, and things that you hear about but really don't know much about. I was particularly impressed by descriptions of what went on in the sky over Hiroshima, an important narrative about the atomic bomb's inner workings. Beyond the main text, which is excellent beginning to end, appendices and notes are also quite informative."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10WXIR6DPY406"
                },
                "Date": "on August 30, 2001",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": "This book was given to me as a gift. I opened it with dread anticipating reading a \"textbook\" style book on physics. BOY WAS I WRONG! This gem finally put the pieces together on E=mc2, but it was more. In explaining how mankind got to E=mc2 (an amazing journey)Bodanis also shows us in a clear and comfortable style what it takes to resolve other unknowns, THINK. Be curious, be interested in why and build on what you know."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MA4F2Y6EE8QR"
                },
                "Date": "on October 14, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A wonderful book written for anyone! I enjoyed it tremendously. No math involved."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TZYME7K7VHXH"
                },
                "Date": "on July 2, 2003",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "It was a very enjoyable read. I had a lot of fun with it. If you expect to FULLY understand E=mc2 after reading this, you'll be disappointed. But, you will have a much better understanding of the equation and can almost follow the stream of thought that got Einstein there and past it. I really enjoyed this book. If you liked \"longitude,\" you'll like this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SLGQPCMJ2W81"
                },
                "Date": "on November 11, 2006",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1W79N0CT220CJ"
                },
                "Date": "on December 14, 2001",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "I know very little about physics -- or, rather, before reading this book I knew very little.  I feel now as though I possess a firm grasp of the rudiments of Einstein's famous equation.  Neither scientific expertise nor mathematical sophistication are required to learn from, and to greatly enjoy, this superb little book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A124SIOCJJ09C7"
                },
                "Date": "on September 8, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "got it quickly- very helpful  school reading"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZ0PCEZUTF5QO"
                },
                "Date": "on March 22, 2004",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 9, 2004",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26KSBC3315A3O"
                },
                "Date": "on June 14, 2004",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QKD6G4NKE9NF"
                },
                "Date": "on November 10, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Entertaining, Enlightening and Enjoyable."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XFE6R7OW7SVK"
                },
                "Date": "on December 23, 2001",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "I have read many books on this subject and NONE of them conveyed the essence of the equation the way this book does. I am not a scientist, and did poorly in chemistry in school, so I really needed a book such as this one.  Bodanis' metaphors make this famous concept - that mass and energy are the different aspects of the same thing - really easy to understand.  For example, he describes the uranium atom like an overstuffed water balloon, ready to be punctured by a slow moving neutron.  Now I can finally picture how the atomic bomb worked.  Bodanis also shows how this timeless equation developed against a backdrop of human frailty - insecurity, double-dealing, backstabbing, jealousy, and even romance.  His description of an Allied nighttime raid against a Nazi-operated heavy water factory in Norway reads like a spy novel.  There were at least two surprises in this book for me: 1)  the crucial role of women in the development of proof of Einstein's equation, and 2) the academic establishment's resistence towards the equation and other aspects of the new physics.  Many of the pioneers either skipped school or did poorly in it - probably because they were too imaginative to put up with orthodoxy.  But they kept their individual, iconoclastic spirits alive, and helped found a new physics and cosmology.  At the end of the book, author Bodanis writes \"I loved writing this book.\"  And one can tell that he did.  I loved reading it as well."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10XOFJNI81OBQ"
                },
                "Date": "on May 11, 2004",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "It is easy to think of technology in the context of hard science and with the intellect. Bodanis gives lay readers an appropriate level of insight about how math and science evolved through several hundred years to propel our species toward the elegant equation that changed the world. This historical journey enlivens many forgotten but critical thinkers who made it possible for a restive patent clerk to make the essential creative leap into the intellectual unknown. But this book accomplishes something else, even greater. The author's brilliant chapter describing in micro-second details the detonation of the atomic bomb over Hiroshima creates a powerful, sobering perspective of this fearsome technology and dispassionately reminds all of us of the threats looming. The author uses his beloved science to bring into searing perspective the human face of thermonuclear war. The power to manipulate the atom has the capacity for good in medicine and other human advancements, but it is also a power capable of planetary destruction. It is wise for lay readers to understand E=MC2 beyond science. Our survival is at stake."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PEVP36Y5A2EQ"
                },
                "Date": "on May 30, 2003",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AK7MPID0HXXIG"
                },
                "Date": "on July 18, 2010",
                "Helpfulness": 0.5,
                "StarRating": "1",
                "Text": "Bodanis is an engaging writer. Unfortunately, this book is very short on scientific and historical accuracy. If you want authenticity with your entertainment, this is not the book for you. The number of errors is legion, and many are quite significant. It would appear that neither the author nor the publisher saw fit to have the manuscript vetted by experts in physics and/or physics history."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YPR7G99ZD8FO"
                },
                "Date": "on November 26, 2001",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A152YPMFU0WUR9"
                },
                "Date": "on June 24, 2003",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFGPSTC9ICA1I"
                },
                "Date": "on June 18, 2001",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "Over all, a very good read.  Mr. David Bodanis does a good job of tracing the \"roots\" of the equation E=MC2 and entertaining the reader at the same time.  David's story becomes a tapestry of people and places involved with the creation of this deceptively simple formula, all of which are woven together over time. The contributions of the more notable persons such as Newton, Faraday, and Einstein of course are present.  But equally interesting are the contributions of Cecilia Payne, Lise Meitner and even Robert Recorde."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38KQA6RSKL86J"
                },
                "Date": "on January 25, 2003",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AP2J9QLR2Z500"
                },
                "Date": "on January 28, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "in good shape"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12BUBPS6ZNZ82"
                },
                "Date": "on March 6, 2001",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "Although we have all been exposed to this famous equation, this is the first book I've come across which actually makes a meaningful attempt to explain not only what the symbols themselves mean, but also what the underlying implications of the equation are.  Additionally, the author's method of interspersing personal information about the scientists involved with the equation after Einstein conceived of it, was an effective way of breaking up what can sometimes be a rather dry subject."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11RL0EFGMJK8O"
                },
                "Date": "on June 18, 2004",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IRRQUR9P7D1C"
                },
                "Date": "on November 28, 2006",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8CEHBFFI6VZC"
                },
                "Date": "on March 19, 2004",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "Bodanis personalizes the famous equation so that even i could understand its significance. Bodanis tells personal stories of famous characters associated with the equation including WWII secret missions and anti-semitism. Bodanis does a good job making the equation understandable. This book has made me look up at the sun with whole new understanding."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SLVQKERJUS16"
                },
                "Date": "on October 10, 2007",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on November 27, 2002",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "This book is written for the layman.  Bodanis is a wonderful storyteller, whetting my appetite for more.  He makes the topic easy to understand, but still manages to capture the magnificence of the concepts.  I would recomend it to anyone."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ACW3ITNRCRUZ"
                },
                "Date": "on June 16, 2001",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "This is a terrific book. If you have an inquiring mind, you'll love it. It is so easy to read that time flies by.You learn so much, not just about the well-known equation, but about the people whose work made the thought possible."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 29, 2002",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Well written and most interesting.  The author was also quite an historical researcher.  Who ever knew that Voltair knew Newton or that Voltair's love was a brilliant French lady (who contirubted the 2/square to E = mc2)."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WK4TWN4E1WWG"
                },
                "Date": "on May 6, 2002",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I like Bodanis style of writing, once you start reading this book you can't stop. Very easy to read and learn some interesting facts, and it conbines history with science and personalities. Buy it and read it!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CPN3NWNV6MBP"
                },
                "Date": "on December 30, 2001",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": "This book is a must read for anyone in a technical field. It gives a great historical and storylike approach to one of the worlds most famous, yet most misunderstood equations.  You meet characters like Voltaire and Werner Heisenberg, Lise Meitner and Lavoisier, J. Robert Oppenheimer and of course Einstein himself. This book truly gives you an insight that will leave you on internet book sites writing reviews and looking for more great books."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39WNQ37GUIBIY"
                },
                "Date": "on May 17, 2006",
                "Helpfulness": 0.4,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LSL8SO66RHIQ"
                },
                "Date": "on January 3, 2003",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Truly, do you think understanding Einstein's theories and the illusive equation E=mc2 is impossible, reserved only for the physicists and geniuses?  Stop!  With David Bodanis' book you can understand and explain E-mc2 to anyone!  Wouldn't it be great to feel the joy of understand special relativity, general relativity and all its implications.  This accessible, well-written, engrossing book does all that and more.  It welcomes you as a capable, intelligent person into the seemingly elite world of scientific knowledge.  It is fantastic to read and re-read.  As accesible as it is it would make an excellent text or reference book also.  Do not miss adding this to your collection."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on August 15, 2003",
                "Helpfulness": 0.5263157894736842,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on December 3, 2001",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DT4WVIBD8JQ2"
                },
                "Date": "on October 26, 2005",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": "The fame of relativity will dwindle but Einstein's equation (E = mc2) will remain for ever because it reflects deep hidden truth. It must be noticed for the historical record that this essential equation was obtained from surprisingly successful model of the structure of universe in Eugene Savov's book Theory of Interaction the Simplest Explanation of Everything. Savov also simply derived the principle of uncertainty in his framework, something that Einstein's relativity cannot do."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on January 14, 2001",
                "Helpfulness": 0.25,
                "StarRating": "5",
                "Text": "This was a fantastic book. I couldn't put it down. A very easy read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UWVXZ998DULX"
                },
                "Date": "on February 12, 2002",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQIDN0CNY7L92"
                },
                "Date": "on February 19, 2006",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "1",
                "Text": "As a Japanese citizen, I do not want to believe that Einstein wrote to FDR many times trying to persuade him to build A-bombs by using explicit words and I do not want to believe that FRD was so stupid and impolite that he declined the proposal by such a well-known nobel-laureate physicist. We Japanese like Einstein very much, and probably Einstein liked Japan very much since he visited Japan twice, both time welcomed by heated celebrations. It is also unlikely that he hated Germany that much since many of his relatives and friends were still there. When Einstein arrived in US, he had only a few hundred English words in his vocabulary and probably was not able to write decent letters in English. It is rather well known that a Hungarian physicist Leo Szilard wrote the letter, performed all the meticulous errands, and Einstein just signed. No letter of Einstein quoted in this book has the date or the source. Also I don't want to believe Heisenberg was a bad guy just because he was an excellent scientist. Although I firmly believe in Lise Meitner's great contribution to the fission theory, I do not want to think that Otto Hahn was a bad guy who expelled her from Keiser Wilhelm Institute in Berlin and stole the theory from her; to Keiser Wilhelm Institute and Otto Hahn, it was much better to let her away than losing her in a gas chamber; also in the situation with Nazi governed Germany, Otto Hahn just could not mention, in his paper, her name and her nephew's name (Robert Frisch), who were known as Jews. This book is unscientifically emotional, dramatized, opinionated and biased, so is my review of this book. \"Brighter Than Athousand Suns\" by Robert Jungk was much better to understand the historical event, and I expect much to \"Heisenberg's War\" by Thomas Powers."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25NOI0VACRV4Y"
                },
                "Date": "on March 13, 2007",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Light and witty, this book was very interesting and fun to read."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on December 29, 2003",
                "Helpfulness": 0.22727272727272727,
                "StarRating": "4",
                "Text": "I first encountered this book at the library as a book on tape.  I was fascinated.  It would make a good companion to Richard Rhodes' The Making of the Atomic Bomb."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWDFOM2D4PTZD"
                },
                "Date": "on October 24, 2001",
                "Helpfulness": 0.058823529411764705,
                "StarRating": "2",
                "Text": null
            }
        ],
        "ReviewUrl": "http://www.amazon.com/mc2-Biography-Worlds-Famous-Equation/product-reviews/0425181642/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "182"
    },
    "Salesrank": "#72,054",
    "Timestamp": "2015-05-24 15:21:43.142072",
    "itemurl": "http://www.amazon.com/mc2-Biography-Worlds-Famous-Equation/dp/0425181642"
}
