{
    "Category": "in Books (",
    "ListPrice": "",
    "Name": [
        "Beyond the Chinese Face: Insights from Psychology"
    ],
    "OfferPrice": "",
    "Reviews": {
        "AverageStarRating": "3.4 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on September 22, 1999",
                "Helpfulness": 0.9333333333333333,
                "StarRating": "5",
                "Text": "This book is written by a scientific psychologist for the intelligent layperson \"who wants to understand how and why Chinese people behave and think as they do.\"  The facts and conclusions about Chinese  behavior and thought - the \"how\" part of the preceding sentence -  and the facts and conclusions about Chinese society - the \"why\"  part - are gleaned from scientific studies of the Chinese people.  The  author, Michael Harris Bond, Ph.D., has taught at the Chinese University in  Hong Kong for 25 years and is presently president of the International  Association for Cross Cultural Psychology.  He is also one of the best  writers in psychology, and he has done a masterful job  \"translating\" scientific jargon into words we all can understand.  As one reviewer put it, \"It's one of the best such books I have ever  had the pleasure to read, a skillful blend of hard data and warm human  insights.  I was captured from the first sentence to the final quote.\"  Now, it must be said that certain readers are going to be disappointed  with this excellent book.  It is not a Fodor's-type travel guide to social  interactions in China, and it's too complex and humble to be of much use to  businesspeople eager to exploit the Chinese market. Flakes \"into\"  weird Chinese philosophies and medicines will find nothing of interest  here.  But for the thoughtful reader who wants to learn about Chinese  psychology, this book has no peer.  It's the best."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on September 13, 2001",
                "Helpfulness": 0.9285714285714286,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2D6EB1TALULSS"
                },
                "Date": "on May 8, 2002",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I have now been working in Hong Kong for nearly four months. A colleague lent me `Beyond the Chinese Face' in my first week here in Hong Kong. I have lived in several different countries and cultures, and so have at least an intellectual understanding of different perspectives and ways of seeing the world. But it is amazing how unhelpful one's intellectual awarenesses are when faced with understanding actual events or situations in a new cultural setting. What `Beyond the Chinese Face' managed to do for me was to assist me in building a framework in which to understand what I observed on a daily basis. By enabling me to feel that I understood more about the context I was in, I felt more relaxed, and so was able to engage with different customs and rules more easily. Even Hong Kong bureaucracy became more comprehensible! I liked the fact that the book made it clear that many of the existing research studies are flawed, but the overall patterns emerging from research were clearly laid out. It was refreshing also to read a book that was based on academic research but was written in a style that was accessible and easy to read. If only more academic writing were like this! This is a valuable resource for all newcomers to Hong Kong. Thanks, Michael."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2G3Q93EGQ8QEG"
                },
                "Date": "on January 3, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is an easy-to-read yet thorough examination of the Chinese culture.  It has a current focus and provides the reader with an excellent guideline for communicating with Chinese people.  An important guide to dealing with the major economical influence of our time!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CKVMA6DMN1P"
                },
                "Date": "on March 2, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A96MSIGCOPDB0"
                },
                "Date": "on October 20, 1999",
                "Helpfulness": 0.5714285714285714,
                "StarRating": "5",
                "Text": "What an insightful, sensible, readable and informative book that explores the question that many ask about other cultures - \"HOW and WHY do others think and behave as they do?\"  Without a doubt an expert in his  field, Dr. Michael Bond masterfully weaves for the reader an explanation to  this question in a thorough and understanding fashion.  A fascinating, yet  understandable voyage into Chinese culture.  This small yet valuable book  truly goes - \"Beyond the Chinese Face.\""
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on August 11, 1998",
                "Helpfulness": 0.4375,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on August 13, 1998",
                "Helpfulness": 0.2777777777777778,
                "StarRating": "1",
                "Text": "I read Mr. Harris' book while on the way back from China, after studying  in Beijing as an exchange student. Reflecting upon my experiences in China,  I was amazed at how Mr. Harris distorts the truth. Almost everything he  says in the book is incomplete or distorted. If anyone wants to know more  about China and its people, the best way is to go and visit, and see for  himself. The worst he can do is read Mr. Harris diminutive lies. I regret  my parents wasted their money to buy this book for me."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on November 7, 1999",
                "Helpfulness": 0.3611111111111111,
                "StarRating": "1",
                "Text": null
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Beyond-Chinese-Face-Insights-Psychology/product-reviews/0195851161/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "9"
    },
    "Salesrank": "#246,582",
    "Timestamp": "2015-05-24 15:35:14.551856",
    "itemurl": "http://www.amazon.com/Beyond-Chinese-Face-Insights-Psychology/dp/0195851161"
}
