{
    "Category": "in Books (",
    "ListPrice": "$84.00",
    "Name": [
        "Student Solutions Manual for Chemistry: A Molecular Approach"
    ],
    "OfferPrice": "$71.22",
    "Reviews": {
        "AverageStarRating": "4.3 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12TJDZL9VBQ2N"
                },
                "Date": "on April 28, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "I WOULD DEFINITELY get this if you are doing problems in Chemistry, A Molecular Approach. Believe me, I tried it with no solutions manual and got headaches from trying to figure out some of the cumulative and challenge problems at the end of the chapter. The solutions only cover the odd problems, which is good enough. Steps are skipped in some solutions, but you can figure it out from there if you spend some time breaking down the solutions, this in turn will help you with other problems. Write notes in the solutions manual with a pencil to help you while you are breaking it down. For some numbers that seem to come out of nowhere, type those numbers into Google, sometimes they are constants or chemical standard notations that haven't been covered yet at that point in the book. Sometimes you can also use the text index to look up unfamiliar notations by topic and other things that have not been covered yet at the chapter you are at."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1T0SPRB58KD8Z"
                },
                "Date": "on October 25, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "I have found this manual to be a very useful adjunct to Chemistry by Tro, this lets me work through many more problems and see valid methods to solve these problems. The solutions are clear and easy to follow."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXGXGOXGJ7Q6R"
                },
                "Date": "on November 15, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Needed it for class! but it was helpful in the class!  Seriously helped me pass the classes!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9D4344DEQ66X"
                },
                "Date": "on May 6, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This solution guide is an excellent companion to the textbook. When I was reviewing for exams, it was very easy to work out a problem and check to see if I did it correctly. Furthermore, the solution guide helped me when I didn't even know where to begin. It provides a conceptual approach to each problem before showing how to solve the problem arithmetically."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BPO1CIQU988Z"
                },
                "Date": "on September 21, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is the exact text book that I needed and it is in phenomenal condition. All the problems are worked out very nicely in the book and help to reinforce concepts learned in the classroom. Not only was this book cheap, it was also quickly shipped. Wonderful service!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VNDAJ4LQQHEA"
                },
                "Date": "on February 9, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Very, very helpful. It goes along with the review questions at the end of each chapter in the book and really has helped to understand each question"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZKMZW7VEDV2G"
                },
                "Date": "on May 5, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The whole point of purchasing a solutions manual is to verify the correct steps in coming to a final conclusion. This book did a great job in terms of reaching that goal. Tro did a careful job to include all steps, no matter how minor, in order to keep students on the right track. I would recommend this manual for any general chemistry student."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HHO3C4I2UG7A"
                },
                "Date": "on September 22, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great service. Prompt and professional. It was hassle free and made my return easy. Was definitely worth going through them"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXOHO24FZJXRE"
                },
                "Date": "on August 31, 2013",
                "Helpfulness": 0.625,
                "StarRating": "1",
                "Text": "This is listed as \"Student Solutions Manual\" and it is not the actual Student Solutions Manual, on the cover it says \"Selected\" Solutions Manual and is significantly abbreviated. This version does not list the actual problems. Now a week behind the game."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1L6CI04FBUA3J"
                },
                "Date": "on March 3, 2014",
                "Helpfulness": 0.5,
                "StarRating": "1",
                "Text": "This solution manual contains the answers to the odd questions along with a little bit of summary of the points of the chapters. My biggest complaint is that the explanations of the solutions can be more obtuse than the same information in the chapter.  I believe that a good solution manual will actually explain the steps in a clear way, using the specifics of the question. Instead, steps are skipped or the author assumes the reader already knows things. If the student could understand this manual, he or she wouldn't need this manual."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYFHIY7GCD8MR"
                },
                "Date": "on June 3, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "This book helped me through gen chem. Let me be clear when I'm saying this, without this book, you'll fail gen chem. It is really nice, very detailed, and take you step-by-step to solve problems. For those students out there, you are paying +$1k for tuition, so don't be cheap when it comes to $20-30 extremely helpful book. In fact, take it as general advice. Whenver you are taking science course, go on amazon and look for solution book and buy it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VKR7E1I4S421"
                },
                "Date": "on May 3, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Awesome book, definitely met my expectations and it is so helpful as well."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BPIVL1XUU62N"
                },
                "Date": "on May 20, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "very helpful! i hate chemistry and this book helped me out >!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MG3OCJ9TMPN"
                },
                "Date": "on May 28, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Thank you!  Book was in great condition!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3N6N3BOE3FX7F"
                },
                "Date": "on February 19, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Good book in good condition."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Student-Solutions-Manual-Chemistry-Molecular/product-reviews/0321813642/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "15"
    },
    "Salesrank": "#46,746",
    "Timestamp": "2015-05-24 15:14:06.422377",
    "itemurl": "http://www.amazon.com/Student-Solutions-Manual-Chemistry-Molecular/dp/0321813642"
}
