{
    "Category": "in Books (",
    "ListPrice": "$16.95",
    "Name": [
        "The Lightness of Being: Mass, Ether, and the Unification of Forces"
    ],
    "OfferPrice": "$14.79",
    "Reviews": {
        "AverageStarRating": "4.2 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1STS42CMFPN6Q"
                },
                "Date": "on August 24, 2008",
                "Helpfulness": 0.9819819819819819,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADXCXX15KNZC9"
                },
                "Date": "on October 1, 2008",
                "Helpfulness": 0.9743589743589743,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29LZBZTS1MNRG"
                },
                "Date": "on September 19, 2008",
                "Helpfulness": 0.9545454545454546,
                "StarRating": "5",
                "Text": "I am not a physicist but I have been fascinated by cosmology, general relativity, quantum mechanics, string theory, multi-dimensional theories, black holes, grand unified theory (GUT), etc. since my college days in the mid-to-late seventies. I have read many books on these topics and many are very difficult reads given that I am not grounded in the advanced mathematical models and approaches that underpin the theories. Having said that, this book is a very easy read for the layman (as easy as a book on this topic can be) and is written in a highly entertaining way. Frank Wilczek has a wonderful sense of humor. I find that I don't have to read any sentence twice to understand the concept. I get it the first time around. It takes true brilliance to convey very complicated concepts simply and with great clarity. I sat down and read this book from cover to cover without putting it down. It covers the evolution of thinking on matter and space from the earliest thinking to today's speculation and theories. The concept of space as a dynamic grid is fascinating. Dr. Wilczek even includes a glossary of terms in the back of the book in case you don't understand the meaning of a particular word or phrase. I highly recommend this book to people who want to keep abreast of the latest thinking on this area of physics. It is an informative and engaging read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYI7566VPC77G"
                },
                "Date": "on October 7, 2008",
                "Helpfulness": 0.9411764705882353,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IS9FVR9WG5TY"
                },
                "Date": "on January 8, 2010",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36K2N527TXXJN"
                },
                "Date": "on June 7, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "One of the most important scientific stories of 2008 has been the calculation of the heavy particle masses (\"hadrons\") using some of the most elaborate computational methods yet. This has been yet another vindication of Quantum Chromodynamics (QCD), a strange theory that governs the interactions of particles that make up atomic nuclei. This theory is a cousin of electromagnetism, and like the theory of electromagnetism it is deceptively easy to formulate (at least with the aid of some higher mathematics), but the real-world predictions have been devilishly hard to extract. One of the earliest people to show that QCD does in fact correspond to physical reality was Frank Wilczek, who remarkably did this important work while still in his early twenties. Since then he has gone onto an illustrious career in theoretical Physics that culminated in his winning a Noble Prize for his work. To people in the Physics community he has been known for many years for his lucid expository articles, and we are all fortunate that he has written a book about some of the topics that he is the foremost authority on. The basic premise of this book, as suggested by the title itself, is that most of the stuff that we are surrounded with is in fact trapped energy. Wilckek turns the famous Einstein's equation E =m c^2 around, and in the form m = E/c^2 shows the rationale for why we can have mass as a form of energy. His writing is clear and accessible, and the book is not burdened with the technical details. Even so, many places could potentially be obscure to people who are not familiar with the basic ideas of modern Physics. Overall, however, this is one enjoyable and interesting book and a worthwhile read for anyone who is interested in the latest developments in advanced Physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3W3EJKHGYC9VQ"
                },
                "Date": "on March 12, 2009",
                "Helpfulness": 0.7619047619047619,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYN67RAMW7GVQ"
                },
                "Date": "on November 13, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "The book reaches out to a wide audience: communicating with wit, skill, and remarkable truthfulness. In this it is better than any other popular account of fundamental physical reality that I know--bringing you into the mind of a top-level theorist, connecting you with how he thinks, what is actually known, what the questions are, what will be learned in the next few years. The book is intense, entertaining, extremely honest.  There is no BS. Bob Laughlin said it: the book is both fun, and *right*."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKN6JB2RDRUHH"
                },
                "Date": "on June 29, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AS8X46XLHIB8F"
                },
                "Date": "on October 23, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "According to the author, we have been thinking about the universe the wrong way around.  Rather than being the fundamental stuff of the universe, mass is actually just the accidental byproduct of various other forces generated by the material that the universe is made of, trying to come into equilibrium.  Rather than being mostly empty vacuum, the real essence of the universe is a kind of grid that is a superconductor-like, multi-layer fabric that somehow generates these interactions which, by complete happenstance, ultimately lead to us.  There are three points to note about this book:  (1) it is extremely well-written and every sentence as well as every chapter is short, simple, and easy to understand.  (2) the concept that it presents, of a universe consisting of an ether-like field, is much more intuitive and graspable than explanations we have received previously, and, as the author takes great pains to point out, does not depend on any of the non-intuitive (and non-provable) string theory cults.  (3) The author states several times that he is completely and absolutely sure of his theory; but by the end, you will have no basis to decide whether this is truth or wishful thinking.  Nevertheless, READ IT, and expand your possibilities."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1F1NEYH7ZK0YA"
                },
                "Date": "on February 22, 2011",
                "Helpfulness": 0.8,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FPHXI8HWK3WX"
                },
                "Date": "on January 18, 2009",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3Q04XXGGED746"
                },
                "Date": "on August 4, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22BXN4D3UG7GM"
                },
                "Date": "on October 30, 2008",
                "Helpfulness": 0.7777777777777778,
                "StarRating": "4",
                "Text": "The author is a very brilliant person.  This book is not light reading.  On the other hand, the subject matter is quite complex.  For physicists, the book is a five plus.  I am glad that I labored through it, although at times, I was tempted to put it aside.  It took a lot of work and concentration to read it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25ZLA0XAI72VV"
                },
                "Date": "on June 11, 2011",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16GAIJJE39T1S"
                },
                "Date": "on December 2, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JXRXYVSUAW6I"
                },
                "Date": "on January 5, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1D9Z20TCUH6ZX"
                },
                "Date": "on February 26, 2009",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AB5OR4A1ER2X1"
                },
                "Date": "on October 4, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35DF2RHGYZIOG"
                },
                "Date": "on April 14, 2010",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TFUF3NGS7G3I"
                },
                "Date": "on April 20, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3F52SVA9D8F7F"
                },
                "Date": "on December 31, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "This started off as a very interesting book, looking to explain how outer space, commonly thought of as empty, is really full of... something.  He also works toward unifying the fields of physics that deal with the large and the very small - quantum physics, strong forces, weak, electromagnetic and gravity, subatomic particles, etc.  I was able to keep up for the first half of the book but fell behind in the second half and fear I'm just going to give up 60% of the way through.  It's not a bad book and it's well written, but just too advanced for my 64 year old brain.  I recommend looking at the previews and giving it a try if you feel up to it.  I did, but just couldn't hack the deeper parts."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KFCCRRXEB5KY"
                },
                "Date": "on October 11, 2009",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5JPWW31JFWCE"
                },
                "Date": "on December 2, 2008",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "This is the clearest explanation of multitudes of basic theoretical elements for NON-experts in physics that I've ever read! And while he openly admits to no great desire to integrate science with art and/or an abstract (non-personified) form of religion, I sense a couple of starter-possibilities someone else might use in trying that. Already I've gone on to his earlier book -- Longing for the Harmonies -- to search for more clarity on several relevant ideas. Right now, Wilczek is right up there near Henry Stapp on my ranking of best-tentative-directions-in-grasping a multiverse that MAY have started with MIND versus MATTER but so far we really don't know which."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YODGVALKHN1H"
                },
                "Date": "on May 29, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "The  author  uses  every-day  language  to  explain  a  difficult  subject.  I  get  the  sense  he  is  talking  directly  to  me  as  he  writes.  Also  enjoy  his  sense  of  humor.  Believable,  non-stuffy  scientific  stuff.This  is  a  very  difficult  topic.  It  does  require quite some  effort  to  read  and  understand.  If  you  seriously  want  to  understand  cutting-edge  physics  and  quantom  (mechanics)  thinking,  this  book  is  for you."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1M0W7S3OJ3IA7"
                },
                "Date": "on February 18, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38LU4WLVMD3YY"
                },
                "Date": "on May 14, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I heard Dr. Wilczek speak at UC Davis, which is why I bought the book.  It is an amazing read and gives readers some story behind many of the discoveries into particle and theoretical physics.  Very readable, despite being dense with facts and theory, because he is writing in a way that tells a story, or many stories, of discovery."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANPQT1Q9K3CB6"
                },
                "Date": "on May 4, 2015",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23HBDA7NES0FF"
                },
                "Date": "on January 6, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3M33IG79VYYO1"
                },
                "Date": "on December 9, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYWIZP3XOMVPV"
                },
                "Date": "on August 27, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Deep and profound, not watered down too much, assumes knowledgeable readers, yet fully accessible to non-physicists (although some non-specialist knowledge of both relativity and QM is assumed). Highly recommended."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1P5BGXPMOCVL8"
                },
                "Date": "on February 23, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGHBZR0O439FG"
                },
                "Date": "on March 28, 2009",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "3",
                "Text": "I am a keen fan of popular science - having A levels in maths and physics and a degree in maths and economics I would hope Im up to reading most popular science books. This book started off so well, funny, easy to read, difficult concepts well explained and laid out. However, part way through, once it starts to try and explain quantum chromo dynamics etc I was lost. I kind of understood things but my general level of understanding was not up to the job. I believe the author did his level best to \"dumb down\" the issues but I suspect there is only so much dumbing down that can be done! It was a good read but above my head - shame - Ill have to buy another book and try and grasp the concepts through further reading."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AESQR2AD27BR4"
                },
                "Date": "on August 23, 2010",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11PN8AO3UDPTH"
                },
                "Date": "on October 18, 2009",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9E3D3VRK05TW"
                },
                "Date": "on September 28, 2008",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "I loved the book! First because of the topic, in which I'm very interested. I learned a LOT and feel I now have a good general understanding of the current state of particle physics. I liked Wilczek's explanation of the origin of mass and appreciated his theory about why, from the quantum perspective, gravity appears to be such a weak force. Most of all I liked his style: very readable with a truly light manner that remained completely serious about the subject matter itself. I laughed at the humorous asides. Highly recommended."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FZA04N27DQX7"
                },
                "Date": "on October 10, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Very interesting book. This book is for those interested in scientific things especially concerning particles. He goes into the fact that gravity is so feeble. He stresses the standard model QCD and QED. He explains how space is not empty but contains The Grid. He explains Quarks and Gluons. Other subjects covered are chromodynamics, electrodynamics, the origin of mass, feebleness of gravity, and is beauty truth. Are axions, dark matteer? Don't worry about lots of formulas to consider. This book is written in plain english for those interested in the subject."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PATZHWCR44BG"
                },
                "Date": "on June 25, 2009",
                "Helpfulness": 0.6521739130434783,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26OHTF5XRPUV3"
                },
                "Date": "on January 30, 2010",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great book recommended to me by Prof. Mark Whittle, professor of astrophysics at the University of Virginia. I am a Teaching Company student of his DVD course. The book covers much of the same material he does in his course but explains it somewhat different. Apparently much of this material is rather difficult to explain. Two explanations of the same thing helps me to understand some rather counter intuitive events. A good companion to \"The History of Time.\""
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3X3DKVGPCPOQ"
                },
                "Date": "on January 30, 2009",
                "Helpfulness": 0.6470588235294118,
                "StarRating": "2",
                "Text": "I'm no physicist but I consider myself to be fairly intelligent and have always been interested in physics, astronomy, and science in general. The book starts off very fun and easy to understand but quickly becomes very confusing and hard to read. By the time the author starts talking about quarks, gluons, partons, and virtual photons I found myself having to re-read over and over again to understand. I'm currently in chapter 7 and not sure if I should keep on reading because I have lost a lot of interest since I just don't get what he's talking about with Quantum Chromo Dynamics and \"Asymptotic Freedom.\" I'm sure some Einstein wannabes are just going to say that I'm retarded or something but this is a bit too much for me. Too bad because I really wanted to understand more about what \"IT\" is. Buy the book and read it only if you are a Physics professor or something like that."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MK8B44KHH4W3"
                },
                "Date": "on September 16, 2013",
                "Helpfulness": 0.6,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A98JL43WI26US"
                },
                "Date": "on December 3, 2009",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Right now i am just getting into physics and this book kept me interested the entire time. Even though some parts are a little mathmatical, it didn't take away from the overall story. I'd say this is a very good read for someone thats interested in getting a alternative perspective on how you think of space and the demension we live in. 5 Stars hands down."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A159HQO8RG1YT1"
                },
                "Date": "on June 26, 2014",
                "Helpfulness": "",
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DSOIE802W7K1"
                },
                "Date": "on January 12, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Dr. Wilczek's highly readable book presents an honest view of what we do, and do not, know about the frontiers of physics, including particle physics, the unification of forces, and gravity. Written prior to the discovery of the Higgs particle at the LHC, it provides an understanding of the Higgs mechanism and the origin of mass more generally, and an introduction into the concept of supersymmetry. It also touches on dark matter and dark gravity. (In fact, one of the prime candidates for dark matter, the axion, was postulated and named by Nobel Laureate Wilczek). There are no equations, but concepts are introduced with simple and creative diagrams."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27C53DD0FBT4N"
                },
                "Date": "on February 23, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Shows some pictures of math equations to illustrate their brevity in contrast to their power. Good for the intuitive feeling it spins for explanations. While probably aimed at non technical readers, might be more useful in the overview it provides for the technical. Especially good in de-bunking the popular interpretation of the Higgs, even though the Higgs is treated as almost as an afterthought. Outstanding at placing the unification SUSY in relation to the earlier models, and showing the relationship between classical EM theory, QED, QCD, the standard model, etc. Also, good glossary, although it's not much needed because of the explanations of terms as it goes along."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28HGPGSY6VADC"
                },
                "Date": "on April 5, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent book, well written, and very advanced thinking!...Light!, Light!, our ancestors called it \"light\" and not heavy, because light has no mass and is not subject to gravity- something must people even scientists can't figure out! Ties right in with John Keely and his magnetic theories."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1E2LT6FV241ZR"
                },
                "Date": "on January 18, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJRMVNFHK230W"
                },
                "Date": "on March 9, 2014",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16242HUD8A4MF"
                },
                "Date": "on April 29, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I have some background in math (not needed) and very little in physics, but I could understand the book well and enjoyed reading it.  The text cleared up some basic terminology and concepts in quantum theory nicely.  It has inspired me to work through some of the suggested reading"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYJLB099TLPZB"
                },
                "Date": "on December 26, 2010",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A very clear exposition of the major ideas of current physics.  Not an easy book, but it's a very complex subject.  It concentrates on concepts, with only occasional references to math, so it's good for the (smart) general reader."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KWQ743LXV6Y9"
                },
                "Date": "on January 14, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AV3MYC4WU1QU"
                },
                "Date": "on August 25, 2009",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "First time I read the book it was mind numbing, the second time I am beginning to understand some of the cool ideas. I feel like I'm understanding reality a little more. No fear of looking for nature's secrets."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35DZ2MFPG9XFX"
                },
                "Date": "on November 2, 2010",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The best popular exposition of current thinking and reasearch in nuclear physice since Pais's SUBTLE IS THE LORD, which remains however the best piece of science writing extant."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33R3UDL2KN6WT"
                },
                "Date": "on June 8, 2013",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Dr. Wilczek has the perfect  talent for making the abstract concept perceivable. For years I have understood that the \"orbiting electron\" concept was now rather obsolete,  but  trying to find a good way to grasp the world of subatomic particles, dark matter, dark energy was very challenging as physicists tend to write for physicists. I would've likes to have become one but had other, louder callings in other directions. All the while I have  longed for a better understanding of how natural philosophers now look upon the model of the atom.... Well, this IS the book. It is a fun read and it is very clear.  I highly recommend it for anyone interested in this subject. High School teachers and college profs will find great ways to  present some of these  unusual concepts to their students.  I feel I can at least understand post-docs a bit when they banter about these things. Now, if I could just find a corresponding book for dif-e-q."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1M1JSMCCNDF1G"
                },
                "Date": "on March 9, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Quantum Physics theory written elegantly with great communication skills and in an understandable language. A joy to read for those of us who aren't trained physicists."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZSOM6W07LBNH"
                },
                "Date": "on January 29, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NEJL2B5QQB8M"
                },
                "Date": "on March 18, 2009",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "For a layman who has the desire to find out what is really happening in the world of the very large, and very small."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39UY374GHYPY6"
                },
                "Date": "on April 13, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I found the text readable and interesting.  I had trouble with the figures as they often were not near the text that referred to them."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2A8XPLUKCCFA0"
                },
                "Date": "on April 30, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great book for wannabe physicists. Frank explains things in relatively easy terms, and is also pretty funny."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APXCTX4JPFE0Q"
                },
                "Date": "on December 28, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "written with wit and charm, wonderful explanations of what is going on around us that we never see."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22DVRK7Q233X5"
                },
                "Date": "on June 4, 2009",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2822NIMBESV3G"
                },
                "Date": "on September 11, 2010",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": "Modern science is dominated by the dogma of mathematics. Math should be used as a tool and not set on a pedestal as the basis of all reality. This book helps one see that science needs to take a new direction."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5WMBIOGE8Q6N"
                },
                "Date": "on January 1, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2A7XY78RAM5H5"
                },
                "Date": "on September 9, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2A7J4DW71PA0M"
                },
                "Date": "on April 5, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "a must read"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YHZ6CFCFQBIW"
                },
                "Date": "on November 10, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "An enjoyable and enlighting read. Frank Wilczek presents a complicated subject in a clear and understandable logic relating back to Maxwell."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13UGPZRLK3WRW"
                },
                "Date": "on March 19, 2009",
                "Helpfulness": 0.4,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJ2553MFBCZ6K"
                },
                "Date": "on October 25, 2008",
                "Helpfulness": 0.4,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OLSFTS7ZVHYB"
                },
                "Date": "on June 20, 2009",
                "Helpfulness": 0.47619047619047616,
                "StarRating": "1",
                "Text": "I am not sure if I should review this book because I am not among the intended audience.  This book is very much dumbed down for a general audience.  Readers who have no training in elementary particle physics might get something out of it, but for me it was a complete waste of time.  The author kept promising \"more on that later\" but at the end I was very disappointed.  Also, the style seemed rather silly to me, with rambling analogies and weak attempts at humor."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AN5PF6CPB50AD"
                },
                "Date": "on June 15, 2011",
                "Helpfulness": 0.25,
                "StarRating": "2",
                "Text": "I'm embarrassed to have fallen for the trick of buying a book just because it was written by a Nobelist, if indeed it wasn't written by a hired ghost (no pun intended, Fadeev and Popov).  It is as though Frank Wilczek emitted a long, sublime fart, and thought it might have a run on the market---as indeed it has. Bottom line: if you like science books for the laity, consider skipping this one; its prose is bland, and it probably won't tell you anything you don't already know. Now where did I put that book-annihilation operator..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15OELODF9ZOUZ"
                },
                "Date": "on December 30, 2009",
                "Helpfulness": 0.11764705882352941,
                "StarRating": "2",
                "Text": "This concept is popular nonsense; a charming scientific circus. Einstein, Irwin Schroedinger and Milo Wolff disagree that discreet particles exist. i.e QCD and quantum-duality are both wrong but useful if you want to publish popular papers and keep your $$$ research contract."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A294CIZ43VNQDW"
                },
                "Date": "on September 19, 2008",
                "Helpfulness": 0.2413793103448276,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LFYYZZD1RNH"
                },
                "Date": "on October 10, 2008",
                "Helpfulness": 0.06896551724137931,
                "StarRating": "3",
                "Text": null
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Lightness-Being-Ether-Unification-Forces/product-reviews/0465018955/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "73"
    },
    "Salesrank": "#343,790",
    "Timestamp": "2015-05-24 13:42:35.911379",
    "itemurl": "http://www.amazon.com/Lightness-Being-Ether-Unification-Forces/dp/0465018955"
}
