{
    "Category": "in Books (",
    "ListPrice": "$14.95",
    "Name": [
        "Alien Honor (A Fenris Novel)"
    ],
    "OfferPrice": "$10.99",
    "Reviews": {
        "AverageStarRating": "3.9 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IVXFTA1R0UVZ"
                },
                "Date": "on December 26, 2013",
                "Helpfulness": 0.8837209302325582,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KPJ1MOGTZVGC"
                },
                "Date": "on December 18, 2013",
                "Helpfulness": 0.90625,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SQW65A3VZ1RA"
                },
                "Date": "on December 12, 2013",
                "Helpfulness": 0.8444444444444444,
                "StarRating": "3",
                "Text": "Although the e-book was great entertainment up to the point where it stopped, I felt like I was left hanging  with missing chapters.  The book should never have been written w/o at least having a followup book that connected the two characters Klane (the seeker) and  Cyrus.  It was as if the author decided to quit right in the middle of  writing his book.  What a disappointment.  I paid for half a book!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AATKF0HDBQL86"
                },
                "Date": "on January 28, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "When I first got Alien Honor by Vaughn Heppner, I was sort of expecting another novel in the vein of Orson Scott Card's Ender novels, and while this one does contain some elements that are similar in tone, I am happy to say that this is a brilliant story that is perfectly capable of standing on its own two feet.  The tale of Cyrus and the other \"Specials\", each with his or her own tele-ability who can rip holes in space and bring their ship closer to its intended destination, is one that had me on the edge of my seat the entire time, and while I was kind of disappointed that the ending left me hanging, I'm definitely awaiting the next book in this series."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UH2UTQOXN1BG"
                },
                "Date": "on December 18, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Fans of Heppner's good solid work will find more of the same, which is fine, set in the Doom Star universe for those familiar with that. The plot is straightforward and gritty in his usual style, with the main character a tough kid from the gutter serving with the Space Marines and sent away to a faraway \"new Earth\" planet. The first part of the book takes place aboard the ship, and revolves around the things that go wrong there, which I found a bit slow, but entertaining enough. The book really takes off in the second part, when the ship arrives in the alien system, to find things much different from what everyone expects - including the reader. The second part of the book totally blew me away and was lots and lots of fun in the classic pulp mold - multiple menacing alien races, crazy technology, and the plot suddenly speeds up a lot and rushes to the end. So, if I was to make a recommendation, I'd say, view the first part as a setup to the second part, and I hope Heppner keeps on writing like the second book rather than the first."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PD27UKAD3Q00"
                },
                "Date": "on April 27, 2014",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHUT55E980RDR"
                },
                "Date": "on February 3, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Yes, the space opera genre is still alive and well.  It seemed to me that the science fiction genre was getting helplessly stuck into the dystopian and apocalyptic ruts, but Alien Honor promises a refreshing respite.  Hopefully, the subsequent offerings will live up to this one,"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GXR6CHHPX0JS"
                },
                "Date": "on April 8, 2014",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "This book just takes too long to get rolling.  As I recall I was at least a third of the way through the book before I really even started to get interested in it.  For me, it's amazing that I even continued reading it that long. Usually if a book did not grab my attention by the end of the second chapter at worst I would simply put the book aside, not finish reading it and not buy any more books by that particular author.  In this case, though, I broke my own rule and continued reading until it finally started to get interesting enough to finish the book.  The author introduces a number of key characters to the story, but ends with only one key character without actually telling the reader happened to the rest of them.  We know they've been captured by the alien race known as the Kresh, but Heppner doesn't really tell you anything about them beyond that.  The one character that he does end the book with still leaves you hanging because the book ends in a cliff hangar so that you have to buy the next book to find out what happens to him.  I will NOT be buying the sequel.  I don't want to have to wade through another boring book just to find out what happens to ONE character from the previous story just to find that the sequel doesn't have a definite conclusion either."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AX0ZTNX6KVJ40"
                },
                "Date": "on December 28, 2013",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IWVJN00EADL7"
                },
                "Date": "on November 14, 2014",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34VRVI4CSI5RQ"
                },
                "Date": "on March 11, 2014",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2W2XTPHAQ4416"
                },
                "Date": "on August 23, 2014",
                "Helpfulness": 1.0,
                "StarRating": "1",
                "Text": "I read 2 to 5 books a week.  I can count the number of books that were so incredibly bad I just couldn't finish them on one hand.  This book is one such book.  I just could not bare to read the phrase \"just like sparticus\" even one more time."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUDSM2CTLLW1Q"
                },
                "Date": "on March 26, 2014",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZH5ULI4SBO48"
                },
                "Date": "on March 15, 2014",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AJ98QQPRU7WC"
                },
                "Date": "on December 19, 2013",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": "I was hoping for a follow up on the Doom Star series and I was not disappointed. My only regret is reading it too fast! I could not put it down! Now I have to wait for the sequel! Great job and I'm looking forward to a long series!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1T90O1KTDQSY8"
                },
                "Date": "on November 29, 2013",
                "Helpfulness": 0.7272727272727273,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TISM7NVNKPDQ"
                },
                "Date": "on February 7, 2014",
                "Helpfulness": 0.8,
                "StarRating": "3",
                "Text": "I hate cliff hangers. They should carry a warning on the cover.  INCOMPLETE. STORY. The Story line was interesting and the characters were some what 1 dimensional but I would have enjoyed if it was a complete story"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CMJTWJGJFFLG"
                },
                "Date": "on October 27, 2014",
                "Helpfulness": 1.0,
                "StarRating": "1",
                "Text": "Poorly done, I had to come back to this ebook many different times as I couldn't keep any real interest in it. Sorry I bought this one. I won't be buying the series."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8KM4YOB8FGGH"
                },
                "Date": "on April 17, 2014",
                "Helpfulness": 0.75,
                "StarRating": "2",
                "Text": "I really love the idea of this story....the plot is unique and creative.  I selected this book because it was the first in a new series, but now as I read some of the other reviews that people have left, I see that this \"new series\" picks up where the author's old series left off. So, knowing that, I feel like I am missing some backstory here. Whether I am or not still remains to be seen, as I have no way of knowing if I have the whole story or not, so I have to write my review based on what is in this book alone.  The idea of this story is very creative, the characters are interesting but not quite as fleshed out as I'd like them to be.  And the ending..... The story completely lacks one. I don't mind books that end by leaving room for a sequel, at least they end. This book stops abruptly with a cliff hanger and just leaves the reader dangling there, holding on to the literary cliff for dear life. I didn't appreciate this and, as a result, probably will not bother with the next book in the series because I can only assume the second book will end just as abruptly in an effort to get the reader to purchase the third book. When an author is more concerned with book sales than entertaining the readers who give him these book sales, that's when I walk away."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3G007LQX6KGOD"
                },
                "Date": "on January 28, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This was a really fun and enjoyable book to read. Alien Honor is one of those stories that is hard to put down once you pick it up. The pace is consistently good, there aren't really any lulls in the story. The characters are full of life and are interesting to follow. One of the great things about this book is it stands on it's own two feet without the need for tons of page filling back stories and other things that cause some stories to jump around too much and be annoying. The writing style the author uses is great for those readers who are easily distracted, because the wording sticks with the reader and doesn't feel like it's struggling to get a point across. One of the more fun sci-fi books I've read in a while for sure."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2X2WTEVCZ5L8N"
                },
                "Date": "on March 24, 2014",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15FSBJ2CALIX1"
                },
                "Date": "on January 28, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I love hard science fiction but had never heard of this author.  I got the book with hopes of a great story and was not disappointed.  Earth and the solar system is in need of expansion room, so a ship is sent to a planet over 200 light years away.  They get there by means of people with telekinitic powers who can rip space and thus bypass the speed of light.  What they find when they get there is a real surprise.  I am not going to spoil that.  But this is obvious the first book in a new series.  I look forward to the future books in the series.  Plus plan to read the books by the same author set 100 years before this book soon."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1APNR15UXR4JT"
                },
                "Date": "on March 29, 2015",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "I suspect most SciFi enthusiasts will find something of interest for them in this first book of a new series. It held my attention strongly enough to order the next two books in the series. The plot, action and characters are reasonably well developed. My only personal criticism is that the established \"time frame\" references that take place in the story are too short for the kind of rapid evolution/cloning of species which is described ... even considering the potential for \"faster than light\" (instantaneous) travel portal speeds and allowing for the many flaws in modern Darwinist Theory."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WG33SBOT901X"
                },
                "Date": "on December 3, 2013",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12UADHB0QU9ES"
                },
                "Date": "on February 5, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Realistically protrays humans and aliens as different individuals with different self-interests - some good, some bad.  A fitting follow on to the Doom Star series - looking forward to the next book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DFFM8EZALLRX"
                },
                "Date": "on January 31, 2014",
                "Helpfulness": 0.75,
                "StarRating": "4",
                "Text": "I enjoyed the book, but like other readers who left comments, was very disappointed to be left hanging half way through the story.  I don't mind books written in a series, but I want to read them back-to-back.  The fact that it's the first book in a series should be made clear when purchasing the book.  If I had known, I would not have bought the 1st book until the series was complete. Unhappy and left hanging..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A392K5D3UEJ2RP"
                },
                "Date": "on December 21, 2013",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "If you liked his other books you'll certainly like this one too. Another late night not being able to put it down. Chopping at the bit for the sequel."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JH1L2JTX27EX"
                },
                "Date": "on December 13, 2013",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "Wow I hope there is a continuation of this story.  It is just awesome.  I love sci-fi and this book rocks. I can't even give you a hint what it's about or I'd ruin it for you."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APBDZ88BBTN4F"
                },
                "Date": "on February 6, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BJ81NT43LKSM"
                },
                "Date": "on January 22, 2014",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VQBEW0G4IH1J"
                },
                "Date": "on February 23, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32VCG8IU45MM7"
                },
                "Date": "on April 21, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "After the character introduction the story quite staging and really got some meat to it! The author has a very unique way of telling a story and keeps you hooked to the end. I can't wait for the next chapter!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AN81JUYW2SL24"
                },
                "Date": "on March 14, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TSTJP0B3A3H5"
                },
                "Date": "on May 7, 2014",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A63YV1OSVFIYE"
                },
                "Date": "on January 6, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2I98OOPNIJNYY"
                },
                "Date": "on January 13, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "There are five or six earlier books in the Doom Star series that if read before Alien Honor provides a lot of background and details that I understand will give this book a richer read.  Much like the first three books by Thomas Stone's \"The Harry Irons Trilogy\" is needed background to understand his later book \"Jennings' Folly\".  You would not have an understanding of for example who the \"kitzloc\" are and how they relate to the reading of Jennings.  Moreover a first read of \"The Silmarillion\" by J. R. T. Tolkien really makes the \"Lord of the Rings\" make a lot more sense.  Not that this book is not well constructed and interesting, but you tend to struggle to understand the meaning of things.  I tend to like to not wrestle with books I read.  I prefer to read something fast and not have to chew on details.  So on this point alone I would not discourage putting this in your collection.  However I would first read the Doom Star series.  I have not finished this book for reasons I have discussed and have put it down to do just that.  Can't wait to get back to it.  Just a suggestion."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2E8ENKFLWGEU7"
                },
                "Date": "on December 5, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Set several hundred years after the events of the \"Doom Star\" series, the politics, technologies and characterizations flow smoothly from those stories.  Reading of the previous series is not, however, a requisite to enjoying this book.  Starting out with separate hero-figures, their disparate origins and story-lines destined to eventually dovetail, the contrast in their stories keeps the narrative feeling new throughout.  The heroes, however, suffer from one flaw that seems to be a constant with Heppner's heroes; a recurrent and often unreasonable level of self-doubt and second-guessing of their own beliefs and values.  While a humanizing element in most stories, in these it is sometimes carried out to the point of being tedious, sometime making me feel like yelling at the book as I might at the teenagers in a horror movie who think it's a good idea to split up when being pursued by a serial killer.  The story-line is in itself fortunately engrossing enough to enable me to bide my time through these passages, and captivating enough to force me to proceed to the next in the series, \"Alien Shores.\""
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXKU364U6ALK3"
                },
                "Date": "on December 14, 2013",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQY5XBYSENNZQ"
                },
                "Date": "on March 31, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BA72K4VK1UN1"
                },
                "Date": "on February 20, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A391VTDTFIM6X3"
                },
                "Date": "on January 1, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UJDZHK6VYE95"
                },
                "Date": "on September 23, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Rather than repeat what has been said in other reviews, I'll just offer my opinion and that is that I liked the plot line.  I enjoy stories involving enhanced mental abilities or, as Heppner calls them, \"Specials\".  This series certainly has that.  Unlike many other Sci-Fi novels that pit the human race against an alien race, Heppner presents us with multiple alien races, including one \"descended\" from humanity. The end of the book does provide a set up for the next book. I did enjoy reading the book and, after finishing it, I looked forward to the next one in the series.  I have now  read the next book, Alien Shores, and that does color my review of  Alien Honor.  And, once again, am looking forward to the next one in the series."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18Q929WCBG1IC"
                },
                "Date": "on August 23, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PE3V5NBJUQAN"
                },
                "Date": "on September 12, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Alien Honor is the first book in the Fenris story, a journey of humanity from Sol to the Fenris system 230 light years from earth.  It reminded me very much of Andre Norton's Time Traders series which I recently reread and enjoyed again.  The heroes of this story are the telepaths who can move their faster than light ship in jumps of several light years at a time making the journey feasible.  Unfortunately the Fenris system is already populated by some bad aliens and thus the saga unwinds.  All in all this is a well written story with a sensible plot.  Book one was good enough that I gobbled up book 2.  Unfortunately there is as yet no book 3 to tell me what happens next.  I can't wait!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32ZRT70JDEVIB"
                },
                "Date": "on March 23, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1A5HOL8QL0OLN"
                },
                "Date": "on February 13, 2015",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "For the most part I was kept interested in reading. There were no sections that I skipped over out of boredom. The concept used for FTL is a interesting concept and is the backbone of the story. A bit loose in scientific reality, but it is science fiction after all. The ending however, just sucked. Almost dropped you mid sentence. I realize that the author was trying to set you up for a sequel. For me what he did was the opposite. I don't want to buy any more that leaves me like that. He needed to go just a little further to make me want to go further. I read this on flights from ATL TO CDG TO DEL."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17SAYFC2XP2DP"
                },
                "Date": "on March 27, 2015",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "As the first book in a series, there is always the tendency to flesh out one main character and leave some of the others less developed and artificial. The main protagonist \"hero\" Cygnus is very well developed, while the introduction of a future main character Klane is sporadic and certainly underexplained, probably because his backstory will be developed bette in Book 2 of the series. All in all (cliche, I know) it was entertaining and a good read for a Sci-Fi book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KCFBD77JE2FY"
                },
                "Date": "on March 4, 2015",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "When a colonization mission is discovered to be a trap its up to a lone psychic to light the flames of rebellion. The problem I had was how plodding the set up seemed in the book. You only find out at the end how the two points of view are connected and it didn't seem worth the wait. I've enjoyed other series by this author but I'm not sure about this one."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ULD92P0W49XB"
                },
                "Date": "on July 15, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "One of the better sci-fi books I've read in years. And the level of writing is a giant step above the self-published books currently making the rounds.  There are a few illogical points in the book, however, they aren't enough to spoil a great beginning to a series.  The author did a great job of creating a fictional world."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A301TJ5K8L4TI8"
                },
                "Date": "on July 11, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Intriguing.  Kept my attention.  Enjoyed the numerous story lines or plot shifts.  Hope the series continues and expands."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GUANTGTLQXMD"
                },
                "Date": "on July 10, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Good read, Ready for the next in series."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZIHQ7NY0ZXJD"
                },
                "Date": "on July 7, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AU1VKPFFTJ39C"
                },
                "Date": "on April 14, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great beginning to a new chapter.  The storyline has a lot of potential avenues it can take.  Looking forward seeing where it leads and sharing in the adventure."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABGC99CLA3UZ0"
                },
                "Date": "on April 7, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Just when the story was getting really good, I have to wait for the next book.  If you're looking for Psionic combat, seat of your pants action scenes, alien worlds, genetically mutated humans, talking dinosaurs, and complex space battles, this is your author.  Read the Doom Star series first for a good primer on advanced space combat, and a little back story on the future of mankind.  If you gobble up Sci-fi like I do, your shelves aren't complete without Vaughn Heppner."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A222CK2MCABWNF"
                },
                "Date": "on March 28, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Fantastic  Just like Doomstar and Invasion I hope Alien Honor also becomes a series.I also enjoyed hearing of cyborgs and highborn again.  Maybe more?"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I94ZZU7FFRIT"
                },
                "Date": "on March 7, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Had a lot of fun reading this and would like to see the second half published. Looking forward to it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2B3EHOOEGT406"
                },
                "Date": "on March 6, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "The kind of story you really want to keep on reading .. I'm really hoping there is a continuation .. I hate leaving characters stranded!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31G4YVTEL4TFG"
                },
                "Date": "on February 28, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Very exciting, only thing I didn't like was the ending, the next book in the series isn't out yet. Can't wait."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EFIN8VE69967"
                },
                "Date": "on February 23, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I have enjoyed reading it. I am not sure if the story continues, but if it does I plan on reading it. If for no other reason than to find out more."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3T3UAYS2WHH22"
                },
                "Date": "on February 21, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "If you like aliens, this book is for you. Vaughn Heppner really brings the characters to life in this one!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31WJ33PRW24SD"
                },
                "Date": "on February 20, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "The book was great, but I think more could have been elaborated on. Perhaps Vaughn is leaving that for other books. Regardless, I wanted more."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CJJQV64MG3TO"
                },
                "Date": "on February 19, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "The book was delightful, but I wanted to liven it up a bit, so I bought the professional narration. Oh my gosh. It gets so intense and in depth I couldn't put it down. Love the book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39T1ZDP5O90OK"
                },
                "Date": "on February 15, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "The four stars are given for the ease of reading. I found this book quite unputdownable and cannot wait for the following instalment"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JSJ174T90LSN"
                },
                "Date": "on February 9, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Cyrus is a gang member in underground Milan.  \"Rescued\"  from an attack , he is trained in his psy powers.  Sent light years from earth on a colonizing ship , they arrive at Fenris system and find the supposedly uninhabited system in the middle of a war."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DHN98L5GEMO9"
                },
                "Date": "on February 8, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "If you are looking for a blend of aliens and humans fighting the yoke of tyranny, I recommend picking up this book. There is a good storyline and a good development of the characters. The science portion is less. I am looking forward to the next book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWZ2Z7J4I9WMV"
                },
                "Date": "on February 8, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I liked the author's thinking on the big picture stuff. A few technical things bothered me,but overall the story held me the entire time."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIS8QFP47QMY"
                },
                "Date": "on January 28, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BKZ0VBIM0USM"
                },
                "Date": "on January 23, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Since this was  a spin off of the Doom Star series I was expecting the same type of story with different characters but boy was I wrong!!!!...this book is IMHO 10 times better than the previous books, for one I liked the story better, we have more races involved, new abilities, different humans, telepaths, basically the whole enchilada for a classic military science fiction...I totally recommend this book..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVSMATTODD8BQ"
                },
                "Date": "on January 15, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I enjoyed this book tremendously.  It was difficult to put down.  Characters are likable and have interesting traits which develop into possible future story lines. I'd like to read a little more about both sexes in future plots however since it takes both to create a more believable environment."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3F1Z4TVCRSOLP"
                },
                "Date": "on January 12, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I like other Heppner books and this was no different.  It seems like a good lead in for another series.  It will interesting to see where he takes it from here.  I look forward to the next book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JOX5JNGMNMEX"
                },
                "Date": "on January 10, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I enjoyed this book  very much . It was not slow or boring at all .  I recomend to any sci fi reader's"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NFPI8SRLZ4PR"
                },
                "Date": "on January 6, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Don't usually read SciFi, but was pleasantly surprised. Good, Fast paced story line, however the ending sets you up for a sequel"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADJ86HRMLYD2S"
                },
                "Date": "on January 4, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I am Old School. I do not believe in \"Close Encounters\" \"Aliens are Nice\" themes. The Alens in this book are delightfully Old School, as they trck the Earthmen and force them into captivity. I would like to know more about Cyrus and what he can do to save Earth. I hope I have not seen the last of the Seeker or of Klane. I eagerly wish to know what happened to the Earth crew, though I fear for the worst. This is a delightful book in that nobody, even the aliens, knows what is going on!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11V441JV0FOKM"
                },
                "Date": "on January 3, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This appears to be a good start to another great series by the author. The story is only slightly connected to an earlier series and can be read as a standalone. Alien Honor ends somewhat poorly as it sets up the next book in the series but is aoverall a good read. Waiting for the rest of the series may be indicated."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZM3UYES7Z325"
                },
                "Date": "on December 30, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PNTHHDFAJY75"
                },
                "Date": "on December 23, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AF1DFC5Q8QJMB"
                },
                "Date": "on December 24, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "The different theme of the story was just enough to hold my interest.  It was a slow read and a little light on the action and heavy on talk.  Still all in all it interested me enough to buy the sequel book (I say buy but really got on Kindle unlimited - if I had to pay full purchase price I doubt that I would have done so)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3U1S5KR287T3I"
                },
                "Date": "on April 24, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I only occasionally read sci-fi/fantasy.  I'm glad I did in this book!  I was drawn in to the epic battles between humans and aliens, and the action is non-stop.  What can I say that won't give anything away?  This book involves all the best things about sci-fi, and you should definitely read it!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZCV0IX1PIT63"
                },
                "Date": "on May 23, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "An interesting way to bring us into a new universe. This is clearly a book one. Lays out the universe, the good, the bad, and the ugly. There is enough here as a story on its own for sure, but it felt a little like a prequel you might read before the real story."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABGVXZF7O2M2R"
                },
                "Date": "on January 5, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "An interesting and enjoyable book, I really like this start to a new series.  There are lots of plot twists and opportunities to expand the story.  I've already purchased the second book and am looking forward to starting on that as soon as I finish this review."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CJJ4TTWR1DZL"
                },
                "Date": "on March 29, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The reading of this story is done with ease.  Vaughn keeps you involved and does a remarkable job of character development.  You will have a hard time putting it down and will look forward to the next addition to the collection.  Vaughn tells a great story."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JKO4DGKW67Z0"
                },
                "Date": "on May 21, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "A well paced novel. I  would have wished to get more development of the main characters.Some of them play a big role but I think their personalities are too light . It  would have helped  for  the plot to get a more in-depth view of their past lives."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EUOMNGISDA3P"
                },
                "Date": "on January 11, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I liked the author's vision of a new way to travel faster than light. His future vision and characters surprised me. I liked both of the heroes he has created. I'm looking forward to the next book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HL507BAE750S"
                },
                "Date": "on September 13, 2014",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": "This was not Heppner's best work. The plot is disjointed, characters unbelievable at times and the plot only so-so. I've read a lot of the Author's works and enjoyed them. This one disappointed."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MKR2EQLZKI9K"
                },
                "Date": "on May 16, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This book doesn't travel in a straight line but zigs and zags. Just when you think you know where it's going it changes directions. That makes it interesting to read and you want to know more"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1V649MV9FZYLO"
                },
                "Date": "on July 27, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I liked the story very much. My only criticisms are minor, and nit picky at worst. Overall it kept my attention well, and had me wanting to dive back in to read more whenever I put it down."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATZ7GCCTCBRLJ"
                },
                "Date": "on September 14, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "The book has a reasonable premise, but moves through the middle two-thirds WAY too slowly. Then it ends in what would  appear to be mid paragraph.  Not recommended for young readers."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Y14087IRJT33"
                },
                "Date": "on February 20, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I read the book almost without interruption...a very good structure and balance between psi characters and space battles. I look forward to read the second book..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BMZY0A8NDXTE"
                },
                "Date": "on August 10, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UBKXIKIO2PU"
                },
                "Date": "on May 5, 2015",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUHXWGRYZGCGG"
                },
                "Date": "on March 21, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The book was an excellent follow up to the previous series. I am looking forward to the next installment. Looks like another winner for VH."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3V41CTZ5NS94X"
                },
                "Date": "on March 13, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Another well done story keeping everything in view with out losing the plot. Enjoyed the story line and characters. Another winner."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PIZKM6N4VCPY"
                },
                "Date": "on August 3, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Looking forward to sequel and then I will discover your other books. Thanks for great sci fi.  Fast paced and good character growth"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34HG5XJGXDSC4"
                },
                "Date": "on October 7, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Interesting book,  written as part one of I don't know how many. I'm definitely ready for the next one so the book must be good."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JQTVJX0XPOMQ"
                },
                "Date": "on May 12, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Great read looking forward to the sequel.  Liked the character Cyrus now add the girl. One more species who have ftl"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZN6G22CQTCTO"
                },
                "Date": "on May 22, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Kept me involved good action although it lost  me several times when it tried to be too technical I give it 5"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASG4QFX05U3JX"
                },
                "Date": "on April 10, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I enjoy this author and his books a lot.  If you like scifi and/or military fiction, you will like this."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TYICFSN9EQ9A"
                },
                "Date": "on April 11, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Another Heppner Classic in the making.  On book two and really enjoying his great narrative style."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZ3R0KD0KD0I0"
                },
                "Date": "on November 8, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "An interesting,new approach to a sci fi story, a fun read...I highly recommend it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAGZDHAMS9TFT"
                },
                "Date": "on October 9, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "Really a 3+, but not quite a 4. Pretty well written but predictable plot."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5TUM9BAO62MP"
                },
                "Date": "on September 17, 2014",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": "Wife's book which she didn't enjoy.  Told me she would not recommend it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QJZR3SHT1XZ3"
                },
                "Date": "on September 12, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Great story and well written.  I'm waiting for the next installment."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASAQS33VXWW4M"
                },
                "Date": "on October 24, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Vaughn Heppner is a great writer. I am never let down."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32MIYS7WB8825"
                },
                "Date": "on January 8, 2014",
                "Helpfulness": 0.6,
                "StarRating": "3",
                "Text": "space fantasy isn't usually my thing but this book was a pretty good one.  might be worth trying the next one in the series."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36PXYC07WSMIV"
                },
                "Date": "on October 19, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "Good read but the ending was a little weak."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AQOCH7NXWKHZ"
                },
                "Date": "on May 11, 2015",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APY79QUYJ9F8T"
                },
                "Date": "on April 11, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great book. Waiting for book three."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATTWTCYT7MPJT"
                },
                "Date": "on October 14, 2014",
                "Helpfulness": "",
                "StarRating": "1",
                "Text": "didn't know it was in two parts"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19QCWUPTEZZK5"
                },
                "Date": "on March 29, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Waiting for the last in series"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21FRV5OFXBATS"
                },
                "Date": "on April 11, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Good work, as always"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29KJDBN6GY1E7"
                },
                "Date": "on May 8, 2015",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": "Good intro book into a new series from a great Sifi author."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DYU12RYV1FG8"
                },
                "Date": "on April 6, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "great book"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASXL3GAK6KGZS"
                },
                "Date": "on December 20, 2013",
                "Helpfulness": 0.5,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TP9LJ9P4Y4UJ"
                },
                "Date": "on February 22, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Excellent"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASTKT0FEMOXOJ"
                },
                "Date": "on October 4, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "ok so far"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24SNLVXPYBP5E"
                },
                "Date": "on October 4, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Satisfied"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1652ZDG8U27OP"
                },
                "Date": "on February 5, 2014",
                "Helpfulness": 0.5555555555555556,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2O35A3381VDD7"
                },
                "Date": "on May 18, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Great"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIP8ORMRDUR4A"
                },
                "Date": "on February 27, 2014",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": "started out good then it was like the author didn't know how to finish so he started another story.....ended really lame!!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LS2NAFKASF2D"
                },
                "Date": "on December 15, 2013",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": "this book is not that god but just enugh goodness to read but i still read it ye i still read it they coud add some better grammar and other stuf like that"
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Alien-Honor-Fenris-Vaughn-Heppner/product-reviews/1477808825/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "120"
    },
    "Salesrank": "#202,321",
    "Timestamp": "2015-05-24 23:42:44.859991",
    "itemurl": "http://www.amazon.com/Alien-Honor-Fenris-Vaughn-Heppner/dp/1477808825"
}
