{
    "Category": "in Books (",
    "ListPrice": "$17.00",
    "Name": [
        "The Anubis Gates (Ace Science Fiction)"
    ],
    "OfferPrice": "$14.23",
    "Reviews": {
        "AverageStarRating": "4.3 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A317CUPDD6NKJN"
                },
                "Date": "on January 31, 2002",
                "Helpfulness": 0.959731543624161,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AH8NYD41MAT61"
                },
                "Date": "on August 18, 2001",
                "Helpfulness": 0.967391304347826,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1A73VJLDT6PAU"
                },
                "Date": "on February 28, 2001",
                "Helpfulness": 0.98,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALXZ64A9OAPJ8"
                },
                "Date": "on January 4, 2001",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Tim Powers is, to put it plainly, the best fantasist working in the genre. Period. One read of The Anubis Gates will prove it to anybody's satisfaction; I know it's done so for me. My God, what a book. Simply the ideas of time travel and dopplegangers that Powers puts forth here (not to mention his teriffic eye for Victorian Period detail, and his brilliant, believable characterizations of notable figures of the time) are a delight. Unfortunately, I can't talk too much about the plot without giving it away and ruining the immense pleasure reading this book for the first time will give you. I can speak in generalizations, however -- such as the manner in which Powers' protagonist becomes unstuck in time, which is so pedantic as to be wholly believable; or Powers' expert pacing and timing, which help the novel to tick away like Swiss clockwork; Powers' delicious sense of atmosphere and mood, which add to the Victorian setting just the right flavor of danger and eerie magic bubbling just under the surface of things; Powers' understanding that human beings are frail creatures, especially in the time period he's writing about (when his characters get hurt, man, they HURT!); Powers' impeccable plotting. And it is this last, most of all, that makes The Anubis Gates what it is -- for as fans of the fantasy and science fiction genres know, time travel is very difficult to write about effectively, and only the very talented can make even a conditional success of the job. Powers is one of the best -- rather than leave behind all manner of loose ends and creating more paradox than closure with his story, Powers instead makes sure that everything is tied up by the novel's last line. Everything that happens in Anubis Gates happens for a reason, and nothing, not a moment, is wasted on unnecessary business. Not only is the book's ending completely seamless, it is also a total surprise: you'll think you know what's about to happen, but Powers will (I guarantee) pull the rug right out from under you. The only other artists I know of who were so compltetely able to fool their audience were Cornell Woolrich, Ira Levin, and Alfred Hitchcock; Powers is every bit as good. The Anubis Gates, by reason of its brilliantly-imagined world and Powers' strong, effective characters and plot, is one of the greatest fantasy (or science-fantasy, or whatever the hell you want to call it) novels I've ever read. If you care at all about the genre, you MUST read, not only this book, but everything else by Powers that you can lay your hands on. You owe it to yourself -- and to Tim Powers as well, because as far as I'm concerned he doesn't get anywhere near the recognition he deserves."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 7, 1998",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Have you ever enjoyed a good time travel story only to find yourself annoyed with the paradoxes introduced by the character's actions? Well, Powers masterfully weaves this tale of a modern day Coleridge expert's exploits and misadventures in 19th century England. There are no potholes or contradictions that Powers did not somehow manage to smooth out and plug snuggly into his storyline. This book will make you flip back and forth from section to section looking for mistakes, but it all works together. After reading this book, I immediately read Last Call and Expiration Date... I'll have to say, although the other two books are entertaining and engaging works, The Anubis Gates is definitely my favorite."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ITA8B1DZAMU0"
                },
                "Date": "on December 18, 2004",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DDM7V4HZX54V"
                },
                "Date": "on September 25, 2004",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NBOL825B93OM"
                },
                "Date": "on January 19, 2004",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26HH9L174D3LC"
                },
                "Date": "on January 8, 1998",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A150QZUUQAN21X"
                },
                "Date": "on July 14, 2000",
                "Helpfulness": 0.9166666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19Y4W9RZDRNF4"
                },
                "Date": "on March 10, 2005",
                "Helpfulness": 0.9090909090909091,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33M4Y4PK6KK0X"
                },
                "Date": "on July 21, 2001",
                "Helpfulness": 0.9,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MTO8GC1UL8GD"
                },
                "Date": "on February 15, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LR37S2750F2Y"
                },
                "Date": "on May 13, 2005",
                "Helpfulness": 0.9,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MAB5Q4XA209W"
                },
                "Date": "on July 12, 2005",
                "Helpfulness": 0.8888888888888888,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3739W9QQZ448J"
                },
                "Date": "on June 16, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKY75VKMYS2PO"
                },
                "Date": "on September 9, 2005",
                "Helpfulness": 0.8888888888888888,
                "StarRating": "5",
                "Text": "This book is easily one of the 10 best books I've ever read. It turned me on to the works of writer Tim Powers, and I have now read every one of his novels (and most of his short stories, as well). \"The Anubis Gates\" is easily one of his masterpieces. It is usually lumped under SF or Fantasy in bookstores, because they honestly don't know what to make of it - it IS both SF and Fantasy, but so much more. For lovers of dark, modern fantasy - or anyone who loves a great time-travel tale unlike any other - this book is highly recommended. I also recommend Powers' \"Last Call\" - but it is not for the faint of heart."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZVU6DKD69AIY"
                },
                "Date": "on April 30, 2004",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Few novels combine popular storytelling technique with artistry as well as The Anubis Gates. I enjoyed this novel because it is intelligent without becoming pretentious. A fast paced, yet twisting, plot keeps the reader guessing by tossing a somewhat broken Everyman 200 years in the past where he is beset by characters both vividly grotesque and charmingly romantic. Ironically, the time traveler's smug assurance of his superiority as a human from an advanced civilization is turned on its head when he immediately finds himself an alien in a world he can't relate to and persecuted by powers he doesn't understand. The characters and settings were depicted so well that I felt like a set director as I imagined each scene in my head. The only drawback to the book is that there are no others like it. If you want exciting storytelling that still maintains high literary standards, this book is for you."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 25, 2002",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AD4XBTBQYQBT3"
                },
                "Date": "on October 19, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A272GC7LY7OV33"
                },
                "Date": "on January 15, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOMTYFH121ZVC"
                },
                "Date": "on December 21, 1999",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "A gentle beginning that builds into a wild roller coaster of a book! Tim Powers best work mixes time travel, fortean oddities, thieves guilds, ancient Egyptian incantations and manages to evoke a dirty London that is  so gritty and so real that you can almost smell the rotting filth floating  in the river Thames. The hapless hero who starts out as a paunchy academic  type is carried along by the flow of events. He seems powerless to change  his destiny. Destiny has other ideas and soon sets out to change him. The  hero is hampered in his adventures by the certain knowledge of the exact  date and time of his own death. While it is true that the story does jump  from location to location, this just serves to add to the excitement and is  an integral part of the book's powerful attraction."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LPTRW8V5ZDI7"
                },
                "Date": "on May 23, 2001",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOJA2CDXBLYP2"
                },
                "Date": "on August 27, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I've had a recent interest in steampunk and found this book on a few lists, so I thought I would check it out.  Wow!  One of the best books I've ever read in terms of entertaining, unpredictable, and just so original!  To be honest I didn't see a whole lot of steampunk stuff in it besides time travel and some darker atmospheric elements - so if you're not a fan of steampunk then don't worry, I believe you will still enjoy it.  No disrespect to the other reviewers but my recommendation is to stop looking at anything about this book and go read it now.  Trust me, you don't want to hear ANY spoilers at all because the twists and turns are so good!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3I7L9URLTIJ0M"
                },
                "Date": "on May 7, 2003",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Excellent!! This book and George R.R. Martin saga of \"The Song of Ice and Fire\" I think are the best science fiction novels I have ever read. \"The Anubis Gates\" delivers a phenomenal and unique story from start to finish. What I most love of the novel was the author originality in establishing the plot of the story and the constant turns and surprises the story delivers. There is no point in this novel where the story gets boring or too 'slow paced', on the contrary, the more you read, the more intriguing. I hope you decide to add this book to your collection, enjoy the ride!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3U3PVZFRNP7XK"
                },
                "Date": "on December 28, 1999",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I once told Tim that his name is prophetical, for he does indeed write about Powers, in human form and in mythical form. He found that amusing. This book has powers of all kinds, mystical, magical, political, artistic,  and just human. It is perhaps the best example of the unique Powers power  of taking the most bizarre fantasy ideas you ever heard and mixing them  with painstaking historical research to make a seamless whole that you just  know would be true IF... time travel was possible... IF... the old Egyptian  gods were real... IF..."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on December 16, 2002",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GBJQ9THOYDAJ"
                },
                "Date": "on June 22, 2011",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "I suspect every serious, heavy reader has a few authors whose new books he buys without reading reviews or even bothering to discover their subject matter. One of mine is Tim Powers, the Master of the Secret History. This one is the first of his \"historical fantasies\" I read, back when it was first released, and I've been an addict ever since. Brendan Doyle is an academic in English lit, specializing in the Romantic poets, and especially in the not well known William Ashbless, a friend of Byron and Coleridge. He's struggling to get his book published when he receives an offer from Darrow, a notoriously eccentric billionaire, to come and give a lecture in London, all expenses paid plus a hefty fee. How can he turn that down? It turns out Darrow, who is slowly dying, has discovered a method of traveling into the past, via a pattern of \"gaps\" in the time-stream, specifically to the early years of the 19th century. To raise funds, he has organized an excursion to witness a lecture by Coleridge -- at a million bucks a pop -- and Doyle is to be the designated expert. And it all comes off as planned, except that Doyle is waylaid and kidnapped and misses the return jump to present-day London. And so begins his struggle with the forces of ancient Egyptian magic that inadvertently created the gaps in the first place, and with the evil clown/sorcerer who controls most of the beggars of 1810 London, and with Dog Face Joe, an insane sorcerer who can shift from one body to another. Doyle gets caught up in multiple layers of plots and conspiracies, all of which exist just below the surface of the world we all know. He also comes to know young Jacky, who has his/her plans for revenge. And he won't stay in his one body for very long, either, which is just as well. All of which is Powers's patented method of plot, character, and narrative, and it works exceedingly well. You have to pay close attention to keep track of everything, but you won't be able to put it down."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FVQFA7X5RHUR"
                },
                "Date": "on November 4, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AY7ZS03I9M3PY"
                },
                "Date": "on July 6, 2009",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AP3A4UW8OJFV"
                },
                "Date": "on January 9, 2005",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWPM2JSPU9N04"
                },
                "Date": "on June 6, 2001",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I cannot express enough my thorough enjoyment of this novel. An incredible ammount of twists and turns keep you on your feet, all of them plausible and never seen coming. This is easily the best Sci-Fi/Fantasy/Time Travel book I've ever read!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OMUNEXJZDKKZ"
                },
                "Date": "on August 5, 2004",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3E9KE3HT64CGD"
                },
                "Date": "on July 3, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 12, 1997",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APTNTPMH0OUCV"
                },
                "Date": "on April 16, 2002",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1F7C4VEJH0ECL"
                },
                "Date": "on April 15, 1999",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This story gets so complicated that even the author gets confused at least once as to whom is whom.  While we jump among three centuries and change bodies and names the characters are going by (whew) Powers weaves a wild  and fascinating story with excellent narrative skills.  He should write a  straight novel about early 19th century England.  He obviously knows and  loves the subject with intensity.  Super entertainment!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30KEXFT9SILL6"
                },
                "Date": "on December 5, 2001",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2E5GLJPQAMOBS"
                },
                "Date": "on September 29, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 20, 1997",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Everything good about this book has already been said.  I read The Anubis Gates 11 years ago and have been recommending it to all my book-worm friends, and if they didn't like it, I would buy the book from them at double the cost!  Needless to say, I never had to"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GXBMUTVHWHJL"
                },
                "Date": "on April 28, 2010",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QIMGRM0GW8NU"
                },
                "Date": "on September 5, 2006",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "5",
                "Text": "This is one of the few books that I've ever read to my husband that he couldn't figure out before the end. Tim Powers and his billion-threaded plots defy attempts to predict their outcome. Definitely and enjoyable read. Powers knows how to weave a very tight plot that still leaves room for humor and whimsey. Highly recommended."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32Q6LR5VKOF5I"
                },
                "Date": "on July 14, 2006",
                "Helpfulness": 0.7333333333333333,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 31, 1997",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "It's always a shock when I notice that this book is out of print;  the world just seems to make a little less sense.  Conversely, it's a relief to see a new edition like this one.  For those not familiar with Tim Powers' work, this book is still the best place to start.  It features a rich cast of characters and a vivid 17th century London that initially offers only glimpses of the plotting and magic churning behind the scenes.  A Tim Powers book can span years or even the lifetimes of his protaganists.  These reluctant heroes fight for survival against the secret evil that lies just beneath the surface of their everyday lives, and anything can happen because Tim doesn't do sequels.  The Anubis Gates in particular has many awe-inspiring scenes in it, and is just an unbelievable amount of fun....  So why didn't I give it a 10?  I'm only 30 years old;  maybe I'll read something better someday.  (Hey, I can dream, can't I?!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 26, 1999",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GEZRZ6F5WKOD"
                },
                "Date": "on December 14, 2001",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMTADN8VCK6J2"
                },
                "Date": "on May 30, 2002",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "What a great pleasure it is to stumble onto a wonderful author whose work you were previously unfamiliar with. I saw Tim Powers name on a Sci-Fantasy web site and decided to give him a try. This is a superb novel, intricately yet smartly plotted and nicely weaved together by a very talented writer. Most of the story takes place in early 19th century London, brought vividly to life by the author. The story contains (among other things) time travelers, sorcerers, werewolves, a maniacal clown,  historical poets Lord Byron and Samuel Taylor Coleridge, fictional poet William Ashbless, and Brendan Doyle - our time-traveling hero from 1983. Powers gives us a unique perspective, with fresh ideas. This one is a keeper. I'm looking forward to more of Tim Powers work."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GQTXEMWXVK7D"
                },
                "Date": "on January 7, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This was the first of many Tim Powers books i read. My wife took a writing class with Tim and brought this book home with her. I read it on a flight because i was out of stuff to read. Boy was i happy that i did. This was a refreshing and original tale that can be enjoyed by readers of all genres, it truely has something for everybody. Time travel isnt a favorite of mine, but it is a recurring a theme from Tim and each book surprises me with a new twist on it. It is not too often that someone's creativity impresses me, but so many of the charactors in this book are like nothing that i've ever read that i have no choice but to cheer for tim's originality. Tim has taken my dislike for clowns to a whole new level......so to speak."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKV4R4M4FD6K3"
                },
                "Date": "on October 28, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on May 8, 1997",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Mild-mannered Coleridge expert gets marooned in 17th century London, then things get weird. This is Powers at his best - carefully carved characters dragged helter-skelter through a meticulously researched historical setting having adventures, some harrowing, some just plain goofy. More ambitious than On Stranger Tides, my other Powers favorite. Like On Stranger Tides, the fantastic elements of the story are consistent, carefully thought out, and most seem to be drawn fairly narrowly from the (Egyptian, in this case) mythology referred to in the title. Overall, a \"dark, delicious flow of strangeness\""
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AT3ESUWYNLKUK"
                },
                "Date": "on February 4, 2007",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "My only real gripe with Anubis Gates was that Mr. Powers basically lost a couple of his most interesting characters for about 100 pages or so.  Without going into spoilers, I really missed reading more about Jacky and the Clown.  Sure, the last 20 or so pages were awesome and neatly wrapped things up (nice ending!), but it would have been nice to have spent more time with these characters.  All in all, this was an amazing read.  Loved the mysticism, the Egyptian historical stuff, the sorcery, the historical characters, the time-travel, the sci-fi!!  Highly recommended."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KR9ET455LKWO"
                },
                "Date": "on July 24, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Tim Powers adds enough research and craziness to his fiction (read that correctly) to make you wonder where history leaves off and imagination begins.  He has become my favorite author in my \"guilty pleasure\" genre.  So much of it seems like...just maybe that could happen, far out as it may be.  I'm most of the way through his latest work and can't put it down.  Will soon get into his short stories.  It's summer after all!  Great read, better imagination on Mr. Powers part.  Good stuff!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EB2EQFX4IRNL"
                },
                "Date": "on May 5, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on April 24, 1997",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book is impossible to describe clearly. In it, a mild-mannered English professor tangles with Egyptian wizards, evil clowns, werewolves, body stealers, the Knights Templar, and even Samuel Coleridge. The pace is exhausting and every time you think you know what will happen next you're fooling yourself. I can't think of another book I had as much fun reading the second time as I had the first. If you have never read a Tim Powers novel, this is the place to start"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AETPG15VK78T3"
                },
                "Date": "on March 29, 2002",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Q74N243PTXFL"
                },
                "Date": "on June 6, 2005",
                "Helpfulness": 0.7,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AWLPWTZRXNFO"
                },
                "Date": "on September 1, 1998",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1D3W8U611KPYJ"
                },
                "Date": "on September 28, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Fantasy at its best. Time travel across 1600s, 1800s, and 1980s with bizarre and sometimes grotesque characters. The scenes come alive as if you were there. With adept historic detail, he creatively weaves a chase across time travels with fluctuating characters. Expect only the unexpected as he concludes with a vivid, wild, seemingly cataclysmic ending. I couldn't stop turning the pages."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21GEOIRZ2DG8A"
                },
                "Date": "on May 14, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Couldn't believe how quickly I finished the book, I was disappointed to reach the end so quickly! Intriguing story coupled with perfect soft background music and a wonderful reader..it both kept me engrossed, yet physically very relaxed. Already into book two of this series."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AX5FQYFZ2I0Z"
                },
                "Date": "on March 10, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XKUJ7U53C3VP"
                },
                "Date": "on January 11, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book blew me away.  Time travel and awesome rolled up in a tortilla of Egyptian lore.  I may have to reread this one."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3K06ZM47VZRVI"
                },
                "Date": "on January 13, 2007",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "its a good read from begining to end.  The characters are lovable and the sci-fi is good enough to keep a reader entertained.  My only complain was that the cover made me think that it was heavily influenced by egyptian culture but most of the book is set in england during different time periods with a few chapters mentioning egypt."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8738NLQKGB7P"
                },
                "Date": "on November 30, 1997",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Tim Powers is perhaps the most unjustly unrecognized authors in Fantasy and Science Fiction.  Anubis Gates is ranked way on the top of my favorite books of all time.  It's imaginative, it's fun, it's well written, it's educational, it's provocative, I could go on and on... Buy it today or you'll regret it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Y68E3UV5HLSR"
                },
                "Date": "on October 3, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GTFLXYMIPKJ3"
                },
                "Date": "on November 6, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACV5MOOTBQK9H"
                },
                "Date": "on September 21, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVUC5DXOA2OZW"
                },
                "Date": "on April 12, 2014",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LA6Z4ZBR9ZP8"
                },
                "Date": "on August 8, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Z1DOBASN3YZB"
                },
                "Date": "on October 28, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on September 3, 2001",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "What a funny, intelligent, crazy, amazing book. It's an absolute roller-coaster ride of adventure, romance, darkness and magic.  I would highly recommend this book to any reader of fantasy and/or sf.  It's wonderful."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AC4Z26E60FBEM"
                },
                "Date": "on December 13, 2010",
                "Helpfulness": 0.75,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2V1121177OVJ"
                },
                "Date": "on November 25, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 6, 1997",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "The Anubis Gates was the first (and best) Tim Powers book I read. What an incredible imagination this man has!  A thoroughly entertaining book. I'm not a fantasy or sci-fi buff but I loved this book"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on November 17, 1998",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Thank you, Tim Powers, for a book shaped with such care that when I finished I had to laugh aloud with satisfaction.  Why such glee?  Because The Anubis Gates delivers so generously on the twin essentials of plot and  good writing.  On writing quality, science fiction often disappoints.  But  not here.  Powers cares enough about words and has the necessary skills to  serve up what is sometimes exquisite prose.  It is the story, though, that  is the triumph of The Anubis Gates.  The \"science-fantasy\" novel is a tale  of \"Byzantine complexity\" (citing Ramsey Campbell's introduction) whose  characters, settings, and story elements snap together like the precision  parts of a marvel machine.  Turns of plot, reversals, and the laying of  surprise upon surprise makes the story a true exemplar of the overused  attribution \"classic\"--in this case a modern classic.  If you must have a  good story and if it must be well written, get ready.  Dinner is served in  The Anubis Gates.  Place a candle on the table, a napkin on your lap, open  to page one, and enjoy."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PQYIIJ4SWDQ"
                },
                "Date": "on February 1, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13B7EBL4AN801"
                },
                "Date": "on September 3, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "I enjoyed reading this book.  It was easy to get right into the story, you are drawn into the characters dilemma  even if you're not familiar with the time period.  The magical forces and Egyptian flavors are familiar, but with a twist that keeps the reader interested throughout.  It seems to have a lot of random threads and characters, but the author manages to tie all the pieces together.  My only complaint is about the multiple fight scenes in third act, it gets a bit tedious, and doesn't move the story along.  Overall a very enjoyable book to sit down with, and I found myself continuing to read long after I should have gone to bed!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on April 21, 1998",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I find it really strange to see this book listed under Science Fiction by Ace--but reading it was a riot, a joyride, a rollercoaster trip, a free fall without parachutes. The plot is so crazy, and yet (in the end) so cohesive, I wonder how did Mr. Powers kept track of all the loose ends while writing this book. But what I found most satisfying (attention: spoilers!) was the idea that the main character's \"own life\" only starts at the end of the book. Before that, he lived the life of Ashbless, which he knew by heart. That was for me a nice finishing touch, in what was an excellent book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GCZ07XRJX858"
                },
                "Date": "on September 28, 2008",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 25, 1998",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Powers is amazing and \"The Anubis Gates\" is one of his best. A time-travel tale which works so well is a rare thing (May is one of the few others who do it this well) but Powers handles this, as well as any topic, beautifully. The research is flawless, the settings equally so and the story so completely readable. There are a few predicatable - a couple almost corny - points but these only seem to make the book better. As with all my Powers books, I don't lend this one out - I'm sick of buying replacements."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KQAWRQCZOR92"
                },
                "Date": "on January 9, 2014",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GEZRZ6F5WKOD"
                },
                "Date": "on January 25, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 8, 1998",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANAAKTEQQ8B8A"
                },
                "Date": "on March 9, 2015",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "Enjoyed it somewhat. After reading the reviews I thought I was in for something really great. Don't get me wrong, the story is very interesting and clever. But the characters just had....no character. The story also seems to jump and progress too quickly leaving it with somewhat of a movie screenplay sort of feel. Then again, I might have a better chance of building an artificially intelligent canoe out of fingernail clippings than writing a good novel so what do I know."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2E8ZCF5RJHCH9"
                },
                "Date": "on March 17, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "With rich characters, great re-imagining of early 19th century places, a fantastic story backed up by industry awards, this book showed great promise. And I was hooked for 95 percent of it. But it let me down in the climax as I felt there was too much deus ex machina and not enough of the characters I already knew getting the hero out of a sticky situation. I still enjoyed the story and I will read more of Tim Powers' books because of this. Four stars out of five."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39T8A30VM2O1S"
                },
                "Date": "on April 22, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGR1WPTDMAEAD"
                },
                "Date": "on September 14, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 18, 1999",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I don't need to say much about this book except, \"You must buy and read this book!\" A fantastic and original story of fantasy, history, magic and action. For pure entertainment, this book is hard to beat. I had  read almost all of Powers' books before reading this one, and this is the  best he has produced. Since he is one of my favorite authors, I cannot  praise it more highly than that."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16CRWAAX3S85Y"
                },
                "Date": "on July 24, 2002",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "As a regular reader of sci-fi and fantasy, I have come across numerous variations on the time travel concept, Tim Powers, does it with originality and creativity that few others offer. If you're in the market for sci-fi/fantasy that is original and not just a retelling of the same old story with a new cover than this book is for you. From the moment I picked it up, I could not put it down."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SZ0CBCA07GRI"
                },
                "Date": "on October 14, 2013",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "Basically a great story but with a non-sympathetic \"hero.\"  I felt like he was trying to apply the tension-release formula but the tension was one damned thing after another and the release was just treading water and tedious to read through and didn't add anything to the story.  Not sure if I'll try another in the series.  Anyone have a favorite?"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PYAGCFIN5NEC"
                },
                "Date": "on May 13, 2014",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EQRFI17IJZ8V"
                },
                "Date": "on October 18, 2013",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIZNJFTOY1OQC"
                },
                "Date": "on June 26, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HR714C88NN9D"
                },
                "Date": "on June 7, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ISI4RU0G95KZ"
                },
                "Date": "on March 11, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "...but more than a bit too long. And fairly 'dark', so not exactly light reading. Having said which, I read it through.. will wait for some time before I pick up another book by Tim Powers though."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APS8L07ET7XI"
                },
                "Date": "on February 5, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "This is my second Tim Powers book and it won't be my last. He has an original turn (or twist) of mind and having read On Stranger Tides, I expected more of the same. This wasn't the same, just a little more imaginative and even more enjoyable. I will come back to Tim Powers in a month or so and I know that he won't disappoint."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on January 21, 1999",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "God this book is awesome. I am only 14 and absolutly loved this book. This is has the to be the best book I have read in ages.  This book adds a unique twist of plot that I have never seen before. This book is the best.  If you like ainchiet egypt, 14th century england, time travel or  magic/fantasy,  then you'll absolutly love this book."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on April 17, 1997",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31RGLT0487G14"
                },
                "Date": "on October 21, 2013",
                "Helpfulness": 1.0,
                "StarRating": "2",
                "Text": "I can't believe how disjointed and boring this book is.  I had really hoped it would be worth the money, but it held only a bare modicum of interest for me.  The language is so stilted and the characters so annoying, I barely made it half way through before calling it a loss.  I so kept hoping it would improve, but not so."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on January 12, 1999",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 25, 1999",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I generally hate time travel books.  This and Kindred (a much darker book by Octavia Butler) are two exceptions.  Wild yet logical, all lose ends are taken care of as effect becomes the cause.  An excellent book to read when  you want to devour something challenging and thrilling."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DG3A9IAL8P7V"
                },
                "Date": "on March 22, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A353S31FPSCZ6J"
                },
                "Date": "on January 30, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PBKX6TPO21OR"
                },
                "Date": "on May 5, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KLGVGBOIY0KH"
                },
                "Date": "on July 5, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I became an instant Tim Powers fan about 17 pages into this book --- this man is one of THE most powerful and evocative fantasy writers alive today, and this is one of his very best stories, a must-read' for those who love dark fantasy ..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JA6A2Q7FJJMS"
                },
                "Date": "on July 17, 2001",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34R7EQVEQQNY1"
                },
                "Date": "on August 29, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I enjoy time travel stories a lot, and this is quite possibly the best I've read (and not coincidentally, one of the few I've reread).  The whole story is so perfectly self-consistent despite the time travel angle.  Beautifully done!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FQWOBSCWX2KN"
                },
                "Date": "on April 14, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This was my second Tim Powers book. I've just recently discovered him and have a hard time putting his books down. I hate writing these reviews because I always feel like I might give too much away about the book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVBOCSETZ2VQ9"
                },
                "Date": "on September 21, 2002",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "If you start reading this book you will probably end up wanting to buy and read everything else Tim Powers has ever written.  If you have not yet read his stuff you have a treat ahead.  Enough said."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12OKUSUX0CVQ1"
                },
                "Date": "on October 4, 2010",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Held my interest almost all the way through, but started meandering a bit toward the end. A unique book, though, written by someone with real talent. I'm looking forward to reading more of his work."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EDDJ7EMZHX4M"
                },
                "Date": "on February 17, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26UY2QZR1M9O5"
                },
                "Date": "on May 17, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "The plot is straightforward enough, but the author remembers to add healthy bits of humour (and horror!) at frequent intervals, which keeps things moving nicely. Recommended."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1E2GF0K8S7G10"
                },
                "Date": "on October 4, 2012",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "This had interesting concepts about time travel and was thorough in the portrayal of times in the past.  Some of the images were way out there but overall I enjoyed the read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GV39WO3NJVHY"
                },
                "Date": "on August 17, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3S9NB8XPK1T74"
                },
                "Date": "on March 29, 2014",
                "Helpfulness": 1.0,
                "StarRating": "2",
                "Text": "Very hard to follow the story line... started out good, but soon became a difficult trek through 16th century England, with archaic language without any translation."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PZWV7QW17DW8"
                },
                "Date": "on February 5, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is my favorite Tim Powers book and he's written some great ones. Everything comes together perfectly in this one and it's an altogether mind-blowing, fun read."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on November 9, 1997",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "If you like science fiction; if you like fantasy--if you just like a well-written thought-provoking page-turning barn-burner of a good time . . . READ THIS BOOK!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KTTEMFQQGH5W"
                },
                "Date": "on June 9, 2000",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "Previous reviewers have done justice to the plot of this modern science fiction/fantasy classic.  I originally read it back in the 80's before it went out of print.  Once I lent my copy out to a friend and never saw it  again, I was determined to find a new copy.  Many of Power's works are  detailed works of fantasy that will entertain you for hours, but this  one,more than most, bears rereading.  Trying to find this book used was  impossible for years because of it's popularity.  It's rerelease in 97 is a  reason to rejoice.  The story holds up perfectly well over the years.  I  don't believe this story should be overshadowed by his later work,  regardless of their value.  It is coherent for time travel, fantasy,  historical fiction and some science fiction fans.  Anyone wanting a good  story should enjoy the twists and turns imbedded in the basic plot.  Last  Call and his following works have won Powers new fans.  They should become  aware of this gem and fall under it's spell."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on November 5, 1997",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I think this is one of the best works that i have read in the last years in this genre. The word is excellence in its most brilliant representation."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1C4AUMAN5VZ21"
                },
                "Date": "on December 29, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "A fascinating and imaginative novel.  Creative use of historical periods.  Some unforgettable characters and a whole lot of twists and turns!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATH31NQJMHSAZ"
                },
                "Date": "on May 27, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Great story. It's different but great! Been wanting to read it for years and glad I have now. It's a mix of history, magic and time travel."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27HO4RPHTJX64"
                },
                "Date": "on April 22, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "I usually hate time travel stories but this held up surprisingly well. He managed to allow for a fated universe and free will.  Well done."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2P4JI6A9Y7R3C"
                },
                "Date": "on May 19, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "The Anubis Gates is a well constructed book about time travel that plays with and uses that genre's tropes to make a worthwhile read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2W9948JMQ40B9"
                },
                "Date": "on September 18, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Amazing read, fast paced, great characters. Ending left me a little unsatisfied, I would love to see a sequel but nonthless 5/5 !!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QBDQQMXS0LFO"
                },
                "Date": "on April 21, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Fantastic. One of those books that has you marveling at the creativity and imagination of the author. Very highly recommended."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APCFDDQSGL019"
                },
                "Date": "on May 10, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I read this book nearly 30 years ago and it haunted me until I tracked it down again. One of my all time favourites"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Z81GM85KH5XS"
                },
                "Date": "on December 29, 2011",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "4",
                "Text": "Fun time travel romp by Tim Powers. Mild mannered literature professor gets stranded in 1810 in London, and has adventures with evil Egyptian sorcerers, a murderous clown, gypsies and a werewolf named 'Dog-faced Joe'. The portions concerning Horrabin the clown and 'Dog faced Joe' were excellent. ** spoiler alert ** I thought the story was very good excepting the diversions to 1680's London and Egypt. The foray into Egypt, in particular felt 'undercooked'. Also the whole evil plot of destroying the British empire, in order to restore the ancient Egyptian gods, didn't make much sense to me. After all by 1810 Egypt had been Islamic for over a thousand years- if Anubis, Horus, Isis et al. could survive that, I'm sure they'd be ok with the British."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28E61353X8EMA"
                },
                "Date": "on February 17, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "And with Tim Powers, that is very good indeed. My only regret is not having more time with Elizabeth. Oh well."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 23, 1999",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book is so good that I bought 3 more copies after the cover fell off my first one."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GJOOKNI69H2Q"
                },
                "Date": "on January 29, 2000",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "4",
                "Text": "I have to thank Grover of Oxford Books in Atlanta for making me a Tim Powers fan.  He threw in an old paperback copy of it for nothing when I was buying some rare Stephen King hardbacks, and I was hooked.  This was the  first of many Powers books I have read and devoured over the last ten  years, and as good a place to start as any.  First time Powers readers,  have patience; it will all eventually make sense."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOTB1671D35HU"
                },
                "Date": "on April 29, 1999",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 19, 1999",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "Go along for the ride for the first 25 pages or so (the time travel set up is a little contrived), because what this really is an sf version of a historical novel probing the deepest and darkest underworld... kinda like  Charles Dickens on bad acid. Powers is incredible in being able to make  what might sound like an unlikely novel work, and work it does. If you can  loosen up your logic circuits a couple of degrees and watch this book like  a movie, you'll be astonished."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AL0T6A7BM4MUQ"
                },
                "Date": "on January 9, 1999",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2F2GWRCWIJXK6"
                },
                "Date": "on July 1, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I enjoyed it very much. It was not as spooky creepy as I expected, which is a very good thing."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DQWFWINN3V5A"
                },
                "Date": "on June 16, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Tim Powers' 1983 Philip K. Dick Award winning novel \"The Anubis Gates\" is a bit obvious in its plot driver, but the details of the story make up for that.  The story is interesting, the descriptions well done, and time is handled very nicely.  The only real complaint I have about it is that the characters don't seem to be \"in character\" to me.  We've got main characters from long ago and far away who act very modern.  Others start out that way and then seem to turn \"in period.\"  Others go the other way.  It's a bit disconcerting.  However, the story is still good enough for me to rate it at a Very Good 4 stars out of 5."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 27, 1999",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "3",
                "Text": "After all the hype, I picked up a copy of this book with great enthusiasm.  I thought it was a good concept, but the plot was slow in unravelling and there was a mix of characters that was sometimes hard to follow.  However,  it does come together beautifully in the end."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AQSST84HG0NC"
                },
                "Date": "on April 6, 2013",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "3",
                "Text": "I was recommended this after reading neverwhere by Neil gaimen. I'm not sure what I expected but it was not this, nonetheless I thoroughly enjoyed slow to move at some points and anti climatic for context but you forget that as you gets lost with the character."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALT3HB96ZFU7I"
                },
                "Date": "on May 13, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Some books in life are rereadable and some are not. This book, like others by Tim Powers, is rereadable. Clever, witty, and lush with engaging characters and a nice, quirky plot that ties together some little oddities of history. Connected to \"Nobody\"s Home\" which uses some of the same characters."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on May 16, 2000",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "A mind-bending, totally unexpected, truly unique work of fantasy.  Powers is able to combine incredibly dense storylines and threads to weave an utterly enthralling story.  A book for intelligent, thinking people who  enjoy fantasy!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYFZ6RAXGZTMV"
                },
                "Date": "on October 2, 2000",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "Not only has Tim Powers created a well written and very entertaining book, but he has also managed to create a time travel story without logical contradictions where the reader can still be suprised!  Highly recommended."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34ZS86B5UPU1S"
                },
                "Date": "on December 9, 1999",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "4",
                "Text": "At every turn Tim Powers keeps you on your toes. The plot has more twist's than Pulp Fiction, and heros you can relate to. I have given a copy to every book reader I know, and have yet to have one say they hated it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1050UCGQLYJI9"
                },
                "Date": "on June 28, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Y9PUN1Z2N2KD"
                },
                "Date": "on October 3, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FYTH0NIK2MZV"
                },
                "Date": "on September 15, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This was well packed and arrived quickly and in good condition. I am thoroughly enjoying the story which is unlike anything I have read before. Very innovative and well told. Definitely has me on the edge of my seat."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15EIJ39KNO00D"
                },
                "Date": "on June 9, 2000",
                "Helpfulness": 0.625,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BLBI7GDVNOMM"
                },
                "Date": "on January 5, 2013",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "3",
                "Text": "The Anubis Gates delivers to those with the perseverance to see it through to the end...a story within a story within a story."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20CPW4RU55GCA"
                },
                "Date": "on December 23, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The book is non-stop action, covering every horror/fantasy/sci-fi cliche but the kitchen sink, yet managing to do it in a refreshing way.  Fantastic and fun read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UJQ2VXFSKVZG"
                },
                "Date": "on July 3, 2000",
                "Helpfulness": 0.6,
                "StarRating": "5",
                "Text": "Along with Connie Willis' \"Doomsday book\", this is one of the best books on time travel I have ever read. This novel is tightly plotted, and Powers reveals he's done quite a lot of research on his subject matter. There's a poetic undertone to his whole vision, but best of all, this is a  very entertaining book. You almost want to look up William Ashbless... when you finish reading it! I am only sorry that Mr Powers isn't  such a big name, possibly because he doesn't write what must people expect  from a fantasy novel."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27HVVLSZZ13XK"
                },
                "Date": "on November 19, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I love all of Tim Power's books but Anubis Gates is my all time favorite. Probably the best time travel book I've ever read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3V3MUJ22ZLI43"
                },
                "Date": "on August 24, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "It was an interesting premise but about 3/4 of the way through it became one dimensional and easy to unravel"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FI3IJB2W4YJB"
                },
                "Date": "on August 27, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1R928HS0MMR74"
                },
                "Date": "on September 12, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I am currently reading this one and cannot put it down.  It is fascinating."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2P6UIKG4W7KSK"
                },
                "Date": "on September 11, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "One of the best time travel stories ever written.  Immensely satisfying."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BHADHV0092UA"
                },
                "Date": "on May 23, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A really good time travel tale with some supernatural components."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MKPJC88RT60C"
                },
                "Date": "on August 14, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Quite possibly the only time travel novel anyone ever needs."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVTEOB3CILET0"
                },
                "Date": "on March 27, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Got me into the song \"Yesterday\" by The Beatles."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1N8A9I1CIXYZO"
                },
                "Date": "on August 25, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The most amazing book better than Game of thrones"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 6, 1999",
                "Helpfulness": 0.6,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TZ68ET764KD0"
                },
                "Date": "on September 4, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Love all of the twist and turns thru time"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VL076RH9XPSO"
                },
                "Date": "on July 6, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "GOOD STORY, VERY STRANGE"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2A895C1LCLD1L"
                },
                "Date": "on July 1, 1998",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "I'm not much of a fantasy fan, but this novel fell within the bounds of what I enjoy.  The fantasy elements are tightly controlled and bound to the plot, which involves time travel back to 19th and 17th century London.  The realistic settings and realistic reactions by our hero enhance a complicated and rewarding plot.  What flaws there are in the story make one proud to have spotted them amidst the busy story rather than annoyed that they exist."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LZAB4CK5DZCG"
                },
                "Date": "on January 2, 2011",
                "Helpfulness": 0.5789473684210527,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GPKC42QA6737"
                },
                "Date": "on March 27, 2001",
                "Helpfulness": 0.5454545454545454,
                "StarRating": "3",
                "Text": "Powers sat down to write a book with the following thought in his head: \"How can I write a time-travel book about Lord Byron, Egyptians, and the ever-popular horrific clown?\" The Anubis Gates is the result. The plot is neatly stitched together, and you'll find yourself flipping back a few pages, mumbling sagely, \"Yep, that sure did happen back in Chapter Three,\" as well as being mildly freaked out by the malformed sorcerous freaks of 19th century London. What's the upshot? It's all a lot of fun, but nothing is terribly new or original. The clever knitting together of the plot is probably its best feature, but outlines do not a novel make. I read through it, laughed, shuddered just a teensy bit, and then neatly alphabetized it on my shelf. I probably won't read it again, but I didn't mind traveling around in time with Tim just once."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1X8VZWTOG8IS6"
                },
                "Date": "on September 2, 2007",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ALF72BQ4RIEL"
                },
                "Date": "on August 9, 2006",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": "To-date (may soon be overturned as I'm trying a new one from Tim Powers now) -- this is the best book Tim Powers has written.  I have tried some of his other stuff and it has been like he is a one-hit wonder.  The Anubis Gates is a very good read that he has not matched again in my view.  Here's hoping that my current trial of another of his books comes close to this one."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANG2L5PVEQAFZ"
                },
                "Date": "on May 17, 2009",
                "Helpfulness": 0.5769230769230769,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on January 23, 1998",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": "Go back in time via some magical unexplained means and visit lots of ghouls and goblins.  I thought it kinda dragged.  I would have been less offended had it not been called 'science fiction'.  Where was the science?"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21U1PMEG6RYJN"
                },
                "Date": "on January 3, 2015",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "just what I wanted for a great price"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1O04GKA1CNH6C"
                },
                "Date": "on January 26, 2015",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Not as much as I thought I would"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YRV8ICHSL41F"
                },
                "Date": "on March 21, 2005",
                "Helpfulness": 0.5238095238095238,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQD48ZYYAZEBN"
                },
                "Date": "on May 31, 2000",
                "Helpfulness": 0.375,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJIUC8RHKA85D"
                },
                "Date": "on September 6, 2011",
                "Helpfulness": 0.4,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27AT1AO1IG1CV"
                },
                "Date": "on January 31, 2008",
                "Helpfulness": 0.5,
                "StarRating": "2",
                "Text": "The Anubis Gates has very little to do with ancient Egypt, Anubis, but more about gates into time travel.  After the first 100 pages things started to fall into place, but with this book, its hard to keep on track. Beware, the author constantly changes people, time and places, from beggars in England, Lord Bryon, a weird clown, sadistic torture and the \"yags\". I found the ending (last 50 pages without interest). Expecting a book about ancient Egypt, this was not it.  It could have been written with much less confusion to circumstances to present a book about time travel."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11PO85FJRYB23"
                },
                "Date": "on April 26, 2012",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "A very strange, bizarre and disturbing book. However also very entertaining, despite being about time travel. Which despite what else you might read is not handled better here than other tt books."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4DXI79ISF2T1"
                },
                "Date": "on October 8, 2009",
                "Helpfulness": 0.2857142857142857,
                "StarRating": "3",
                "Text": "Interesting if clouded premise, lots of action in different time periods, strange doings, unexplained strange doings, good good characters, really good bad characters, strains the willing suspension of disbelief, lots of potential undeveloped links to historical events, a rather ho-hum uninspired protagonist, a twist of an ending, moderately enjoyable. Time travel here is not utilized to its greatest potential. The insularity of the novel is such that time travel is almost irrelevant. Anubis lives! How and why are not explained here."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1S3Q7OJMCOYBH"
                },
                "Date": "on August 18, 2000",
                "Helpfulness": 0.38461538461538464,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24L8LTIR460LY"
                },
                "Date": "on April 28, 2011",
                "Helpfulness": 0.3888888888888889,
                "StarRating": "2",
                "Text": "I know this is a popular book and Tim Powers has many fans, but honestly, he is a mediocre at best, and horrendous at worst writer. His writing style is jumpy, his plotlines don't mesh well, his characters are one-dimensional, and his jokes aren't funny. While admittedly there are a few nice ideas buried in the story, especially the way he ties in Egyptian lore with strange magic, the book was a chore for me to read. I had to will myself just to finish it. I think I wouldn't have minded this book as much a five or ten years ago, before I read luminaries like Gene Wolf and G.R.R. Martin, but unfortunately for Tim Powers, his writing comes off as hackish."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AX31R0JMPAY51"
                },
                "Date": "on June 13, 2010",
                "Helpfulness": 0.4090909090909091,
                "StarRating": "2",
                "Text": "I was excited for about half of the book--interesting characters, unique plot twists, fun action sequences, original premise.  Then it just went on and on as if the author was trying to make it as complicated as possible or didn't know how to end the thing (or both).  The book is overwritten and should have been wrapped up about 100 pages earlier.  This is nowhere near as good as the the reviews here lead you on to believe."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A142DW9KJ5IE5W"
                },
                "Date": "on August 7, 2012",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29CUCGRX04TS8"
                },
                "Date": "on August 19, 2002",
                "Helpfulness": 0.25,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D5UNK2DAJ5SR"
                },
                "Date": "on November 5, 2012",
                "Helpfulness": 0.25,
                "StarRating": "1",
                "Text": "It is rare ever that I have not finished reading a book. I love to read and always have a book on hand- whether it's my Kindle or an author I collect. This book was really hard to get through. I have never read Tim Powers before and would be reluctant to read another of his books. The beginning of the story and the idea of the story was great and I was sucked in right away but then something happens and it was just too \"jumbly\" in the middle and several times I wanted to put it down. But in the spirit of \"giving it a chance\" to redeem itself- too little too late."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10LWN643498R1"
                },
                "Date": "on February 21, 2011",
                "Helpfulness": 0.37037037037037035,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OIFRCSFEB3VZ"
                },
                "Date": "on July 31, 2013",
                "Helpfulness": 0.1111111111111111,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3O57FAG9I566G"
                },
                "Date": "on October 23, 2013",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": "I just could not get into this book.  With a name like Anubis Gate, I expected a greater Egyption presence in the book.  Needless to say the title is a little misleading"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DEQO8TOZR2U1"
                },
                "Date": "on May 17, 2012",
                "Helpfulness": 0.15384615384615385,
                "StarRating": "2",
                "Text": "Tim Powers is a writer of considerable ability who lacks sufficient discipline. This novel has everything in it but the kitchen sink. The flashbacks and flashforwards are okay, but when the werewolves came in to an already rather complicated tale of Egyptians/Gypsies/London pickpockets/wacky American scientists/English professors I sort of lost interest. The best part of the book by far is the fragment at the beginning by William Ashbless, \"The Twelve Hours of the Night\", which is excellent. I think Powers should switch to poetry and drop his prose career."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YO9Z241U5VJI"
                },
                "Date": "on January 7, 2015",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": "Well , never read any thug by him, an never will again"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AB3511A53HZM"
                },
                "Date": "on September 1, 2004",
                "Helpfulness": 0.29411764705882354,
                "StarRating": "2",
                "Text": "This novel is just one or two rungs above ususal low-level fantasy stuff. Supposed to be wonderful but definitely not. Quite imaginative but undescriminating and with oh-no-not-again slugs of action too much like a movie, and with the author being an English teacher he ought to know better -- supposed to be very \"well researched\" but not really, it reads like it was writen by a bloke who writes for a hobby and has a dead shaky understanding of the setting in terms of language, politics, culture, etc. Nor can he bring characters to life or make people or situations attractive so he just throws in more distr-action. Not a fan. Wouldn't read any more of his."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8DWGIAHI5DMW"
                },
                "Date": "on February 16, 2013",
                "Helpfulness": 0.16666666666666666,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27ZSE4JO37KU8"
                },
                "Date": "on July 1, 2000",
                "Helpfulness": 0.16666666666666666,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AL3KV6YU2S71Q"
                },
                "Date": "on August 7, 1999",
                "Helpfulness": 0.3230769230769231,
                "StarRating": "1",
                "Text": "Powers ranks for me with Robert Heinlein and Piers Anthony -- wildly popular authors who are hopeless writers.  I tried to like this book.  I REALLY tried.  In the end, the whole thing is a mess, beginning to end.  I  have read many books with non-linear plots; Powers can't handle this.  I  have read books with outlandish characters; Powers can't pull through.  I  have read historical fiction/fantasy; Powers does not know from whence he  speaks.  I have read works of occult fiction; Powers knows nothing.  I went  into this book never having read any of his works and having it praised to  the skies by no less than four of my friends -- I now wonder at their  tastes.  The characters are flat beyond compare, the plot is in its best  points contrived, in its worst points hopeless, and even the use of  \"thieve's cant\" is wrong, wrong, wrong.  My god, it is easy to  pick up Dickens and get more of theive's cant than Powers has!  This book  is revered and I know I will shift few opinions, but I must give this a  poor review.  Don't read it.  It is not worth the effort."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A234LZY8YEUKT6"
                },
                "Date": "on July 15, 2012",
                "Helpfulness": 0.13636363636363635,
                "StarRating": "1",
                "Text": "I am a sci-fi/fantasy junkie, and hated this book. The excessive number of unnecessary characters and subplots made it hard to follow, and Powers had to resort to dei ex machina several times to close them out. The middle third of the book read like a bad James Bond movie on steroids, with the principal character being chased by either 4 or 5 separate groups. The last 50 pages were pure looney-tunes. Good fantasy sets itself rules, and lives within them - this book did not."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Anubis-Gates-Ace-Science-Fiction/product-reviews/0441004016/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "190"
    },
    "Salesrank": "#150,842",
    "Timestamp": "2015-05-24 23:30:13.346752",
    "itemurl": "http://www.amazon.com/Anubis-Gates-Ace-Science-Fiction/dp/0441004016"
}
