{
    "Category": "in Books (",
    "ListPrice": "$15.99",
    "Name": [
        "This Book is From the Future: A Journey Through Portals, Relativity, Worm Holes, and Other Adventures in Time Travel"
    ],
    "OfferPrice": "$10.22",
    "Reviews": {
        "AverageStarRating": "3.6 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37BUQBHAJ76JZ"
                },
                "Date": "on September 7, 2012",
                "Helpfulness": 0.9047619047619048,
                "StarRating": "2",
                "Text": "This book is not well written. On almost every page, an idea is mentioned and then we are told that they will discuss this at a later chapter. This is constant! Any writing textbook will tell you that this is bad writing. Don't bring it up until you are ready to discuss it. Also, the text has many LONG lists of movies or TV shows that talked about time travel. Who cares? This is not giving me any information I can use, or expanding my knowledge. I got a little more than 1/3 through this book and gave up. Not worth reading."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24505CR98NLLV"
                },
                "Date": "on June 26, 2012",
                "Helpfulness": 0.7857142857142857,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RKTZEA53C8U4"
                },
                "Date": "on March 10, 2013",
                "Helpfulness": 0.6923076923076923,
                "StarRating": "1",
                "Text": "Great topic.  Too bad it was written for fourth graders.  Well, actually written BY fourth graders.  Bad writing, terrible editing, typos everywhere.  Ideas don't follow through.  Science is mixed up with and confused by \"science\".  The \"guest writers\" are even worse.  I could go on and on.  I might detail the horrors of this mega-piece later, but trust me, it's a jaw-dropping creation of stupidity."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3W5S4MMKUO02"
                },
                "Date": "on February 10, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I really liked this book!  I don't know what made me want to read about time travel.  (too much Fringe?)  ...but whatever the reason, I'm glad I read this book.  Written in an entertaining way.  Fun read!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LA7KQ53RW687"
                },
                "Date": "on July 27, 2013",
                "Helpfulness": 0.5,
                "StarRating": "2",
                "Text": "The authors clearly did not do thorough enough research. I was familiar with many of the stories they cited, but they had a lot of details incorrect. I never finished the book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26OG41U871YTV"
                },
                "Date": "on December 10, 2012",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "There is so much here to digest. If books were meals, this would be a 3-day Thanksgiving. Larry Flaxman makes the meal very digestible."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AM0BSCZLN3O5F"
                },
                "Date": "on February 15, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "It's good to find out that nobody knows about time travel as of now. I've gone back in time for very brief moments. It was like short movie travelers in glorious black and white. Both times were mundane things but answered a few things that happened to me that I never remembered. Yet, I loved the book!"
            }
        ],
        "ReviewUrl": "http://www.amazon.com/This-Book-Future-Relativity-Adventures/product-reviews/1601631502/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "7"
    },
    "Salesrank": "#1,078,232",
    "Timestamp": "2015-05-24 13:34:01.211582",
    "itemurl": "http://www.amazon.com/This-Book-Future-Relativity-Adventures/dp/1601631502"
}
