{
    "Category": "in Books (",
    "ListPrice": "",
    "Name": [
        "Michael, Brother of Jerry (Dover Books on Physics)"
    ],
    "OfferPrice": "$7.99",
    "Reviews": {
        "AverageStarRating": "4.4 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1W35V38UIWVPS"
                },
                "Date": "on March 9, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I happened across this book while looking for stories about Irish Terriers.  I wouldn't normally read Jack London; his stories always seemed more to my brother's liking.  However, this book quickly grabbed me because a lot of it is written from the dog's perspective.  And those passages are spot on.  Michael reminded me so much of my own Irish Terrier and how he thinks and reasons.  It really got to my heart.  When I finished reading, I made a donation to the ASPCA.  And although I don't know much about Jack London, I'd bet he had an Irish Terrier himself, for sure."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQ55H30MZSV0Q"
                },
                "Date": "on August 15, 2007",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJPIFU1GCJ33Q"
                },
                "Date": "on June 11, 2004",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3R6TYGEVJ1DIN"
                },
                "Date": "on December 29, 2006",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is a wonderful book, as is its prequel, Jerry of the Islands. It's a great dog story. But be warned, if a child is to read this book it should be under the guidance of an adult prepared to explain the extremely racist characters and situations.  The story is no fluffy puppy story. It is exciting, the locations exotic, but some of the situations are brutal - it's a Jack London story after all, and the 'N' word appears at least a million times.  Still, I'm not one for censorship, and it is a great opportunity to talk about just what happened to people of color, how they were treated, and why they might be justifiably angry about it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35DDC8MZVUNFT"
                },
                "Date": "on May 20, 2003",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "JL was great at writing from the animal's point of view. you get the feeling he knew what he was talking about. there is no way you can read this book without feeling that the dog is a person, but also that this is a very realistic way of describing the dog's life. a dog gets kidnapped by a man, who turns out to be  a rather nice fellow. adventure in this story, great dog psychology which always amazes me. i won't give away the dog's adventures but they are interesting, there is a lot of lovely details and particularly detailed descriptions of how the dog thinks, and the story is touching on a very human level."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VU2IFN9NTWN1"
                },
                "Date": "on June 13, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Michael Brother of Jerry is an excellant sequel to Jerry of the Islands. Jack London sure knew how to write a book and make you feel as though you were actually in the story. These stories would be as popular today as then if not for a politically correct world we live in. Some of the statements made would not fit very well with todays race sensitive attitudes in this country. All that being said however it is a very good story and I highly recommend it if you like adventurous tales. Good book and the ending will leave you smiling."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QN1SJPR6L552"
                },
                "Date": "on November 21, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQ55H30MZSV0Q"
                },
                "Date": "on November 24, 2007",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This is London's expose of the training used for animal acts of the day, which starts in the Soth Pacific, using his South Seas experiences. London was sick, tired and depressed during this period of his life and it is not among his finest writing but is powerful stuff, as is all London."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ARUNQPJEEDML"
                },
                "Date": "on September 11, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "No slow spots in this book! This sequel to Jerry of the Islands is worth the read."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Michael-Brother-Jerry-Dover-Physics/product-reviews/1491088265/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "9"
    },
    "Salesrank": "#6,448,794",
    "Timestamp": "2015-05-24 13:12:47.453013",
    "itemurl": "http://www.amazon.com/Michael-Brother-Jerry-Dover-Physics/dp/1491088265"
}
