{
    "Category": "in Books (",
    "ListPrice": "$14.95",
    "Name": [
        "The Direction of Time (Dover Books on Physics)"
    ],
    "OfferPrice": "$13.46",
    "Reviews": {
        "AverageStarRating": "4.1 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A282NT6X75ETCF"
                },
                "Date": "on July 25, 2000",
                "Helpfulness": 0.9411764705882353,
                "StarRating": "3",
                "Text": "If you didn't know, this book is hard.  I am a first year engineering student, and I felt lost through most of it.  I gather it was intended for full-fledged physicists, but I was intrigued to read it anyway because of a  philosophical thread running through the work. But beware--get ready for  some Immanuel Kant and Einstein in only the introduction.  This book is as  much about the physics of time as the philosophy concerning subjectivity of  time.  Even though I didn't understand a lot of the probability or almost  any of the quantum mechanics math, I still got some pleasure out of some of  the more bizzare conclusions of the book.  Did you know that for an  isolated system (one not interacting with any others), time can't be said  to have any direction?  Furthermore, time as we know it is just a  statistic.  Another interesting fact is that on the quantum mechanical  level, there is no such thing as time!  If these things intrigue you (and  you know what a double Riemann sum is) go for this book.  Otherwise, be  very afraid..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EC1IG3LOB0NF"
                },
                "Date": "on March 24, 2001",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "It is a beautiful but exterememly difficult book. It covers the concept of time and direction of time from the beginning up to current thinking. Author, being one of the founding fathers of philosophical quantum theory first introduces a good understanding of Thermodaynamics and Statiastical Physics and defines the order of events to lead into statistical definition of arrow of time. A lot of difficult concepts from Classsical Statistical Physics, Probability Theory, Relativity and Mathematical Logic as well as a good understanding of Quantum Physics is assumed to be in the bag of the reader, after all this book is not a Popular Science book.  Although the author claims that knowledge of derivations of the formulas used are not critical to understand this study yet time to time the language and logic becames exteremely difficult. This is a must read book in this subject, may be many times or time and time over after increasing the understanding in other subjects that only tools in this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5F7GXHQY6C5P"
                },
                "Date": "on June 15, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3WFVPQMUPY7A"
                },
                "Date": "on May 31, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VXVH4P85N73K"
                },
                "Date": "on October 1, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16XUHEYEYF8TB"
                },
                "Date": "on December 15, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2809U2S14N0K1"
                },
                "Date": "on July 12, 2012",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OSXYFCT53MOI"
                },
                "Date": "on March 31, 2002",
                "Helpfulness": 0.6,
                "StarRating": "5",
                "Text": "H.Reichenbach is undoubtly one of the most remarkable scientists that the world has ever witnessed.  The interested mind is to be very strongly urged to read the book 'The direction of time' by him. Time is an essential concept to every physics student, as without it nature would be meaningless, and therefore the study of nature would be an empty pursuit. Whenever we wish to understand why we are in the 'world', say rather than in the planet MARS we have to understand thoroughly what actually happenned in the past, beginning from The Big Bang, that is, from the beginning of time. The book gives us a clear understanding into this inquiry ('TIME') developing both classical and quantum mechanical content of the concept of time starting from the first principles. The book carefully clarifies many confusing conceptions about time. For instance, the author clearly explains the contradictions lying in  the famous Zeno's paradox which attemts to prove that time does not exist, in such a way that the physics student is now much more confident with such essential concepts  as displacement and velocity. Also in the book, another essential concept of statistical physics ENTROPY is developed in a very systematic way and through this concept the direction of time is decisively established. Moreover, the issue of DETERMINACY or INDETERMINACY , an issue which is simply ignored in the text books or mentioned briefly in a few sentences as if it is self-evident and therefore does not need further elaboration, is discussed in depth, so both theoretical and experimental physicists have now a strong ground in arguing their proposals. I, as a physicist of 18 years of university lecturing experience, strongly recommend it to every single physics student or actually every single mind (student or not) who cares about the future, and who needs a decisive explanation (justification) for their potential steps to save (before being too late) our home THE WORLD WHICH WE NOW LIVE IN, only home only home and only home for us and for our childeren including of course our organic bodies, the animals and the plants. The direction of time and equally of The ENTROPY are the key concepts to understand what technology actually is, and to understand why it is inevitable to face more and more polluted environment as technology advances."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30QVS14SHS2O4"
                },
                "Date": "on March 30, 2009",
                "Helpfulness": 0.4444444444444444,
                "StarRating": "2",
                "Text": "I think it was a good thing that Reichenbach never published the book: if only his wife had not found the manuscript and published it posthumously. Upon reading the second chapter I was astounded at how dismissive he was about identity and persistence. He makes a controversial presumption about identity without any arguments for why he presumes such identity and without giving anything close to identity criteria. He then glosses over the problem of identity through time, whether endurantist or perdurantist or whatever. And he claims to be a philosopher! These are such important issues in the philosophy of time, in philosopher in general. That said, this is not so much a book about the philosophy of time as it is about the philosophical foundation of statistical mechanics: whether statistical mechanics is a good explanation for the second law of thermodynamics or not. And this is where Reichenbach fails. Instead of dealing with the philosophy of statistical mechanics, per se, he wants to validate its worth by giving it a sound mathematical basis using probability. That is not philosophy at all. But the worst is his seemingly ad hoc explanation for why the universe is moving from a low entropy state to a high entropy state by dealing with the symmetry problems in statistical mechanics, that is, the symmetry of Newtonian physics and the statistical postulate with respect to time. He posits a branching system, which has been updated by Paul Davies in \"The Physics of Time Asymmetry\". Reichenbach's branching system is just absurd! He gives two arguments to buoy up his branching system: i) an idea of a causal chain that creates a net, which is open and ii) a probability lattice. Now I realize that he comes up with very sound math to prove the soundness of his probability lattice, but correct math does not a universe make. The probability lattice, while requiring a suspension of disbelief to analogize it to his branching system qua explanation of why the universe came from a low entropy state towards a higher one and why there \"seem\" to be entropic subsystems (e.g. a fully formed ice cube melting in a glass of water), is predicated on Reichenbach's belief that the arrow of time is explained by the phenomena of cause and effect as a open chain that creates a net. For him, a cause is an interaction and an interaction creates a subsystem which branches off of the overall trajectory of the entropy of the universe. I have no idea what this means. Why is cause an interaction and what is an interaction exactly? Does cause and effect have to be the working of occult powers? What causes interactions? Can interactions be caused, since by definition they are causes? None of this makes any sense despite his valiant and tedious efforts to back up his theories with a mathematical foundation. But, this is philosophy, not theoretical mathematics. And all his theories, or more accurately, his equations, seem to make statistical mechanics more complex and fantastical than needed or wanted. There is no elegance here. There is, however, a hodgepodge of equation after equation for ever more complex and incoherent theory after theory, without any rigorous analysis or argumentation from a philosophical standpoint."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Direction-Time-Dover-Books-Physics/product-reviews/0486409260/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "9"
    },
    "Salesrank": "#1,000,200",
    "Timestamp": "2015-05-24 13:13:25.070198",
    "itemurl": "http://www.amazon.com/Direction-Time-Dover-Books-Physics/dp/0486409260"
}
