{
    "Category": "in Books (",
    "ListPrice": "$109.95",
    "Name": [
        "Basic Electricity: Complete Course, Volumes 1-5 in 1"
    ],
    "OfferPrice": "$70.70",
    "Reviews": {
        "AverageStarRating": "4.7 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WF7OK2NLSYW7"
                },
                "Date": "on October 14, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I first read volumes 1-5 ten years ago when I started working as an elevator technician. My copies are third time hand-me-downs of the original 1954 publication. These are without a doubt the most helpful books I have ever read on basic electrical theory. Each topic is clearly and concisely explained and forms a building block for further topics in the series. These books form the foundation of knowledge I use in everyday real world applications. The authors explain each principle with reference to real world examples to allow the reader to relate what they have read to what they have seen."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2T8R019J5K029"
                },
                "Date": "on March 20, 2001",
                "Helpfulness": 0.9710144927536232,
                "StarRating": "5",
                "Text": "Absolutely the best book I've found to explain electricity, in the most simplictic form.  I'm a person who learns through visual diagrams and this book is chaulked full of easy to understand drawings.  Each chapter ends with a review section to reiterate what you've learned and a self-test that follows.  Excellent book!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on September 15, 1999",
                "Helpfulness": 0.9661016949152542,
                "StarRating": "5",
                "Text": "This book is better than all the other selfteach manuals presently on the market.It is not hypermath or over-simplistic.It saved me over $2000 in trying to learn electronics from a correspondence school.If you want to  travel on a journey through electronics, this book is your first step!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AU36P7B7F3RYM"
                },
                "Date": "on December 26, 2000",
                "Helpfulness": 0.9333333333333333,
                "StarRating": "5",
                "Text": "After 30 years of doing \"other things\" I decided to refresh my knowledge of electrical principles learned in the military.  This book is excellent because it starts at the very beginning and builds, one concept on another, with ample photos and illustrations, to allow you to truly understand what you are reading.  If you want to learn about electricity and don't want to go take a course to do it, this is the book...even if you don't know anything at all about the subject!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GXCQE9Y9TCXP"
                },
                "Date": "on September 11, 2004",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVMLMV2SSPY65"
                },
                "Date": "on April 25, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33DWT2APDBNX6"
                },
                "Date": "on July 3, 2005",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Although basic as the title suggests, it is an excellent text with lots of problems and explanations for those requiring a technician's understanding of practical electricity using ELECTRON FLOW. One can breadboard a lot of these circuits and test circuit analysis concepts. Don't expect an electrical engineering circuit analysis book;  for that purpose, get Mr. Van Valkenburgh's Engineering Circuits, or Bobrow's excellent Elementary Circuit Analysis and Fundamentals of Electrical Engineering."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 17, 1998",
                "Helpfulness": 0.9523809523809523,
                "StarRating": "5",
                "Text": "Great self-study guide for adults who need a thorough understanding of DC and AC.  Originally published for the Navy in 1954 (the excellent drawings and illustrations all have the the campy look of that era), this is still one of the best texts I've ever seen on basic electricity.  Highly recommended!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2T2QKRT6EW57Z"
                },
                "Date": "on August 3, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I also own the Bureau of Naval Personnel's \"Basic Electricity\" and Mike Holt's \"Basic Electrical Theory\".  While I really like Holt's book, and the Bureau's book is a good one, this is one better.  Since it was first published in 1954, you may find the illustrations and graphics (did they have \"graphics\" in 1954?) a bit dated.  On the other hand, I think they help explain the concepts very well."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A123L0P2ZF0ATZ"
                },
                "Date": "on August 27, 2004",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book is definitely the most informative basic electricity book that I have found, and it is also the easiest to understand and follow.  It starts at the very basics of electricity and then introduces new concepts in a logical, easy to follow manner.  The author does an excellent job of fully explaing new concepts before expanding and building further upon them."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on January 3, 2003",
                "Helpfulness": 0.9230769230769231,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25S1RM3W4NU6W"
                },
                "Date": "on July 3, 2005",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book is one of the finest books on electronics you can find. Yea, sure you will find some few bad diagrams here and there (very few, actually), but because the book is written so well, you'll know what the author really meant. I really cant give this book anything less than 5 stars, i absolutly love it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A137K0C0H5I1M8"
                },
                "Date": "on July 4, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39HQ18PG57ADO"
                },
                "Date": "on October 30, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I first discovered this book about twenty five years ago, when I was a teen.  I distinctly remember devouring this book quickly.  The concepts are clearly explained in a manner that is very easy to grasp without a mathematics background.  The diagrams  are extremely well done.  Some of the circuit diagrams are quaint by todays' standards, but for me that just adds to the appeal.  Without this book, it is doubtful  whether I would have chosen electrical engineering as a career."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FW82LRJ9HRXB"
                },
                "Date": "on January 7, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Read this book from cover to cover with no problems. I am truly amazed at the quality of information it contains. It is slightly repetitive as you move from chapter to chapter, but this helps me ingrain knowledge. Many might find this off putting, but it works great with my memory! If you are interested in this subject, read this book from cover to cover, and you will be right on track for many more advanced topics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AU5EFK1T2FK99"
                },
                "Date": "on February 12, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is the best book on electricity I have every read! I have read a number of entry level books on electricity and all of them have fallen short. The key to this book is its order of presentation. When explained in the proper sequence it is much easier to grasp the topics. If you are looking for a book that will give you a rock solid foundation in electricity then this is the one."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1L5G5NTGTCCOH"
                },
                "Date": "on January 26, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26HKU3ZJ5M0TF"
                },
                "Date": "on April 16, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I bought this book at the suggestion of an electrician to give to my son who has an interest in electricity. My son is 39 and has told us that it is exactly what he needs starting out with the basics. John, Oregon."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SJWAPNGMFLNS"
                },
                "Date": "on July 22, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Very useful book. The authors do not jump in to the equations but take the time to explain the nature of electricity. As a software developer, this book is proving to be a very nice read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RXKENTAKMKQ4"
                },
                "Date": "on April 7, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Basic Electricity Complete Course, Volume 1-5 was perfect. I taught me everything I needed to Know. The first chapter started with explaining what causes electricity, in such a simple way that anyone could understand. and every chapter after that is just as good. When you have completed this book you will know complex circuits, motors, generators, single phase, three phase and much more. I highly recommend this book to anyone interested in the electrical field or just want to understand electricity."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A313H9VAQMUB97"
                },
                "Date": "on September 22, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I have read a pretty good ways into this book so far and it has been great. It explains the theory of electricity, how it all works and how it is produced and whatnot. It is really pretty great. I knew very little of how electrical stuff actually worked, this has filled in a lot of blanks for me, but I still have a lot more to learn."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACE6L5MD5CPRX"
                },
                "Date": "on February 27, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Explained from the point of science and now I understand. I always want to know why I am doing something so, in case I get into a situation I've never come across, I can think my way out. The info in this book allows me to do that. The graphics are very dated but really have no negative impact on the info whatsoever."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3S6H4FPU21H9I"
                },
                "Date": "on August 12, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RX6Q7UF4H43W"
                },
                "Date": "on December 14, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "I bought this book to study for a basic electricity test. This book did a really good job of breaking down the concepts so you can understand the material. good and very informative."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ADGU7DHGDDLT"
                },
                "Date": "on March 11, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AROWXR20LRRFG"
                },
                "Date": "on January 30, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Originally had a copy of book as part of course in mechanic school. Gave it away and have always missed it. Bought this copy to refresh what I have forgotten. I will keep this copy.Covers every phase!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A323KF1EQSWBIQ"
                },
                "Date": "on July 18, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book is easy to read and very clear. I would recommend it to anybody interested in learning more about electricity. I can read this like a novel and sometimes I can't put it down."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SG2XKLDLCPL5"
                },
                "Date": "on February 19, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is a very good book for those with an inquiring mind. If you make it to 5 you get a gold star."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NMG219N725ZJ"
                },
                "Date": "on February 7, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MV87I10GCJB3"
                },
                "Date": "on December 29, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "For over 40 years I tried to find an introductory book on electricity that was readable to the non-professional and non-science student. With this book, I finally found it. What most authors \"explain\" in a page, these authors explain in ten pages—and it makes a big difference."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3V1NSLKIUUPK8"
                },
                "Date": "on December 13, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I would have to say that this is a good book.  But I am just starting to learn about electricity, I have to read the sentences two or three times before it starts to sink in.  I think it is a good learning tool. My experience so far is that learning electricity is not easy."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Q1VJ9TWIZEYS"
                },
                "Date": "on July 25, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "It helped me to understand to the point I can now deal with the basic electrical issues at home. Great book. Great service from the vendor."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TXXODMRJGCJ1"
                },
                "Date": "on December 13, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This was for my husband.  The book was in very good condition.  He is very happy with it and uses it regularly."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XVI1B7CRCYW3"
                },
                "Date": "on July 20, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Awesome for the basics and beginner. I have not seen better and I have reviewed many."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEA1QCBEWM2FB"
                },
                "Date": "on December 31, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "very informative book just goes a weird way of explaining but overall good book"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AV2QFR9VNSZ0B"
                },
                "Date": "on October 16, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Easy enough for training employees, which is all we need."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BY3Z4BAN0EPH"
                },
                "Date": "on February 26, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Fun to read. The favorite book on electricity in my lab."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AASR7AIHCNUEO"
                },
                "Date": "on March 19, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Great Book for learning the basic"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39DVQ5J6GVSNM"
                },
                "Date": "on January 17, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Good"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36K9XCBZIISOF"
                },
                "Date": "on November 14, 2011",
                "Helpfulness": 0.4,
                "StarRating": "4",
                "Text": "If some one would like to find the basic theory of electrical and circuit book ; this book is match your requirement. I am working for electrical service business more than 20 years . Right now I use this book to recovery my technical knowledge to explain some strange behavior in my job."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35DNVCVAFTT6W"
                },
                "Date": "on November 19, 2010",
                "Helpfulness": 0.25,
                "StarRating": "4",
                "Text": "Very good book as it takes a step by step approach to explaining the basics of electricity.  Would say it is well worth the price to have for beginners or ???"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3U5EA3DMKRQ3H"
                },
                "Date": "on February 14, 2005",
                "Helpfulness": 0.5471698113207547,
                "StarRating": "1",
                "Text": "All these posts must be by people who didn't actually take the time to READ THE BOOK!!!!! All I have to say is that the direction of current flow shown in the diagrams is either wrong, or varies widely between conventional and electron theory. For example, on page I-41 they show electron theory current flow from a battery through a lamp in the right direction (negative to positive), but then later in the section discussing Ammeters pages I-95 through I-104 they consistently show current flow going in the WRONG DIRECTION. Obviously the person who did the diagrams was confused and no one did a good job checking their work. This is the kind of thing that is terribly confusing for a person trying to learn \"BASIC ELECTRICITY\" and is just plain sloppy. I want my money back!!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18S51XCL633I6"
                },
                "Date": "on January 25, 2011",
                "Helpfulness": 0.125,
                "StarRating": "5",
                "Text": "This book arrived in perfect condition and the shipping was prompt enough to reach us before Christmas.  Thank You for the great product and customer service.  This was a gift so we aren't able to provide a review for the book itself.  Thanks!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JEWEYL6Y49ED"
                },
                "Date": "on September 25, 2007",
                "Helpfulness": 0.0625,
                "StarRating": "5",
                "Text": "TO TEACN A 15  YEAR OLD BOY BASIC ELECTRYC AND BASIC TUBE CIRCUITS BEFORE HE BEGININGS SOLID STATE ELECTRONICS BY HIS GRANDPA."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1D7HM0MMEAKUN"
                },
                "Date": "on November 17, 2010",
                "Helpfulness": 0.12903225806451613,
                "StarRating": "1",
                "Text": "Book was a disappointment as it was very dirty and we did not feel was worth even looking through the book. Seller misinformed."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Basic-Electricity-Complete-Course-Volumes/product-reviews/0790610418/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "45"
    },
    "Salesrank": "#51,619",
    "Timestamp": "2015-05-24 13:35:30.404099",
    "itemurl": "http://www.amazon.com/Basic-Electricity-Complete-Course-Volumes/dp/0790610418"
}
