{
    "Category": "in Books (",
    "ListPrice": "$64.48",
    "Name": [
        "Physical Science"
    ],
    "OfferPrice": "$194.56",
    "Reviews": {
        "AverageStarRating": "3.9 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NGQFW72QK0SU"
                },
                "Date": "on February 22, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Good book for beginners to science. The math equations are explained well. There are a lot of examples to confirm what you learn.  Great illustrations for driving home the concepts learned. If you ate a visual learner, this book is great."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21O0SOOT1PII8"
                },
                "Date": "on May 9, 2015",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "Condition said \"good\" and definitely should have been \"acceptable\" which I likely wouldn't have bought. Cover, spine, and pages were all pretty worn and there is a decent amount of highlighting and marking in it though all of the text is still legible. Only reason I didn't do two stars is because I only paid $23 for it, though it is 3 years old and some of the material is outdated. No idea why my teacher had us get an old book. The main problem I have with the book however is that 8 pages in the middle of the book just started falling out when I got to it and the binding is noticeably messed up there. I take good care of my books too as well the fact that I hardly opened the thing until midterms so I'm pretty positive the binding and pages were on the brink before I got it. I understand they were still attached when it was sold to me but I looked up the condition descriptions for books and even before the pages fell out the book falls under \"acceptable\" considering the wear and amount of highlighting. I am pretty late getting to this review and I have filled all of my science requirements now so I won't need another textbook but the point I want to make is Mr. Tillery please be more thoughtful and/or honest with your condition ratings. I would assume you don't heavily rely on selling $23 used textbooks for income so please be more careful with it. For what I did read of it I thought was well written and engaging for science being my least favorite subject but I don't like buying really worn down books so Mr. Tillery expend a little more energy and do more work on your objects by looking through them harder before you sell them."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HUJ85JGH901X"
                },
                "Date": "on February 25, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Although I believe this text is too advanced for mid-tier sections of 9th grade physical science, it is perfect for honors sections, or for more advanced students of other sciences to use for a review.  It has just about everything covered, is well written, and is laid out in a readable manner, with just enough illustrations to support learning, but not so much as to be too busy."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19VU3SRGA1K7G"
                },
                "Date": "on November 16, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Required for coursework in Physical Science with lab. Book is well organized, full of great information and pictures. End of chapter self-tests, questions for thoughtful response. Summarizes calculations explained in text."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQESVN6EWPTKS"
                },
                "Date": "on September 26, 2014",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": "Be aware that this is not compatible with a Kindle!  Only works on an iPad or my MacBook. I was unaware os it is very inconvenient that I cannot bring it on my Kindle to class, as I intended."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZQKHXVLE3EH6"
                },
                "Date": "on February 15, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "With the price of school books today, I was happy to find this on amazon. Though a bit worn, it serves the purpose. Excellent buy."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VPOPHTOKO488"
                },
                "Date": "on February 14, 2013",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "They did not send me the book they showed. I think the one  they sent me is the older version because the cover is different"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1M89LK6OD2M5N"
                },
                "Date": "on January 25, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "of great help same material even though it is a different edition i got an A in my physics class thanks to this book ;-*"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DZS208FV03JK"
                },
                "Date": "on August 2, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "A great textbook for a student has already taken a basic Physics and/or Chemistry class.  Easy to read and understand."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10R2LTBQKSNVL"
                },
                "Date": "on March 27, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Usually when it comes to physical science I am lost, but this book described everything very well. very good book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHKBROT2UAFJZ"
                },
                "Date": "on July 25, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "It was as described and arrived in time. The book itself is pretty good, easy to read and has great exercises."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABB9ZM9LHO68U"
                },
                "Date": "on March 13, 2013",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "It is a great source for helping me with my course work for college.  It will be helpful in the future."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A526ZGXITBECX"
                },
                "Date": "on February 12, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "This book was a basic science book. I hardly had to use it so I didn't get much from it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PUWG3HEB7NN9"
                },
                "Date": "on September 6, 2014",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": "Not as described!  Terrible shape.  Should have been listed as \"FAIR CONDITION\""
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8HUAKA4MAOYP"
                },
                "Date": "on November 23, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book was delivered to me exactly as described.  Thank you."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HYEAFEWTCNQI"
                },
                "Date": "on February 9, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Just as described thanks"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14UUJMRQ6ULRV"
                },
                "Date": "on July 6, 2014",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "I took physical geography last semester and now I'm taking this. I wish I still had last semester's book. I have a suspicion that they were both written by the same people. The material appears to be identical. The book does the job, but it's not cheap considering it's just a repeat of my last class."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CHKSICR9YL5L"
                },
                "Date": "on January 8, 2012",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "Received text quickly. Book is in good condition. Only con is the end of chapter reviews were completed in ink. Would have been better if written in pencil so I could erase the answers."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANSVP50E0SR8Z"
                },
                "Date": "on June 23, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "This Book was in really good condition it had some writing but not a big deal. It has no liquid spills. And the pages/ conver was intact!!! I Am really happy with my book!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28DZT5S4BCOKL"
                },
                "Date": "on September 2, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Everything worked out great.  I love the idea of getting discounted books for college.  The quality of the item was good and it arrived in a timely manner.  Thanks!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3B0Q4QO9E2CW9"
                },
                "Date": "on July 3, 2013",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": "When I ordered this it was suppose to be the text book not the work book so I wasted my money on something I couldn't and didn't use."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BW6Z37VMB3H9"
                },
                "Date": "on September 14, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "The book came quickly and at a great price so very pleased since I don't really wanna take this class but its on my degree plan:(!!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1P3SQDGCAYL8S"
                },
                "Date": "on February 12, 2013",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "This book was in great condition and was a great price but for the class that I bought it for I never ended up using it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARGGW4NZL3RX6"
                },
                "Date": "on November 24, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Yay"
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Physical-Science-Bill-Tillery/product-reviews/0073512214/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "24"
    },
    "Salesrank": "#72,370",
    "Timestamp": "2015-05-24 15:35:46.990539",
    "itemurl": "http://www.amazon.com/Physical-Science-Bill-Tillery/dp/0073512214"
}
