{
    "Category": "in Books (",
    "ListPrice": "$70.00",
    "Name": [
        "Band Theory and Electronic Properties of Solids (Oxford Master Series in Condensed Matter Physics)"
    ],
    "OfferPrice": "$64.75",
    "Reviews": {
        "AverageStarRating": "4.0 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AG35NEEFCMQVR"
                },
                "Date": "on June 8, 2004",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QUC51QJS7FJ"
                },
                "Date": "on January 20, 2006",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "This book is a good bridge between very abbreviated descriptions of solid state physics found in most EE semiconductor device books and a tome like Ashcroft and Mermin's standard Solid State Physics book. It is mainly descriptive and elementary (the Boltzmann transport equation is barely mentioned). I like it because the author often plainly says useful things like the effective masses of electrons and light holes are similar, or that the heavy hole masses are pretty much the same for common semiconductors. The coverage of optical properties is minimal, apparently by design since the book is part of a series (Optical Properties of Solids by Fox)."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVI3SQE2617T4"
                },
                "Date": "on November 19, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I found the appendices to be useful for references. The text and derivations in the main part are short on detail. So the main text is probably better suited as a quick guide reference for people that already have an understanding of the material. Or for those who really want to get a better understanding by working out all the derivations on their own."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SH26PV1JXT01"
                },
                "Date": "on August 31, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The text is pretty advanced but if you can trudge through it, you'll have a beyond-grad level understanding of band theory.  Especially useful for materials and semiconductor folks."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29JX6RD5YU8OD"
                },
                "Date": "on April 26, 2010",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "3",
                "Text": "This book offers a pretty decent overview of band theory, but it's woefully lacking in detail, especially in the later chapters, which seem to get progressively more qualitative.  You shouldn't rely on this book to give a thorough knowledge of band theory, but it's worth reading.  I think it would be especially useful when preparing for talks, because the explanations in the book are pretty easy to understand."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Theory-Electronic-Properties-Condensed-Physics/product-reviews/0198506449/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "5"
    },
    "Salesrank": "#211,326",
    "Timestamp": "2015-05-24 15:34:57.456654",
    "itemurl": "http://www.amazon.com/Theory-Electronic-Properties-Condensed-Physics/dp/0198506449"
}
