{
    "Category": "in Books (",
    "ListPrice": "",
    "Name": [
        "Chemistry: Concepts and Problems: A Self-Teaching Guide"
    ],
    "OfferPrice": "",
    "Reviews": {
        "AverageStarRating": "",
        "MaxNumReviews": 15,
        "ReviewList": [
            {
                "Author": {
                    "Helpfulness": "97%",
                    "Location": "Psychologist in Australia",
                    "Name": "Eve",
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11LKGR7ZJJEDC/ref=cm_cr_pr_pdp?ie=UTF8",
                    "Ranking": "#38,523"
                },
                "Date": "on September 28, 2003",
                "Helpfulness": 0.9770114942528736,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 23, 1998",
                "Helpfulness": 0.9846153846153847,
                "StarRating": "5",
                "Text": "I am going back to school in the fall to start Pre-med. I hadn't taken chemistry since high school (my previous B.S. was in the arts, not science!) so I figured I'd review the basics to give myself a head start on my classes. This book is even better than I expected. It doesn't only contain information to read, it also allows you to interact with the material, solving problems, answering questions, and working formulas. Because learning by actually doing is so effective, this book has taught me more than I would have thought possible. I now feel more prepared for my courses, and am looking for more books in this series to give me a similar boost with calculus and biology. I highly recommend it. It makes a challenging subject very clear and understandable."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 2, 1999",
                "Helpfulness": 0.9607843137254902,
                "StarRating": "5",
                "Text": "As a teacher myself (but one who knows nothing about chemistry), I must comment on this excellent book.  It is clear, organized, and well-written.  The authors have taken a difficult subject and made it understandable.  I  feel as though I am much better prepared for the college chemistry course  I'll be taking in a few months - and I even think I will enjoy it!  Thank  you for this great little book!"
            },
            {
                "Author": {
                    "Helpfulness": "98%",
                    "Location": "Richmond, VA",
                    "Name": "S. Singer",
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36GZZT9FAPVZB/ref=cm_cr_pr_pdp?ie=UTF8",
                    "Ranking": "Reviewer ranking: #4,586,372"
                },
                "Date": "on July 17, 2006",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I bought three different books to use this summer to tutor a high school student in Chemistry before she goes into the class in the fall.  This one is by far the best.  It is clear, concise, well-written, with good exercises and good explanations.  It would be nice if it had a few more exercises so she could get a lot of practice, but other than that, I'm finding it an excellent resource."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 31, 1997",
                "Helpfulness": 0.9736842105263158,
                "StarRating": "5",
                "Text": "This book is set up in a way that reinforces the concepts you have just learned.  For those of us that are unable to see the trees through the forest, this book will not only show you the trees, but it gives you land marks to find your way around, back, and through.  And amazingly enough, the forest is not such a scarry place after all.  A great book for the first time chemistry student"
            },
            {
                "Author": {
                    "Helpfulness": "91%",
                    "Location": "Boston, MA",
                    "Name": "_davis_",
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2A3N3WKAW4QX2/ref=cm_cr_pr_pdp?ie=UTF8",
                    "Ranking": "Reviewer ranking: #28,989,731"
                },
                "Date": "on November 11, 2000",
                "Helpfulness": 0.9080459770114943,
                "StarRating": "4",
                "Text": "I am in a chemistry class this year and I am using a book titled \"Chemistry\" by Raymond Chang.  I decided to buy this book as a reference as my textbook has trouble explaining some of the concepts and problems.  When I received this book, I noticed that it only covered up to about chapter 8 in my 32 chapter textbook.  Although it only explains the fundamentals of chemistry, this book does do a good job explaining those parts."
            },
            {
                "Author": {
                    "Helpfulness": "92%",
                    "Location": "Roma, Italy",
                    "Name": "stefano@sbcweb.com",
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24EOZLE9FWOKX/ref=cm_cr_pr_pdp?ie=UTF8",
                    "Ranking": "Reviewer ranking: #29,622,717"
                },
                "Date": "on May 13, 1999",
                "Helpfulness": 0.9230769230769231,
                "StarRating": "5",
                "Text": "This book will just do what it promises: teach you the basics of chemistry. This is tailored so that even one who knows nothing about chemistry can learn (and even if he is a bit dumb!). Lately, the price is  very low."
            },
            {
                "Author": {
                    "Helpfulness": "89%",
                    "Location": "Laurel, MD",
                    "Name": "C. Price",
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34C6ID0BIGCIY/ref=cm_cr_pr_pdp?ie=UTF8",
                    "Ranking": "Reviewer ranking: #532,438"
                },
                "Date": "on March 5, 2003",
                "Helpfulness": 0.967741935483871,
                "StarRating": "4",
                "Text": "An excellent book for those taking a chemistry course or those who need to be refreshed for an upcoming comprehensive exam. It is straight forward, to the point.  This book contains subjects that are most likely to appear on exams. It adds simplicity, if possible, to chemistry. A well deserved investment if you want to improve your grade."
            },
            {
                "Author": {
                    "Helpfulness": "97%",
                    "Location": "Norway",
                    "Name": "Espen",
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LES6PKVRVWJZ/ref=cm_cr_pr_pdp?ie=UTF8",
                    "Ranking": "Reviewer ranking: #24,600,981"
                },
                "Date": "on May 17, 2006",
                "Helpfulness": 0.9642857142857143,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "Helpfulness": "55%",
                    "Location": "Phoenix, Arizona",
                    "Name": "Ted Bell",
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUA1ELT1UNKLA/ref=cm_cr_pr_pdp?ie=UTF8",
                    "Ranking": "Reviewer ranking: #30,808,499"
                },
                "Date": "on October 21, 2009",
                "Helpfulness": 0.8870967741935484,
                "StarRating": "3",
                "Text": "Like many others who wrote reviews, I purchased this book in preperation for a college chemistry class. This book had so many positive reviews that I thought it would be a perfect addition. Well, it doesn't live up to the hype given by so many 5 star reviews. How on earth can this be titled a \"self teaching\" guide? At best, it is useful as a review of what you might learn in a chemistry class (though not nearly as in depth as most college chemistry courses require). There is very little instruction on each subject (usually only a brief paragraph, if that) then a quiz immediately after. I was expecting a more in depth review of material and then maybe a quiz at the end of each chapter. While this book might be useful, I am so happy that I also decided to get the Homework Helpers Chemistry book. THAT book is actually written in a flowing, logical, in depth manner that makes learning each step more coherent for the new chemistry student. While I'm sure that I will refer to this book at some point during the course, I put more confidence in the Homework Helpers book."
            },
            {
                "Author": {
                    "Helpfulness": "87%",
                    "Location": "",
                    "Name": "J. STORMER",
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IHRDHU369SW7/ref=cm_cr_pr_pdp?ie=UTF8",
                    "Ranking": "Reviewer ranking: #1,497,177"
                },
                "Date": "on August 24, 2009",
                "Helpfulness": 0.9545454545454546,
                "StarRating": "5",
                "Text": "When the clep administrator at my institution informed me that no one he had ever given the chemistry clep to had passed, I decided to take the preparation very seriously. I began researching how other people had passed the test and ordered several materials. After 8+ years of no chemistry, my chemistry knowledge was not very good, so I had to prepare more than someone who just finished a high school chem or college intro chem course. If you are starting from scratch or just want to make sure you pass this test, then this is what I would recommend. Begin with the Wiley, \"Chemistry Concepts and Problems: A Self Teaching Guide.\" This book is written in a continuous question and answer format that reviews and tests your knowledge to build a strong foundation of chemistry knowledge and problem solving. Then simultaneously study REA's \"CLEP Chimistry,\" by Peel (I strongly recommend getting the book and CD with two practice tests included) with the Chemistry CLEP Professor software. You will find the REA book to be very summarized. I bought that first and felt like I needed more help. I found the CLEP Professor and gave it a try. My comprehension and retention immediately began skyrocketing, in addition to my practice test scores! The CLEP Professor follows the exact format and order of information of the book, but fills in a lot of the gaps. You may opt to purchase a general chemistry textbook to look up additional information on specific questions, but I would not recommend studying it alone to pass. There is too much information not focused for the CLEP exam that will make you forget what you need to know. You can also research anything you need to know more about online making the textbook unnecessary. I would recommend at least one month to go through these three materials. You should plan to spend about two weeks on the Wiley Self Study and two weeks on the CLEP professor and REA book together. That will give you 6 practice tests to work on. I recommend taking one practice test while you are studying the last two materials every other day. This will show you what you are learning and what you need to learn. Spend one month and about a total of $150 and you can save two semesters of time and about $2000. You should pass easily if you follow the three steps of this program: 1-Wiley Self-Teaching Guide, 2-CLEP Professor and REA CLEP Chemistry, 3-Take practice tests and look up material you are unfamiliar with. I hope you do well."
            },
            {
                "Author": {
                    "Helpfulness": "75%",
                    "Location": "USA",
                    "Name": "A. Chai",
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYUHVEP2DDQ2S/ref=cm_cr_pr_pdp?ie=UTF8",
                    "Ranking": "#55,959"
                },
                "Date": "on April 30, 2007",
                "Helpfulness": 0.9444444444444444,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "Helpfulness": "92%",
                    "Location": "Gig Harbor, WA USA",
                    "Name": "Chris N. Goodman",
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13D840K8WD3YF/ref=cm_cr_pr_pdp?ie=UTF8",
                    "Ranking": "Reviewer ranking: #1,870,103"
                },
                "Date": "on March 31, 2000",
                "Helpfulness": 0.8888888888888888,
                "StarRating": "5",
                "Text": "This was a great book highlighting a lot of chemistry concepts.  Working through the book I refreshed my old learning and thereby set myself up for increased success in chemical oceanography.  The book was easy to  understand and the solutions were clearly explained in terms supporting the  information taught.  I'd recommend this handy guide to anyone coming back  to chemistry after a long time away.  I wish there was a companion book  dealing with organic and physical chemistry concepts."
            },
            {
                "Author": {
                    "Helpfulness": "77%",
                    "Location": "Colorado, USA",
                    "Name": "BaPuters",
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JJNSW1XHXX9B/ref=cm_cr_pr_pdp?ie=UTF8",
                    "Ranking": "#45,068"
                },
                "Date": "on June 19, 2005",
                "Helpfulness": 0.9090909090909091,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "Helpfulness": "91%",
                    "Location": "Jackson Township, OH",
                    "Name": "Samuel C. Palmer",
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AH2PUZAHDHP1/ref=cm_cr_pr_pdp?ie=UTF8",
                    "Ranking": "Reviewer ranking: #5,986,279"
                },
                "Date": "on August 8, 2007",
                "Helpfulness": 0.9090909090909091,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "Helpfulness": "91%",
                    "Location": "San Ramon, CA USA",
                    "Name": "Carolyn",
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZI2WCSW8Z4SG/ref=cm_cr_pr_pdp?ie=UTF8",
                    "Ranking": "Reviewer ranking: #13,309,311"
                },
                "Date": "on October 11, 2006",
                "Helpfulness": 0.9047619047619048,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "Helpfulness": "81%",
                    "Location": "New Orleans, LA United States",
                    "Name": "Jeffery L. Smith",
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOUKRECWP828A/ref=cm_cr_pr_pdp?ie=UTF8",
                    "Ranking": "#22,015"
                },
                "Date": "on January 7, 2010",
                "Helpfulness": 0.84375,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "Helpfulness": "62%",
                    "Location": "New York City, NY",
                    "Name": "Tax Whiz",
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6X4N3WL81DQ5/ref=cm_cr_pr_pdp?ie=UTF8",
                    "Ranking": "Reviewer ranking: #1,978,696"
                },
                "Date": "on December 26, 2012",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "Helpfulness": "88%",
                    "Location": "Texas",
                    "Name": "J. Bell",
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MQIN3AYNNZ8L/ref=cm_cr_pr_pdp?ie=UTF8",
                    "Ranking": "Reviewer ranking: #1,520,573"
                },
                "Date": "on February 25, 2006",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I found this book very helpful in preparing for my teacher certification test to teach high school science.  The concepts were presented in language that was easy to understand.  The \"fill-in-the-blank\" format throughout the text helped to reinforce concepts.  It helped me recall a great deal of Chemistry that I had learned in college years ago.  Overall, an excellent book."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on April 26, 2004",
                "Helpfulness": 0.8947368421052632,
                "StarRating": "4",
                "Text": "This book was very helpful.  I found that this book is more detailed than the 900 page, $160 textbook I bought for the class."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Chemistry-Concepts-Problems-Self-Teaching-Guide/product-reviews/0471121207/ref=sr_1_2?s=books&ie=UTF8&qid=1432263491&sr=1-2&keywords=chemistry+books+paperback/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful"
    },
    "Salesrank": "#4,906",
    "Timestamp": "2015-05-21 22:58:52.505130",
    "itemurl": "http://www.amazon.com/Chemistry-Concepts-Problems-Self-Teaching-Guide/dp/0471121207/ref=sr_1_2?s=books&ie=UTF8&qid=1432263491&sr=1-2&keywords=chemistry+books+paperback"
}
