{"Category": "in Books (", "Name": ["Halo Graphic Novel (Halo (Tor Paperback))"], "Timestamp": "2015-05-24 23:42:41.333369", "itemurl": "http://www.amazon.com/Halo-Graphic-Novel-Tor-Paperback/dp/0785123784", "Reviews": {"TotalReviewCount": "100", "ReviewList": [{"Date": "on August 2, 2006", "Text": "Don't believe the naysayers. If you enjoy Halo and you have an open mind towards graphic novel storytelling then you will enjoy this book. The guys below obviously have no taste in art nor any taste in storytelling---how can Moebius, Nihei, Bisley, etc. have contibuted terrible art? They are all sought after graphic novel artists. The reviews below seem more reflective of wanting to see this book do badly than actually have real criticisms beyond \"this is bad, that is bad, etc.\" My fave stories in this book was Nihei's and Moebius's. Really strong art and moving story lines. Don't buy the hype just buy the book and enjoy the read. Let the haters hate. Halo will always reign supreme.", "Helpfulness": 0.9090909090909091, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34SJANKBE9TTH"}}, {"Date": "on August 4, 2006", "Text": null, "Helpfulness": 0.92, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5DYGXTK6IYEU"}}, {"Date": "on September 4, 2006", "Text": null, "Helpfulness": 0.875, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3I5045MQYC6J4"}}, {"Date": "on September 29, 2007", "Text": null, "Helpfulness": 0.8, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1K9KNLTSJF7Q9"}}, {"Date": "on March 22, 2007", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3P08EXSXDTC4J"}}, {"Date": "on August 2, 2006", "Text": null, "Helpfulness": 0.8333333333333334, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15K4QXXGEOHYM"}}, {"Date": "on January 4, 2007", "Text": "This is the best comic I have ever read. I , being a Halo fan myself, have also read the novels that compliment the story of Master chief and the rest of the Halo universe.  This is a wonderful edition to the Halo universe. It answers questions about characters , the art is spectacular, the stories and how they are presented meld so perfectly together with the style of the games, novels, and the rest of the  halo universe that I felt I was reading cut scenes form the games and continuations of the books( which both were amazing as well). Any comic book lover, Halo fan or Sci fi fan should check this comic out , and if that sparks your enthusiasm  and you want to find out how this all ties into the Great Story that is Halo you should check out the other novels and game products. 5/5, perfect!, wonderful!, so many words can describe how pleased I am with this product.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BW1F8MJB3K4W"}}, {"Date": "on April 18, 2007", "Text": "I felt this book wasn't worth the price. At least for the hard cover version. The only really good story is the first one, other than that the others aren't very good. Reasonably good artwork but the last one had more of a kid like style and the story wasn't very good and a little confusing even. The drawings in the back were better than half the stories. I expected more but i would say it isn't worth the 20-25 dollars. wait for the paperback.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15LJW0WN3B2U9"}}, {"Date": "on July 17, 2007", "Text": "I was shocked to see any negative reviews of this book! Maybe I just don't know what a good comic is because this was my first. But if you're a fan of the 'HaloVerse', or are even a little interested in the Halo story then you should like it. Great side stories and great Halo art.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OT0P6PH6SIV3"}}, {"Date": "on March 9, 2007", "Text": "I didn't think when i bought it that it would be as graphic as it is, but the call it the 'Graphic Novel' for good reasons. If you have read the other 3 Halo books it dose fill in a few cracks, also in the Halo 2 story. I wouldn't recomend it for younger readers though.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IOF6CCNC0PVW"}}, {"Date": "on August 16, 2007", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18BPBYI8ZLL0I"}}, {"Date": "on June 15, 2007", "Text": "With the wild success of the Halo video game series on the XBox, expanding into other mediums was inevitable.  Thanks to Marvel Comics, Bungie's shooter franchise makes it's way to the comic page in this original graphic novel, which features short stories taking place in the Halo universe.  The best story to be found here is undoubtedly \"The Last Voyage of the Infinite Succor\", written by Lee Hammock and illustrated by the great Simon Bisley (Lobo, Heavy Metal), which details some major plot points that are intricate to the overall backstory behind the Halo series.  The rest of the stories featured here though are quite underwhelming to say the least.  Though there is great artwork to be found throughout the Halo Graphic Novel, there's not nearly enough here to hold your interest.  Not to mention that a full-length, original story would have been much better served than what is found here, but hopefully with Halo 3 on the horizon, that will become a reality.  All in all, the Halo Graphic Novel isn't bad one bit, and is worth checking out for hardcore Halo fans, but everyone else isn't missing anything here by a long shot.", "Helpfulness": 0.75, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJKWF4W7QD4NS"}}, {"Date": "on February 6, 2007", "Text": "This is a great book to add to any Halo lover's collection. It gives more insight into the Halo world and the pictures are just amazing.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2T3YGBV4HJ10K"}}, {"Date": "on September 7, 2006", "Text": "The best representation of the halo universe yet! Accounts for how Sergeant Johnson escaped the flood, and the day the covenant found earth", "Helpfulness": 0.8, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30BT8X819FRB1"}}, {"Date": "on January 5, 2007", "Text": "This books is one of the best I've read in a long time.  If you are a fine of the halo series of games and wish for deeper story, then this book and the previous three will satisfy your curiousity.  It will give you insight as to what happened with the other spartans during the first 2 games and sets up where they are at the start of the third I do believe.  There is a fifth books coming as I understand it.  I hope it is as amazing as this book.  Only took me a day to read...not because it was that easy or short but because I couldn't put it down.  5 stars!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KQQNOHFVS15L"}}, {"Date": "on August 28, 2006", "Text": "This is a great novel.  There isnt any thing really to add on from Halo or Halo 2 from this book but the stories are pretty cool.  In this you get to see a couple of things that went on around Master Chief and they are pretty well done.  And the art pages are sweet as well.  I kinda wish some of them were posters.  But ya this is an awesome novel if you are a Halo fan buy this book.", "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WJ5P8XLO6DU3"}}, {"Date": "on March 9, 2007", "Text": "The Halo Graphic Novel is beautifully written and illustrated by some of today's best talent.  I was only a marginal Halo fan before reading this graphic novel... and now I'm a Halo fanatic!  If this is a precursor of things to come for this property (Bendis is writing a new series for Marvel), then you have my money and my vote!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AX29P3VF75JPJ"}}, {"Date": "on July 31, 2006", "Text": null, "Helpfulness": 0.673469387755102, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NJ2GWURL2ONB"}}, {"Date": "on August 30, 2006", "Text": "This Novel not only depicts the Halo Universe and stay true to the \"Halo Bible\" but also gives us a more in-depth look at the Halo Universe. From Sargeant Johnson's amazing escape from the Flood to the Elite who lost half of his face, this Novel will rev your think tanks and make you wonder, \"What elese could have happened?\"", "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3I5GYWV5TP7R6"}}, {"Date": "on January 15, 2007", "Text": "This is actually a review from my son since it was a gift to him and he was the one who read it, so here is what he thouht of it: \"There is really good artwork, the stories were great but it was missing some key elements from the games. Otherwise, it was very entertaining. I recommend this book.\"", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A253TTO1EUHK4C"}}], "ReviewUrl": "http://www.amazon.com/Halo-Graphic-Novel-Tor-Paperback/product-reviews/0785123784/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.0 out of 5 stars"}, "OfferPrice": "$16.60", "Salesrank": "#213,669", "ListPrice": "$19.99"}