{"Category": "in Books (", "Name": ["Victoria: A Novel of 4th Generation War"], "Timestamp": "2015-05-24 23:48:10.319901", "itemurl": "http://www.amazon.com/Victoria-Novel-4th-Generation-War/dp/9527065453", "Reviews": {"TotalReviewCount": "28", "ReviewList": [{"Date": "on November 16, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OJCH3MV9M78K"}}, {"Date": "on November 19, 2014", "Text": "I thought the first ten percent sounded like a reasonable prescription for reform. After that it became military fantasy, which I quite enjoyed.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARBRHXF3WLH5A"}}, {"Date": "on November 25, 2014", "Text": "The book  clearly captures one possible dark trajectory for the U.S.  and postulates an interesting yarn about a how one might restore traditional values so sorely lacking in much of the modern dependency victim culture.  Given that I'm personally hopeful that this dark vision of a world looking backward for stability is not our future. The only reason for 4 stars rather than 5 is my being  pedantic about technology. The story has some inconsistency in the available tech level of the world where tech comes and goes as needed by the story, but is not really 100% internally self consistent.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AINDVI97XW17W"}}, {"Date": "on November 21, 2014", "Text": "Politically incorrect historical future fiction.  Tells a story of the US beginning in present time through its collapse and rebuilding in many different sections.  Great story for students of history that see problems with the direction our society is going.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EL82MRH50FFO"}}, {"Date": "on December 1, 2014", "Text": "On one level, this is just what I call \"right wing revenge porn\", something like the Johnstone \"Ashes\" series: the good guys win (always), the bad guys get it in spectacular and amusing ways, it isn't top-flight literary style, and there's a tactical/military training element.  But there's a strong philosophical subtext here: how can a society turn itself around without imposition from government? How much do ends justify means? Can any peace come from ideology? Is there such a thing as too much technology? This book has made me think outside the box. Many scenes are shocking: it begins with the burning for heresy (at the behest of the Anglican church) of a female Episcopal bishop, the protagonist examines both the positives and negatives of Wisconsin going Nazi.  Some are funny: New York gives up New York City to Puerto Rico in order to join the Northern Confederation. The people who most need to read this won't. But the people who would read it will benefit...and it's fun.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AL3GG5SVUBXMK"}}, {"Date": "on December 10, 2014", "Text": "The author deals creatively with a country with no federal government, no regulatory state, and no electricity, in which people walk, ride animals or steam-powered trains, and farm.  There are plenty of challenges remaining for the Northern Confederation of the states of old New England, both civil and military.  The main characters have a deep understanding of both history and war, which they apply with skill throughout the Second American Revolution and its aftermath.  A first-rate story by a first-rate storyteller.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AS91M8WEGUCG7"}}, {"Date": "on January 19, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28RA5RAA9A3ID"}}, {"Date": "on November 28, 2014", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZU6YZ58TDMEA"}}, {"Date": "on November 21, 2014", "Text": "While I disagree with some of Lind's premises... I see this more regionally... I enjoyed his logic and conclusions... if you have read the first 35 chapters online... this will NOT disappoint... enjoy as I did.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SQZXKS9LVQY9"}}, {"Date": "on May 17, 2015", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AM1CO53ZQ5BGE"}}, {"Date": "on May 17, 2015", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PSFX5QI7JYU8"}}, {"Date": "on November 19, 2014", "Text": "Great read but the king of Anti-PC is still H.A. Covington.  Check out \"The Brigade\" for an adults dosage of anti-PC.", "Helpfulness": 0.7142857142857143, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZYCLJGQOFAAH"}}, {"Date": "on December 4, 2014", "Text": "In these times of riot and ruin, it is tonic to the spirit of the civilized Western man to know that one is not alone in one's thirst for justice or one's hunger for sanity. VICTORIA represents just such a tonic. In its breezy yet bracing documentary style, this narrative of retrogression and renewal lifts the spirits of the Christian reader by reminding him that the Old Ways are not forgotten and that he is not alone. In many ways, this book is the contemporary LOOKING BACKWARD, a foretelling of the rise of a Christian and Cavalier world order in the same fashion in which Bellamy presaged the rise of the current global techno-socialist regime, and, likewise (one hopes) inspiring in some Cincinnati of today the will to \"breathe together\" the breath of life into this literary body of hope.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1E5E44SXWM47T"}}, {"Date": "on December 20, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A322928IKDX7ML"}}, {"Date": "on February 6, 2015", "Text": "Interesting and well written book that captures, I fear, the vision many Americans hold of one of our possible futures.  The heroes are a bit over the top, and the ease with which the great Welfare State that we have become crumbles somewhat pushes credibility, but it is well written and thought provoking.  There is an obvious degree of sometimes troubling \"bloody mindedness\" about the whole narrative, and while I applaud its political incorrectness (and believe me, it is extremely politically incorrect), there is too much evidence of cavalier intolerance substituted for mature engagement with issues for me to be completely comfortable with it.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KVSJCLAONVQQ"}}, {"Date": "on December 20, 2014", "Text": "After reading numerous adventure world collapse novels I was pleasantly surprised at the unique viewpoint the writer provides.  Although it is locked in Christian beliefs it is not offending as some novels are . . it brings us back to those things that have worked for centuries.  So I recommend it, it's a good read with workable conclusions . . . although difficult ones.  ENJOY!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PV31U32G0X0K"}}, {"Date": "on November 22, 2014", "Text": null, "Helpfulness": 0.6, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQ5RHWPYEYMIT"}}, {"Date": "on February 20, 2015", "Text": "Good read, fascinating as a primer on warfare, which of course it is.  Also an interesting alternative to the current neo liberal world order is presented, namely, Retroculture.  While it is possible to critique the author's imagined solutions and scenarios, remember, it's a work of fiction.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AE7C3DJZXBKDV"}}, {"Date": "on November 30, 2014", "Text": "Crystal clear prose, well developed dialog, and action that never drags all adds up to a must read novel. Easily the best I have read this year. As an added plus, each of the chapters are as complete in themselves as a series of short stories.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15DJIAQWID575"}}, {"Date": "on December 31, 2014", "Text": "Hear is a book that has a lot of opinion that are look down at. if you can not sit back and think about what the book is about you will not be able to read this book if you can think about the situation then it is a fascinating read", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XTFL8XBJAYMW"}}, {"Date": "on March 29, 2015", "Text": "Thought provoking with a hint of how-to added. While much is the authors philosophy packaged into a novel, there are plenty of opportunities to crosslink into other trains of thought on the subject.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOQ1XQ11FJ5XE"}}, {"Date": "on December 7, 2014", "Text": "An interesting novel, very eccentric in places, with a fairly plausible narrative of what might happen after the collapse of the American national government.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A42MZHDATL0AE"}}, {"Date": "on March 10, 2015", "Text": "THe writing is a bit clunky, but the world is interesting.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Z7HSNOP3011J"}}, {"Date": "on November 29, 2014", "Text": "Wonderfully outrageous!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3G7FADLHIRUEH"}}, {"Date": "on December 5, 2014", "Text": "Tragically optimistic.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AV6522W8AVRBL"}}, {"Date": "on January 4, 2015", "Text": "Our future?", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27NRBKRNYQD44"}}, {"Date": "on December 8, 2014", "Text": "Great book!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A169494470OTYZ"}}, {"Date": "on November 26, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVRQH2BZWACQI"}}], "ReviewUrl": "http://www.amazon.com/Victoria-Novel-4th-Generation-War/product-reviews/9527065453/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.3 out of 5 stars"}, "OfferPrice": "$18.22", "Salesrank": "#570,515", "ListPrice": "$18.95"}