{"Category": "in Books (", "Name": ["The End: A Postapocalyptic Novel (The New World Series)"], "Timestamp": "2015-05-24 23:41:42.012621", "itemurl": "http://www.amazon.com/End-Postapocalyptic-Novel-New-World/dp/0142181498", "Reviews": {"TotalReviewCount": "681", "ReviewList": [{"Date": "on June 9, 2013", "Text": null, "Helpfulness": 0.8601398601398601, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1C9N9IEJFGD9T"}}, {"Date": "on April 17, 2013", "Text": "I can't find any other books on Amazon by Hopf, so I am going to make the assumption this was a first published book.  If so BRAVO!!!!!  I loved the style, loved the complexity of the plot, the great characters, and the realistic breakdown of society in my hometown (scary though that might be).  I can hardly wait for the next installment, which I sincerely hope is currently in process....I have to find out what happens to Gordon, Samantha, Hunter, Sebatian, and crew.  If you want a good read and enjoy end of the world fiction read this, it truly is good!", "Helpfulness": 0.8210526315789474, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1STSIBS59744U"}}, {"Date": "on July 13, 2013", "Text": "I was looking forward to this as I enjoy the genre, but could not get past the first 15 pages. The writing style is simply not up to par with professional writers. The stilted dialogue, poor sentence structure, limited vocabulary, and grammar errors were too much to bear. I want to support self-publishing writers, but these writers should respect those purchasing their books and work to refine their writing and editing skills before publishing.", "Helpfulness": 0.8181818181818182, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AWGB1IC9H7HY"}}, {"Date": "on May 4, 2013", "Text": "More than any other genre, I love the post-apocalyptic world for the simple reason that it always makes me ask, \"What would you do?\" That is the case with The End; I liked the variety of characters, each of whom answers that question differently. And after reading up on the author, was amamzed at the similarities between the author and the main character. I now certainly know what G. Michael Hopf would do! And one nice touch: some of the most evil people in this book are the most ordinary.(SPOILER) Usually you see the neo nazis or gang-bangers as the bad guys (The End has this too) but the most vile character in the book is the President of the Home Owners Association! That is certainly way too real! One complaint - the Editor missed numerous typos and grammatical errors but don't let that get in the way of a really good read.", "Helpfulness": 0.84, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3F8KM0WKR3X6E"}}, {"Date": "on June 28, 2013", "Text": "I am honestly shocked at the large number of reviews that rate this book so well.  I was disenchanted with the book by the time I reached about 25% of the way through, but kept reading - thinking something was going to happen that would discuss in some significance the breakdown of society because of the apocalyptic event. Instead, the greatest amount of true discussion about the restructuring of society seems to be with the main characters disputes with his neighborhood HOA president.  Then, the main character (whose background and personality traits are barely explored) makes extremely unlikable, violent decisions that even when considering the state of the new society still make no sense.  Meanwhile, the main character's wife seems to carry on in her daily life as if the destruction of society is no big deal with a perfectly melancholy attitude.  Lastly, the portrayal of the US Marines is unsettling to say the last.  The mutiny of the Marines, and eventual murdering of Marines by Marines is not only unbelievable but rather offensive, and basically helped me stop wasting my time as I deleted the book from my Kindle at the 61% mark.", "Helpfulness": 0.7647058823529411, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATPO059B88SUI"}}, {"Date": "on April 16, 2013", "Text": "Well written. I appreciate the way the characters  we're developed. I can't wait for the next book in the series.", "Helpfulness": 0.7804878048780488, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LJZUBN1E2BKP"}}, {"Date": "on May 29, 2013", "Text": null, "Helpfulness": 0.7441860465116279, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VUIXYS4OXD8G"}}, {"Date": "on April 23, 2013", "Text": "Very few authors have the ability to grab my attention with just the very first pages of a book. This author had that ability! This was a great book....one I couldn't put down right from the beginning. The storyline as well as the characters were well developed. I look forward to reading more from this author.", "Helpfulness": 0.7560975609756098, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOLX7M2KBJLZS"}}, {"Date": "on August 19, 2013", "Text": null, "Helpfulness": 0.7857142857142857, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15PYCET4XH22X"}}, {"Date": "on May 23, 2013", "Text": "the book immediately draws the reader into the story.  extremely good character development, well paced action, really like how he has different stories happening simultaneously (on a ship and on land).  the book is very compelling, making it difficult to put it down. the author's research into what can happen when this type of disaster strikes makes the novel very realistic.....and scary. i was glad he didn't dwell on gory scenes - many authors spend too much time trying to gross out the reader. i'm an avid reader and was extremely impressed with this author, particularly since this is his first novel. he writes as well as many of the top-notch experienced writers. i am anxious for the sequel to see how the lives of the characters develop. it was a very satisfying read and i would recommend it highly.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATY5QH0G1SB3U"}}, {"Date": "on June 28, 2013", "Text": null, "Helpfulness": 0.8333333333333334, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A260G70ZN7KP9P"}}, {"Date": "on May 13, 2013", "Text": "This book was one of the best I've read.  Everything from writing style,  characters,  and plot kept me glued to this book. And im glad the author actually made the dialog of the characters believable.  I've read too many books that looses my interest when the grammer they use is very unbelievable.  Thank you to Mr. Hopf for an amazing book and I can't wait for the next one.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUJZ3ZOBXMEW2"}}, {"Date": "on March 3, 2014", "Text": "Really a good book! So hard to put down. Well written like only a veteran could do.on to the next", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30SJTVOU3KQB5"}}, {"Date": "on July 15, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DUM0HFISATWV"}}, {"Date": "on June 25, 2013", "Text": "Absolutely horrifying. The author does a great job of making you feel like you are in the novel... like it could be real. I can't stop thinking and dreaming about this dang book. Makes me glad I married a marine. Can't wait for the rest of the series.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYOAKNNR81C2H"}}, {"Date": "on May 16, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PHFDDJ4MYH1D"}}, {"Date": "on May 13, 2013", "Text": "Hard to put down when you start.  Well developed characters and a good story line. A very enjoyable read and am looking forward to the next book that is coming out this summer.  Good job.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33NBN97AUXCIT"}}, {"Date": "on May 4, 2013", "Text": "Turn the TV off and enjoy this great weekend read. The good guys are really good and the bad guys end up dead; hard to beat that.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5WKFNGEOES7Q"}}, {"Date": "on April 30, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQJRQESRO88E7"}}, {"Date": "on May 26, 2013", "Text": null, "Helpfulness": 0.7777777777777778, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACO69282UBTDX"}}, {"Date": "on May 13, 2013", "Text": "I bought this book because I pretty much read all the other books in the genre. I really enjoyed this book, the story is plausable and the actions and reactions of the characters are more realistic than some other books I've read. In a nutshell I highly reccomend it.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2J0PQ2CHWN5EK"}}, {"Date": "on May 1, 2013", "Text": null, "Helpfulness": 0.75, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QHYQ60A1ICKM"}}, {"Date": "on May 25, 2013", "Text": null, "Helpfulness": 0.7777777777777778, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1E5OMQB737EEI"}}, {"Date": "on June 28, 2013", "Text": null, "Helpfulness": 0.8333333333333334, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NFBKAV0GX6J8"}}, {"Date": "on April 16, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HL4CWBBPL1WW"}}, {"Date": "on August 3, 2014", "Text": "Read it and liked it. The End had a different story line and actually portrayed a community after a catastrophic event. The End also put the reader in the shoes of the average military enlistee stationed far from home when a crisis state-side occurs. Most 'doomsday' or 'end times' books have the same scenario with some prep 'how tos' thrown in. Placing aside the graphic home defense scenes, which are realistic having seen the aftermath of a home invasion; I think even the most 'girlie-girl' can envision how a SHTF situation will unfold. ~ Sorry Virginia, there is NO Santa Clause after a crisis!", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AL28F3F1TDE8Y"}}, {"Date": "on April 27, 2013", "Text": "I loved this novel: The End - A Post Apocalyptic Novel by G. Michael Hopf and gave it 5 stars. A remarkable piece of writing. Very engaging and mature literary work. Reads like an accomplished author wrote it. Strong character development and multiple storylines that mesh well. I strongly recommend this novel for anyone who likes Clancy or other military thrillers. The book flows like that. This is money well spent. Couldn't put it down.", "Helpfulness": 0.7222222222222222, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38OQTOCARQ21S"}}, {"Date": "on July 11, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TO8OGKSF08BY"}}, {"Date": "on July 9, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3S30X54H1JRMZ"}}, {"Date": "on June 4, 2014", "Text": "This is one of my favorite series now. The characters are great and story is even better. Just  got done with part 3 hope he's writing part 4 now.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AF2PZM3MV8F0C"}}, {"Date": "on May 19, 2014", "Text": "Couldn't put it down can't wait till \" the long road\" graces my iPad I have already purchased it. Great author", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A182TZ68ZUUU7V"}}, {"Date": "on May 17, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BIHJFMPGJ13K"}}, {"Date": "on May 3, 2014", "Text": "I read this one and am listening to the second The Long Road via Auidable.com I prefer it the 2nd is better but you have to read to this one to understand what the 2nd is about. But I am ok with spending the money on both and it should  be interesting when the 3rd comes out I'll buy it hopefully it'll be on Auidable as well.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5FG2BKNYI6XV"}}, {"Date": "on April 28, 2014", "Text": "The writer makes this a hard to put down book and makes you want to see what happens next. Can't wait for the next book of the series.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A215NGHI3XLKD7"}}, {"Date": "on April 14, 2014", "Text": "I read a fair amount of post apocalyptic/ sci fi/ survival/ zombie (no zombies in this let me make that clear) \"literature\" and had a blast reading this; I was pleasantly surprised by how quickly I found myself sucked in. Found it very easy to imagine things going south very quickly in the event such an attack took place- didn't help that I live in the city written about I suppose. Frequently found myself asking what would I do in such a situation? I recommend this to anyone who likes a good post apocalyptic read- up there with \"The Remaining\" series if you have read that! And if you haven't you should!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17JYWH4IAIJQT"}}, {"Date": "on April 13, 2014", "Text": "I've read a bunch of post apocalypse stories and this is definitely one of the better ones. Can't wait for the third one.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1K2S05P954VQ"}}, {"Date": "on April 12, 2014", "Text": "Fast pace. Lots of action. Fun to read. Some parts a little corny but it's a super fun fast read.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZS8A2RX49VCS"}}, {"Date": "on April 11, 2014", "Text": "This book has been an amazing read full of twists and turns and a dynamic representation of a SHTF scenario. I've read many such books and by and far this is my favorite. I'd highly recommend this read to anyone looking for  theoretical psychology concerning a SHTF event and will offer real insight into how things will unfold in a post collapse America.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BKD5RXGJRYWU"}}, {"Date": "on April 6, 2014", "Text": "So many things to consider as this could be a real possibility in our future.  The novel is fast paced, well written with many separate stories within. Before I was even halfway through the book, I downloaded the 2nd book in this series to my Kindle and pre-ordered the 3rd book in the series to be available this month.  A great read and all should read and be prepared.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1H4JFUJ9XAUCP"}}, {"Date": "on April 4, 2014", "Text": "I really loved this book. I am a recent new fan of the post-apocalyptic genre, and now I see why so many people like these stories. The story is paced really well, with lots of suspense and yet it has a balance of character development. I read the author’s bio and now I see why the technical details and military aspects are so believable; he’s a Marine Corp veteran. The story really made me think about “what if” this happened to my family. What would we do? I’m a fan of the TV series Evolution, which has elements of an EMP attack, and this story-line is as good or better. This book has really strong cinematic potential, and I hope they make it into a movie. I will definitely buy the next in the series, Sanctuary. Well done G. Michael Hoph! You have a new fan. Keep up the good work!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AW99331LYIE6Q"}}, {"Date": "on March 29, 2014", "Text": "I got to meet the author and a convention and he handed me a free copy of this book.  I was skeptical because who hands out their book for free?  Have to say I was wrong in my perception.  It was a fun read.  I enjoyed the characters and could totally relate to them.  Pick up the book and just enjoy.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PA4064GS5W7B"}}, {"Date": "on March 27, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LW2BL7SFPB27"}}, {"Date": "on March 17, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19CCACN6LC8S0"}}, {"Date": "on March 12, 2014", "Text": "I'm always looking for a good post apocalyptic story and this author provides a different view of what the world would be like as the result of an EMP.  No zombies in this version, but it really got me thinking about the whole EMP business.  the character development was strong and I immediately read the 2nd book in the series to find out what happens next.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AK5QQFAICY009"}}, {"Date": "on March 7, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DCHI8BIO91ZE"}}, {"Date": "on February 19, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WCJ1NL7RLNIS"}}, {"Date": "on February 18, 2014", "Text": "I enjoyed reading this first installment of the series. The story evolved differently than others in the genre, perhaps not exactly as I would have written it, but, the plot twists were interesting.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3B3G8T1LPR1RJ"}}, {"Date": "on February 15, 2014", "Text": "Again, proper grammar and spelling was so appreciated by this reader. Intense story line that keeps the reader's interest. enjoyed", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Q3STBEZTTE9C"}}, {"Date": "on February 11, 2014", "Text": "Great perspective on the end of the world as we know it. A true representation of just how fast civilization would collapse and how quickly morality would deteriorate.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30DZONEU7HD1J"}}, {"Date": "on February 8, 2014", "Text": "Had this book read in two days because I couldn't put it down. This was a brutal & raw look at what could happen after an apocalypse.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATXBW1J9GIX8Y"}}, {"Date": "on February 7, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HXJ8W5OQPQKL"}}, {"Date": "on February 1, 2014", "Text": "A great end of the world read from a preppers perspective! Loved all of the military references and slang, very well done!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3H5Q4XP3I0HXC"}}, {"Date": "on January 29, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BB5ZQQ1S9KZK"}}, {"Date": "on January 29, 2014", "Text": "I could not put this book down. I hope same day they make it a movie. This book also makes you think about what could be inevitable!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14ST5OA7LM06T"}}, {"Date": "on January 27, 2014", "Text": "Loved it, this could happen to us, we need to be prepared! Excellent reading, good time line and character formation!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8KETS8FSFF5X"}}, {"Date": "on January 20, 2014", "Text": "A great read. I had a hard time putting it down. Very thought provoking. I look forward to the next book…", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AB87FTOGU8J9D"}}, {"Date": "on January 19, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QKWAABKDSCEL"}}, {"Date": "on January 16, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZA99MEK7DBQU"}}, {"Date": "on January 8, 2014", "Text": "I enjoyed this book and most others that I have read that are of similar content. In todays world, it's not hard to imagine it as happening right now!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AYAD3M4KIJ2R"}}, {"Date": "on January 3, 2014", "Text": "This story was very exciting and fast to read I ordered the next book immediately. I recommend this story to anyone", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AAJX877G3DKL"}}, {"Date": "on January 1, 2014", "Text": "This is a great series! Grabs your attention right from the beginning. Looking forward to the next book- due out in 2014", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AN5RZ0BA69YKB"}}, {"Date": "on December 28, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8G7QUUX5MHZG"}}, {"Date": "on December 27, 2013", "Text": "It is an excellent book. This will be an easy book to recommend tofriends and family. A great story in human nature.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A55VRLNNAER5E"}}, {"Date": "on December 22, 2013", "Text": "I am way into the post apocalyptic series (prefer that on audio than written) but once I saw this book and the mixed reviews I got curious, I had to form my own opinion. I am glad I gave it a shot, this is my new favorite post apocalyptic series!!! I enjoy how the author pushes the boundaries of human nature when there is no rule of law and no government. Contrary from what others have said, the personages have depth, you just have to give it time for the different scenes to shape their character. Its only 5 bucks, give it a shot and see it for yourself, then come back here and let others know, I think this is a great read, and I am through with book 2 already, its just as good! I recommend it to anyone.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35ZW587S7C8GU"}}, {"Date": "on December 22, 2013", "Text": "There were some punctuation and grammar mistakes that were a little annoying but it still was a great book to read", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHZWJLLC7K448"}}, {"Date": "on December 21, 2013", "Text": "Very intelligently done, gave a realistic idea of what could possibly happen in a scenario like this. It could very well happen to us, hopefully it won't, but you better be ready for it. Enjoyed it immensely, highly recommend it to all, but it is very dark.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DFAUZ9PF0RI6"}}, {"Date": "on December 17, 2013", "Text": "I really loved reading this book, inspired me to get my emergency kit sorted ASAP! Loved our anti hero and his shoot first ask questions later attitude. Not sure why all the terrible reviews but I am neither a critic nor an American, Just joe blog book enthusiast!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A274HY8K9CGOA6"}}, {"Date": "on December 10, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5NACLO5722OB"}}, {"Date": "on December 7, 2013", "Text": "Loved this book. Was away on holiday, ended up buying this one, the next one, plus a whole bunch of other similar style books. I really enjoyed it, couldn't put it down. Characters well written, story line is well thought out. I am eagerly awaiting the third instalment. If you are into the walking dead series, Jericho tv series,  fall out games, anything survivor oriented, you'll love this!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FRWAMMYRHHAI"}}, {"Date": "on December 7, 2013", "Text": "I love the books on Kindle!  We want more...  I am rereading a lot waiting on the new installment of the saga.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16SS0V9S6LG2B"}}, {"Date": "on December 7, 2013", "Text": "The idea of losing electricity and all the conveniences I have now would be devastating, and the story kept me on the edge.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5PWXBL313K7V"}}, {"Date": "on December 6, 2013", "Text": "I've read both books in this series to date and cannot wait for more!  Had me hooked immediately.  I love post apocalyptic fiction and this is some the best EVER!!!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EQIT3DTZ64E3"}}, {"Date": "on December 6, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IM5J121SY0I9"}}, {"Date": "on December 5, 2013", "Text": "Exciting, riveting story line.  My husband I both loved it and could not stop listening to the audio until it ended---and even then we said NOOOOooooooo it isn't over.  Can't wait to get the second in this series.  It is not a light hearted book.  But it will keep your interest to the very end.  So, many things I like my husband is bored with.  No one will be bored with this one.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXZFS04H7KK2D"}}, {"Date": "on December 5, 2013", "Text": "I read this book a few months ago and it stuck in my mind enough to want to post a review. As a hard core fan of apocalyptic fiction, I rank this one up there with some of the classics. Having lived in San Diego for more than a decade, I was able to picture the area and appreciate the destructive effects of losing all power and modern technology. As society crumbles, ordinary people strive to secure the means of survival. Most will not succeed. This book will be a favorite among preppers and doomsday fans. I also enjoyed the sequel and look forward to more from this new author.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KU715OUVJ9T7"}}, {"Date": "on December 4, 2013", "Text": "Great read.  I didn't want it to end.  I couldn't buy the next book in the series quickly enough and start reading it.  The story was gripping and the characters endearing, yet they do what they need to do to survive.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AB5K9LAUM1FPQ"}}, {"Date": "on December 4, 2013", "Text": "I Couldn't put this book down once I started reading it. This book kept my interest until the last page!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3400P8KBTGSXF"}}, {"Date": "on November 29, 2013", "Text": "I was not sure I would get into this book as I had read an apocalyptic novel of similar subject a few months ago but this book grabbed me and shook my complacent mind into a frenzy of fear that this could very well happen to our country. A great read for military vets especially marines as well as civilians because it shows interactions and accomplishments of both in a world gone crazy.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3K07Y5HM7MWAO"}}, {"Date": "on November 12, 2013", "Text": "Well written book that keeps the reader enthralled with all the different ongoing activities of each of the characters. The book ,although fiction  is not totally unfeasible from a possible reality  if a similar crisis were to happen in the US.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37C1KGD1W96TG"}}, {"Date": "on November 11, 2013", "Text": "Is say local because all of this occurred in my home town. All the streets and stores mentioned are places I know very well,although I could have sworn it was a home depot off Mira mesa and not a Lowe's.  Anyways, this was a fast paced thriller about a worst case scenario of an emp stopping America answering situation from several different vantage point. I really like it an  I plan to be  the next book.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABDMECDAEP3T3"}}, {"Date": "on November 11, 2013", "Text": "I liked that there were no zombies or monsters. The author gives you something to think about. it was very realistic and kept me turning the pages.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21VS1VDX2FZ1W"}}, {"Date": "on November 11, 2013", "Text": "This is a very good book. The genre is one of my favorites. I definitely will read the next book in the series.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGFJ3DPS5ZXAW"}}, {"Date": "on November 10, 2013", "Text": "Amazing story. Makes you wonder how your friends would fare in this type of situation. I only hope I would be able to keep my family safe.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3P74Y6RGTKEMY"}}, {"Date": "on November 6, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYGMFB6M0EK7Z"}}, {"Date": "on November 4, 2013", "Text": "It's not rocket science, but I certainly enjoyed it, so much that I purchased the second book after getting the first via the lending library, cheers, and please keep up the good entertainment", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FMC2FVN9DRD"}}, {"Date": "on November 3, 2013", "Text": "A novel but very realistic and I am glad to have read it . The title  is a little misleading in that many think it is about the biblical end time.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3K2O9405RCIA6"}}, {"Date": "on November 3, 2013", "Text": "Overall the tone of this book is pretty harsh, but its a good story with good characters.  The actual premise of a high altitute emp completing wiping out everything electronic isn't actually true but like any other work of fiction some suspended belief is required.  The character development was good and it helps to set up and explain the sometimes brutal violence contained in the story.  this is a good post-apocalypse story with some raw human elements.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AT7F6GYEWRUPW"}}, {"Date": "on November 2, 2013", "Text": "Outstanding story.  Finished the read in 7 days.  Just started Book 2. I hope the author can keep up, please drink more coffee..", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7D1SPQ5FPVH3"}}, {"Date": "on October 30, 2013", "Text": "I am getting the 2nd book right away.  Thus was hard to put down.  I missed my bus stop once because i was so into the book.  I have read several post apocalyptic books and this is my favorite.  Makes you think about the possibility and hope this never happens.  It tells 3 stories that are happening at the same time.  It keeps you interesting in all 3 and turning the page hoping to get back to your favorite one soon or not to leave the one you are currently on.  I cant wait to start the second one.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARNUU4JICW1XZ"}}, {"Date": "on October 29, 2013", "Text": "I enjoyed the story, however realistic it seems.  Good writing and plot creation, quite impressed. I will be reading his next book.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AULM87L1P9AFY"}}, {"Date": "on October 29, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A110KTQQPAS417"}}, {"Date": "on October 29, 2013", "Text": "This is the first book I have read of this author. This book grabs you from the beginning and doesn't let you go. The way the author explains everything, it makes you feel like your living this nightmare with them.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2H21G2HP2T0AI"}}, {"Date": "on October 28, 2013", "Text": "I thought that the author did a great job in realistically portraying how quickly society could devolve into the Dark Ages.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19M9NKK0VTG2I"}}, {"Date": "on October 28, 2013", "Text": "I found this a well put together story.  It moves along at a good pace.  Believable characters, and plot.  Good read.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WHJT0GKTONH4"}}, {"Date": "on October 28, 2013", "Text": "I enjoyed the book. It was too short but worth the price. Off to read the second book. Buy it", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TWUCVFHHA7J6"}}, {"Date": "on October 27, 2013", "Text": "I got this book for free.This book started and never stopped grabbing my attention. This is the first apocalyptic type book for me.It was eyeopening and terified me to the extent that I now know that I/we should be preparing for this to be happening yesterday! This is our reality,If you look at what is happening with our government today.Most people think we can depend on our government to take care of us in any catastrophy.This book showed me to not be so blind.The way the story played out was all to real and I now know that I am not at all prepared for what is inevitable.Even starting now there is not enough time to prepare. In todays age this should be recomended reading material in junior high school so our young will bring it home for parents to read who believe as I did so they would know to begin preperations. This I feel is one of the most important books  I have ever read and wish I had read such a book 40 yrs. ago so I would be prepared for the inevitable today.This book is fiction, today!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1M3MN9ROC2ZBI"}}, {"Date": "on October 25, 2013", "Text": "Well written of what could possibly be a reality one day. Scary! Great story, can't wait to start on sequel", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A135NU067H4NJ8"}}, {"Date": "on October 25, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NO84ZD94XB7I"}}, {"Date": "on October 21, 2013", "Text": "A page turner, hard to put down once you start. One of the better novels I've read in this genre.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34WBU7AT8R592"}}, {"Date": "on October 21, 2013", "Text": "On par with Tom Clancy for detail and development.  These stories will really make you think on how prepared you might be for this sort of world.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JRP6HV92JW5Y"}}, {"Date": "on October 19, 2013", "Text": "I don't like to have to review other peoples work. What is good for one person might not be good for another. But thank you", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LVU1IIQ88JVP"}}, {"Date": "on October 19, 2013", "Text": "I've been reading post apocalypse fiction for a few months now and most are fanciful and with limited scientific accuracy.  This series is spot on.  Michael got it right and his story is the super scary truth of how fragile our way of life has become.  I can't wait for the third book.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3S9FGV4Z2FLOM"}}, {"Date": "on October 16, 2013", "Text": "It's unfortunate that i can only give this book five stars because it deserves many more! Exciting, well thought, well written! Fresh and inventive. Awesome!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DRO0HGO2TIJZ"}}, {"Date": "on August 6, 2013", "Text": "I am s huge fan of Alas Babylon and imagine it as a manual for when the world ends. However, this book is a modern version of that with the violent reality of how our world will be after it end. Where Babylon touched the surface of post war reality, The End takes you over and beyond.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A78GSREUVDCZL"}}, {"Date": "on July 5, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3M8KPYX6CGUTQ"}}, {"Date": "on July 3, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HAMVJUIH479Q"}}, {"Date": "on June 14, 2013", "Text": "I believe this is Mr. Hopf's first novel, and he deserves congratulations for an exceptional writing debut.  If you have any interest in post-apocalyptic stories, you'll really enjoy it.  If you don't have an interest, you'll probably enjoy it anyway.  The book is well written and the characters are believable, as is the entire story line. Mr. Hopf takes you on a journey through the eyes of a survivor. While the book has an ending that doesn't leave the reader up in the air, it also opens the door to the beginning of another adventure. I am looking forward to the next book in the series. Good job, Mr. Hopf! Keep writing.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OJEKXAQA6ESP"}}, {"Date": "on June 1, 2013", "Text": "The story was just okay for me. It was not a particularly imaginative take on the apocalypse theme, and was very heavy on military themes and characters. (There would be more challenges to be overcome had most of the main characters not had military training. The story would have been far more interesting if they were just normal people with no particular combat readiness.) There really wasn't any resolution at the end, either... Just a hook for the next book.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ALMG2V3GXD0M"}}, {"Date": "on May 13, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31BN3V5GS79WA"}}, {"Date": "on September 1, 2013", "Text": null, "Helpfulness": 0.75, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DJXAO662DUR7"}}, {"Date": "on December 10, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BNZVP7NR7PCR"}}, {"Date": "on May 14, 2013", "Text": "I really enjoyed this book, I read it non-stop. If you like a well written nonstop action thriller that keeps you on the edge of your seat you will love this one.", "Helpfulness": 0.8, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SL5MZJ50WJKW"}}, {"Date": "on March 18, 2015", "Text": "This is a good book & the type of book I love to read.  Survival stories are my favorites.  However, as good as this book is, there needs to be some real improvements.  The character development is very poor.  That is the first thing I look for in a book.  The only development in this book is the lack of food & the cruelty of some people.  Not all of the cruelty was caused by the bad guys.  Anyway, Gordon is an egotistical jerk.  Sebastian is a whining child. Connor is a psychopath.  The children, at least Haley, is a spoiled brat.  The women seem to be on another planet. Most of the main characters are not at all likeable.  All of this sounds like this is a terrible book but the writer is good & would be very good if he just added some real characters to read about.  His descriptions are good & not rambling on & on.  I will definitely read the whole series & probably enjoy most of it.  I guess I can't expect Stephen King or F. Paul Wilson in every book but sure would like to have their type of characters to read about.  Even F. Paul Wilson made his main character with a larger than necessary ego but we who read his books also knew the character well enough to see his good points.  So far I haven't found much of a good side to Gordon. He is great at killing anybody & everybody but not sympathizing with the \"human condition.\"  Maybe a lot of us would react the same way in times like these but I want a little better from the books I read.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATYL4WCQA1WN2"}}, {"Date": "on April 17, 2013", "Text": "Just got \"The End\" and have enjoyed it from the moment I started reading it.  I hate to put it down.  I love when a book takes off like this one.  I can't wait to finish and look forward to part 2.  Great work!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AV12XGI4W6CQX"}}, {"Date": "on July 10, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SF6922L1Q6N0"}}, {"Date": "on June 10, 2013", "Text": "I liked this book because it was not the same old story I'm used to reading. This had a unique group of people with particular skill sets that made survival possible. I look forward to the next book.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33RBUVESJ48YQ"}}, {"Date": "on August 13, 2013", "Text": "The central character is an ultra-narcissist whose only interest is his nuclear family.  His women characters are either good girls (soft, but firm, wives and mothers), or B*****ches who oppose him.  Literally.  He has no recognition of his own amorality or pathology.  But worse, he's boring and predictable.  And that's why I found it impossible to finish.  I just didn't care about any of the characters.", "Helpfulness": 0.7272727272727273, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D2OAPRCCYPC7"}}, {"Date": "on July 23, 2013", "Text": "The characters and writing were awful. You could skim over whole pages, knowing you we're missing nothing. Glad it was so inexpensive.", "Helpfulness": 0.7272727272727273, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIIIC8Z37AHHB"}}, {"Date": "on May 27, 2013", "Text": null, "Helpfulness": 0.75, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22GNVGUDVO6AG"}}, {"Date": "on July 3, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CJI1YRINSV3H"}}, {"Date": "on August 18, 2013", "Text": "To begin with, I had intended to purchase the Kindle version of this book.  Somehow, my fat fingers must have punched the wrong button and viola...I bought a large (thick) paperback.  First thing I noticed is that Mr. Hopf must have \"self published\" this book, as I could not find any reference to an external publisher...opening the cover, I was happy to see the fly lacked the usual PC drivel about \"Coincidences to any person, living or dead,\" yada, yada.  Don't know why that pleased me but it did.  Now on to the review; Some readers have started their reviews by saying, \"For his first book it was outstanding,\" etc.  I'm here to tell you that for anyone's book, no matter how far along their literary path they may be, this was an excellent bit of work.  I started the book after dinner and finally put it down with 30 pages left at 1 AM.  Very fast paced with characters that were well-developed and believable.  Bravo, Mr. Hopf.  Can't wait for the followup effort.  Thanks for the lost sleep.  Mk", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3K9PQQOPAX4AQ"}}, {"Date": "on July 30, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GHD9WOS3N81R"}}, {"Date": "on August 5, 2013", "Text": null, "Helpfulness": 0.7142857142857143, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIQ4BK6MON98Z"}}, {"Date": "on March 13, 2015", "Text": "This is a truly mesmerizing tale, not to mention thought provoking. The EMP he describes has been in the news for quite some time and most people I talk with have no clue as to what it is, let alone it is one of todays most realistic dangers to America. Several countries are working on EMP weapons, I assure you they are not making them for the hell of it. In Mr Hopf's book he realistically details not only the cause but in my opinion very accurate scenarios  in the aftermath of such an event. I simply can not stop reading his novels, one and two have been devoured in the blink of an eye. I'm trying to slowly savor book three while awaiting book four. I know the series has to eventually come to an end, my only hope that his next writing agenda is as compelling as these. I have little doubt I will adore anything this man writes. His description of the chaos after the attack is so real I can feel ad taste it at times. Great writer, please keep it up Mr Hopf.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GIJKWOWHZ48Q"}}, {"Date": "on May 24, 2013", "Text": null, "Helpfulness": 0.75, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2O3DPIC2EIE85"}}, {"Date": "on August 16, 2013", "Text": "I must say, I am waiting for the next book in the series...This is definitely one of those \"thrower\" books...Typically, I can peg what happens next...  not in this book.  Whats good?  The \"hero\" doesn't make it to his bug out location and has to make due with what he has and where he is...Not everything is cut and dry and the characters have to improvise... It opens up those \"cans of worms\" that leave you with ~ OH, Never thought of that!  I've often thought that these kinds of novels were just as important as the \"how to\" books because they give you scenarios and make you think about what YOU would do in certain situations ~ And this book goes to prove that building community is the long neglected prep.  Most excellent job G. Michael ~ looking forward to another sleepless night because of you!  Check out our interview of G Michael at [...]  click on July 16th and enjoy!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALUJSHBIC3FW6"}}, {"Date": "on September 2, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GN5X5BEMG0QK"}}, {"Date": "on April 18, 2013", "Text": "Unlike other other books you don't wait for for the action to start.  The End brings you right into the struggle.  A must read!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28UZ84WMN4JOO"}}, {"Date": "on December 1, 2013", "Text": "I love this genre of book.  I love the survival stories.  I have passed this on to friends hopefully everyone will enjoy it.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15LDYHVYWRN9Z"}}, {"Date": "on July 27, 2013", "Text": "Very few books have the ability to make me want to buy them after using Amazon's \"Look Inside\" feature....This was one of those books! Starting the story in the near future and having a reporter interview the main character's daughter not only helps draw you in to the story, it lets the reader know that this is not it for this series. The book shows the harsh realities in which society would crumble if the technology we rely on suddenly dissapeared. At times we as the readers hate the protagonists actions but have to ask ourselves \"Would I do any different in this situation\"? For this reason it is a great novel it is not only entertaining but also thought provoking. It is a quick read if you have time to read the whole book on my day off!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZTSUTO0B6UL5"}}, {"Date": "on July 1, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QJJYD6154SD5"}}, {"Date": "on July 17, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TJLV8IKL7ETE"}}, {"Date": "on August 23, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APF68752DVIG2"}}, {"Date": "on May 18, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6GT3MYS3CHWQ"}}, {"Date": "on June 26, 2013", "Text": "As many times as I have wondered about the possibility of this future, I have never prepared for it.  I have been completely enthralled, entertained and most importantly informed by \"The End\".  While I don't read many books these days, I could not wait to get some daily time with this book.  My social life was scheduled around read time!  That hasn't happened in years. I now feel like I am somewhat prepared to deal with life after an EMP attack, should it occur, but I also have more reading to look forward to.  This book is a Survival Guide as well as entertainment and I am very fortunate to call McCall, Idaho my home!  Cheers G. Michael Hopf!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMGV6RRIC6VWB"}}, {"Date": "on June 24, 2013", "Text": "I came across this book while browsing through Amazon's kindle owners' library, and was immediately intrigued by the premise of the novel: what could happen in the event of a large-scale disaster, such as an electromagnetic pulse (EMP) attack.  This book was hard to put down!  I found the story smart, thought-provoking, well written, and engaging.  I appreciate how the book chapters are laid out as a timeline.  This book is a must-read for citizens of modern societies, and serves as an excellent reminder of how much we take electricity (and civility) for granted.  Looking forward to the next installment!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1E0GKL35OJJVT"}}, {"Date": "on May 13, 2013", "Text": "I really felt the Author did a great job writing a believable story with twists and turns that have the reader having a hard time putting the book down.  His character development was good.  It was interesting to see how each character in the book reacts to life and death decisions which made me reflect on how our country would be if this situation played out.  It was interesting to me to see a group of Marines and Sailors defy the orders of a President of a rotting country.  The time to obey orders from phony politicians and Hollywood is over. Cheers....and cant wait to here the rest of the story!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28IP7V4LTHWGJ"}}, {"Date": "on August 7, 2013", "Text": "If you liked the movie Red Dawn (the original), you will like this. Though its not Russians invading the US, its does have a similar quality, of a small group of people dealing with the aftermath. I agree that the characters could have been defined more, but I don't think this affected the overall plot. There is enough happening that instead of back-story, we can determine the motives of the individuals by their actions. I am looking forward to the next book \"The Long Road\" with anticipation. And this promises to be a great series. I also look forward to seeing how Hopf's writing progresses.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUQTZI41DU3F1"}}, {"Date": "on September 11, 2014", "Text": "This book set me off. I was infatuated with it from the get go. Gordon as a lead character is intelligent and swift. His perception of the sudden reality cast upon him was engrossing. I really enjoyed the multiple perspectives in the book as well. From Connor to Sebastian and back to Gordon and his family, it was nice to see the multiplle views of the catastrophic event. Loved the book and im already on the 3rd in the series. Ill be patiently awaiting book 4. Thanks G. Michael Hopf , youve opened my eyes to how quickly life could change as we know it.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2W16YBWZ4VX9X"}}, {"Date": "on March 2, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26YX8MTQYPWDU"}}, {"Date": "on May 17, 2013", "Text": "I enjoyed this book. It didn't seem like 400+ pages because I managed to read it in roughly 24 hours. Sleep and normal life duties interfered with me finishing it faster. It reminded me of a cross between the James Rawles series and One Second After by William Forstchen. The only reason I didn't give 5 stars was due to a couple very tiny errors that were nearly unnoticeable. I am eagerly awaiting the next book in this series and have already recommended this work to some friends and family. Overall I say worthwhile!", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2D6CPF76JH13Y"}}, {"Date": "on November 6, 2013", "Text": "This book was exciting to read from beginning to end. It's the kind of book that makes you think, and makes you wonder. It also inspired me to Thank God that things are not that bad in the US...yet, and I hope they never are. For me, I encourage the other readers to see the book for what it is....a fiction novel based upon a premise...what would happen if? I read the 2nd book in the series, The Long Road, and am anxiously awaiting book 3. You won't be wasting your time reading this book, if you like a lot of action, and enjoy imagining how things could be.", "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HQHAIGNL3DGL"}}, {"Date": "on May 28, 2013", "Text": "Purchased from Amazon...I've read dozens of Post-Apocalyptic novels & most (but certainly not all) were entertaining but I definitely rank 'THE END' as one of the best written & most enjoyable of all! The arthur, Mr. Hopf certainly did his homework & it is easy for the reader to imagine that his story accurately depicts how people might react & survive at the end-of-the-world as we know it. Once started, it was simply difficult to put down! You won't go wrong buying this book.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39JRAKN7BWS5B"}}, {"Date": "on July 1, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9APJGYYFD1JX"}}, {"Date": "on June 5, 2013", "Text": "I just finished reading this book and all I can say is WOW!! The character development was great, and from the moment you started reading it just engrossed you in the novel. Before I read this novel my favorite book in this genre was \"One Second After\" which was a great book as well but this far tops that novel. I highly recommend this book to anyone that liked \"One Second After\" or \"77 Days in September\". I cannot wait for the next book in this series.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QRR9VNDPK04U"}}, {"Date": "on May 28, 2013", "Text": "For a new author, Mr. Hopf has done a very good job on this first book  in the series.  While there were a few typos, he (or someone else) clearly did a great job editing.  This is no mean feat for a new author!  The book is well thought out, decently researched and entirely plausible.  The world created is well crafted indeed without falling to the tropes fo all too many apocalyptic novels.  This is an excellent read for anyone who's a fan of such material and I look forward to the next book!", "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFG005J657WY5"}}, {"Date": "on May 29, 2013", "Text": "I have not finished this book because i dont want it to end. The story is totally believable, not like some or most post disaster books ive read. You see life through the eyes and thoughts of the characters and are gradually led into a world of chaos.  I cant wait for the next book, and being a believer in the possibility of an actual EMP, after buying and reading the ebook, im getting a hard coy, just in case.  Great job by a great author.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BO1P3W7YOLIT"}}, {"Date": "on July 7, 2013", "Text": "The EMP info = essential knowledge \"in case\".  I appreciate reading what resources will be needed and available.  Bicycles and OLD vehicles can help us obtain and transport them in the first critical days.  Characterizations were realistic and evoked my emotion.  I'm eagerly awaiting book two so I can know what to prepare for after Phase One of an EMP and so I can learn what the author has happen to Sebastian and to Haley's brother.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FGWM7KNK2JOY"}}, {"Date": "on August 16, 2013", "Text": "I absolutely loved this book. It was a page turner from the first line and I couldn't put it down. Excellent character development, the author weaved the story line together in a way that kept me engrossed from beginning to end. My only disappointment was getting to the final page and wondering what the future holds for the dynamic characters. I see the second installment is coming soon so I don't have long to wait to find out.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AS5ZVV2883D06"}}, {"Date": "on August 9, 2013", "Text": "I couldn't stop reading. Hoping the next book is as well  written and easy to follow! At 38 I feel somewhat behind on what I should be doing to prepare for any future issues.  Thanks for giving me a realistic view into the animal side of man that is sure to be present on any extreme timeline. All the while learning the importance of trusting relationships along the way, new and old!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IMTVSWLFC5UC"}}, {"Date": "on May 11, 2013", "Text": "This book grabbed my attention from page 1 and held it to the last page. Perhaps, some of the \"shoot first,ask questions later\" events seem over the top, when you consider life as we knew it no longer exists, the world will be a 'kill or be killed' existence. Looking forward to reading the next book in the series, not looking forward to what life would be like, if an EMP struck.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OE0OATNMFMPT"}}, {"Date": "on May 31, 2013", "Text": "I felt like I was a part of the action!  The author does a great job describing the events and making you feel like you are beside the characters as they do battle with unsavory characters in an anarchist state. This book also increased my awareness of how our world as we know it could deteriorate rapidly if an event disrupts the power grid for an extended amount of time,", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1H97PP40ROP2W"}}, {"Date": "on May 25, 2013", "Text": "Bad writing abounds in this genre but this author has talent. He tells a compelling story with well developed characters and successfully avoids the usual pitfalls of bad dialogue and poor editing that often plague new writers. I've read hundreds of shtf type novels and this is in the top two or three. A great first book and good enough for a mainstream market. Can't wait for his second book!", "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AS68HOKD544K6"}}, {"Date": "on July 9, 2013", "Text": "I read a fair number of books, and to me if I am not into it after the first couple of pages..I usually toss it aside.  With this book not only did I never toss it aside, I never even put it down.  I have long been fascinated with the potential for complete societal breakdown following disasters or attack, and this book was spot on. Can't wait for the sequel.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HG4RDATHM00"}}, {"Date": "on May 19, 2014", "Text": "Great read. Written for modern day readers as G Michael Hopf does. He doesn't dive into explaining every scenario as most writers long ago had to describe everything. Again, more modern. Hopf's characters weren't written to be likable. It's a survival situation, every decision made is to survive, not to be morally perfect. Great read, have read The Long Road and order Sanctuary.", "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FVOBIB2G8Y0Q"}}, {"Date": "on July 10, 2014", "Text": "Awesome book! I read a lot in this genre and this has to be one of the best! Entertaining read but really makes you think about the fragile state our lives really are. Highly recommend!!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3V3E9KBX2LQGI"}}, {"Date": "on June 13, 2014", "Text": "Realistic scenarios, and only a few will anticipate enough to survive. The trip out of San Diego needs more detail added", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFOMZN9YF7MGN"}}, {"Date": "on March 31, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANM42D7WGZY83"}}, {"Date": "on February 24, 2014", "Text": "I liked the first book in this series very much.  I find characters that use strategy to develop some semblance of normalcy in the post-apocalypse very entertaining.  the development of a small society in a housing development was very interesting.  Having different factions with different motives kept the first book moving along very well.  The lead character is flawed...wow, that doesn't happen often.  He has a temper and isn't always able to control it.  Nice to have a real character.  I do have to agree with some of the reviews, though.  The character development is spotty.  Important people do things that aren't consistent with prior experience.  I must admit, I bought the second book and found it far inferior.  It devolves into a standard book with even weaker character development.  I add this simply because if you bought the second book expecting more of the same, I think you will be disappointed.  My rating on the first book was very high.  The second book was barely average.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A619LFPT9U6QU"}}, {"Date": "on February 23, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VPX1QH62VSMH"}}, {"Date": "on February 9, 2014", "Text": "This book scared me in that this could possible happen and there would not be anything we could do about it. We would be in a mess if we lost our food source as most people don't know how to provide for themselves unless they go to the grocery store. Kept me on my toes! I am looking forward to the sequel.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1R3U3IDVNA0A1"}}, {"Date": "on February 8, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HICLKUUYWPUQ"}}, {"Date": "on November 2, 2013", "Text": "Good story and kicker for the apocalyptic imagination. Story jumps around a lot and is very scarce on detail which prevents in depth interest into the characters. Overall good read, gonna get the next one just because I enjoy this genre so much.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A282SMOYLQALSP"}}, {"Date": "on October 15, 2013", "Text": "Dark thriller. A scary look into the future. A great accounting of what the apocalypse would really look like in the U.S.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQ013I1IDBKOJ"}}, {"Date": "on October 9, 2013", "Text": "I just thought that I would add my 2 cents worth and say that character development is for romance readers, and this is NOT a romance book, so who cares if somebody stubbed a toe when they were a child and now can't cope with military issue boots? Action and adventure buffs will love the book, so that is that, end of story, and the last review that needs to be written.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2N2L0JGLU3CS1"}}, {"Date": "on October 9, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIAYNAZ54QQRK"}}, {"Date": "on October 6, 2013", "Text": "Loved this book. Kept me reading well into the nights. Dark and gritty. If I were to imagine how things went down after a super EMP attack on USA, this would be it", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQZ0DAIZEKOEY"}}, {"Date": "on October 6, 2013", "Text": "Very interesting concept. Hope this never happens.  Really enjoyed the story.  Is another one in the works. Tell me yes!", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SS95N3K2UCZA"}}, {"Date": "on October 5, 2013", "Text": "this is book one of the trilogy and one of the best i have read. Hopf puts you in touch with the charactures. highly recommend this series", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16S8NJT5L86GV"}}, {"Date": "on October 3, 2013", "Text": "Having personally lived through several hurricane-induced time periods of civil unrest, I can attest to the author's frank depiction of how things go downhill rather quickly after an \"event\". This book was riveting and I couldnt put it down after the 1st chapter! There were some spelling & grammatical errors, but nothing terrible enough to detract from the work itself.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1P71ZYG10RXLF"}}, {"Date": "on October 3, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TA4K2M1FEH7J"}}, {"Date": "on October 3, 2013", "Text": "This was an eye opener. Having lived through hurricanes I have seen how chaos can take place in a short amount of time. As prepared as you may think you are, trust me, you are never prepared enough.  Only by reading the book can you understand your survival mode.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QI7KGAA5Y21B"}}, {"Date": "on October 1, 2013", "Text": "This book makes you think, what would you do in this situation. Are you prepared? Well I feel I am more aware of what is important and what needs to be taken care of in a country with no power. Anyways this book was entertaining as well as informative.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A225ASNDUJ4CXK"}}, {"Date": "on September 29, 2013", "Text": "Lately i've read a few of these post-apocalyptic books. This one is by far the best. Highly enjoyable, and thought-provoking.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AH0KYB7KHBKR2"}}, {"Date": "on September 27, 2013", "Text": "I loved this book and the series this far. I am looking forward to the 3rd book in the series.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23ABDTGLHWJL7"}}, {"Date": "on September 27, 2013", "Text": "The scary thing about this book is it's something that could potentially happen.  It really makes you think about what you would do and how far you would go to protect yourself and your family given the situation you find yourself in.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AE0LNZ5D97NCB"}}, {"Date": "on September 24, 2013", "Text": "At first I wanted to skip around and almost stopped reading because all that military stuff is not what I read. I'm so glad I hung in there because I would have missed a great book!  Plenty of action and also great characters. I love the relationship between Gordan and Samantha. Both are strong but know when to listen to the other. Looking for the next book immediately!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4AWT3H2YSHSA"}}, {"Date": "on September 24, 2013", "Text": "This is a great novel. I love futuristic, sci-fi books that are still based in reality and this one fits the bill perfectly. I loved the story, the main character is likable, but not too likable (if that makes sense) and it is full of action. It is kind of scary though. It seems that this could actually happen. Makes me want to start stocking up on supplies!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ANGIF39MXARG"}}, {"Date": "on September 24, 2013", "Text": "This could be seen as a wake up call for all of us...we need to be prepared a lot more than we are! It was a glimpse of what could happen to our society after an extra-ordinary event. This was a good story, and I can't wait to read the sequel.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NGMQFEC94NJF"}}, {"Date": "on September 23, 2013", "Text": "I read the reviews before purchasing, and now that I've read the book I'm wondering of the negative reviewers actually read it. First, the premise of the novel isn't that far fetched, and the description of what happens during and after \"the event\" are believable. The characters are well defined and their motivations are developed and therefore their actions are believable. At times there is a lot of action so rather that create an 800-1200 page Tom Clancy novel (I like Clancy but sometime have a hard time getting through his thick novels) the author uses the same approach as one of my other favorite authors, Jack Higgins, and keeps it short and to the point in the narrative which makes for a fast paced novel which is hard to put down. I borrowed this fist novel using my Prime membership, but just purchased the second as I really like this new author and hope he's working on a 3rd book already. If you like fast paced post-apocalyptic dystopian fiction then you'll love this series.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AM3RVPJ3ISDDQ"}}, {"Date": "on September 21, 2013", "Text": "I have seen the other, more critical reviews......  Geeeesch!  What do you expect?  This is his first book!  Did I enjoy the read? YES.  Did I learn something?  YES.  Will I read Hopf's next book?  Absolutely.  I live in the great town of McCall Idaho.... Hope the frequent references to it don't motivate the masses to come here when the going gets rough.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BCUXMJLV3KQN"}}, {"Date": "on September 21, 2013", "Text": "Thought story was well written and the scenario was quite believable I enjoyed the story.  The main character Gordon was a bit over the top, but still somewhat believable.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1O45PG3MK4TE9"}}, {"Date": "on September 21, 2013", "Text": "THIS BOOK IS TIMELY AND FOLLOWS THE THOUGHTS AND FEARS OF MANY AMERICANS! It is an easy read. Enjoyed it very much.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TLL09VMC332A"}}, {"Date": "on September 19, 2013", "Text": "An excellent first book in a series that kept me turning pages, long after I should have gone to sleep.  I had to order book 2 as soon as I finished reading this book.  I can't wait to read what happens next.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1A3UCSCBIJZ46"}}, {"Date": "on September 19, 2013", "Text": "Decent book all around. Probably not the most realistic, at least in terms of the Marine response. It does try to cover an ambitious number of story lines.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2L105BUM6YZ6"}}, {"Date": "on September 19, 2013", "Text": "This is a very scary story & I had to remind myself several times that is what it is..a story.  Kept me on the edge& really made me think. Looking forward to reading book 2.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A393HMK1RR0ZMC"}}, {"Date": "on September 19, 2013", "Text": "Better than the first book I can't wait for the next book.I couldn't stop reading it. I wish it was longer.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BA057PS3G0NW"}}, {"Date": "on September 18, 2013", "Text": "I really liked this book.  I believe it captured well how people will respond to a major crisis in this country that will leave everyone struggling to survive without ANY government assistance.  Gets you to thinking on what we should do to prepare for any eventuality. And gives a good snap shot of how people will behave when struggling to survive.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34D2ZHT7Q4PDK"}}, {"Date": "on September 16, 2013", "Text": "This book has believable characters. The author makes feel good about the characters. The plot is fairly good it has good pace.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PM7K9S8NJ69K"}}, {"Date": "on September 16, 2013", "Text": "Despite some misgivings about the writing of the first chapter or two, this developed into a good read. Good enough for me to order the follow-up book.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11YBDLV4PS412"}}, {"Date": "on September 15, 2013", "Text": "This plausible novel about a major EMP and nuclear attacks that started the rapid destruction of America is on a similar theme of \"One Second After\" except that the US doesn't survive and this is the first of a series. I would recommend. There are some real survival issues at play that most folks would never think about for families, communities as well as a nation. Sadly, a major EMP  is a realistic threat with the same potential dire consequences.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUGQSOS5KTNOH"}}, {"Date": "on September 15, 2013", "Text": "I had a few sleepy days at work because I literally could not put the book down.  I just needed to know what happened next.  On my way to purchase the next installment.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CE1MIBSXTQC5"}}, {"Date": "on September 14, 2013", "Text": "There are a few rough edges and a couple of points where I'm left thinking that a particular story element is just not believable, or that the transition from one moment to the next is a bit rough. Great character development, though. Left wanting to read more.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AM23SC3ZPOIB3"}}, {"Date": "on September 13, 2013", "Text": "It was slow to start with but once you get into it it's hard to put it down. If you liked the Left Behind series then you will like this series. I can't wait to start reading the next book.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SA9GPS1JVEK4"}}, {"Date": "on September 13, 2013", "Text": "A really engaging read.  You can put yourself into the shoes of any of the characters and the words on the page become your reality.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1G1JKDR2LETS6"}}, {"Date": "on September 13, 2013", "Text": "I've read similar stories along these lines. Good character development. Some are a little stereotypical, like the HOA lady.  I'm about to start book 2.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJMHNTX905YWY"}}, {"Date": "on September 13, 2013", "Text": "an extremely plausible, pulse pounding vision of life after EMP. A fast paced, fraught with peril chronicle of the struggle to survive, and rebuild. A rich tale with great characters both good an evil. Looking forward to the next book in the series!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UZD5GAD7P9BI"}}, {"Date": "on September 13, 2013", "Text": "Great story line and suspenseful plot. I could see this as something that could really happen in the US. Scary!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AF18TWVLF1UQP"}}, {"Date": "on September 13, 2013", "Text": "This book /series has a realistic view of how the world would be if we were attacked in the way portrayed in this book. I enjoying the series so far.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1A910S9UF3JLP"}}, {"Date": "on September 12, 2013", "Text": "I don't know where to start. This had me riveted from the beginning. You will not be disappointed. Obviously, I'm not a writer.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OM2NEC9GGPRV"}}, {"Date": "on September 11, 2013", "Text": "I think this is realistic for fiction. I would highly recommend this book to every one. What is next? Now.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2J6L7XZJUAO5L"}}, {"Date": "on September 10, 2013", "Text": "This is one of the best apocalypse novels I have read so far and there isn't a zombie anywhere!  It was especially chilling since I was reading it while Syrian chemical attacks were in the news. The very real possibility of this fiction coming to life is truly frightening.  Be afraid folks.  This could be a look at our future.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A160BUGXVBJ5VK"}}, {"Date": "on September 10, 2013", "Text": "Very entertaining. Didn't want the story to stop. It shows a probable and likely situation if an EMP were to strike the U.S.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A134FRR1UGUYF1"}}, {"Date": "on September 10, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NYTURQZK3QQ6"}}, {"Date": "on September 9, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AG5GB8JKT4HR9"}}, {"Date": "on September 7, 2013", "Text": "I read a lot of books and magazines, but this one held my attention until I finished it! GREAT reading!", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25IJ1R6A57PHF"}}, {"Date": "on September 6, 2013", "Text": "This book kept me interested from beginning to end. I am now reading the sequel and it already has my attention. Thank you G. Michael Hopf, for great reading!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AC9AFG8PVGXJD"}}, {"Date": "on September 6, 2013", "Text": "This is definitely a good read, in that the way it is written it sounds just like stuff that is occurring around us right now.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2G51WC3NE3FRQ"}}, {"Date": "on September 6, 2013", "Text": "I thought this book was very well written. I can not wait to read the rest of the series when it comes out.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38HGMNTNBAG8N"}}, {"Date": "on September 4, 2013", "Text": "I read this book in 24 hours and I never do that. I couldn't put it down. The book never let you down and was easy reading. I will start the next book this week. Great book.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GD41PQZECNZN"}}, {"Date": "on September 4, 2013", "Text": "I had this book pop up as a recommendation since I had bought a few similar.... wish I had found it sooner! The bar has been raised! When you get this one, just download or buy book 2 at the same time.... take my word it will save you frustration of waiting :)", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24UY3XGS2KYVU"}}, {"Date": "on September 4, 2013", "Text": "Did not know this was a series when I started reading, and now after finishing book two can not wait for the third installment.  Don't know what to say without giving anything away. You want the family to survive, and the story keeps pulling you further in.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZM59S2LKPWZK"}}, {"Date": "on September 3, 2013", "Text": "I have been kind of fascinated with end of world stories and this one had me hooked with in the first few pages. I read this book within a week (which is fast for me) and started book 2 as soon as I could. Highly recommend.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18DXHJ2E74N6W"}}, {"Date": "on September 2, 2013", "Text": "I bought this story, started reading it then got distracted and put it away for another day. Today was another day, I guess. I started reading it again and did not put it down until it was finished. It is an excellent story. I did get a little frustrated at times trying to keep up with everyone within the story, but the storyline itself guided me through those parts. And while I didn't like some of the things that happened, I can clearly see how they could happen within a post-apocalyptic setting. If you like post apocalyptic stories you will enjoy this one. Buy it, read it, you won't be disappointed.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2F1VSYZM3WVI1"}}, {"Date": "on August 31, 2013", "Text": "Not a great deal of suspension of disbelief which is nice nor does it bog down in details.  Realistic and developed characters and story with good flow.  Recommended to any apocalyptic survival fiction fan.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQF13X8E0L998"}}, {"Date": "on August 31, 2013", "Text": "Great read. Cannot wait to read the next book hope there is more then 2 in the series.  Highly recommend", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EDT8U3RETR41"}}, {"Date": "on August 30, 2013", "Text": "I rented this book and am eagerly waiting for the next. Well written story and fast paced. I highly recommend reading this if you like apocalypse stories.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PH9OQAQYDP2J"}}, {"Date": "on August 29, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJ5XZHKEX3LL8"}}, {"Date": "on August 28, 2013", "Text": "I'm always pleasantly surprised when I get a \"free\" kindle book via Pixel of Ink that is this good. I finished it moments ago and have already ordered the next one in the series - the 2 days wait until its publication is torture! Great story and despite the typos (I would edit your books for free!) well worth a read!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29UJIZ4GB5YAY"}}, {"Date": "on August 28, 2013", "Text": "The story starts a little slow, and I thought  to myself, \"Oh No, another post apocalyptic novel written by retired military, with weak female characters &  guns, guns, guns\". I was pleasantly surprised, as the pace picks up & the jargon is understandable. The storyline is interesting, however the female characters mostly remain insipid, hysterical, & quite frankly, stupid. The children &  women are stiff and unrealistic. So why then you ask did I give it 4-stars? For the same reason I ordered the sequel. I enjoyed the story and was invested enough to want to know the end of the saga. I hope the author continues to write and softens his rough edges.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PJR6ZFPJPCJN"}}, {"Date": "on August 28, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PVLAKF1BMOMG"}}, {"Date": "on August 28, 2013", "Text": "I got this book for free and LOVED it.  I finished it in a few hours and couldn't put my Kindle down. I love the fact that it shows how we as American are completely unprepared for any kind of major disaster. This book definitely makes you think what would I do.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TMQKGCGVK6MQ"}}, {"Date": "on August 27, 2013", "Text": "Great book, lots of action and really good characters. Story line moved fast and held reader's interest very well. The end left a want for the follow on book to see how the story rolls on! 5Stars", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30XZ090HA3D7Q"}}, {"Date": "on August 27, 2013", "Text": "I really enjoyed this book! \"The End\" is one of the most realistic apocalyptic books I have read. The storyline of the characters keeps you on your toes and there isn't a dull moment. I can't wait for the sequel! Definitely a must read!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2H41G3K3OM4YJ"}}, {"Date": "on August 27, 2013", "Text": "Just like a marine, shoot them all and let God sort them out. This book is probably the closest to actual how it will be when the lights go out. Hopf did an excellent job of capturing the various types of human responses to such a cataclysmic event and the ensuing fallout. Going to enjoy the next installment.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2P6D5A4P2EWFQ"}}, {"Date": "on August 26, 2013", "Text": "Loved this book. Held my interest all throughout, totally believable especially in this day and age. Can't wait for book two", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QN9YSDVPW4F0"}}, {"Date": "on August 24, 2013", "Text": "On the edge of my seat, reading.  A real page turner.  Couldn't put it down.  Can't wait for the next book.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGLWBZI1L2SR"}}, {"Date": "on August 22, 2013", "Text": "Really makes you look around and think, \"what if.....\" Isn't that what the best books usually do? The story is fast paced and feels like something that could really happen. You never doubt the author's authority to tell this story.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADMWNHB35WA2L"}}, {"Date": "on August 22, 2013", "Text": "This book was something I usually don't read but I did and really enjoyed it. It held my attention right up to the end. Will look for the next book in the series.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZEELCGOOC78W"}}, {"Date": "on August 19, 2013", "Text": "This is probably closer to what might actually happen. Well written story. Can't wait until the next one on August 30th.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23I0NDQU241NZ"}}, {"Date": "on August 19, 2013", "Text": "This book was very enlightening I have never really thought about what it would be like to go through a third world war . But this books gives a great example of the thing we would have to face and the choices that would have to be made , if you want to really look into this I recommend this book I did not think I would like it but I could not put it down ,and from now on I think I will look at thing a little differently in my apenyoun this is a great novel and I want to read the sequel.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2X7WD61UZ4GQD"}}, {"Date": "on August 19, 2013", "Text": "Hats off to GMH, this is an incredible read. I really enjoy the author's style, painting a clear picture of what's going on. The story grabs you right from the beginning and never lets up. Some reviewers complain about some of the story, come on folks, it's fiction! I love PAW books and this one certainly didn't disappoint. Keep them coming, fast paced action that never let's up. Great fiction, I hope it stays fiction!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3C8A699GDZT1S"}}, {"Date": "on August 19, 2013", "Text": "A little slow in the beginning, but the action picks up fast.  The main character is admirable for his solidarity to family & friends.  Very plausible scenes of survival.  How quickly society erodes in the face of an extreme terrorist act.  Just wish there was follow up to the President 's decision to retaliate...May be coming in the next book.  I admire the key characters for the decisions they have to make...especially the marines. Hope  \"The Long Road\" will be another good read.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3J8PIZFIS8SWX"}}, {"Date": "on August 18, 2013", "Text": "Good book a little moot for me some time but everything that has been in the book could happen overall a good read and It gets you thinking", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MEOL8139758M"}}, {"Date": "on August 17, 2013", "Text": "No ghost, slasher, or vampire story could even hope or dream to be as frightening as this one.  This is because the entire time you are reading, in the corner of your mind is always the knowl edge that this scenario could truly happen to us and our lives.  It was so hard to put down and I found myself laying awake at night thinking about it.  I think that every adult should read this book, if only for educational purposes.  However, those who only care to read light entertainment may not want to risk it.  I can't wait for the sequel.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CYVPC8BQXSJB"}}, {"Date": "on August 16, 2013", "Text": "First of all...there are a lot of us who review books and don't even know how to \"get paid\" for 5 star reviews!  Second---yes, there are errors in syntax, grammar, and POV, but give the guy a break---it's his first book!  As for character development---I felt I understood  the characters right away---I don't have to have pages of \"filler\" and background to recognize dialogue and actions as believable and understandable.  Is there anyone who's ever dealt with a power hungry president of some winky organization (in this case the HOA of the protagonist's neighborhood)?  If so, you recognize the type immediately! :).  As for the ex-Marine being super tough and not seeming to care about anyone other than his family and close friends---the few sentences about Iraq in 1994 should explain that!  And the ship's commander who led a mutiny?  Come on--do you expect our guys to sail halfway around the world to  sift through ashes in NYC and DC--when their families are clustered around the base in southern California?  Yes, there were horrific scenes of murder and mayhem---but a relatively small and short-lived disaster like Katrina spawned horrific scenes too. (You watch--I'll get mail over that last sentence!! :).. Not all survivors of disasters are saintly...and saving one's children would become a priority over behaving nicely!  So...all those nay-sayers should just write their own if they are such experts!  I've pre-ordered the sequel...I found The End entertaining, and if you like PA fiction, get it, read it and enjoy!", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHUPETGMLNU2S"}}, {"Date": "on August 14, 2013", "Text": "Excited for the next in this series.  Well written, fun read, curious to see the direction this series goes.  cheers", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18S8Z0R2BP0QO"}}, {"Date": "on August 14, 2013", "Text": "I have been enjoying this book. I was looking for something more after reading other apocoliptic books and I found this one.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FGTTPH3YHCV8"}}, {"Date": "on August 14, 2013", "Text": "I saw this when scouring Amazon for another book to read. Purchased it and once started found very hard to put down.  I liked the character development and even the history of Gordon which flowed well through the book. Wont say much as dont want to spoil it but this book is a must read. Have already pre ordered the sequal as loved it so much.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IAD85YGVGVO"}}, {"Date": "on August 14, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXXANEMNEK8SW"}}, {"Date": "on August 14, 2013", "Text": "I have never pre- ordered a book- until I read this one. I have developed a fondness for reading authors whose writing challenges me to contemplate, \"what would I do\" and this book gave me many opportunities to do just that.  I am looking forward to the next book!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3R8PPXGE3619V"}}, {"Date": "on August 14, 2013", "Text": "This book is amazing. I have recommended it to so many people; including my boss. This book makes for a terrifying reality, but great to prepare.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UGATVRUZSGPR"}}, {"Date": "on August 13, 2013", "Text": "I'm picky about what I read and I really enjoyed this book.  The writing is solid and it has well developed characters.  If you like post apocalyptic stuff (and you do or you wouldn't be reading this), then you'll like this book.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3I7FN54QQN0OX"}}, {"Date": "on August 13, 2013", "Text": "This type of story is the kindI like.  While I had some small difficulty keeping track of characters, the story certainly kept me going.  I don't know if the sequel will be as good, some day I plan to find out.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28XSG31II9I8U"}}, {"Date": "on August 13, 2013", "Text": "Good book that turns into a really fast read. I was surprised to find that it is just book one of a series. I may have missed that when I selected it. Now I will be wondering what happens next....", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TV5NJMS173KE"}}, {"Date": "on August 12, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KVIXC10BKM9C"}}, {"Date": "on August 12, 2013", "Text": "I feel like this is coming my grand folks used to say the last war will be over food and flash  and gold", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SI1QFBNEEVGK"}}, {"Date": "on August 12, 2013", "Text": "Civilization is fragile and this story exposes just how fragile it is. The scenario of all the comforts we have are eliminated by just turning off the lights... All of them, everywhere. An EMP attack shows how poorly we are prepared to become self sufficient. Hunger and the struggle to survive turns good people into savages. Only theses with foresight and being prepared can hold out hope that society will endure. A page turner that will keep you awake well past the last page.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2F2OFB84GPOB8"}}, {"Date": "on August 11, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GOXHV5LM0CPR"}}, {"Date": "on August 11, 2013", "Text": "This book held my attention to the end; couldn't put it down. I can't wait for the sequel to come out.  I would highly recommend this book to preppers and anyone that enjoys a fast paced good read.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OFU3FIK4UTAL"}}, {"Date": "on August 10, 2013", "Text": "Great story from the start and never let up. Now looking for the next! I want to see how it ends!", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LVT3OCOU5FSA"}}, {"Date": "on August 10, 2013", "Text": "Loved it and cant wait for next book on August 30! Great characters that I cared about.  Feels true to life as I imagine things would deteriorate in a real situation.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OT43F3RUCQ42"}}, {"Date": "on August 8, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38GY4OAFX5MN0"}}, {"Date": "on August 7, 2013", "Text": "I really liked this book, thought provoking and informative.  Enjoyed the different perspectives and scenarios they kept my absolute attention I constantly found myself eager to get back to the previous scenario.  I listened to the Audible version five stars too, the narrator was great, he did a good job at character changes with his voice and setting the tones with in each scenario.  Looking forward to the next volume, hopefully in Audible again with same narrator.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QOHD6S47F641"}}, {"Date": "on August 7, 2013", "Text": "It kept me hanging the entire book, couldn't put it down and finished it in one read. Can not wait for part two to come out.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANIIC6DXS8BVI"}}, {"Date": "on August 6, 2013", "Text": "Good book if you enjoy this genre. Very quick read. Look forward to the next one in the series. Go Gordon!", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LWP924WKXMPX"}}, {"Date": "on August 5, 2013", "Text": "A page turner. Author's writing conveyed knowledge of survival skills. The story kept me interested and was hard to put down.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BOG7V9LWXKT4"}}, {"Date": "on August 4, 2013", "Text": "I really enjoyed this novel.  To many shtf novels have these little plot twist where some out of the sky good fortune falls into the main characters lap; not this one.  I think this is authentic to what it would be like during a EMP or other national catastrophe.  I also really liked Marine Corps story line. Even though they are trained to follow order our military are citizens also and their concern for family wouldn't go away because of the uniform.  Great novel; can't wait for to read the sequel.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2D3LEJ4O9DDTG"}}, {"Date": "on August 4, 2013", "Text": "I really enjoyed this book. I kept looking at how much I had left to read thinking I didn't want it to end. I can't wait until the next book comes out.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VZVD2T406WYK"}}, {"Date": "on August 3, 2013", "Text": "This was a fast read. Great characters and dark story line,but heck it is called the end. One prays this never happens.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JMEOVDHLKZ8X"}}, {"Date": "on August 2, 2013", "Text": "This book was one of the best ones I have read in years!  I loved the detail and feeling through the story.  I recommend it to everyone and especially anyone who has interest in post-apocalyptic tales.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3URI8UE9CGSCN"}}, {"Date": "on August 1, 2013", "Text": "I recommend this book to post apocalyptic readers.  Is it highly polished like a novel that came out of a huge publishing house?  No.  If you're not so picky that you can overlook that, it's a great read.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2V8P9KB4VUKQ"}}, {"Date": "on August 1, 2013", "Text": "I simply couldn't put it down once I started. I've already preordered the next book in the series, which is the only negative. It won't be out for another month. The story line is terrifying because this can very easily happen very soon and I know I am in no way prepared. Time to get prepared is now.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JRIMO6CGRIV2"}}, {"Date": "on July 31, 2013", "Text": "Great read!!!! Can't wait for the Long Road to come out August 30, 2013. Hope it leaves me wanting more like this one!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2X0EWVQTQVN1L"}}, {"Date": "on July 30, 2013", "Text": "I you love sci fi you will love this book. I couldn't put it down. I didn't want it to end.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KSRBUVADZL4M"}}, {"Date": "on July 30, 2013", "Text": "The End was one of the best books I've read in a long time. I couldn't put it down. I am a huge fan of Apocalyptic and Prepper fiction.  This was one of the better ones. I am looking forward to the next book.  I check at least twice a week for the sequel to be released. G Michael Hopf has created characters you come to care about.  You find yourself rooting for them to succeed.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXNY9SVOI99BA"}}, {"Date": "on July 30, 2013", "Text": "A bit like the book, Dark Days Rough Roads, but better written and easier to follow the story; can't wait for next in series.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NMVB0MLLDNJX"}}, {"Date": "on July 30, 2013", "Text": "This was an Excellent book with an astounding plot, believeable characters and a can not put it down until it's finished grip on the reader. Always interesting to read someone elses take on how 'the end' of America could happen. I highly recommend this book and can not wait for the sequel!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VWSDDHIEGKGI"}}, {"Date": "on July 30, 2013", "Text": "Great book.  Very well written and entertaining.  I did not want to put it down.  Can't wait for the second book to come out.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35YF0SOZ1SF5A"}}, {"Date": "on July 29, 2013", "Text": "I enjoy reading books that give you different perspectives on how this can all play out. Very believable characters & plot. I just wish I didn't have to wait for another book.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2B9QNN0EVZE0L"}}, {"Date": "on July 29, 2013", "Text": "What a great story, nothing is black and white as far as who is in the right. You will pick your favorites.  I put this author in my top three with Angry American and Joe Nobody.  Five stars since it is so believable, and well thought out!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3O20JMT2WMDR3"}}, {"Date": "on July 28, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATBRM4TPAO5OP"}}, {"Date": "on July 26, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3A8VSAKVY2PUB"}}, {"Date": "on July 26, 2013", "Text": "Good story froma fellow Marine.  Very nice character development with nice, suspenseful twists and turns!  Quick read.  Can't wait for part 2,", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EAII0GOVWMV9"}}, {"Date": "on July 25, 2013", "Text": "Anyone interested in realistic type apocalyptic books  this is  a must read. Actually makes you think that this could really happen and this is how'd it'd go! Can't say enough good things bout The End! Kept me reading and not want to work or put diwn", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OYKT3Y66A7M1"}}, {"Date": "on July 25, 2013", "Text": "I loved this book..it kept me captivated.  The authors writing style is wonderful and engaging...i cant wait to read the next in this series", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XJD2U3BIQ131"}}, {"Date": "on July 24, 2013", "Text": "liked it a lot, but wish the rest were out so I could read them one after another.  Like another reviewer, I'm guessing that means this is the first book by this author.  I hope he comes out with more soon.  I will certainly read them.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PE5SFHEW4VH8"}}, {"Date": "on July 22, 2013", "Text": "Very good book. I couldn't put it down! Anxiously awaiting for the 2nd book!! Got this book for free from the kindle library!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A210NE3U2CQZU1"}}, {"Date": "on July 22, 2013", "Text": "I enjoyed the book and can not wait to read the second book in the series. The writing was realistic and Gordon's character was well rounded.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LB1HOPQEG4WY"}}, {"Date": "on July 22, 2013", "Text": "Love the apocalypse novels. This one “The End\" grabbed a hold of me early. The only thing worse than putting it down is having to wait for book 2. Come on August...", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XMECMQO6KKE9"}}, {"Date": "on July 21, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A380AV0TZ4OPY9"}}, {"Date": "on July 20, 2013", "Text": "I can't remember the last time I read a book that was this great.  Definitely worth it, I wanted to read it again after I finished it.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VIYM92AJKBRN"}}, {"Date": "on July 19, 2013", "Text": "Loved this book! I am hooked!!! When is book 2 coming? I hope it's soon. I thought Hailey telling the story was a great touch!! I hope Molly gets what she deserves too!!!!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1B9V1IQIU6DOH"}}, {"Date": "on July 19, 2013", "Text": "The idiots in the book and there is always at least one make you want to slap the shit out of them they are so convincing.  I really enjoyed the book and finished it in short order.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZ5442678T6PD"}}, {"Date": "on July 18, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVN6HUWAF0SSZ"}}, {"Date": "on July 18, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZKJZAILZR2HP"}}, {"Date": "on July 17, 2013", "Text": "This is a very intense book. I couldn't put it down and will read again before sequel. It will make you think about the end and are you prepared for it yourself. Our world and luxuries are very fragile and we are 1 catastrophic event from being thrown into the stone age!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1D34F818ALEGH"}}, {"Date": "on July 17, 2013", "Text": "I couldn't put my kindle down.  This story kept me up late and well into the early morning.  On a work night.  Looking forward to the next part of the story!  Great job!!!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1F1DC13CX9ASU"}}, {"Date": "on July 16, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAWD6ICPQBLIC"}}, {"Date": "on July 15, 2013", "Text": "This post apocalyptic novel brings up a lot of new issues that I. Hadn't thought of. It is very well written", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9Z7SFMBY18EM"}}, {"Date": "on July 15, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CIH2MEV1M2U8"}}, {"Date": "on July 15, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21GT6ZFCOMQDL"}}, {"Date": "on July 14, 2013", "Text": "I enjoyed this book from start to finish. So many Post Apocalyptic books seem like the are meant to be a text book on how to survive. This book has a great plot with many character's I hope to hear about in the next book.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2P40D2PF9818V"}}, {"Date": "on July 13, 2013", "Text": "Just finished reading this...And honestly I could not put it down. Well written and very believable. Looking forward to the next book in this story.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUBYJK6AZ8BEW"}}, {"Date": "on July 13, 2013", "Text": "This book scared the bejeebers out of me. When i bought this book, I stayed up most of the night reading and was sad to learn that the sequel is not coming out until next month.  Whether you are a prepper or just love a good read, this is the book for you.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A66EBRDJCEMFF"}}, {"Date": "on July 12, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19MQO35OZ3HQY"}}, {"Date": "on July 11, 2013", "Text": "Picked it up and wanted to keep reading,it held my attention very well and was easy to return to when I did have to put it down.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27X8YDZW5J4HH"}}, {"Date": "on July 10, 2013", "Text": "This book was a page turner from the start. Hopf has a great feel for real dialogue. The characters develop quickly and the action is relentless. The military turn of events seemed a bit rushed into a mutiny but was exciting. Overall a great effort and exploration of desperation and human nature under stress. I look forward to the next books!", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10XANVXQ0634N"}}, {"Date": "on July 8, 2013", "Text": "This was a great read. I enjoy these PA books and this one was great because it was so plausible. It's also a great look at how things would fall apart in such a scenario. I look forward to the next chapter of the story.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJSIOAQI4Z6N8"}}, {"Date": "on July 8, 2013", "Text": "I enjoyed this book very much.  Another review stated that if you liked One Second After, you would like this and I agree.  I would say that One Second After is still my favorite, but it is a stand alone book. The End being a series that has a much bigger story definitely has the potential to surpass it.  The author G. Michael Hopf needs to hurry up and get the next edition out!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SUQ4CY271DWX"}}, {"Date": "on July 7, 2013", "Text": "Really enjoyed reading this book and burned through it very fast.  Watching out for the sequel which is due out any day now.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DMGZ1T1H3VKI"}}, {"Date": "on July 5, 2013", "Text": "I'm a big fan of this kind of novel,  This was a awesome read, great characters and so realistic.  I read this book in one day I just couldn't put it down. I'm putting this author on my favorites list and look forward to more books from him.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21OBI0VGRO6ZF"}}, {"Date": "on July 5, 2013", "Text": "Great book.  Couldn't put it down.  It really makes you wonder how well you and your own family would do if or when the US is under attack. Scared thought.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A139KE0MZ67V8Y"}}, {"Date": "on July 3, 2013", "Text": "This is a very well written book and it kept me hooked all the way through! The characters were well developed and the scenarios realistic. Can't wait for the next one. I highly recommend this book.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14P6CEQSB3PGO"}}, {"Date": "on July 1, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AK6QV6O8CR00X"}}, {"Date": "on June 27, 2013", "Text": "I hate to excersize, but I only let myself read this book while I am on the eliptical trainer, as the time passes so fast I hardly felt like I worked out... Sweat dripping on my Kindle GOOD!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7JGWZ8Q6VU1N"}}, {"Date": "on June 24, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MM84SRTPQICY"}}, {"Date": "on June 23, 2013", "Text": "Couldn't stop reading.  I can't wait to dive into the next book . It changed my way of thinking completely.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21UPSML2SU2H1"}}, {"Date": "on June 23, 2013", "Text": "This is an excellent, awesome, amazing book! I literally could not put it down and definitely await more from this author.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Z1LM2MRYFLCG"}}, {"Date": "on June 22, 2013", "Text": "I haven't read such a good book in a while!  The author did a good job developing the characters and the story line. We all wonder what would happen if our world as we know it went through a disaster. God forbid that this were to come true!!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CWCSVQ4PCEY5"}}, {"Date": "on June 22, 2013", "Text": "After searching several titles I decided on The End and wasn't disappointed! Well written story about characters with real life emotions, abilities, strengths, and weaknesses. I'm  anxiously waiting for the follow up!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SPSG5O4LW7IS"}}, {"Date": "on June 21, 2013", "Text": "I liked this book and the perspective it had on telling this story from the future, so that you know despite the destruction and ruin the EMP event caused some people get through it.  I also think the author did a nice job of analyzing the general public response, or lack of to the initial event.  Some authors have the general public going to guns  and violence pretty quick.  I would like to think that the response and time line would be closer to how this book presented it.  I'm waiting for the sequel to come out this summer.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DYT94J1XDVEL"}}, {"Date": "on June 16, 2013", "Text": "If you like this kind of science fiction/fantasy it is in the group of some of the best books I have ever read. Keeps you hanging on every page and always wanting to continue where I left off. Looking forward to reading a sequel to this book.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A201RKLZN46TAJ"}}, {"Date": "on June 15, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25GAS44MY1ARA"}}, {"Date": "on June 13, 2013", "Text": "A must read. Couldn't put it down. Do yourself a favor and get this book. You'll be glad you did.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABEZ6IY7NSX7C"}}, {"Date": "on June 13, 2013", "Text": "Really liked the timeline style of the story.  Characters were fleshed out and believable.  Will be looking for more from this author.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VAV1IKNDTMAX"}}, {"Date": "on June 13, 2013", "Text": "I'll have to read the next book when it comes out, that is if I haven't lost I interest by then.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GA6HLOGMEBFW"}}, {"Date": "on June 13, 2013", "Text": "In the realm of end of the world EMP stories, this one stands out.  It's well written and keeps you engaged through the entire book.  If you like EMP stories, this one will certainly satisfy.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31UJBZCISWHHP"}}, {"Date": "on June 7, 2013", "Text": "I was suprised at how much i liked the book. It kept me so captivated that i had to take a day off just to finish it. I cant wait for book 2 to come out.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BD5X1J7I5KY2"}}, {"Date": "on June 6, 2013", "Text": "Some of my favorite indie books are those that bring the author's area of expertise into increasing the realism of the story. Michael G. Hopf does this here better than almost any other indie sci-fi book I've read. His characterization of the collapse of society following an EMP attack is both chilling and fascinating. Of all the indie sci fi I've read over the past few months, I still remember this book for that reason. I am very much looking forward to the sequel!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RLEDE6EUC9T0"}}, {"Date": "on June 3, 2013", "Text": "I have been reading many Kindle books of this genre. This one grabbed my attention in the first couple of pages. I jokingly call these books my \"prepper porn\". This is a keeper. I am looking forward to reading the next book. Please hurry and publish!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33D7XVW71K6W"}}, {"Date": "on June 1, 2013", "Text": "I can say that I enjoyed every other chapter. I'm even considering purchasing the second book in the future (oh yea, they forgot to tell you the story doesn't end here). It was a lot of the \"In Iraq\" military hoopla that I just brushed over. I don't know anything about the military, or they're slang. It was written well enough that I could follow the story regardless; and that part of the story was necessary to get the full aspect of what the author was going for but it wasn't as enjoyable to me. Really did enjoy the \"end though\". Hope this author writes more to come.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2D7V28TFQKMSQ"}}, {"Date": "on June 1, 2013", "Text": "Great work in the post apocalyptic genre.  Hooked you from the beginning and kept you up reading it till the end.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3159VPVJ9041N"}}, {"Date": "on June 1, 2013", "Text": "I love his style of writing. Great plot, great characters, how he breakdown it down. I can hardly wait for the next book. I have to find out what happens to everyone. Again a very good book..........", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OLIBOZ3U6F0T"}}, {"Date": "on June 1, 2013", "Text": "Tons of action. A real page turner. I read the whole book in two days, couldn't put it down! It was so exciting! Can't wait for the second book!!!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3T0WGKZ3G815"}}, {"Date": "on May 31, 2013", "Text": "Extremely entertaining and thought provoking, The End is apocalyptic fiction at it's best.  G. Michael Hopf has written a real page turner with characters you come to care about.  I can't wait to read the next book!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAD4K2ODWH29N"}}, {"Date": "on May 31, 2013", "Text": "Great book! Don't make the mistake of starting it right before bed. I couldn't put it down! Please release the second one soon!!!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AK6Q7BEBB8NTY"}}, {"Date": "on May 29, 2013", "Text": "The premise of the book is a what could happen in the future if all things electrical didn't work any longer. The story is seen through thee eyes of a number of characters as civilization crumbles. I did not find that the book's characters and plot were as we'll developed as I've read in other novels, but an interesting read nevertheless. I'm waiting for book two.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WWQ3YOWLA06S"}}, {"Date": "on May 28, 2013", "Text": "I thoroughly enjoyed this book. It was very well written. I am looking forward to the second installment when it comes out.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17T8NQFPFONPW"}}, {"Date": "on May 27, 2013", "Text": "This was an excellent read. Made me think about being prepared for a crisis. I will definitely get the next book in the series when it comes out.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A264HT6Y86SX6F"}}, {"Date": "on May 26, 2013", "Text": "I rated this highly, as I've read many books of the same genre, and found this one involving almost all aspects of a future without our daily luxuries.  It also addressed a bit of military involvement should a world crisis occur.  I'd recommend the book to anyone interested in the \"what if\" scenario of post-apocalyptic survival.  Looking forward to the sequel this summer!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Y6TXU9EXSTD4"}}, {"Date": "on May 24, 2013", "Text": "Very very good read not a lot of information as some others I have but nevertheless a very good well written book.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TKV7U3W3ZJJ2"}}, {"Date": "on May 22, 2013", "Text": "I loved this book but now I am engrossed in another story ever I have to wait who knows how long to read the next one . Cannot wait to see where this story takes us .", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AP758VPD5Z9EU"}}, {"Date": "on May 22, 2013", "Text": "A beautiful day in San Diego turns into nightmare when unknown forces strike the USA with EMP and city busting Nukes.  See how one man copes with the new normal in which one must kill or be killed as society quickly devolves like a blown tire.  Surprises loom on most every page for Our hero,  the US Marines in Afghanistan, and the country's Speaker of the House cum President...in this well written and edited book.  I can't wait for part two to be published in summer 2013!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PH08VML4GC1G"}}, {"Date": "on May 20, 2013", "Text": "This book was GREAT!!! I have read a lot of fiction that has tried to make you feel what the future would be like if you had something really bad happen in our country but this one hit it on the head. Most people would not even think about a power age being a attack but it could happen so easy just like this book. Can't wait for the next one to come out. I also posted on the Facebook page and was glad to get a reply.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KZ5GGK0JT9K9"}}, {"Date": "on May 20, 2013", "Text": "I enjoyed this book from the beginning right up to the Cliff-hanger ending. I thought it was well laid out and the characters were believable. I look forward to the next book!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOU159MGINEZN"}}, {"Date": "on May 20, 2013", "Text": "While the writing is a bit stiff at first, the story is gripping and not a little scary in the possibility that the scenario has the real ability to occur. The characters with the exception of the main character's wife are very believable. The author does an incrediblly realistic job showing the rapid breakdown of society. (Adding a few pages to depict conversations between the main character and his wife would make their relationship seem less one-sided and give the wife more depth) Regardless of the minor flaws, I am very eagerly awaiting the next book in this trilogy and I highly recommend this book to anyone who enjoys being unable to put a book down until they reach the end.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I00XXCJLEATI"}}, {"Date": "on May 20, 2013", "Text": "I am dying for the next one to be out. I hated when this one ended. A really good read that shows an excellent insight to human behavior. WTG..G. Michael Hopf!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LVQW84T0SWRT"}}, {"Date": "on May 19, 2013", "Text": "Several different story lines all coming together at the right time to make the book interesting and looking forward to the next.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANVTAWS16M5UU"}}, {"Date": "on May 19, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1X5ONNPI82MAR"}}, {"Date": "on May 19, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A188S0U6R1Z9CS"}}, {"Date": "on May 19, 2013", "Text": "Great read didnt bog down anywere. Looking forward to the next book. Would recommend this for folks that enjoy this genre. Review by William Womack.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KYIIQZ0GPEKM"}}, {"Date": "on May 19, 2013", "Text": "I do like an end of the world saga. It's even better to read one without zombies. The scenario sounds feasible and therefore believable. I found it hard to put down and cannot wait for the sequel.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WTYHW7W553I4"}}, {"Date": "on May 18, 2013", "Text": "I loved this book!  It is a true glimpse into what would take place if this event happened today.  Truly this is a must read wakeup call that as a nation of people we are losing the ability of critical thinking that gives us the ability to survive as a nation of people!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OTOTMS46K96J"}}, {"Date": "on May 18, 2013", "Text": "This book was extremely well written. The main characters were not just some faceless people from doomsday preppers but actual people. The characters had depth that leaped off the page. The story moved at a fast pace that never slowed down. It was amazing and yet realistic to see how quickly civilization broke down. A lot of the books in this genre either get bogged down in the minutiae of preparation or skills or have shallow main characters. This had neither. Granted most of their food and stuff came from scrounging aka looting but I thought given the story how most people would react this was the most realistic outcome. I also realize I hate typing reviews on a kindle keyboard. I can't wait for the next book in the series.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AMMJ05D7QCK7"}}, {"Date": "on May 18, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHTL5VNWPI3BT"}}, {"Date": "on May 8, 2013", "Text": "have not had a read this good in a long time.  action max.  bad thing is hopf left every thing hanging for the next book.  like the gunslinger 1st of king's dark tower series.  we want more!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SNWLQ2Y33Z0Q"}}, {"Date": "on May 8, 2013", "Text": "Thoroughly enjoyed this book, finishing it in two nights (missed some sleep, but worth it).  I enjoy most zombie apocalypse novels and this was a nice change for me.  It still has all the \"fun\" things....... survival, good vs evil, relationships and some awesome battle scenes (yes, women can enjoy that ,too!).  Loved the character development, but hope for a little more depth in the next book.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36D3BLSHM1Y25"}}, {"Date": "on May 6, 2013", "Text": "I liked the author's ability to tell a story and move it along. The characters and scenarios were believable. Please eliminate a few grammatical errors, especially the sentence fragments, and this reads very well.  I will buy the next book in the series.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AV2F4D0OY0OKF"}}, {"Date": "on May 6, 2013", "Text": "In the genre of \"grid-down\" shtf survivalist stories, G. Micheal Hopf's 'The End' is the first book that comes anywhere close the level of \"Light's Out\" by David Crawford.  What makes this story easy to connect with is that the main characters are portrayed as realistic people and the disfunctional neighbors are who you would find in any middle-America community. Even though it's a great story to get people thinking about personal preparedness, the better lesson was gained in leadership do's and don'ts! Alot can also be learned in what kind of neighbor you want to be and in the lessons of Gunny, when to keep your mouth shut and when to go stealth. It is truelly a shame that this book has been crafted in chopped-up portions of a series instead of a full sit down novel or one that's complete to put on the library shelf. Some edit/typos but common in this genre...hate waiting for part 2...but will.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SQTMKX3J83D"}}, {"Date": "on May 5, 2013", "Text": "Well written, good story line, and well devoleped characters.  One of the better books in the genre I have read.  I hope he follows up on this book.  Well worth the money.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABFNALESES8SM"}}, {"Date": "on May 5, 2013", "Text": "I enjoyed the read, however I was concerned by the shoot first, ask questions later approach, employed by so many of the main characters.  I have no right to criticize the writer, and won't, but remember as you read this book, it describes one possible viewpoint.  As a Marine, I am skeptical of stories involving rogue Marines.  But none of us can forecast the world waiting for in the future.  As one old Marine General once said, \"Be polite.  Be professional. And have a plan to kill everyone you meet\". God bless America!", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2M61Y4O4F0ZIS"}}, {"Date": "on May 4, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15J1MSLSB38SX"}}, {"Date": "on May 4, 2013", "Text": "Very well written and thoroughly enjoying. Can not wait for the next one. This has gone to the top of my list for this genre.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12FZUH0QLNRRG"}}, {"Date": "on May 3, 2013", "Text": "I liked the authors writing style, he keep you on edge and you couldn't put the book down. I look forward to his future works", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BQA8353S6FL"}}, {"Date": "on April 29, 2013", "Text": "It's a bullseye in the post apocalyptic wave of books and TV shows out there.  Full of action and he takes the time to develop deep characters that are believable and interesting. I liked that the book shows different storylines going on simultaneously in different parts of the world.  I can easily see this book becoming a future TV or movie.  Most of all - I love that it is a post apocalyptic story with NO zombies!! (not one).", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2H6FYNQZ92POX"}}, {"Date": "on April 29, 2013", "Text": "Great read, one of the best post apoc. Books ever I would recommend this to any post apoc. Lover! Awesome", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKE5WK6FBRBUS"}}, {"Date": "on April 29, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LH9S0B2VC20U"}}, {"Date": "on April 27, 2013", "Text": "This was an excellent read. I liked the fact that the book started with the ending and then cycled back to the beginning. The three stories made the situation more real and frightening. The back and forth between these stories kept me engaged. I look forward to the sequel.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9HJRBWGDYM9Z"}}, {"Date": "on April 26, 2013", "Text": "It started a bit slow but became a real page turner once it got going. I would have liked a little more \"outside the gate\" story telling but there was plenty of action and the multi-able story lines were very easy to follow. No super hero charterers but plenty of raw shoot-em up action. Worth the kindle price.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAPJRPPV26CDA"}}, {"Date": "on July 1, 2013", "Text": "I downloaded this and lost all concept of time. Very real,scary story. I read lots of these and this one is among the top. Some say this author went to far,I say it was RIGHT ON!!  How far would you go to protect your family?  Some reviewers complained about the grammar. I say to them to read a dictionary. Lets keep it simple....YOUR GONNA LOVE IT", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVRNCTSPQ3IJ8"}}, {"Date": "on September 9, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VLIEQGX02ZDK"}}, {"Date": "on August 1, 2013", "Text": "As a fan of the post-apocolyptic genre, I really enjoyed this book. Mr. Hopf really keeps the action moving along. There were a few instances where I thought characters acted inexplicably violently, but overall I felt the book really gave a realistic portrayal of society's probable downfall after an EMP. Looking forward to the sequel.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZG5MFC6I2A8K"}}, {"Date": "on July 6, 2014", "Text": null, "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15KI7FZ00FLCE"}}, {"Date": "on June 20, 2014", "Text": "This story can happen all too easily and most people are blissfully unaware until it is too late. Is it the greatest work of fiction ever?  No, but it is a well written, good and timely story about how life can change in an instant.  The characters are people you can easily relate to, the protagonists are people that are like most everyday people you know with their good and bad sides.  The antagonists are people that you easily recognize in your neighborhoods as well.  It may be all too accurate.  If you are a liberal you will likely hate this book as it doesn't relate to Utopian ideals but the reality of how the world really works everyday even though the hints of politics are very subtle in the story.  Liberals probably will not recognize themselves in the story until too late but everyone else will spot them immediately.  I blew through this book.  Great reading and I pray that it forever remains a work of fiction.", "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A135W7G0K0T6XI"}}, {"Date": "on May 21, 2013", "Text": null, "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NO4V06SRQKRW"}}, {"Date": "on May 8, 2013", "Text": "The best post-apocalyptic novel I've ever read. Great plot, characters, and a realistic scenario. Looking forward to the next installment.", "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LK0I7IU9JA5A"}}, {"Date": "on April 18, 2013", "Text": "Well written with engaing characters. One of the best in the genre that I have read in awhile. I am eager to read the sequel.", "Helpfulness": 0.75, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2D7K1ZZCTCTPU"}}, {"Date": "on May 2, 2013", "Text": "This is a well written, thought provoking book that also entertains and maybe scares, just a little.  I wouldn't want to live in Gordon's post-war San Diego or in any part of the post-war country for that matter, but it's quite believable and the characters are well developed.  Can't wait to read Part 2!  Keep writing Mr. Hopf!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DOPJRVJUNFNL"}}, {"Date": "on April 30, 2013", "Text": "pretty good story, but neither prose nor editing are very good. decent characters, and story and details are believeable. i got very tired of some conversations and repeated lines. the final third of the book appears to be unedited with tons of grammatical errors, typos and even a switch to present tense on a few pages. all in all, an enjoyable read, but a bit flawed.", "Helpfulness": 0.7142857142857143, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XV3KDX0G7JXC"}}, {"Date": "on November 8, 2013", "Text": null, "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38R9XX28WK3PI"}}, {"Date": "on June 24, 2013", "Text": "Though I've never read a book in the post-apocalyptic genre, I found this book very easy to read and interesting from start to finish. Well developed characters and the story line was believable to the point it had me asking myself, \"would my family & friends be prepared?\" I look forward to the next one!!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2S9CGZ6WS8OF"}}, {"Date": "on July 7, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AKORNCCAXSHZ"}}, {"Date": "on February 21, 2015", "Text": "I got this for free awhile back, but ust read it.  Pretty darn good book.  You can read the entire book in less than 4 hours.  Gets you pretty engrossed, so much I purchased the second book in the series (of 4 books) about 2 minutes after I completed this one.  Thanks for the fun read Mr. Hopf!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29HTPTAH1VKXL"}}, {"Date": "on February 25, 2014", "Text": "This was one of the best apocalyptic books I've read.  Well written and only a couple times that I rolled my eyes, which is excellent with these type books.  You never knew what was going to happen next.  I'd say more but I have to go order The Long Road now and continue our journey.  Buy it!", "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A232C18C586SJ7"}}, {"Date": "on August 2, 2013", "Text": "Great story. A fast paced and exciting story line. One problem is that with a lot of these stories you have to wait for the next book to complete the story and sometimes that can be frustrating if you do a lot of reading and trying to keep all of the various story lines correct.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AX0V1MBGA3I72"}}, {"Date": "on October 3, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A218BKIJ288ZVY"}}, {"Date": "on June 19, 2013", "Text": "This book took off from the beginning and kept my attention through out.  It was fast paced and never dull.  What was even better, was the realistic portrayal of the characters and how they reacted to everything that was going on around them.  Can't wait for the sequel!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3P7XKVFBZOOIV"}}, {"Date": "on September 7, 2013", "Text": "Some of the best character development I've seen In a long while. Really enjoying seeing how the event  effects the various characters  in different settings. I cant wait for the next in the series.  Mr. Hopf thank you for your service and keep the stories coming!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HMACB1WLCO4H"}}, {"Date": "on September 16, 2013", "Text": "The New World Series, by G. Michael Kopf, Splendid. Enjoy this genre when well done, and this was. Description of the rapid decay of society was spot on. As well as detailing all the various agendas. Think Barone was my CO at one time.Good job Marine...", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOV05EOZ70FX6"}}, {"Date": "on May 10, 2015", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1A2NPGDIFVMYB"}}, {"Date": "on February 13, 2014", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3I4GZJZO155GG"}}, {"Date": "on July 9, 2014", "Text": "Love this genre. The End by G. Michael Hopf continues to feed my inner craving for world devastation. Great character development for both good and evil characters. Very well written page turner. This writer has me hooked. Looking forward to more.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1S60JTX7965X4"}}, {"Date": "on September 7, 2014", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ADHAQLZHHBGO"}}, {"Date": "on June 20, 2013", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7K7Z8JBERUR1"}}, {"Date": "on May 13, 2013", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11FAYYDIWL22Z"}}, {"Date": "on May 28, 2013", "Text": "Didn't want to put it down and sorry I couldn't run right out and buy the next in the series.  Thought provoking.  The characters were well defined and real.  Anxiously awaiting the new one.  Thanks for the entertainment.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UUYK7LG7OVLZ"}}, {"Date": "on May 20, 2013", "Text": "Great storyline - very good character development! I hope this is the first of many more books to come.  Gordon is my hero. A \"must read\" and as with all of these books, you will learn a lot.  You will enjoy this book.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHRZ36WLWZDAS"}}, {"Date": "on May 3, 2015", "Text": "G Michael Hopf writes some very good books.  I really enjoyed this book.  This could actually happen and we all need to be prepared with food storage and water storage...we all need to be prepared.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALLRYB56JR68S"}}, {"Date": "on May 22, 2015", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BHDUCZB5OPVE"}}, {"Date": "on March 1, 2014", "Text": null, "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2S5N90GKXKZF5"}}, {"Date": "on August 25, 2013", "Text": "Once I started I could not put this book down.  Fast paced and great story line.  Can't wait for the next in the series, The Long Road. Highly recommend for those liking SHTF scenario.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GZP9EE21KGEI"}}, {"Date": "on January 12, 2015", "Text": "This book is a good read. I am a fan of the post-apocalyptic genre and this series so far hasn't disappointed. I'm currently working reading the second one and have the third waiting.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AN8VW2F5OLX87"}}, {"Date": "on May 23, 2013", "Text": "This book is an awesome page turner!  I felt like I was there along side the characters throughout the story!  I'm so ready for the next book!  G Michael Hopf is a great writer!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BBZC9I4OWLV"}}, {"Date": "on September 22, 2013", "Text": "I loved the book. the style just fit with the story line. It's just too good for words and I hope that all the people that read this review enjoy this book as much as I did.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1V3HZ1Q8L3BGW"}}, {"Date": "on March 20, 2015", "Text": "Nice story and easy to get into and dream of what it might just be like soon. I hope nothing goes down but I honestly don't see how we can keep going without a major Reset.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DQAQBYWSLAMO"}}, {"Date": "on September 13, 2013", "Text": "a little amatuerish writeing at times but still a good read.... i may be predudiced since im an ex army guy tho... i liked it tho... its a nice change from zombies", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28E0I3CL0UD8V"}}, {"Date": "on July 23, 2013", "Text": "never heard of this author, i took a chance. good storyline and reasonably realistic scenarios. ill be looking for the next book in the series.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EHIKBO354UAL"}}, {"Date": "on August 4, 2013", "Text": "Great book, couldn't put it down. So ready for the next book, which I've pre-ordered! I will recommend this book to my friends and family!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NTMHD0C7J7DO"}}, {"Date": "on March 20, 2014", "Text": "Gripping, too possible.  Totally enthralling, lots of action, and many twists and turns.  Have just gotten to the ending pages.", "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39OQ8KDTLAPO4"}}, {"Date": "on July 25, 2013", "Text": "Another nice post apocalyptic novel with a different reason being the EMP burst.  And the other twist about what the Marines do/respond.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3R8PZSMBZUWTA"}}, {"Date": "on August 24, 2013", "Text": "From the beginning it jumped off at a very fast pace.  I am looking forward to more of the story line if he puts out another book.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEUVO0LK0W240"}}, {"Date": "on May 26, 2013", "Text": "I liked the book. I think there should have been more about the rest of the country. Little vignettes ala stephen King.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TM4SR2NUMRLZ"}}, {"Date": "on August 19, 2014", "Text": "This was a great read with Good flow and memorable characters. Very hard to put down. Now moving on to the next book.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38H6JROS603PV"}}, {"Date": "on March 22, 2015", "Text": "Our very possible future, if people don't wake up.  This book tells it like it very well may be, soon then we think.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AWUGMWMQBR67"}}, {"Date": "on June 3, 2013", "Text": "The content is really good for this genre (end of the world as we know it). It is written in a style that keeps the action moving at a fast pace but with time enough to draw out some of the main characters. More character development of the secondary folks in the book would be nice. And the main character actualy gets shot - will wonders never cease. Could an EMP cause all of this damage? It really is an unknown but setting that aside what we see in this book feels true - at least believable. With that said I do have to point out the printing and proofreading are very poor. That is why I gave it one less star (the only reason). The proofing errors do detract from the reading experience. I hope they correct this in the sequel - and I will be reading the sequel as soon as it comes out.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A252UNZRASM5WI"}}, {"Date": "on August 20, 2013", "Text": "Easy read, page turner of a book. Enjoyed start to finish. Excited to sink my teeth into \"The Long Road\".", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OM5XRMKDSQMS"}}, {"Date": "on July 26, 2013", "Text": "Started the read and did not want to put it down. I was able to put myself right there within the story.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YJ8XPSUBO0PS"}}, {"Date": "on June 19, 2013", "Text": "I read this book in 2 days.The story in this book seems so real that it just grabs you and won't let go.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6M91IYN4A5MQ"}}, {"Date": "on June 14, 2013", "Text": "The author has a great ability to make you dislike the leading characters in the book.  The whole premise that military commanders would not follow orders and would become traitors to our country in order to return to their families is insulting to anyone who has ever worn a uniform.  I will avoid books by this author from now on.", "Helpfulness": 0.6666666666666666, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PE35BJI03AYK"}}, {"Date": "on December 20, 2014", "Text": "Loved it. Already started on book 2. Really enjoyed the character development and storyline.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SZEFL80GKUU2"}}, {"Date": "on November 4, 2014", "Text": "I enjoyed Michael Hoff's writing style. It is a clear cut above the average in this genre. An exciting plot with well-drawn characters makes this a very good read.  That said, I almost gave it four stars instead of five because I didn't care for the ending. Not that it was a bad ending, but it, like other serial novels, left me feeling like I'd just read an incomplete book. Now, his book and his ending were much better than most other serials I've read, and I had fair warning that this was a serial novel, so I couldn't hold the abrupt nature of the ending against him. Besides, his style was entertaining so I'll continue to read his books.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UPB8HC3ASNRT"}}, {"Date": "on April 6, 2013", "Text": "Geoff did and excellent job of creating the characters that you can believe in and actually care about whats happening to them, keeping the reader interested in what is going to happen next them. I personally could not put the book down and truly looking forward to the next installment. Thanks Geoff truly enjoyed your book. :)", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHTPZ9MDSEM07"}}, {"Date": "on December 3, 2014", "Text": "It should be no secret that a lot of people were struck with patriotism after 9/11. That wa the worst attack in my lifetime, but what happens in this book is both terrifying and exciting. I could only imagine how I would act if an EMP strike sent us back to the 19th century and we had to fight to survive. In fact I think I picked up a few ideas from this awesome book. Looks like I'm going for the next one in this series to see just where it goes. I suggest you do this same!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GNHNRRBA9C7Y"}}, {"Date": "on February 26, 2015", "Text": "Excellent story line. I cannot wait to read the next book.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IZLLJJU37M4O"}}, {"Date": "on July 2, 2014", "Text": "Excellent storyline.  Easy to read.", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2F1P7WHTOJ68V"}}, {"Date": "on June 27, 2014", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UHBOAX0GKGM"}}, {"Date": "on June 25, 2014", "Text": "Thoroughly enjoyed this one. The story contains some great action and the writer had me pulling for Gordon from the start. Kind of struck a nerve when I read about the self serving HOA president. As soon as I finished this book I grabbed the second in the series. I highly recommend!", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14O2T0R9JO51M"}}, {"Date": "on June 21, 2014", "Text": "I was surprised and thrilled by just how good this book is! I got quickly caught up in the characters and the story. I'm going to buy the second one right now!", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3COFT59QL5ACX"}}, {"Date": "on June 16, 2014", "Text": "I thought this was a great story, characters feel real. Hard to put down at night. Interesting storyline and character development.", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZYUBJN10W7RG"}}, {"Date": "on May 31, 2014", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2W701EQNMV4IZ"}}, {"Date": "on May 24, 2014", "Text": "Well written.  It kept me on the edge of my seat.  A real finger swiper (page turner for you non-electronic types).", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NQE76K8WEU4D"}}, {"Date": "on May 20, 2014", "Text": "The End is an interesting spin on the post apocalyptic genre, that in some ways makes it seem a little more real. Set half a century after the event and told from the perspective of the daughter of the main character. At the time of the relating of this story (as an interview), Gordon is seen as a historical figure who influenced the birth of a new and very different North American nation that rose from the ashes. Highly recommended for those with an interest in the end of the world & who wonder what comes after...", "Helpfulness": 0.6666666666666666, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3A8I126MB1NZH"}}, {"Date": "on August 25, 2013", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3I0R7A5TZF7F9"}}, {"Date": "on June 24, 2013", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHEMTSFA9KJVH"}}, {"Date": "on May 26, 2013", "Text": "I buy these books for my husband's Kindle and he let's me know ahead of time that he is getting close to the end and I was surprised that he had read this book ahead of time, he said he just couldn't put it down. He said excellent book, it could very well be something that could happen in this present time. We understand he has another book that may be out sometime this summer, he is looking forward to the next book.", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30JN4XJVECVRW"}}, {"Date": "on May 27, 2013", "Text": "My husband and I enjoy a good post apocalyptic story and this one is one of the good ones. I wish I had known at the beginning that the story was to be continued in another book. That was the only real problem I had with it. It could have used another proof reading as there were some spelling errors but even so it is better than a majority of this type book available. All in all a good read.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A339EJD50AIPHK"}}, {"Date": "on March 3, 2015", "Text": "I have been devouring post apocalypse survival books for about a year. First this book has been the best edited. Second very well developed characters. Plot actually holds water. One story line in this book is similar to another book which is  coincidence and a very important part of developing the plot. 4 and half stars and easily falls in my top 3", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Z9IW0UH2L566"}}, {"Date": "on July 12, 2014", "Text": "I loved the book. Love his style of writing. Be prepared for a roller coaster of a ride through this book. The 3 subplots are great. You love the characters. His development of post apocalyptic politics is very plausible. One of the better books in the genre I have read. This review is for all 3 in the series.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LAAAWY12BQQQ"}}, {"Date": "on October 15, 2013", "Text": "I basically just don't like the protagonists. Gordon is rollback and white, and does some pretty terrible things that aren't really necessary. The \"super emp\" thing is a bit unrealistic as well, but it is a decent device. I'm not 100% about this, but it seems far fetched to launch a rocket 300 miles up from a container ship. That is 3 times higher than the International Space station.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KUABBEXI65Q8"}}, {"Date": "on October 14, 2013", "Text": "Story gets 5 stars. Writing only 4. Every third page or so there was a grammatical error. That makes for a lot of errors. It did slow down the book somewhat. A comma missing here or there? No problem. Missing words and misplaced words? Big problem. Good story though.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1G6GMA72DWRBE"}}, {"Date": "on October 9, 2013", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUVQMO3P7KFKX"}}, {"Date": "on October 8, 2013", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALAS86BDDTPPS"}}, {"Date": "on September 22, 2013", "Text": "Despite many flaws I do see potential.  The basic plot is enough to grab your attention. I only hope that in time this new writer will learn more about character and scenery development", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XSDTICW1T4JB"}}, {"Date": "on September 17, 2013", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12FG77EUFJKEY"}}, {"Date": "on September 16, 2013", "Text": "While I enjoyed the premise of the book and where the author had us headed, I was less then enthusiastic about the 'to be continued' aspect of it.  There had been no wording in the description that said this book was the first of a series. Not that I don't like series, I just would have been happy to know beforehand and I might have waited until the next book was written before starting it. The story itself was quite engaging and really makes you think, what would happen if everything stopped working?", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IF4TPIVYKVW1"}}, {"Date": "on September 13, 2013", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DIS9EEEGAIXK"}}, {"Date": "on September 10, 2013", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RZJ3B3QGNBJN"}}, {"Date": "on September 9, 2013", "Text": "Post apocalyptic journey from a family and community perspective.  Great characters and storyline.  Well worth the money.  Book 1 in a series.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NQXIO18X48W2"}}, {"Date": "on September 9, 2013", "Text": "Seems that every person in the book was dealing with the most difficult moral dilemma. Without giving too much away, I struggled with many of the choices they did finally make. I'm going to read the sequel, ??? The writer must have hooked me in.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IZZPU0RIWJRQ"}}, {"Date": "on September 8, 2013", "Text": "Not so bad that I might not try the sequel, but I will have to have a dirth on my regular authors to reach out again to this, new to me author.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QE5FBIYYQLIV"}}, {"Date": "on September 8, 2013", "Text": "This is a fantastic book. When I finished it I could not wait to start the second book. Not a book for kids.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32TLJY46Y5U43"}}, {"Date": "on September 8, 2013", "Text": "Good character development and unexpected twists leave the reader waiting for he next twist.  it can't end here.  a virus, an invention, some human qwirk... what will save the planet?", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KJYPM9VKA8LU"}}, {"Date": "on September 5, 2013", "Text": "enjoyed the book.  2nd book is out and hope to read it soon.  looking forward to seeing where this series goes.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VJW59UKAJRQ8"}}, {"Date": "on September 5, 2013", "Text": "Well written, kept my interest the entire time. Very believable story this could happen. Shows that not only are people at their best in a crisis but also their very worst. Glad to see there is a sequel to this that just came out in August.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2U3X2ABH14YUR"}}, {"Date": "on September 5, 2013", "Text": "With the current administration acting as it is, it is possible that this kind of scenario could take place.Having moved out of San Clemente several years ago,it was close to the area the story took place in.I could visualize the neighborhood Gordon lived in,all the petty egotistic \"Rulers\"of the complex h lived in hit close to what probably could happen", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3I4ARU037DG2Q"}}, {"Date": "on September 3, 2013", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12BW0Q7ZP3S3F"}}, {"Date": "on September 2, 2013", "Text": "Written from the perspective of military & government personnel, this book has a very realistic feel to it. Sad to see how fast society crumbles, but I'm sure that is exactly what would happen.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AL9VZ9N86HZXM"}}, {"Date": "on August 28, 2013", "Text": "Over dramatic writing. I never felt connected to the characters. I don't think I would read the others in the series. I don't like the writing style.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A255TCZWJY7BR7"}}, {"Date": "on August 27, 2013", "Text": "Starts slow but after about 100 pages you start to get interested .IT sounded like a romance novel in the beginning . I guess the apocalyptic novel is the rage now that teenage angst is out of fashion.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OU2XAT21EJXC"}}, {"Date": "on August 12, 2013", "Text": "Very believable scenario, thoroughly enjoyed it.I can't wait till his next book. I wonder when it's going to be released?", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZRRRYGELMQKS"}}, {"Date": "on August 12, 2013", "Text": "Good book enjoyed it cannot wait for the next one. Awesome story kept me wanting more really kept me interested.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UBHUXH6DTDDJ"}}, {"Date": "on August 12, 2013", "Text": "A good read, if you're into all things post-apocalyptic; as I reckon I am, based on most of my recent purchases.  I'm looking forward to the next in the series.  You won’t be disappointed in it as it develops the characters well, it’s not just about the landscape.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16GK2ZXF2RD70"}}, {"Date": "on August 11, 2013", "Text": "The EMP bursts over many countries was a new twist. Some parts were predictable, but overall it was an enjoyable story.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Q4SXU8B4874I"}}, {"Date": "on August 11, 2013", "Text": "This was a good read. Was pretty quick read, lots of action, but I wanted more. I will wait until the next book comes out.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A227XGOEJF123W"}}, {"Date": "on August 5, 2013", "Text": "While it is not the most well written book I have ever read, it kept me wanting to know what happened next, and the characters were easy to fall in love with.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ST8SGVA0OGY5"}}, {"Date": "on July 28, 2013", "Text": "The book had a good story line. The main characters had detail but the dialog was very stilted, especially the last part of th book.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHPQ7KLY0ICKO"}}, {"Date": "on July 27, 2013", "Text": "Interesting but overly pessimistic view of what might happen after an EMP attack on the US. Quick read bit unsatisfying ending.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AASABRNEB5UO1"}}, {"Date": "on July 27, 2013", "Text": "A very quick and easy read. The characters are interesting, and the author is writing from a position of knowledge (see his website).", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3V4DA8FJCNDYF"}}, {"Date": "on July 25, 2013", "Text": "Enjoyed the story and would have liked more detail about EMP.  Hope there is a follow up about their life in Idaho.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1F67B5TDVHW6M"}}, {"Date": "on July 17, 2013", "Text": "I can't say I love any of the characters, but I want to know what happens to them. I'm ready for the second book.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WL4HABN516GM"}}, {"Date": "on July 8, 2013", "Text": "I really enjoyed the book. The characters were believable. The pacing was good. I look forward to the next one.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3V9424H2D34AX"}}, {"Date": "on July 8, 2013", "Text": "I just wanted to say how much I loved this book. I am from san diego, so when the author used the city as a back drop. I was great to read about places I know. the fact that the main issue was emp(which is a possibility),shows how the author put this setting in a probable scenario. was very well written. I am a fan of the post-apocalyptic gengre and cant wait til next month when the second book comes oout. keep up the good work. the brothers van Zandt rule.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5ZMC2H95HABM"}}, {"Date": "on July 7, 2013", "Text": "This was an interesting novel. The characters were well developed and generally believable. I will read the next installment. There were a few anachronisms and some of the philosophy was a little skewed. The story is not too predictable and often turned out differently than expected.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MTWPQVH66RDY"}}, {"Date": "on July 3, 2013", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MZVG4JR5UA9F"}}, {"Date": "on June 29, 2013", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A03161313ARWLNX3BXYP"}}, {"Date": "on June 22, 2013", "Text": "This was a pretty good read. It takes you thru the fall of America from different vantage points. There are better books with greater detail but its worth the time.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11LQS714QLTK1"}}, {"Date": "on June 22, 2013", "Text": "This was a awesome book cannot wait for part 2. Now I can get some other stuff done couldn't put it down.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35V7KGAY08Z5R"}}, {"Date": "on June 21, 2013", "Text": "I have read quite a few attempts at post-apocalyptic fiction & I enjoyed this one very much.  Well written with an insightful look at human nature.  Looking forward to reading the sequel.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SZTU5H321AVA"}}, {"Date": "on June 19, 2013", "Text": "I really enjoyed this book and cannot wait for the sequel, this book grabs you at the start and is non stop action all the way", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IHROY1LWCIAQ"}}, {"Date": "on June 18, 2013", "Text": "Really enjoyed this novel and even though there are slot of characters I want to know what's going to happen to them all. I look forward to the sequel!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JF6PANIFZAIT"}}, {"Date": "on June 7, 2013", "Text": "A lot of the information was too repetitive especially in reference to the emp. Once this was covered, the book took off and began to pull you in. It will be interesting to see how the second book progresses.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APB402VHECO6K"}}, {"Date": "on June 4, 2013", "Text": "I was pretty pleasantly surprised with this book.  It contained two of my favorite subjects to read about: Marines and post-apocalyptic fiction.  I think the author did a pretty decent job at setting up his story with the attack and the results of that attack.  He described what people are capable of in the face of a country becoming dismantled.  The only problem that I had with the book was in one of the last chapters when the author goes from telling the story as a past tense to a present tense in the middle of a chapter.  I applaud the effort and saw from another review that the author is Maryland born and bred.  From another Maryland born and bred Marine, good work and Semper Fi!  I look forward to the next book.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJ9LVV0AX61NR"}}, {"Date": "on May 4, 2013", "Text": "Fast paced.  I liked that the characters have flaws and make mistakes.  The sappy \"l love you.  I love you more\"parts were a bit too dragged out and took something away from an otherwise well written book.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TNR1KKNDE6CE"}}, {"Date": "on May 3, 2013", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PBKX6TPO21OR"}}, {"Date": "on May 6, 2013", "Text": "Not a bad plot line until Marines start murdering innocents.  Stopped reading when protagonist murders an unarmed man trying to save his family.  At that point, the protagonist becomes a heinous criminal and the rules of conduct are gone.  Not what I have time to read about.", "Helpfulness": 0.6666666666666666, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HZSNS4BWLF5Z"}}, {"Date": "on May 5, 2013", "Text": "This is just the start of many books.  It has some potential with all the story lines left hanging from this book.  It is disappointing to know I must read several more to get this line-up finished.  Gordon shows us he's a real Marine:  he can curse and kill equally well.  That seems to be all it takes for this genre to be successful.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YMUYRO9QO7FT"}}, {"Date": "on July 26, 2014", "Text": "Bought the first three books thinking \"trilogy\" but it is not. The story is well written and is paced well but the books all end without an ending.If that doesn't bother you then you're going to like these books, if you are like me and prefer each book to end with some closure while leading into the sequel....they don't.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3P4T1Q5R8328I"}}, {"Date": "on July 16, 2014", "Text": "Well written, I have ordered the sequel.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZC36EU80H23L"}}, {"Date": "on October 13, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2E7Q430MGF53O"}}, {"Date": "on April 25, 2013", "Text": "Thinly developed characters, rambling plot. Lots of space wasted on dialogue that seemed like filler. I wish I had my time and money back.", "Helpfulness": 0.65625, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZ53PSSQTHYO2"}}, {"Date": "on September 14, 2014", "Text": "As these books go, it was a good read and it will be intetesting to see how the next  few books go.  So far the book was full of action, backed with good plot and character development.  Also I think the book has a number of subtle and not so subtle lessons anyone could benefit from.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AE4RENZ3VSFCZ"}}, {"Date": "on March 17, 2015", "Text": "Love this story.  Sad to see it end.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QXD52CXVMJKQ"}}, {"Date": "on July 27, 2014", "Text": "I am a fan of these type of books.  This one was will written.  Characters who came to life on the page.  I would recommend this book to all those who, for whatever reason, enjoy post collapse fiction.  I look forward to the next book in the series.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QLK76XA7HMXB"}}, {"Date": "on October 31, 2014", "Text": "Very realistic story. What happens when the curtain goes up? How will people react? You can easily put yourself into the story and say 'yep, I know a person that will act just like that.' Meaning that idiots that Gordon has to put up with.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25C6IAWN5CNK3"}}, {"Date": "on September 23, 2013", "Text": "I liked the book. Too much was explained. Endlessly. The heroine and hero, obviously in love, are separated at the end....to create a plot for a equal. It needed more editing. The author does have talent, but needs a cold, hard editor.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D850PFAJVNEA"}}, {"Date": "on October 3, 2014", "Text": "Good book Hard to put down", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3R7XPAEJ8X1H3"}}, {"Date": "on August 12, 2013", "Text": null, "Helpfulness": 0.6, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AC0JJ0E5Q9BUG"}}, {"Date": "on November 7, 2014", "Text": "This book tells a great story, and is very entertaining. However, it is not a good source of truthful information. It is more like watching a good movie, and not like watching a documentary.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VAFVI4H5AC7R"}}, {"Date": "on August 28, 2014", "Text": "I really liked this series, so far anyway. I was able to read the first 2 books back to back and I didn't stop until I finished both in record time. Will keep going with the series.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IUE8ERXIZ6YB"}}, {"Date": "on September 12, 2014", "Text": "I really enjoyed this book. It is written well and in the moment. I intend to read the rest of the books in this series and look forward to it. It's a good read, enjoy it for that.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AILEO39NM92ZD"}}, {"Date": "on August 18, 2013", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MUUFDHSR3CFU"}}, {"Date": "on May 13, 2015", "Text": "Decent writing. A little jumping around but definitely worth the time. Entertaining, but may also be a little unsettling due to our changing times and current events.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DD4BBS745LOC"}}, {"Date": "on November 5, 2013", "Text": "Here is the problem with the majority of post-apocalyptic fiction: the writing is not all that good. It has a forth grade tone. I'm assuming this happens because people who are interested in writing these books are driven by their commitment to the subject matter and do not have a writing background. I read them despite the poor writing for the same exact reason. the writing began to improve as I moved on through the book, or else I simply got wrapped up in the story and started to ignore the writing and publishing quality. That's another thing: many post-apocalyptic novels are self-published, or published by a small company that is allowing too much originality in line-spacing and paragraph formatting. This book has too much white space on each page. But, as mentioned before, I will read this and every other novel in the genre because they are fascinating. The best-written novel of the genre is \"THE ROAD\".", "Helpfulness": 0.5, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MBSJ1MYTN6J3"}}, {"Date": "on November 2, 2014", "Text": "Couldn't put it down!  It was intriguing, heart pumping, heart wrenching and captivating.  This ended up being a very quick read, as I couldn't put it down.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATZB0J7CEKWW5"}}, {"Date": "on July 16, 2013", "Text": null, "Helpfulness": 0.5, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22ON1OL9OSD3L"}}, {"Date": "on September 10, 2014", "Text": "I truly enjoyed this book and realized that this is only the beginning of a great series. After reading this one, I couldn't wait to read the other books!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I01BJFSF1HWO"}}, {"Date": "on September 10, 2014", "Text": "Awesome series! Absolutely love the content and the writers style... Only wish that there were more of them ready to read now!!! Well done Michael Hopf!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADYOP1NYDO1OB"}}, {"Date": "on April 25, 2013", "Text": null, "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ODE4CW3FP9IJ"}}, {"Date": "on October 13, 2013", "Text": "Bravo to anyone who read past Page 30.  Please tell me this was written by a prepubescent 13 year old.  Then I might cut the author some slack.  The execution is awful, \"she carefully typed with two fingers on the light blue Royal typewriter that she bought for twenty-five dollars at the Goodwill store with the money that she saved from her babysitting job at the yellow house across the street that she could see from her bedroom window that had pink curtains with polka dots on them.\"  Have I made my point? Some advice for future projects - take some college level English and creative writing classes and learn how to structure a book so the reader doesn't get lost. Not every single detail needs to be spelled out for the reader.  You're an adult......so write like one.", "Helpfulness": 0.625, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9DXF9XGV47PS"}}, {"Date": "on September 29, 2014", "Text": "This was a good read, it is not one of the best of this type that I've read but good enough that I'll be purchasing book number 2.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2H0KFB0IUNRT7"}}, {"Date": "on November 30, 2014", "Text": "I love reading this kind of genre every since reading One Second After its going to the public library so others can enjoy it.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TY77I66YHH3S"}}, {"Date": "on April 21, 2013", "Text": "The book was good enough that I will probably read the next in the series. Hopefully the author has made enough in sales of this book that he can hire an editor for the next one. Many glaring spelling errors and a few cases of misused vocabulary which detracted from the story. The biggest problem is poor character development which is fairly common in these event driven stories. All in all, it could have been much better yet I have also read much worse.", "Helpfulness": 0.6, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GEDC503SYH21"}}, {"Date": "on June 10, 2013", "Text": "I havent read a book since 1993 and i was convinced i had zero reading comphrehension, this book proved me wrong im happy to say.  I finished the book in a day and a half and i was on the edge of my seat thru the entire reading process, in excitement of what would happen next.  Im already wondering how the second book will turn out.  The book was incredibly well written and one of the best stories ive ever come across (movie, book or otherwise) It surely makes you think of how life could be, had this event happened.  G. Michael Hopf did an incredible job with this being his first published book, im truely looking forward to what he puts out next.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CJT5G784B8XN"}}, {"Date": "on July 26, 2014", "Text": "Pretty intense times and I can not wait to continue the series! Definitely give this series a read! A+ 9/10", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2I0BT6KHB6AJ5"}}, {"Date": "on May 29, 2014", "Text": "Ignore all the poor reviews with 1 and 2 stars. You won't go wrong! Weak character development,  poor grammar, stilted language, newbie writing errors, narcissistic characters, blah, blah blah,...  I was considering not reading this story because I was concerned these reviewers might be correct. I'm so glad I decided to go with my gut on this one. If you're the type who has a habit of pontificating over sentence structure go read Tolstoy and Twain and save the rest of us from having to read more whiny reviews.", "Helpfulness": 0.6, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2M9CYOGPVNBAY"}}, {"Date": "on August 31, 2013", "Text": null, "Helpfulness": 0.6, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIRHBOM4E4V70"}}, {"Date": "on August 17, 2013", "Text": "Some of the scenes in the book are so wordy and unnecessary I just skipped right over them. The characters are flat and cartoonish. I couldn't identify with any of them, as none of them seemed real or believable. It's a very simple moral universe: good guys are \"lean\" and bad guys are fat (or brown). Everyone is ruthless and selfish, even the \"hero.\" What a horrible depiction of humanity. The story lacks any kind of moral center. Kill or be killed, that's the message. Maybe I've been spoiled by \"The Walking Dead,\" where characters struggle to find their moral compass after the veneer of civilization is ripped away, but there's nothing like that here. The only moral dilemma is whether to maintain blind obedience to a mutinous Marine commander, and we don't even find out how that resolves. I understand that this is part of a series, but there are so many loose ends that the whole thing felt incredibly unsatisfying.", "Helpfulness": 0.6, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8JZBP1KIZ0YL"}}, {"Date": "on July 5, 2013", "Text": "The dialogue was so stilted and awkward, it was difficult to connect with the characters. I also found aspects of the plot hard to believe. I'm thankful I bought this as an Amazon special offer. I think that with a better editor (or an editor?) there is the glimmer of a good story, but it is not ready for prime time right now.", "Helpfulness": 0.6, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HNM8LTDOBKYF"}}, {"Date": "on June 1, 2013", "Text": "I was very disapointed in this book.  It did have an interesting wrinkle in the EMP prepper fiction ring.  The author did not develop the characters very well.  He did not sell the emotion of a very fast developing disaster.  Many grammer errors.  I thought a couple days on just why I felt short changed in reading this book.  I realized the author seemed to be interested in only writing down the high points of the story and was not concerned if the reader cared about it.  Its like you are having a conversation with someone and they are not listening to you.  While you are talking to them they are only thinking of what they are going to say next.  Characters were brought in to the story with all the grace of a home invasion.  Some characters had great potential  to add to the story but were dropped like a hot rock.  I love post apocalyptic books, and this was some what of a page turner, but, I dont think I will be reading the sequel.", "Helpfulness": 0.6, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LMCT8M0ZLB58"}}, {"Date": "on August 18, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WS8PCWCTMASY"}}, {"Date": "on September 1, 2013", "Text": null, "Helpfulness": 0.5714285714285714, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHLJFDCQEUJPK"}}, {"Date": "on May 29, 2013", "Text": null, "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A369P97M9PUVV5"}}, {"Date": "on April 24, 2013", "Text": null, "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12IJ7A7BEB2Q2"}}, {"Date": "on October 3, 2014", "Text": "Good book, but not one of the best in this how the future is coming story.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8VJQ8HL3YL5R"}}, {"Date": "on May 30, 2014", "Text": "I'm a big fan of the Post-apocalyptic genre and The End does not disappoint. I agree with what some of the other reviewers have said about grammar mistakes and other things that I wouldn't have expected in a book of this caliber, but unlike some of them I didn't feel it subtracted from the story line. Hopf does a good job of making you care about the characters and puts some interesting twists along the way. I wouldn't say it's my favorite or maybe even top 5 in the genre, but I don't regret getting it and will definitely be getting the rest in the series.", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12E1SJXZR9VR4"}}, {"Date": "on May 3, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LNQBUQYE2X4V"}}, {"Date": "on January 20, 2014", "Text": "This book grabbed me and held me for the entire ride. I actually read it in one sitting since I couldn't break away. There are multiple story arcs that raise some serious questions about where things fall in your personal belief system. Get it and enjoy!", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1390KWJHMJNDF"}}, {"Date": "on November 4, 2013", "Text": "Different view about how civilization as we know it will end. Interesting view from a childhood memory.  I would read it again.", "Helpfulness": 0.5, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FFUYFO603K0K"}}, {"Date": "on July 4, 2013", "Text": "I don't want to be too harsh if \"The End\" is the author's first attempt at writing a book. The story line is okay but the writing style seems straight out of a junior high school english class. The only reason I finished reading his book was merely out of curiosity on how it would end.", "Helpfulness": 0.5, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ALW3QEF9UFTX"}}, {"Date": "on June 27, 2013", "Text": "I couldn't put this book down!  I can't wait to read the sequel.  Very entertaining, full of action from the beginning.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AD44WQGHGVH1S"}}, {"Date": "on June 24, 2013", "Text": null, "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RNAXH03IJ1GR"}}, {"Date": "on June 24, 2013", "Text": "It was a fast read, I couldn't put it down!!! I read it in 2 days! Can't wait for book 2!!!!!", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGOBPO7Y0CTPA"}}, {"Date": "on June 17, 2013", "Text": "Kind of weak dialogue and simple characters, but a very vivid and well thought out description of what happens to society when the lights go out.", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FEC7WGCBJ549"}}, {"Date": "on June 9, 2013", "Text": "After I got used to the style of writing, introducing the different characters and jumping back and forth to their different stories, I really enjoyed the book. All of the relationships between the characters is fully understood and I cannot wait to see what happens to them next. I read a lot of books in this genre and can honestly say that this is one of the better ones that I have read. I can't wait for the next book to be released to find out what happens to Sebastian and of course Gordon and family.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JR4XU8TNHM2T"}}, {"Date": "on June 6, 2013", "Text": "This story was well written with strong characters.  It was hard to stop reading and had me wondering what would happen next.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OXUY0E5BYCPE"}}, {"Date": "on June 6, 2013", "Text": "I originally downloaded a sample of the Kindle version of the book along with several others, since I like the genre.  However, once I started reading the sample I knew right away that this was a book I had to read in its entirety so I bought it even before finishing the sample.  I couldn't stop reading it and now I can't wait to read the sequel.  The characters are very well developed and the situations mostly believable although I don't think that everything would happen as described, but that's the point.  This book will entertain you AND make you think.  By all means read it, you'll enjoy it.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21AXKQ323D00J"}}, {"Date": "on June 2, 2013", "Text": "The experiences of two brothers after an apocalyptic event is the main time line themes, although they are hardly the only ones.  At times the amount of action from different quarters can get a little confusing and I hate it when a book ends without at least some closure for the to main characters.  Overall a good read and I am eagerly awaiting the release of book #2.", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6E95307PD9HM"}}, {"Date": "on June 2, 2013", "Text": null, "Helpfulness": 0.5, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OCAIWPAAXSFM"}}, {"Date": "on May 8, 2013", "Text": null, "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9WLBGR79TFS1"}}, {"Date": "on April 14, 2013", "Text": "Well written, very hard to put down! I am looking forward to the next book in the series. Hurry up!", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2S3L26PI6INEG"}}, {"Date": "on January 29, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXZD32TVRZ2GB"}}, {"Date": "on October 12, 2014", "Text": "Book 2 in series.  Enjoyed it better than most Apocalyptic Fiction", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1O7MNAVB20UH1"}}, {"Date": "on April 6, 2013", "Text": "WOW...this book is a page-turner. I simply could not put it down and am hoping for a Volume II! Being an Veteran myself, this book hit close to home in a good way and I enjoyed every aspect of it immensely.", "Helpfulness": 0.6, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19CLN575EE07T"}}, {"Date": "on October 12, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQPABH8FO4E1J"}}, {"Date": "on October 1, 2014", "Text": "Great read... very realistic and thought provoking.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28BPAPNVFG9Q2"}}, {"Date": "on October 3, 2014", "Text": "Good read. Similar to the Phoenix Rising series.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2S9804I3FH1SW"}}, {"Date": "on December 24, 2014", "Text": "Well written and edited. I will probably buy book two. I'm a sucker for finding out the end of a journey even though this is a stand alone book.  I did get this free, but I think it would have been worth it to pay for it. Well done 👐👐👐", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EVZ12XDD7HH4"}}, {"Date": "on January 2, 2015", "Text": null, "Helpfulness": 0.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37QHJBRL3EPDK"}}, {"Date": "on December 26, 2014", "Text": "While characters weren't totally fleshed out, the gist was there and the pace was fast. I am going directly to book 2, it took 1evening and a bit after lunch the next day to finish this engaging book...", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AINZ7EABXP3PR"}}, {"Date": "on June 9, 2013", "Text": "This book was well written, character development was spot on. If SHTF is your kind of read, you won't be disapointed. I can't wait to read the next installment. Thanks for the good read!", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19JDWT688ITUR"}}, {"Date": "on December 17, 2014", "Text": "A good read and a welcome distraction.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D7Y3J5KPP57H"}}, {"Date": "on January 1, 2015", "Text": "If we were to suffer an EMP or CME, I think what Mr. Hopf writes in his book (and the two others) could very well be what comes to pass.  Very easy read.  Couldn't put it down.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1D2WMBL0CMO4P"}}, {"Date": "on September 4, 2014", "Text": "Great start to the series.  Good character development and plot line that truly could foresee these events happening.  Maybe not the entire US (EMP) but something similiar...", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YLQ4QTL5A9LB"}}, {"Date": "on December 1, 2014", "Text": "I absolutely LOVE this series!!!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4C69R2X6JPCL"}}, {"Date": "on April 24, 2013", "Text": "Very fun read. I always enjoyed these kind of stories.  Kept me wondering what's next.  I loved Samatha and many others. Can't wait for the next", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FE8DKQQP86HW"}}, {"Date": "on February 10, 2014", "Text": "pretty well written. you folks at amazon shouldn't require over 17 words for a review.  Many times I don't do one just due to that requirement.", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13COST1HGT1VW"}}, {"Date": "on April 23, 2013", "Text": "Read story and set up very well by the author.  I will be looking for a continuation of this book (story) and look forward to reading othe", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IV74JCKDT290"}}, {"Date": "on October 4, 2013", "Text": "this book was absolutely horrible. i hated it. i finished it, but i really didn't want to. it is terribly written, confusing in dialogue. i think the reason the author wrote this book is just so he could use military jargon. this is probably one of the worst books i've ever read. but the sad thing is, it has a good story, but the author didn't know how to tell it. cut out most of the military stuff and tell us how the real citizens are doing. and for god's sake, PROOF READ YOUR BOOK BEFORE YOU PUBLISH IT", "Helpfulness": 0.5714285714285714, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EZC3PW4YQA38"}}, {"Date": "on December 9, 2014", "Text": "One of the interesting things about survivalists is that they often seem to actually hope the worst will happen. Mr Hopf's world view seems very much along this line and his politics,racial and gender prejudices are quite  transparent.  He takes us on a post apocalyptic journey that will ultimately take the protagonist Gordon Van Zant to the white supremacist/survivalist promised land: Idaho. The story here is actually kind of interesting if a bit far fetched. Unfortunately the writing lets us down. The word that kept popping into my mind as I read this was \"adolescent\". The characters are extremely one dimensional ie military or ex military white guys are good and entitled to lead; everyone else is weak and clueless. The author struggles mightily with dialogue, tense and continuity. He might have done well to have some of his self publishing funds for the services of an editor. Still if you don't over analyze it (which I obviously have) it's a fairly entertaining read.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3E17I0E0ZYWWN"}}, {"Date": "on August 6, 2014", "Text": "Interesting, quick read. Action gets off to a slow start, but eventually becomes a book that is hard to put down.", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24L2RQ8B5M79G"}}, {"Date": "on May 30, 2013", "Text": null, "Helpfulness": 0.6, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15QO16OD3CIAF"}}, {"Date": "on April 20, 2013", "Text": "Written by an ex-marine this is a great tale of possible outcomes of a EMP strike. Typical of military writers, his branch of the military is the only one with a \"clue\". The author doesn't get bogged down though with a lot of military jargon. I read the book in one day. Couldn't put it down. If you enjoy EMP books, read this one. You will not be disappointed.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TQK3GSU0DV0E"}}, {"Date": "on July 19, 2014", "Text": "this book will help me out many different ways thank you for having it in stock.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23Q738B8RL36P"}}, {"Date": "on August 10, 2013", "Text": "None of the main characters were likable, in fact, I found myself rooting against them due to their immoral actions and thought process.  The writing style was poor and severe editing was/is needed.  It is a very interesting story idea, however, it was a battle to finish because of such a total disconnect with most characters.  I only finished it because I have some weird since of commitment to finishing things I start.", "Helpfulness": 0.5, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13BVMD9VAENR6"}}, {"Date": "on June 19, 2013", "Text": null, "Helpfulness": 0.5555555555555556, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYFTOJHS5MFH"}}, {"Date": "on February 2, 2015", "Text": "Love the series", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21F8XWXBJ39YE"}}, {"Date": "on June 26, 2014", "Text": "This story has a beginning as to how it all came about.  It's very interesting as you read about how today's world (as we know it), starts to crumble.  It will keep your interest until the very end then you look forward to the 2nd book.....", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34ETSIO6YZ8S"}}, {"Date": "on December 23, 2014", "Text": "Very engaging, really getting into the characters.", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGQV3E5X99KWG"}}, {"Date": "on April 2, 2015", "Text": "Great read!", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33FTGT274JJFY"}}, {"Date": "on September 15, 2014", "Text": "Great book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AU9P0MIWY3DLS"}}, {"Date": "on May 3, 2015", "Text": "Tried really hard to get into this book but just couldn't.  Seldom I don't finish a book, but unless I get desperate for reading material, I won't finish.  I was close to halfway through the book and it just didn't seem to be going anywhere, or even making much sense. My favorite reading is apocalyptical books, but this one just didn't do it for me.  The author has written some very good books but this one left me cold.", "Helpfulness": 0.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36DE07L01MU4T"}}, {"Date": "on January 8, 2014", "Text": null, "Helpfulness": 0.3333333333333333, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IF83HCHVSRW2"}}, {"Date": "on August 16, 2013", "Text": null, "Helpfulness": 0.3333333333333333, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LUD7M1ZHNRSA"}}, {"Date": "on September 16, 2013", "Text": null, "Helpfulness": 0.5454545454545454, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3S8SAJUJCWV5A"}}, {"Date": "on March 29, 2014", "Text": "This was one of those books that i just could not put down.  However, the end was so bad that I did not even know it was the end.  Too bad, too, as I would have given this 5 stars if it were not for the ending", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2B991UJCLML4"}}, {"Date": "on March 28, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EJMVY3YN0ZT3"}}, {"Date": "on February 16, 2014", "Text": "This was a fresh twist to an old story.Looking forward to the second installment. A fast read and great plot.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3M2PCJUZAB85I"}}, {"Date": "on December 20, 2013", "Text": "Good read, just started the Long Road to see what lies ahead for the main participants.  Who will survive and remake the nation?", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1N4586B7V6G71"}}, {"Date": "on November 9, 2013", "Text": "I liked the concept behind the overall plot, but it was obvious that this was an early work by the author and could have used a little more work by an editor to clean up some of the writing and ambiguous plot elements.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UUGS6W4OBDEM"}}, {"Date": "on October 15, 2013", "Text": null, "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATEBYBX9I8K79"}}, {"Date": "on September 30, 2013", "Text": null, "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AH7MMHTGNULPU"}}, {"Date": "on September 28, 2013", "Text": "This story is written by a novice writer. There is no character development and very little description. I have read more developed stories by high school students.", "Helpfulness": 0.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26I08JEDMHY8S"}}, {"Date": "on September 26, 2013", "Text": "There is absolutely no character development, the story itself is a giant republican's wet dream without any of the downsides, and the writing is poor.", "Helpfulness": 0.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QGTS4IP4ONTZ"}}, {"Date": "on September 20, 2013", "Text": "Haven't seen the book yet so I guess you all have nothing better to do than send me stuff ok", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I4GL7NER9N7J"}}, {"Date": "on September 18, 2013", "Text": "Starts out well, but then the soldiers of the war with their phony merchant marine language and non-likability ruined it for me.", "Helpfulness": 0.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VH13CQHV4G6I"}}, {"Date": "on September 6, 2013", "Text": "So ironic that the world I'd just one conflict/crisis after another. Could this be what we will endure in the near future?", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28M5IIU9SM7UT"}}, {"Date": "on September 4, 2013", "Text": "I confess I haven't finished the book yet (I'm a speed reader but I've only able to read this one in small doses). I like the story line but the style of writing and how the characters are developed (author over describes them and their personalities instead of developing through the story) leave a lot to be desired. I'd be more interested if it was rewritten and condensed a bit. I'll try to get through the rest of the book and update my review if needed then.", "Helpfulness": 0.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Z8T11640FS33"}}, {"Date": "on September 3, 2013", "Text": "The book has a great concept but the writing is not the best; it is readable though. If you like end of the world stories you will enjoy this one.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AT7WBO8R37NXY"}}, {"Date": "on August 31, 2013", "Text": "The writer writes awkwardly, enough so that it affected the flow of the story.  It took me a while to get into the book as well. The confrontation with the home owners association seemed unbelievable considering the situation. I think I'll skip the next one.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACSH5YJ36Y2ZO"}}, {"Date": "on August 4, 2013", "Text": null, "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WA977XRULA0X"}}, {"Date": "on July 23, 2013", "Text": null, "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A342JKXBLKZ8N1"}}, {"Date": "on July 16, 2013", "Text": "The basic theme and story line were OK for me.. But I did not care for the writing itself, nor did I feel any involvement with the characters.  Another one of those books where the story stops, more than really ends.  One has to buy the next in the series.  I choose not to.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JVB0IK3I8TEP"}}, {"Date": "on July 14, 2013", "Text": "Did not grab my interest enough to want to continue with the series. Jump around a bit to much and it seemed far fetched at times. Close but no cigar.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13P08HU2BX53O"}}, {"Date": "on June 15, 2013", "Text": "Good storyline, but too much military jargon.... Maybe the next book will have less military/Marines stuff in it. Recommended dystopian reading.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AQH188HO50R9"}}, {"Date": "on June 9, 2013", "Text": null, "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZQ0E49D1NSXG"}}, {"Date": "on May 30, 2013", "Text": "Good novel, well laid out and provocative characters.  1 typo probably every 20 pages but nothing that can't be overlooked. If not for those few errors I would have given it 5 stars!", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANAWGTXDYN7BJ"}}, {"Date": "on May 23, 2013", "Text": "Good plot line with interesting character development.  Not to nitpick but for story based in San Diego where were the Marines from Camp Pendelton and other local military bases?  Writing is a bit amateurish but better than I could do.  Overall a good book based on feeling it was too short.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VA88WCH1TKCX"}}, {"Date": "on May 19, 2013", "Text": "Although nuclear apocalypse is a common theme for novels, this is an imaginative and original variation on the theme. Takes the reader through 3 sub-plots  that one can relate to and reflects a well thought out supposition of what could really happen in this type of situation. No doubt the thin veneer of society could quickly give way to survival as reflected in the story. A few grammatical and punctuation errors do not detract from the overall quality of the storytelling. A recommended and enjoyable read!", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DNZVOC8S5AVO"}}, {"Date": "on May 19, 2013", "Text": "This story had some amount of credibility but too many details of how things happened were left out. Too many unexplained holes in the story. Seemed like the book was knocked out quickly without the deeper thought and planning it should have had to hold together better. Better editing and spell checking would also have been appreciated.", "Helpfulness": 0.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OQY3B182DPK3"}}, {"Date": "on September 12, 2014", "Text": "Good book", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36663YN4W39TN"}}, {"Date": "on July 5, 2013", "Text": null, "Helpfulness": 0.5, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4Q2V1QAODOZY"}}, {"Date": "on July 19, 2014", "Text": "I would.have given a 5  however, as a US Marine retired, I would never wish to.follow that Colonel.  Ends never justify those means.  To fire on American Troops  or any American.is.never justified even if.our Commie government paints.them.as.terrorist.  all and.all, a good read.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DFYP5TF5NURY"}}, {"Date": "on April 6, 2013", "Text": "A very intense and exciting story. Did not stop reading until I finished the book. Looking forward to the sequel!", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32B6JOPJVS66M"}}, {"Date": "on September 13, 2013", "Text": "Who ever write this book has no particular skill. Nothing was left to the readers inference and things were repeated to the point I just flashed over pages. The writer chose easy topics like an arrogant town leader. This was a wonderful idea, and would have been much better if written by a more experienced author. I will not be reading the sequel.", "Helpfulness": 0.5, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABQ1ZK7VQWTJM"}}, {"Date": "on September 10, 2013", "Text": "I usually love this kind of material, but I am halfway through this book and frustrated by the poor writing, bad dialogue, one dimensional characters.  Not sure if i can force myself to finish.", "Helpfulness": 0.5, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8ZOX5408YUH9"}}, {"Date": "on August 1, 2013", "Text": null, "Helpfulness": 0.5, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DL7K82OKFKDD"}}, {"Date": "on April 28, 2013", "Text": "Good story line that holds your attention.  Many grammatical errors keep me from rating it higher. I will definitely buy the next one in the series and hope it gets edited by a real person.", "Helpfulness": 0.5, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AG2HHZE9R1SBG"}}, {"Date": "on September 6, 2014", "Text": "Disappointing lack of information/ideas for a calamitous event.  Money wasted.  If I had bought just the first book I would never have purchased another.  The profanity is atrocious.  F bombs everywhere.", "Helpfulness": 0.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2C31OL3UA6ZT8"}}, {"Date": "on August 1, 2014", "Text": "Exciting realistically possible story with a lot of practical take-always if one was ever to experience a situation of a similar nature. Didn't like the excessive language.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10FVE2JTXCBEK"}}, {"Date": "on April 21, 2013", "Text": "Do you ever hesitate to pick up the next book after reading a really good story because your afraid the next book just wont live up to the last one you read?  I read \"Truth's Blood\" a  little while back and enjoyed it so much I was reluctant to pick up another book for fear of being disappointed.  Then I got busy with work and havent read much for a while.  Thats when I found this book.  Was not disappointed at all and a great follow up to Truths Blood.  This book will keep your attention and keep you turning the pages.  If your looking for that next \"good book\", give this one a try.", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AW622MS6TSD4R"}}, {"Date": "on September 7, 2013", "Text": "This is a terrible book.  To begin with, it's juvenile, poorly-written tripe, but the sheer hatefulness of it is absolutely appalling.  The fifty or so pages I was able to skim before stopping in disgust are a moronic sociopath's military fantasy.  Those with an ounce of morality are cartoonishly portrayed as craven liberals, while guns, bigotry and murder are glorified.  If the author is anything like the protagonist, the Marines need to do a lot better enlistment screening.", "Helpfulness": 0.5454545454545454, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NFG69ZSE9E5C"}}, {"Date": "on October 9, 2013", "Text": null, "Helpfulness": 0.5, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I36UIGJRDI3B"}}, {"Date": "on August 1, 2013", "Text": "This book was based on several families in a US subdivision during apocalyptic times and how they managed to survive.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YGUFU306JKGK"}}, {"Date": "on December 29, 2014", "Text": "Great deal!!", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VB5X1PDQ81CP"}}, {"Date": "on December 5, 2014", "Text": "Meh", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AR60PHB7U38GX"}}, {"Date": "on May 23, 2014", "Text": "12 pages of farting around the house with his wife and kids and 6 paragraphs to describe a gunfight. Doesn't even mention the guy owns a rifle until more than halfway.", "Helpfulness": 0.3333333333333333, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VOAN0NXU9M9A"}}, {"Date": "on January 22, 2014", "Text": "not written well, not entirely bad but poorly written, time to move on to a new subject matter I guess", "Helpfulness": 0.3333333333333333, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIHCRGUPSK53Z"}}, {"Date": "on January 1, 2014", "Text": "Plain and simple, this guy cannot write.  Redundancies and boring sentence structure abound. The story is mildly interesting, but the characters are all relatively flat and dull.  Furthermore, his portrayal of the Marines doesn't agree with what I know.  [Spoiler alert] Having them commit what is, in effect, mutiny? Really?", "Helpfulness": 0.3333333333333333, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15M42WBGGKB1R"}}, {"Date": "on December 28, 2013", "Text": null, "Helpfulness": 0.3333333333333333, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A256ICO33W1FQG"}}, {"Date": "on September 6, 2013", "Text": null, "Helpfulness": 0.3333333333333333, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZK441SF3PQY7"}}, {"Date": "on August 30, 2013", "Text": "Very similar to other EMP stories. Little originality. The story and characters were pretty weak.  There were a few good twists of plot and the ending does leave you wondering what will happen next.  Overall, you have a number of better reading options.", "Helpfulness": 0.3333333333333333, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OTGKIV8HTG39"}}, {"Date": "on August 30, 2013", "Text": "I didn't finish the book.  It got boring quickly. I love end the world stories but I couldn't get interested. I may try it again some time", "Helpfulness": 0.3333333333333333, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AI99A11VFVUXE"}}, {"Date": "on August 27, 2013", "Text": null, "Helpfulness": 0.3333333333333333, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJLX3EUE3UOQB"}}, {"Date": "on July 18, 2013", "Text": "So awfully edited it was difficult to read. I'm glad I borrowed this one and didn't waste my money on it. I did certainly waste my time.", "Helpfulness": 0.3333333333333333, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OT08RS4UQ7J6"}}, {"Date": "on July 15, 2013", "Text": "While the premise is interesting and the plot chugs right along, I could not bring myself to finish the book. The author tells you everything instead of showing it through description of the deeds and actions of the characters. The writing is also choppy and the sentences poorly constructed. I'm sorry, but when I read I expect something better than \"Joe felt anxious. He looked over at his wife and knew he loved her. He was worried about her.\" I would not recommend this book unless you read at a third grade level.", "Helpfulness": 0.3333333333333333, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SW65TXWS1WEB"}}, {"Date": "on October 18, 2014", "Text": "A GREAT READ..GET ONE FOR YOU AND A COUPLE FOR YOUR FRIENDS...MAKES GREAT XMAS GIFTS..", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AINDCQ2XSE20B"}}, {"Date": "on June 14, 2013", "Text": null, "Helpfulness": 0.3333333333333333, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15HI1GKYHP609"}}, {"Date": "on October 12, 2014", "Text": "Micheal is a fantastic writer.i love this series.It gets better and better.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UXOTTGBTG25C"}}, {"Date": "on June 28, 2014", "Text": null, "Helpfulness": 0.4, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAPFC3A9GAUNY"}}, {"Date": "on July 21, 2013", "Text": "This is the worst book I ever finished. The storyline is unconvincing, the characters shallow stereotypes and the dialogue would have befitted a Marvel comic from the 50s. After a while I found both the illogical actions taken by the main characters and the childish dialogue quite amusing - as some sort of parody.", "Helpfulness": 0.5, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AX40WICJ9GU4"}}, {"Date": "on October 12, 2014", "Text": "this is a good series of books and a good yarn into the bargain", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A389IEM3POG3DB"}}, {"Date": "on May 12, 2013", "Text": "Poor writing filled with cliches and stock characters. A few pages in he has a Marine use a Patton quote without attribution, which was the first tip-off than this guy was not on the level. Throw in more dialog involving an imagined Bill O'Reilly interview with a Democratic Congresswoman who wasn't ready to jump into a war with Iran (this after the main character had just gone through hell in combat in Iraq) and you have an author with seriously muddled thinking.", "Helpfulness": 0.5652173913043478, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2J9EBJWPAHOQB"}}, {"Date": "on July 24, 2013", "Text": "This book is truy awful. First the writing is dreadfully amateurish. This guy did no research into the subject matter and his ignorance is clear. I can take a little poor writing but the whole premise is so uninformed and wrong that I could not stand to finish. I like survival stories, but I need to think there is some basis in fact. I want my 3.99 back.. I would give it zero stars if it would let me.", "Helpfulness": 0.5, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVSROOBJWU4BO"}}, {"Date": "on October 16, 2013", "Text": null, "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MWUYXDJE4I8R"}}, {"Date": "on April 8, 2013", "Text": "A bit of corny, predictable, dialog but a well written story. Characters were likable and well fleshed out, plot was believable.", "Helpfulness": 0.4, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AR1MU9T2B5J9A"}}, {"Date": "on March 19, 2015", "Text": "Lost me about 20 pages in.", "Helpfulness": 0.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AFK43V1NZM5K"}}, {"Date": "on August 21, 2014", "Text": "Great, well written story of how civilization would collapse in a world wide crisis.", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACCWNB2LCNHRD"}}, {"Date": "on December 8, 2013", "Text": "Lame, lame, lame.  Terrible writing,  predictable plot,  bad editing.  Wish I hadn't wasted the time on this book.  Sorry, but Hopf writes like a high school student.", "Helpfulness": 0.4, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AOMY8FVZG4BO"}}, {"Date": "on August 30, 2013", "Text": "How do these books get 5 star reviews?  The good news is that you can preview the kindle version to quickly realize how bad this one.", "Helpfulness": 0.4, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OZOYAUQ5WV9N"}}, {"Date": "on September 4, 2013", "Text": "Horrible writing, I tried so hard to push through but it was just too painful. I couldn't even finish this book. Very disappointed.", "Helpfulness": 0.4, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SZZ3KFUP10YW"}}, {"Date": "on February 5, 2014", "Text": "Amazingly disappointed.  After reading several series of post apocalyptic books I have developed a pretty good sense of what I am looking for in these kinds of books and this book doesn't cut it.  There is pretty big lack of character development, dialogue is middle school level at best and it did not pull me in as many other books have.  I do not find myself thinking about the depth of each character throughout the day, wondering how they will deal with the next situation that presents itself.  Of course if you want a lesson in the basics of prepping this May be the book for you!  I didn't get far in this book because it just wasn't worth my time.", "Helpfulness": 0.42857142857142855, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJVY249ICQKA1"}}, {"Date": "on July 26, 2013", "Text": "Never finished it.  The language was just plain horrible.  Returned it after reading only a handful of pages.  Bad language doesn't make a book great or interesting... can do without.", "Helpfulness": 0.42857142857142855, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SY88ZNVOD6JS"}}, {"Date": "on May 29, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HMG97H0JIVYW"}}, {"Date": "on May 2, 2014", "Text": "It must be my 25 years military background but i just could not get into this book at all.  As some reviewers have stated, the writing style was not to my liking, but to me, that is subjective.  Portraying US Marines as this author did is either: a) he knows nothing of the US military or b) he is aligned with the current administrations thoughts about the US military.  Either way, this book gets a THREE, which is pushing it but I never give a fiction book less than a three.  Alleged \"TRUE\" books get less than a THREE if they are blatantly lying in trying to make their point (politics, global warming fallacy, etc).", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6IBF2CGRM1Q7"}}, {"Date": "on April 12, 2014", "Text": "The abundant use of the word \"grabbed\" or \"grab\" really annoyed me. The story line was interesting and really made you think about what you would do if you were in an apocalyptic situation.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AM7HIERZWOLAU"}}, {"Date": "on March 2, 2014", "Text": "The story is about an EMP strike of some kind that wipes out all computers and anything that relies on electricity.  It's been done before and sadly, much better.  The writing isn't very good either.  The story has potential but it needs a lot of work, including some originality.", "Helpfulness": 0.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RYBHP2YKNLQI"}}, {"Date": "on January 17, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZEEGIKWY04R8"}}, {"Date": "on January 14, 2014", "Text": "I love PA books and have a son who is a Marine and recommended this book. However, I found the characters a bit unbelievable. The main character was so overly sweet with his family and so overly bruitish with others. His reasons for murdering others seemed no different than the \"bad guys\" in the book. Also, the story starts March, 2014, and proceeds through the end of December, 2014, and into January of the next year, which is erroniously shown at January, 2014. Was the book not edited? The following book takes off in January, 2014. Shouldn't it be 2015??? I will continue to read the second book and probably purchase the third, because I like them enough to want to see how the author wraps it all up.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WBWITXPCOJGN"}}, {"Date": "on January 11, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QEQ2QYFXX40F"}}, {"Date": "on January 9, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Y7JAJEFIYVZW"}}, {"Date": "on January 9, 2014", "Text": "So forgettable I can't recall exactly. It's an OK time killer, not groundbreaking or great lit. Disappointed in the length of many ebooks.", "Helpfulness": 0.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AI9MUEYBJHU20"}}, {"Date": "on January 4, 2014", "Text": "Good story but writing style to pendantic. Personal development of hero makes him a bit simplistic and stereoptypical.  Some of the story drawn out to long.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1C82DU5A23VIM"}}, {"Date": "on December 26, 2013", "Text": "Book 1 or 2? Beats me from the titles. I enjoyed reading this and the other book, and would like to see one or two more that would conclude the story. I also have trouble figuring out which of the two books is the beginning book. It paints the US government as very simplistic, and our military as if they were 3rd world types. I do not know who this author is but it kept striking me as I read that they do not have much, if any experience, with the US military or government. Just a guess on my part. Characters that know better keep making the same, dumb, mistakes that a novice would.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23JWMDX038UN6"}}, {"Date": "on December 24, 2013", "Text": "This wasn't a bad novel, but like many others nowadays, it is a set-up for a series. It just stops.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3574Z5W5F3ZMI"}}, {"Date": "on November 19, 2013", "Text": "Square-jawed ex-marine takes care of his family, stupid suburbanites don't understand that the world has changed. Nothing that has not been done before.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LKZM6BYKFUZ"}}, {"Date": "on November 3, 2013", "Text": null, "Helpfulness": 0.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27K1NF4LOVBT6"}}, {"Date": "on October 31, 2013", "Text": "I have to agree with a lot of the other comments about the bad syntax, grammar,  editing,  changing points of view and stunted dialogue.  I really did like the book in the beginning but (SPOILER ALERT)the whole Mason thing was BS.  He did not even need to be in the book unless it was to make the protagonist seem like an insane douche,  which was impeccably done.  The protagonist went downhill from here.  And the final attack was all BS.  How was that a surprise ?  Who did not see that coming and it seems it was being foreshadowed.  I finished the book but there will be no need to reread it ever.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1T6WVZB1CUSE5"}}, {"Date": "on October 20, 2013", "Text": null, "Helpfulness": 0.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D457ZJCUHSKK"}}, {"Date": "on October 17, 2013", "Text": null, "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AR3IXZM3MGPYY"}}, {"Date": "on July 9, 2013", "Text": "To much jumping around. And there were a lot of unanswered questions. You can tell the author is a marine from the writing. Also a pretty far fetched novel. However, I did enjoy the reading and look forward to the next book.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1USSNLP8O7RKK"}}, {"Date": "on May 30, 2013", "Text": "Accept my four stars and be thankful to get them.  I said I liked it, liked it, liked it, liked it.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWX7K7NKA8DJ8"}}, {"Date": "on October 14, 2013", "Text": null, "Helpfulness": 0.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KKMSOZA7P8MZ"}}, {"Date": "on July 23, 2014", "Text": "Good book.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VN5A6GAGUFMI"}}, {"Date": "on January 29, 2014", "Text": null, "Helpfulness": 0.25, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DQGK8N73CQ64"}}, {"Date": "on November 1, 2013", "Text": "As a retired senior naval officer, the author's storyline of a Marine Colonel and his troops taking over the ships of a Marine Amphibious Group and then sailing back to the U.S. just isn't believable.  Sure, it is fiction but if you're going to create a scenario, then it should be plausible.", "Helpfulness": 0.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SOTI6TU6I1A7"}}, {"Date": "on October 29, 2013", "Text": "Seriously? THe ratings for this book are making me think twice about the legitimacy of the Amazon ratings, those 5 star reviews HAVE to be homecooked. THe plot is poorly written, this book is terrible. There is absolutely no character development, none whatsoever. The storyline could have been decent, I love the genre, but the author didnt get it done or even close to it. I found myself laughing at how cheesy and elementary some of this plot develpoment was. Originally intended to read the series, not anymore. Not even sure i'll finish the last 75 pages, it's actually that bad.", "Helpfulness": 0.4444444444444444, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24MZ2UPUOC9P0"}}, {"Date": "on January 31, 2015", "Text": "Weak books.  I read all three books because I'm interested in EMP.  But the storytelling here really blows.  These books are about people trying to survive but every major character is despicable.  I found myself wanting them all to die sooner.", "Helpfulness": 0.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22XQSK1H13ITK"}}, {"Date": "on July 6, 2014", "Text": "Lacked details. One guy 'gets it' and takes action - sort of.  The Speaker of the house (actions) is totally unbelievable.  The story isn't believable (I've got 75k in a shoebox up in the attic...says nobody - EVER). Everyone's ideas are half baked. One, just one concept was covered that hasn't been covered better by many, many other books of this theme - meltdown, but even that is really only good for a sidenote.  Since I already bought the second book before starting the first(based on ratings) - I hope like heck its better than the first..", "Helpfulness": 0.25, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJK0Q3MZJBXRC"}}, {"Date": "on June 28, 2013", "Text": "Terrible plotting, pacing, character development, and pretty much every element you'd expect to find in a competent novel. Sorry, just call it as I read it.", "Helpfulness": 0.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZVJ8IC0JBMXQ"}}, {"Date": "on October 27, 2013", "Text": "I bought this book with \"Holding their Own\", from Joe Nobody. I finished \"Holding\", in a day and a half. I than picked up \" The End\" and read about 50 pages. It was very hard to read. I just kept thinking, \" It'll get going soon\". No such luck. So I started skipping pages, and it was all downhill after that. I have no desire to read this anymore..at all..", "Helpfulness": 0.25, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27ML33ITTJL9D"}}, {"Date": "on June 26, 2013", "Text": "I think this is one of the most boring books I've read in a long time.  If you are wanting excitement, then I would recommend Cyberstorm first before I'd waste my time and money on this book.", "Helpfulness": 0.4444444444444444, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AU2EBC2WHIO7P"}}, {"Date": "on May 18, 2013", "Text": "It's as if a robot wrote the book. No emotions at all. It's fine for report writing and an interesting concept but brutal to read. I didn't realize this was yet another self published book. I am trying to avoid them because in general the writing is just so poor. This author needs a writing club and to read some books with some emotional connections. Sorry I wasted my four bucks.", "Helpfulness": 0.45454545454545453, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A334O1EVCA7H89"}}, {"Date": "on October 23, 2013", "Text": null, "Helpfulness": 0.3333333333333333, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PEIJ5M7LNMCV"}}, {"Date": "on October 6, 2013", "Text": "This is so poorly written.  The protagonist is a jerk, to boot.  Save yourself, don't read this. Ever. Really. I mean it.", "Helpfulness": 0.3333333333333333, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1O2K4E2PAVYCJ"}}, {"Date": "on August 21, 2013", "Text": "Had to give one star, because I can't give a ZERO. TG this was my monthly free Prime book. Too many down sides to list.... Avoid.", "Helpfulness": 0.3333333333333333, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UCNDLBXXDHRC"}}, {"Date": "on July 20, 2014", "Text": "Five stars because I set aside several other books to focus on this. I recommend it to high information people who are paying attention.", "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEQ4N3VNEDRXH"}}, {"Date": "on August 7, 2014", "Text": "I stopped reading it when I hit page 100. The first 100 pages are so familiar to every postapocalyptic movie and tv show out now, there is no reason to keep on reading. If you watched any episode of the canceled \"Revolution\" TV series, you've read this book. No originality. I got this book free, don't recommend you pay for it.", "Helpfulness": 0.3333333333333333, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZDPHYT81AN20"}}, {"Date": "on August 23, 2014", "Text": "none", "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1P45VDE88AJUL"}}, {"Date": "on August 7, 2014", "Text": "OK.", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AONJ0YKHAFEV3"}}, {"Date": "on March 22, 2014", "Text": "I love and will read pretty much anything about world ending and rebuilding. I borrowed this book from library and start reading without checking any reviews. The dialogue between characters caught my attention right away and I kept asking myself why do I feel weird about this novel? I rechecked some of the dialogue and they are like elementary dialogue. Similar to he said, she said all the time. I feel like I was in fifth grade reading again. Also the main character and his family acted weird... too much hugging, kissing, and honey honey all the time. Then the main character acted like he didn't care about anyone else period. His perfect family is too unbelievable and no remorse what's so ever about any one else who would not benefit him or his family. Too weird and too selfish. I made it to 25% of the novel and returned it back to the library.", "Helpfulness": 0.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FOJ8WK8RN3IW"}}, {"Date": "on May 14, 2015", "Text": "This fear mongering coward of an author has turned Roger Ailes talking points propaganda into one of the worst written stories that I quit reading. Imagine Mein Kampf with poorer narrative development", "Helpfulness": 0.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MGE1126C0U62"}}, {"Date": "on July 15, 2014", "Text": "The one good thing I can say about this book is has confirmed for me without a shadow of a doubt that I should not trust Amazon reviews.  Its a shame as I would like to be able to trust them, but for a book this badly written to have a 4 star average over 600 reviews is crazy.  There are so many implausible things in this book that at some you stop reading it with real interest and, for me, continue reading just to see how massive a pile-up this train wreck will become.  This is a great example of the dark side of self-publishing.  Amazon, please fix your rating system - the person responsible for it within Amazon should be very, very embarrassed.", "Helpfulness": 0.2857142857142857, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LIWPTMVTRW34"}}, {"Date": "on September 6, 2013", "Text": "This really isn't a review of the book, because I didn't read the entire book.  I did, however, read the sample that Amazon lets you download prior to purchasing the book.  I have to say that early on in the story I was turned off the the fact that national news that the protagonist and his family chose to listen to (Fox News) and the commentator (0'Reilly) interviewing the speaker of the house and liberal congressperson turned me off to begin with.  Then, when the protagonist commented to his brother's query that he had be out purchasing new military style guns to add to his arsenal, I couldn't help thinking that his is not the book for me.  While it may be mundane to the story as it unfolds, I see and hear about enough right wing propaganda and fear mongering every day to make me not want to purchase the full novel.", "Helpfulness": 0.4375, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VHDZTF3UMMEI"}}, {"Date": "on May 31, 2013", "Text": "Must like a military story to like this.  Not the best execution of a good idea. It's just an ok story", "Helpfulness": 0.36363636363636365, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32JY9CGTRL6TY"}}, {"Date": "on August 8, 2014", "Text": "I don't know that I can finish this book.  He must think women are idiots........after months of terrorist attacks on American soil, he explains to his wife, as if she was a child, what an EMP is.  So, if you are married to an ex-Marine, living in San Diego with extensive military targets, you have no preparedness (after the EMP they have to go to the store to pick up supplies) and no idea what types of risk you and your family might face.  I made it as far as page 47 in the hard copy.  Maybe Marines just like their women oblivious.........It is enough to make me write a novel where the men are clueless and the women rack their nines and defend the homestead.", "Helpfulness": 0.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RN9FBQLNUNZ5"}}, {"Date": "on April 19, 2013", "Text": "Good read until I was half way through the book and had missing content, two chapters. Tried to reload it a few times without success, returned it without knowing how it ended. Review would have been 5 stars until then. First experience with missing content and have read hundreds of ebooks, a real interest killer.", "Helpfulness": 0.45454545454545453, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3S5RI7W5ZBG9F"}}, {"Date": "on July 4, 2014", "Text": "Mildly diverting. Good for self published.", "Helpfulness": 0.2, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1D4ZUKONXW0FU"}}, {"Date": "on April 24, 2014", "Text": "I just don't enjoy reading books with a lot of harsh language. I know a lot of people say that foul language is just everyday real life but I do not care for it I'm real life either. The story line seemed to be going well and  I thought the language might lighten a little but it didn't. Just not the  book for me.", "Helpfulness": 0.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QXBO8HYNNNT2"}}, {"Date": "on August 13, 2014", "Text": "Hate books with no ending", "Helpfulness": 0.14285714285714285, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A329QO8NYT3J6G"}}, {"Date": "on August 24, 2014", "Text": "Very poorly written. I could not finish the book.", "Helpfulness": 0.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QMDCMMHRA1J2"}}], "ReviewUrl": "http://www.amazon.com/End-Postapocalyptic-Novel-New-World/product-reviews/0142181498/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.0 out of 5 stars"}, "OfferPrice": "$10.92", "Salesrank": "#23,712", "ListPrice": "$15.99"}