{"Category": "in Books (", "Name": ["Dreamspinner (A Novel of the Nine Kingdoms)"], "Timestamp": "2015-05-24 23:48:01.576259", "itemurl": "http://www.amazon.com/Dreamspinner-Novel-Nine-Kingdoms-Kurland/dp/0425262197", "Reviews": {"TotalReviewCount": "71", "ReviewList": [{"Date": "on January 6, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A311KBQDJQNIZE"}}, {"Date": "on January 1, 2013", "Text": null, "Helpfulness": 0.9230769230769231, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UJ0YU1FHJEQO"}}, {"Date": "on January 2, 2013", "Text": "The book continues the story of the nine kingdoms with Runach.  I admit I was a little worried because I felt let down by the way Rudith and Sarah's story ended and wasn't sure if a story with Runach could be pulled off at least not with him having no magic and messed up hands.  However somehow it works.  I was pulled in immediately as Lynn began her story with a memory and not the one at the well thank goodness.  I think it is the loneliness of Runach and Aisling that pulls at you the most.  It seems as though each is surrounded by people and yet very much alone and trapped in circumstances in which the have no control.  As the travel through the nine kingdoms they are thrown together as they each try to find a place in a world in which neither quite seem to belong.  Aisling is trying to escape the life she left behind in a weaver's guild and find a mercenary to free here people all while trying to figure out how much of what she has been told is a lie and how much is truth.  Runach is trying to find his place in the world without his magic and to relearn how to wield a sword with his nearly healed hands.  They encounter many of the characters from the previous nine kingdoms books...primarily those from the first three, some good and other boy.  The similarities between Aisling and Sarah become apparent early on to the reader and yet the is only a brief mention of Sarah in the book which seems odd considering what is revealed.  The only real downside is that unlike Miach and Rudith, Runach doesn't quite measure up as a hero able to take care of himself and Aisling.  Aisling manages to get him out of a few situations as do other familiar characters and unlike the other too it seems like he is incapable of doing more and clearly wishes he had his magic.  It leaves you thinking, hoping, and wondering if somehow he will manage to get his magic back....", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUP85CG2NBNWN"}}, {"Date": "on January 31, 2013", "Text": "Even though this is the 7th book in a series, it does not disappoint.  Lynn Kurland continues to weave her intricate story with all the characters that I have fallen in love with!  My favorite line in the book... \"We don't choose the events we're faced with, we are chosen to face them.\"", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKNY9WR3XKCJ3"}}, {"Date": "on May 10, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AROSU3CGT54JU"}}, {"Date": "on January 21, 2013", "Text": "If found this  to be very good reading. Unfortunately all writers seem to take  the three novel approach to writing nowadays. Today money rules and selling three books is better then selling one. I can't fault Ms Kurland for the ways of the world however I hate waiting a whole year for the next installment.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JYX436BY4VK"}}, {"Date": "on February 7, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HJQ8IXJJ16JN"}}, {"Date": "on January 5, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32HPEJOM37MF4"}}, {"Date": "on September 1, 2014", "Text": "This is the first book of the trilogy that continues with River of Dreams, which I read first and don’t advise. It introduces Aisling of Buadair, who was apprenticed to the weavers’ guild of that kingdom at the age of seven and has had her apprenticeship extended by her parents twice since then (each apprenticeship lasts seven years). Months short of her 28th birthday, when her parents shouldn’t be able to extend her again, she sees them going into the guild headquarters and has a bad feeling that they’re going to do it anyway. A peddler provides her with the necessary papers to leave the country (not an easy thing to do) and sends her on a mission to find an assassin to kill the usurper who holds the throne. All sorts of bad things happen to her along the way, but she does meet Rùnach, a son of the black mage Gair (also the father of Ruith from the second Nine Kingdoms trilogy and Morgan from the first) whom we met briefly in Gift of Magic. (We met both Gair and Rùnach in that book, for that matter.) And the two manage to end up traveling together, though their relationship is a bit prickly, since both have secrets they’re unwilling to share. The romance side of this pairing is not very prominent in this book compared to its sequel, but the adventure side is stronger. I did note with interest that Aisling is shown on the cover aiming a longbow left-handed; on the cover of River of Dreams she’s also aiming a longbow, but right-handed in that one. I’d presume that if she were really that ambidextrous a point would have been made of it in the text, which it isn’t, so I suspect the artist for this book was just careless. (Or possibly the picture was reverted in a transfer.)", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KATMAV54RMH1"}}, {"Date": "on March 24, 2013", "Text": "Like the first Nine Kingdoms the start is a little slow but if you are willing to hang with it, the story will reward you. Allow me to start this review by saying I love this series. When I discovered it two years ago I fell in love with it. I have read the first trilogy but not the second so there some things that I did not know coming in but things like spoilers do not annoy me. This series is on my To Buy List. It is well written, fun, and just plain good. There is just one problems and it is the same problem I had with the first book Star of the Morning and that is it takes about 100 pages before you are really hooked into the story. I do not know if Kurland just needs some time to get things going but I warn you about that. That said do not let that stop you from reading this book because it is wonderful. I cannot wait for the next and I am going to be buying them all from Amazon from here on out. I like both main characters and we see old ones from the other books and they just add to the story. Some romantic tropes are here but do not let that annoy you just part of the show. The plot has me guessing at the moment but I was in the same position at the end of the first book in the first trilogy too but I trust Kurland. This is a wonderful series with inventive magic, clever heroes, and evil villains; what fantasy lover would not love this? I know that I do.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1O00HPJ60OU2K"}}, {"Date": "on February 6, 2013", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A376N1KXNE0E80"}}, {"Date": "on January 25, 2013", "Text": "If you are familiar with Lynn Kurland you will understand this review. If not don't read this book. This is a series that will make very little sense if you don't start with Star of Morning which in my opinion is the best 3 books of this series. Kurland is a master story teller and she is amazing at making the same story fun to read. Unfortunately she doesn't have too many different story lines. She adds different elements but the characters are all very similar and their stories are too:{ I still love to read her books even tho it is the same story over and over. So this book reminded me a lot of the first three books and the second three books. And it didn't have a lot going on or much movement. But my gosh I enjoyed reading it and couldn't put it down:}", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39BGN8JA7CIFX"}}, {"Date": "on July 26, 2013", "Text": "I bought this book because I am a fan of this series.  I didn't give it five stars because if you've read others in the series it was almost predictable.  Damsel in distress, handsome elvish prince comes to the rescue.  But it still left me wanting more and I can't wait for the next book to see what happens to these characters.  I wouldn't recommend starting with this book I would read the Author's other two series first to get a better knowledge of the characters because they are reoccurring throughout.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14AMX0ULLEN1G"}}, {"Date": "on February 25, 2013", "Text": "The Nine Kingdom series are all wonderful.  Dreamspinner is just as good as all the others.  If you have not read them please do.  Just know that so far each story has come in 3 books and it seems like forever to finish each story.  I share these with friends and we all have problems setting each book down till done.  Can't wait for the next installment of this story!!!!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6JAZC7YJ3YG5"}}, {"Date": "on February 22, 2015", "Text": "I loved this next episode in the stories of the 9 Kingdoms.  Could not put it down and read it in one day!  Then, immediately started the nest one!  It is not entirely necessary to start at the beginning of this series, but I would highly recommend you do.  This will make it easier to keep up with who's who and the intricate weavings from one episode to another.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TGN341V37KW9"}}, {"Date": "on October 7, 2013", "Text": "This book was a good continuation of a wonderful series. I just wish they didn't require this commentary as I just want to like/love/what ever it an be done.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2X3RRY9EX4EPU"}}, {"Date": "on July 26, 2013", "Text": "I love Lynn Kurland books.  Sometimes it's hard to wait for the next one to come out.  She has a way of making the story flow.  You don't want to put the book down & you want to read the next while the story is fresh in your mind.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHK8N4013G4YK"}}, {"Date": "on July 1, 2013", "Text": "This book was very entertaining to read, I have read a few lynn kurland books and this one does her justice", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZU4FZIR3ZPE"}}, {"Date": "on May 19, 2013", "Text": "All the books in this series are amazing! I can't wait for more.  All of her characters are well developed and lovable.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3L0ZNKZR8FQQ7"}}, {"Date": "on April 9, 2013", "Text": "A good story and I am impatiently waiting for the next book, if it follows the others there will be two more books to complete the story.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2H6W5JT3VN86"}}, {"Date": "on March 8, 2013", "Text": "Love Lynn Kurland's Nine Kingdom series...anxiously awaiting the next book. I have read every book of hers and they never disappoint!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VF9RKUKP4AZN"}}, {"Date": "on March 7, 2013", "Text": "All I have to say is Wow what a great storyteller Lynn Kurland is, I like all of her series. If it's not a time travel it's a romantic history lesson with some humor and magic all rolled up together.Her nine Kingdom stories have it all I recommend you start with Star in the Morning and go from there. Again another keeper for my Library of Lynn Kurland books.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Y6E0MK1KGC44"}}, {"Date": "on March 1, 2013", "Text": "I adore this series. Simply incredible and the characters so lovable. I just wish I didn't have to wait for more!!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EBIHM78HE6TB"}}, {"Date": "on February 28, 2013", "Text": "I have read all of the nine kingdoms books so far.  They have all been excellent.  I love how the Lynn has you hooked from page one.  I love the main characters.  They are both vulnerable and it make you want to cheer for them.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ONN9D3MX3PN4"}}, {"Date": "on February 26, 2013", "Text": "I enjoy the fantasy and appreciate that my 13 year old daughter can also safely read this series.  We enjoy the characters.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CYWLBPZG6OFO"}}, {"Date": "on February 10, 2013", "Text": "I loved the story and it is a typically great Kurland narrative . My only issue was the ending  which I'm guessing is a cliff hanger for the next book. But it seemed abrupt and felt frustrating. The previous novels of the Nine Kingdoms have built off a continuing storyline and don't leave you on the edge of a cliff with many months to wait for the next novel.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALNBHTLTP4MNJ"}}, {"Date": "on February 9, 2013", "Text": "I loved it. Once again Ms. Kurland creates characters that readers care about that are not perfect but who eventually overcome their obstacles.  Looking forward to the next book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I9J2RJ5CCE99"}}, {"Date": "on February 3, 2013", "Text": "Have been following this series for years.  I really think that this is one of the best of them.  It could stand alone except for the cliffhanger ending.  Can't wait to read the next one.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Q6L51LWAX80C"}}, {"Date": "on February 3, 2013", "Text": "More please. I forgot how these characters get more than one book. I am vastly impatient, and already can't wait for more! Loved this book, love this series, and Lynn Kurland can do no wrong.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2991IYCLZU5PR"}}, {"Date": "on January 22, 2013", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A256CGCHWMIBK7"}}, {"Date": "on January 21, 2013", "Text": "I normally like anything by Lynn Kurland; however, the characters in this book were not very developed and were more of a sketch.  There didn't seem to be any real continuity and the book ended very abruptly.  If the Nine Kingdom novels are all like this, I don't believe I'll be reading them.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UINFWX2LZT7I"}}, {"Date": "on January 20, 2013", "Text": "First Morghain finds Miach, then Ruith finds Sarah and now Runach is invilved with a dreamspinner from Bruadair.  Kurland's Nine Kingdoms provide enjoyable and interesting adventures for all the surviving members of the black wizard Gair's family.  This is the first of what will probably be three books telling Runach's story.  He is the most damaged of those left alive, having a scarred face and hands and also having had his magic stripped from him by his father.  As a very good swordsman, he is trying to help Aisling who was thrown into this adventure not believing that there were such creatures as elves,dwaves and mages or magic.  This naive outlook leads to many problematic situations as she struggles to carry out an assignment which she is not allowed to explain to anyone under fear of a death curse.  More to come.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKREC9AN5G0OI"}}, {"Date": "on January 19, 2013", "Text": "I love this series. I read alot, every single day and so I am sure I am just a bit jaded. Books have to capture my attention immediately or I just close them up. This book did just that.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18ORZ2SYDOCVK"}}, {"Date": "on January 12, 2013", "Text": "Lynn Kurland has added another great read to her Nine Kingdoms books.  I have all of them, as well as all her books and love every one!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A115ET8E9K9Y4H"}}, {"Date": "on January 11, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ESZ57NA5DVNY"}}, {"Date": "on January 10, 2013", "Text": "I always look forward to Lynn Kurland's new books and I have yet to be disappointed.  I would recommend this book to everyone.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2H9DMSFUV95F6"}}, {"Date": "on January 10, 2013", "Text": "The plots don't vary much from book to book.  But they are a delightful read.  I'm looking forward to the next installment.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XIP7X6K0TZRT"}}, {"Date": "on April 14, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35B14GU576JP2"}}, {"Date": "on September 19, 2013", "Text": "I love this new fantasy series, and deeply appreciate the nature of her romances.  It's refreshing to read a book where the private moments are acknowledged, but kept private.  This book is appropriate for romantic ladies of all ages.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJ9JHS7EBASVM"}}, {"Date": "on December 23, 2013", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KMR4P7TJSIPN"}}, {"Date": "on January 8, 2013", "Text": "This is an excellent series. I've been reading them in order. I know each can stand alone but I like seeing where and what the characters go on to do. Hope you enjoy them as much as I have. ENJOY & Happy New Year", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A128W553WN84EW"}}, {"Date": "on December 14, 2013", "Text": "I have all her books on the nine kingdoms so far and anxiously awaiting next one!! They are filled with fantasy and exciting drama, all woven with magic that one feels they are living the story as they read it!!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJ43SFPRQNPFP"}}, {"Date": "on February 9, 2013", "Text": "Kurland's Nine Kingdoms stories still grab my attention.  They are well written and are still a great read.  You could start with this one, but the series is so good, if you haven't read the others, DO!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8N7LTGW7VE17"}}, {"Date": "on March 1, 2015", "Text": "This was a very interesting book.  It was a stand alone story but also part of a series.  I liked finding out about the people from past stories and how they related to this one.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GRYKY7BUPIKJ"}}, {"Date": "on July 27, 2014", "Text": "Lynn Kurland once again has written a tale that I couldn't put down. I loved the interaction between the characters and could not wait for the answers to the questions posed.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DNFQVJGNFNXQ"}}, {"Date": "on September 14, 2013", "Text": "Love the characters and enjoyed re-visiting with some of the previous characters in this wonderful series.  And it is not finished, there will be another to come.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AP8KEQM7J5ZLN"}}, {"Date": "on March 10, 2013", "Text": "This is a continuation of a very good series.  I was a little dissapointed to get to the end and find that it will be continued in the next book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JUQ5BEFTZ83X"}}, {"Date": "on December 30, 2013", "Text": "I love everything Lynn Kurland writes and she does not disappoint with this book.  I can't wait for the second part to come out January 7th.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Y0HLWUJAAKR4"}}, {"Date": "on September 8, 2014", "Text": "I love Lynn Kurland novels and this is no exception. Non-stop laughter and romance and mending until the end. looking forward to book two.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LTEDH4AVNHFG"}}, {"Date": "on February 21, 2013", "Text": "Lynn Kurland is a WONDERFUL writer and I wait anxiously for her next book to come out.  I have read EVERYTHING she has put out so far.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27US5VXJEPET8"}}, {"Date": "on February 12, 2013", "Text": "I loved the book. A great story worth waiting for, can't wait for the sequels to get released.  Lynn Kurland has done it again.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3J8FL9S5IXIOD"}}, {"Date": "on February 19, 2013", "Text": "This book is little bit different from other Nine Kingdoms but not as much humor either. I liked the first three books better.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UL9HOG0I2SZA"}}, {"Date": "on July 19, 2013", "Text": "this is in a series that has me really hooked..the writing is very good and i can't wait for each book to come on the market", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOY2SMN0LR7RI"}}, {"Date": "on May 14, 2013", "Text": "This is a well crafted and interesting continuing story.  If you love this series, you will certainly find this a good read.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GKY0RUJZLOIC"}}, {"Date": "on March 14, 2013", "Text": "i love all her books and she never disapppoints me.  The detail and fantasy are fun to read and these are true escapism", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APFK6ED7LKTMK"}}, {"Date": "on March 13, 2013", "Text": "I enjoyed the book very much.  I have all of the books published in the continuing series. cannot pass up good stories.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YNLQ1P58LN4T"}}, {"Date": "on June 15, 2013", "Text": "this is one of the books in a series so others should be read before it and in sequence to appreciate the story more", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEJ761G1IM41T"}}, {"Date": "on January 4, 2013", "Text": "Great. Lynn series is great. How she comes up with all this is a wonderful mystery. But I'm truelly thankful.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2H8VAD2UVQ6BT"}}, {"Date": "on January 20, 2014", "Text": "Gave this to my fiance for Christmas.  She said she loves it give highest rating you've got.  So, well done.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A346O24UZKLCTE"}}, {"Date": "on August 11, 2013", "Text": "I loved this book. I couldn't put it down. Ended up reading it in three days. I can't wait for the next one.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAQK4ZOIDXZKS"}}, {"Date": "on October 2, 2013", "Text": "Bought this as a gift (per her request)  She loves fantasy and si-fi.  It's part of a series that she likes", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXB8AK3YN922U"}}, {"Date": "on January 5, 2013", "Text": null, "Helpfulness": 0.5, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQYEEGNRXM0P1"}}, {"Date": "on January 31, 2013", "Text": "This is the latest in the series by Lynn Kurland and is a fun read.  I would highly recommend it.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IQ7RII7VLF3L"}}, {"Date": "on April 6, 2013", "Text": "I am glad that I borrowed this from the library, because if I had purchased it I would be very disappointed. I could write a long detailed review, but others have done that. The point I want to make is this: this is only half of a book. It just stops abruptly in the middle of the story, without any resolution anywhere in sight. I understand that it is part of a series, but it doesn't even wrap up a satisfying subplot. Very frustrating. I probably won't read the following books.", "Helpfulness": 0.5, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3J2XLVRN9YAMF"}}, {"Date": "on January 2, 2013", "Text": "Wow! Another keeper for my bookshelf.  Read \"Dreamspinner\" in two days and was so disappointed to see it end!  It was just as wonderful as the other Nine Kingdom books by Lynn Kurland. I seriously recommend them all to all who love magic, mystery and a bit of romance.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQTD79PDAPSPU"}}, {"Date": "on March 8, 2015", "Text": "Total love all the books in this series.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2J2C82RVLV7YW"}}, {"Date": "on August 4, 2014", "Text": "Iove the whole Nine Kingdoms Series", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VCJ14LIMKXUN"}}, {"Date": "on October 31, 2014", "Text": "Can't wait to read the next one", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GODEP9HFDQAK"}}, {"Date": "on February 16, 2015", "Text": "Great book fast shipping", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3V421MPEBPY83"}}, {"Date": "on March 27, 2013", "Text": null, "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJJET3GTC2142"}}, {"Date": "on February 16, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ADK1SRYEE79H"}}], "ReviewUrl": "http://www.amazon.com/Dreamspinner-Novel-Nine-Kingdoms-Kurland/product-reviews/0425262197/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.6 out of 5 stars"}, "OfferPrice": "$11.88", "Salesrank": "#444,750", "ListPrice": "$15.00"}