{"Category": "in Books (", "Name": ["Tales of the Forgotten: A whiskey Tango Foxtrot Novel"], "Timestamp": "2015-05-24 23:50:17.836761", "itemurl": "http://www.amazon.com/Tales-Forgotten-whiskey-Tango-Foxtrot/dp/1484183487", "Reviews": {"TotalReviewCount": "222", "ReviewList": [{"Date": "on May 13, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15IF7NAB1Y196"}}, {"Date": "on May 11, 2013", "Text": "This is an excellent continuation of Whiskey Tango Foxtrot (Escaping the Dead). As an army vet I have to say that this is much more realistic than most of the zombie storys I've read. This one has fewer editing mistakes than the first story. The combat and movement sequences are realistic. The story line flows smoothly. This is a Keeper.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RCJFTG2GETDC"}}, {"Date": "on May 28, 2013", "Text": "This book is so worth purchasing.  American soldiers and Zombies in Afghanistan lots of action and adventure with zombies chasing at full speed. This is a new author with a great story line I can't wait until the next book.  Hurry I'm ready to buy the next book now.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7A0VXWI27GAM"}}, {"Date": "on November 8, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EDWAYHHJCFL4"}}, {"Date": "on October 9, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1O2IJY3QT1DLE"}}, {"Date": "on July 29, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DUM0HFISATWV"}}, {"Date": "on May 19, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BYK8NS8887H3"}}, {"Date": "on November 8, 2013", "Text": "I have read the other two in this series. The first being a kind of intro or rather a short synopsis in my opinion of what the story is about. The second is getting to know the virus and the characters. It all unfolds really in this book. I cannot express to the reader how great this series is! I felt like I was reading World War Z and The Crazies and A bit of D.J. Molles mixed in. Such an excellent story! I am one that is not at all keen on too much military jargon, even being raised around all military branches in my family. I know all of it, just do not care to read stuff too over my head where I am not understanding, or it is taking away from the story. This book does NOT do that. The characters are great and relatable and the story is non stop action and flows excellent! Love the Primals take as it is a virus and they are not exactly \"zombies\"..As a Zombie fan before zombies were cool, I appreciated this and it was explained so well. I would definitely put this author and his series in my top 20 reads and look forward to the next installment!! Excellent JOB!!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37WILOHMVNVQ0"}}, {"Date": "on June 21, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HVL790PBWYTU"}}, {"Date": "on October 7, 2013", "Text": "Well, I guessed right, the first book was not a fluke, this guy can write and he has a great story line with some very good characters.  I like the fact that this has not started out here in the USA but is in fact everywhere,  and that the story line so far has stayed in Afghanistan,  while I know it will move around it does make a difference as to all the other books out there that deal with this happening here at home. It's a great read, buy it and enjoy, I know I did.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABSMDUBIX49YX"}}], "ReviewUrl": "http://www.amazon.com/Tales-Forgotten-whiskey-Tango-Foxtrot/product-reviews/1484183487/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.6 out of 5 stars"}, "OfferPrice": "$9.51", "Salesrank": "#145,778", "ListPrice": "$11.06"}