{"Category": "in Books (", "Name": ["Abraham Lincoln, A Novel Life"], "Timestamp": "2015-05-24 23:40:29.128106", "itemurl": "http://www.amazon.com/Abraham-Lincoln-Novel-Life-Tony/dp/1932010009", "Reviews": {"TotalReviewCount": "7", "ReviewList": [{"Date": "on April 2, 2004", "Text": null, "Helpfulness": 0.9090909090909091, "StarRating": "4", "Author": {"ProfileUrl": ""}}, {"Date": "on September 14, 2006", "Text": "I thoroughly enjoyed reading this novel. Have you ever wondered what a wonderful personality of the past might think if he or she were suddenly standing in a different era? Lincoln sees cars, a \"modern\" 50's kitchen, and interesting clothing  as he walks into 1955 for a day. It's a day that changes the entire life of Joan, who meets him there. The reader has the opportunity to get personal with these characters in this novel. And I've heard Tony Wolk is continuing this wonderful tale in his next book--I can't wait.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHVD2OO28X5YR"}}, {"Date": "on June 10, 2008", "Text": "Thrust ninety years into the future, what would Abraham Lincoln think of the United States of America? \"Abraham Lincoln: A Novel Life\" asks that what if question as it follows Lincoln as he walks through 1955 America - and his experiences as a man thrust forward where he is idolized as an icon of the country he led for years prior to his sudden rush forward in time. A novel concept for a novel, and deftly written to back it up, \"Abraham Lincoln: A Novel Life\" is highly recommended for community library historical fiction collections as a different kind of historical fiction collection.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14OJS0VWMOSWO"}}, {"Date": "on June 27, 2008", "Text": "I really enjoyed this book. This book personalized Lincoln and made the story seem very real. The plot was believable even though it was out of science fiction. Well worth my time.  Doug Dilley", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3U0RY0FACJ4R6"}}, {"Date": "on April 20, 2010", "Text": "\"Abraham Lincoln: A Novel Life\" is a brilliant depiction of one of our country's most revered presidents. In the periphery, we're given an intricately pieced together history lesson, and at the forefront, a touching love story that spans a century's time. As Abraham Lincoln travels ninety years into the future, finds companionship in the arms of a young widow, and returns to his life in the trying times of 1860's civil war era, Tony Wolk shows his readers that even time cannot contain passion and friendship otherwise not found had history maintained its proper course. A blend of historical research, fantasy, and well-designed love story, \"Abraham Lincoln: A Novel Life\" is truly an enjoyable read, leaving me excited for what's next in the Lincoln time travel series.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQPAG46ZL3FVM"}}, {"Date": "on November 27, 2009", "Text": "Abraham Lincoln:  a Novel Life is a fun time travel novel in which Abraham Lincoln unintentionally goes forward in time ninety years, to 1955, and meets a woman, Joan Matcham, to whom he accidentally introduces himself as Abraham Lincoln and then proceeds to explain.  They spend an entire day together and fall in love...before Lincoln goes back to 1865.  The novel is historically educational and brings Abraham Lincoln--and Mary Todd Lincoln--to life.  In the back of the book is an engaging list of brief biographies on various historic figures who appear in the novel.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YQ983RL2UYAM"}}, {"Date": "on May 5, 2008", "Text": "This is a great book for people like me who love everything about the Civil War, Lincoln and historical novels.  This combines the best of two worlds, as it is historical as to the Civil War as well as the mid-5o's, and provides several interesting perspectives on Lincoln.  It was interesting to think about how close the two were in years, as well as how far apart in how life is lived.  The very personal look at Lincoln is fascinating.  It's the kind of book that could get a young person interested in this era.  I can't wait to read the next installment!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NWG6TN65B35O"}}], "ReviewUrl": "http://www.amazon.com/Abraham-Lincoln-Novel-Life-Tony/product-reviews/1932010009/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.9 out of 5 stars"}, "OfferPrice": "", "Salesrank": "#801,067", "ListPrice": ""}