{"Category": "in Books (", "Name": ["Midnight Crossroad (A Novel of Midnight, Texas)"], "Timestamp": "2015-05-24 23:46:54.369204", "itemurl": "http://www.amazon.com/Midnight-Crossroad-Novel-Texas/dp/0425263169", "Reviews": {"TotalReviewCount": "726", "ReviewList": [{"Date": "on May 15, 2014", "Text": null, "Helpfulness": 0.8918918918918919, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A265NE6H6LYX87"}}, {"Date": "on May 13, 2014", "Text": "Please know now that I've read Mz Harris's books since high school. I love mysteries and strong plots, and usually, Harris's writing has never let me down. Until now. I'm not going to rip into the woman but I will say this is the first book I've read of hers where I was bored reading it. Worse than hating it, I didn't care about any of the characters or there problems. I think it was because all th characters had secrets, so many secrets, that i wasn't able to identify with any of the characters. When the mystery was solved  and the killer revealed, I still couldn't care. I liked Figi well enough, but everybody (the characters) guarded their back stories so well that it  made them all dull. When Harris let me know interesting bits about her Midnight cast, it was too little too late. Sad to say, I didn't enjoy reading this book; I dredged through it. Ignore or believe me -your choice. I'm so sorry Mz Harris.", "Helpfulness": 0.875, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BC28GYJFJ1CA"}}, {"Date": "on May 11, 2014", "Text": null, "Helpfulness": 0.852112676056338, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUCFT77DUPMWX"}}, {"Date": "on May 14, 2014", "Text": "Being a big Charlaine Harris fan, especially the Harper Connelly and Lily Bard series, I was excited that the Manfred Bernardo character was going to have his own trilogy, crossing paths with the Bobo Winthrop character. What surprised me was the unexpected and jarring crossover into the Sookie world of vampires and supers. That was unfortunate, but the appearance of a talking cat pretty much completed the disappointment. Manfred, no longer a very interesting character, did pretty much nothing with his psychic abilities. That may come up in the following books but I'm unlikely to buy them.", "Helpfulness": 0.8476190476190476, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WDQFOYGM18QG"}}, {"Date": "on June 3, 2014", "Text": null, "Helpfulness": 0.8703703703703703, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A53C020615KI9"}}, {"Date": "on July 17, 2014", "Text": null, "Helpfulness": 0.9285714285714286, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SFOO8W8MPKF2"}}, {"Date": "on July 16, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FDGEAA784YI4"}}, {"Date": "on June 18, 2014", "Text": "Depressing, boring and pointless book. Loved the Sookie Stackhouse, Harper Connelly and Lily Bard books but this one is a dud.  I was so looking forward to it, too.", "Helpfulness": 0.9285714285714286, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35FHZUYN3LNRH"}}, {"Date": "on May 14, 2014", "Text": "I am a big fan of all Ms Harris' books, and of all of the characters in all of her series, and so was very keen to read this one.  But I was really disappointed in this book.  Ms Harris has always managed to give depth and humanity to her characters - even if you don't like them you understand them.  And her story telling generally has depth, pace and texture. This book, however, reads like a short story. There is little depth, the story line seems to bounce around, and her characters seem two dimensional.  Even characters we already knew well, like Bobo Winthrop, seem almost caricatures of their earlier incarnations. I guess it is being set up for the next books in the series.  But, unlike the Sookie Stackhouse, Lily Bard, Harper Connelly, or Aurora Teagarden seres, I didn't finish this book wanting to know what happens next.  I will not be rushing to buy the next instalment. t.", "Helpfulness": 0.7916666666666666, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EA0HG63CWNH9"}}, {"Date": "on July 21, 2014", "Text": "Alas I have to agree with what everyone else has written here about this being VERY disappointing.  More than 200 pages in & nothing had happened!  Far too much detail about nothing.  And then NO detail about things that really needed it - i.e.  what sort of 'world' is this?  Is it 'normal' to everyone to have 'energy/blood' sucking vampires wandering around? And talking cats?  I could go on, but I think it has been summed up well enough in the above reviews.  I only finished the book because I was hoping it might pick up; alas it didn't.  If this had been an up & coming author I would have stopped reading well before the finish and written it off as an amateur starting out, who needed a LOT more practise.  Her editors did not do their job on this one.  Loved her other works, but a big thumbs down to this one.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31CHMJUAYXRQ7"}}, {"Date": "on July 27, 2014", "Text": "Thank goodness I checked this out of the library instead of buying it. I found the descriptions of the strange town and its quirky characters too drawn out and totally unengaging. Lost all interest in the middle of Chapter 3 and decided to return it unread which is unusual for me.", "Helpfulness": 1.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MJSKB5Y1GK28"}}, {"Date": "on May 28, 2014", "Text": "I usually live Charlaine's novels but thus one was super slow to start and I had a hard time getting into it. The story was not as great either. I know it's the beginning of a series but Im not sure if I'll visit Midnight again. And by the way......not all right wing people are racist, gun toting idiots. I felt she could have chosen something else to label the bad guys with.", "Helpfulness": 0.9, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GW69CK6I46WK"}}, {"Date": "on June 22, 2014", "Text": null, "Helpfulness": 0.8888888888888888, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2E0TJ49NACDBA"}}, {"Date": "on June 21, 2014", "Text": "Loved Sookie books ( early ones) This is bad. Really bad. Who are the 128 people paid to give 5 star reviews?  They could not have read this book. Boring set up, boring characters. Painful.", "Helpfulness": 0.8333333333333334, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13US1P2FPORQD"}}, {"Date": "on May 9, 2014", "Text": "I kept waiting for the story to switch gears and engage my imagination, but no such spark occurred. The characters had promise but  the Midnight Crossroad never did catch. Good ideas and nice grammar and punctuation but no life. I finished it, hoping til the end something would come alive. I'll not read another of hers early, but wait for the reviews.", "Helpfulness": 0.7727272727272727, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23GX3ZRKNHEES"}}, {"Date": "on June 21, 2014", "Text": null, "Helpfulness": 0.8461538461538461, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JPVOAH8U4QMY"}}, {"Date": "on August 8, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2O2RZ1Z0AHZCB"}}, {"Date": "on July 7, 2014", "Text": null, "Helpfulness": 0.8888888888888888, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1C0Z99ILO92DE"}}, {"Date": "on August 24, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MFDFUGEVNIFK"}}, {"Date": "on June 3, 2014", "Text": "I loved the Sookie series. It is hard for me to believe the same person who wrote the Sookie series, rich with great characters and relaxed storytelling is the same author who penned this .... well....mess. Her attempt to write first person from a man's view was just awful. No man thinks like the main character with as another reviewer put it, long boring and unnecessary descriptions of shoes and body types rather than in-depth characterization. The only redeeming character was the cat but that was already overdone elsewhere. It was awful and I hate to be the one to say it. I was so excited to read it, and I was so disappointed to be skimming pages hoping something good might come of it all, only to have hopes dashed cruelly! Don't bother with this one....", "Helpfulness": 0.8, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ER2URGQJPK7D"}}, {"Date": "on May 20, 2014", "Text": "I was so disappointed. This book left me bored to tears. I had to make myself finish it., and even skipped several pages just to make it end.", "Helpfulness": 0.7857142857142857, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1P9XHDDUUQ9N7"}}, {"Date": "on May 13, 2014", "Text": "I'm a super Charlaine Harris fan- love all the Sookie books. And being from Texas; well I was prepared to like this one a lot! As it turns out, it was only ok. The characters just didn't seem as \"believable\" as all the ones in the Sookie Stackhouse series (yes, if you read her, you know shape shifters and vampires can be very believeable as \"people\"). It just wasn't the page turner I hoped for and expected.", "Helpfulness": 0.782608695652174, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2B1SRF130F6NH"}}, {"Date": "on May 13, 2014", "Text": "I've read every other book Charlaine Harris has written -- and enjoyed every one of them. She creates interesting characters and stories you can't put down. Until this one! I'm 25% into Midnight Crossroad and won't finish it. I hate to say it because I've always been such a fan of hers, but this book reads as though she is simply burned out. The characters are odd but not interesting. The setting is unexciting and not interesting. I'm really sad that the only thing I like about this book is the title!", "Helpfulness": 0.7894736842105263, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1C0IVWUUIZDG3"}}, {"Date": "on June 15, 2014", "Text": "I really didn't care for Ms Harris' latest book. I found the characters uninteresting and the mystery unexciting. It was too dark and grim for a cozy summer mystery novel. If this is an example of current southern gothic literature I'm going to pass on the genre in the future.", "Helpfulness": 0.8333333333333334, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A267BGAFR1QII2"}}, {"Date": "on May 26, 2014", "Text": null, "Helpfulness": 0.76, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MJ8OL2FYN7CW"}}, {"Date": "on June 26, 2014", "Text": null, "Helpfulness": 0.875, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ONARQQVD7P8G"}}, {"Date": "on May 26, 2014", "Text": null, "Helpfulness": 0.8181818181818182, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HA6KZZNDCME9"}}, {"Date": "on September 13, 2014", "Text": "Having been a fan of the Southern Vampire series for years (even back in the days when no one had ever heard of True Blood!), I was excited when I saw Charlaine Harris coming out with a new series. But if you're expecting this book to be at all similar to that series, you will be inevitably and severely disappointed. To be fair, I probably should have read the cover description in a bit more detail, but I'm willing to try anything by one of my favorite authors. Honestly though? This book bored me. I thought about quitting part way through. I care not for Manfred, Bobo, Olivia, etc. Characters were flat, the writing wasn't interspersed with zippy lines. I can't say that I won't read another Charlaine Harris book ever, but I will be waiting until she finishes this series and/or starts another.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A365AJTIRVMH6O"}}, {"Date": "on June 2, 2014", "Text": null, "Helpfulness": 0.8181818181818182, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38OJV2YPHARAE"}}, {"Date": "on September 12, 2014", "Text": "A big disappointment.  I wish I had read the reviews before purchasing this book (solely because it is written by Charlaine Harris). I have read and loved the majority of her other series- from Sookie Stackhouse to Aurora Teagarden. My mistake for taking it for granted that this story would be as engaging as Harris' other books. I found it boring and that her characters were shallow and uninteresting.  Although I see where she is attempting to build a series' foundation,  I am not the least bit motivated to pursue the next book.", "Helpfulness": 1.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZJ7ASQ7FP33K"}}, {"Date": "on May 28, 2014", "Text": "I kept hoping it would get better and it never did.  I would not recommend this book and I am seriously considering reading anything further from this author.  My advice would be to not waste your time or money on this book.", "Helpfulness": 0.875, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SFQUU79HUIS4"}}, {"Date": "on December 9, 2014", "Text": "I'm proud of myself for finishing this book in the same way I'm proud of myself for finishing a task I've been postponing forever. Like cleaning out the fridge or trying on my old jeans from college so I can finally...finally...get rid of them. This book had promise-- characters with whimsical abilities, but these abilities were never fully explored. Heck. They were hardly even USED! Talk about wasted potential. Pass on this one. Harris has got other, more entertaining books out there. This one is kind of sad.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CRSK40PS0HUP"}}, {"Date": "on August 27, 2014", "Text": "I've followed Charlaine Harris' complete career. I've read most everything she has put out. This was way below her standards. The protagonist isn't even remotely interesting, the rest of the characters are boring as all get out and the plot took entirely too long to develop. The ending was the only thing that was interesting. It was unexpected and reflective of what I wish she would write. Talk about the evil and what everyday (as much as this cast of characters could be) people do to deal.", "Helpfulness": 1.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A144RTEXTP1CPE"}}, {"Date": "on July 1, 2014", "Text": "After the spectacular rip-off of 'After Dead', I was so disappointed and angry I was sure I would never buy another Charlaine Harris book again, but time passed and I remembered how much I had loved her many books.  So, despite the plethora of bad reviews, I bought it.  Let me now apologize profusely to my fellow readers.  I should have listened to you and saved my money.  This book is just plain awful.  I find it hard to believe Ms. Harris actually wrote it, despite Manfred being a main character and the references to Harper and Lily from other series.  The writing is stilted, the plot ridiculous, and the characters little more than cartoon shadows.  My best guess is that it was actually written by a grand-daughter, a niece, or some random 13 year old as a massive joke.  I solemnly swear I will never by another book by Ms. Harris.  I feel like like I lost a friend, but I also feel as if I've been hoodwinked by someone I used to care for.  Fool me once...", "Helpfulness": 0.7857142857142857, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUEA1N4FFPQ9I"}}, {"Date": "on June 5, 2014", "Text": "Between the RIDICULOUS names, flat characters, and snooze-worthy pace, I gave up about a little over half way through. Midnight Crossroad has no personality, no spark at all. Charlaine Harris used to be one of my top 5 favorites, but after the last few Sookie Stackhouse \"filler & fluff\" books, I just don't know about her anymore.", "Helpfulness": 0.8181818181818182, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10LUQOSZ5TC6O"}}, {"Date": "on September 23, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AG8K92N37MT27"}}, {"Date": "on August 19, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARBJU5ZUD4883"}}, {"Date": "on May 9, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQNX0WN00JEVE"}}, {"Date": "on May 22, 2014", "Text": "You may not think this review is worth much but I needed to get some closure on my feeling about this book. I am a fan of Charlaine Harris and have been for several years. I keep some of her books to read again. This is hard for me to say but \"Midnight Crossroad\" was a book I had to wade though. I found myself falling a sleep and skipping pages. I never thought that would ever happen reading a book by Harris. Her characters were not real to me and the story line did not grab me as so many of her other books did. If this is her attempt to start another series, I don't think I will be reading it.", "Helpfulness": 0.7857142857142857, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19PIYCI8DAYHC"}}, {"Date": "on September 30, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MC13ZZMHPVBK"}}, {"Date": "on May 21, 2014", "Text": "I'm glad someone gifted me the kindle version & that I didn't pay for Midnight Crossroad. It wasn't very interesting, nothing unique, same formula as Ms. Harris' other plot lines - just less interesting. Oh, & the southern charm thing felt really false in this book.", "Helpfulness": 0.8181818181818182, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALMUTZRYAK0RE"}}, {"Date": "on May 7, 2014", "Text": null, "Helpfulness": 0.7352941176470589, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1D7CDK7HS68NP"}}, {"Date": "on June 7, 2014", "Text": "I've read several of Charlaine Harris' books, my favorites being the first six Sookie Stackhouse. I had hope for this book, but was disappointed. Midnight Crossroad is a very small town inhabited by a group of people with secrets - sounds like it should be pretty interesting.  But none of the characters (even as a group) are strong enough to carry the book. Several ring false because they are not developed enough; I really didn't empathize with any of them. The plot was okay but unmemorable. I think Ms. Harris needs to slow down her turnout of books and focus on depth and dimension of both characters and plot.", "Helpfulness": 0.8571428571428571, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SZX78G2AK51J"}}, {"Date": "on June 19, 2014", "Text": "The only way that this new series has a chance to become interesting is if Sookie shows up with Eric, Bill, and Sam and they gooble up the whole town of Midnight so Charlene Harris can start all over. The book starts to become mildly intetesting near the last 1/4 of the book. Some of the characters were unnecessarily over developed (Chuy, Joe, Rev, etc). She did throw in a vampire but he was a bore.  I am convinced that the reviewers who are giving this book high stars NEVER read this book. I love Charlene Harris but this was a disappointment.", "Helpfulness": 0.8571428571428571, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28I8013Q452FE"}}, {"Date": "on May 23, 2014", "Text": "I've read all Harris's previous books, mundane as well as fantastic. I had high hopes for this one. But NOT ONE of the people were interesting nor were any of them likable. I gave up a dozen or two pages in.", "Helpfulness": 0.8181818181818182, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UY3IHUP131BB"}}, {"Date": "on June 30, 2014", "Text": "Starts very out really good but fades to dust very early. It is not well written and the character development is terrible. The author assumes that anyone reading this novel has already read her other books, which I have not. I was looking forward to a good read and getting hooked on a new series, but I was sadly disappointed. The characters are not convincing and certain situations were, for lack of a better word, silly! A terrible book, it couldn't hold my interest long enough for me to finish.", "Helpfulness": 0.8571428571428571, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36W083SA5RTJH"}}, {"Date": "on May 23, 2014", "Text": null, "Helpfulness": 0.8333333333333334, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27WUZJUM2DHXN"}}, {"Date": "on June 18, 2014", "Text": "I enjoyed reading the Sookie Stackhouse series (up until the last few) and I enjoyed the world that Ms Harris created for Harper Connelly, so I went into Midnight Crossroad with high expectations. Were those expectations met? I am still undecided. Usually I can read a book quickly, but this one seemed to drag on. There are some interesting characters here, but I could not get invested in any of them. I think that having their backstories so mysterious meant that I really didn't care enough about them. All the characters had the potential to be interesting and I assume that the next 2 books in the trilogy will give us more backstory, but it might be too late. The plot seemed to plod along very slowly and I was waiting for something exciting to happen, but unfortunately it never did. I am unsure whether I will continue with this series or not.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A238NNKXOCRVJD"}}, {"Date": "on August 13, 2014", "Text": "This is a Disappointing book, expected more from this author. There is unnecessary violence and the characters are shallow. I would not recommend it.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5B8GI0NIAU22"}}, {"Date": "on June 2, 2014", "Text": "Not up to Sookie Stackhouse stories, it was flat and not at all intriguing.  I found this book an effort to finish and the only reason I kept reading was that I was sure it would get better", "Helpfulness": 0.7857142857142857, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MICJ1OJK3VMP"}}, {"Date": "on June 7, 2014", "Text": null, "Helpfulness": 0.8333333333333334, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14YB8W178VAPR"}}, {"Date": "on May 1, 2014", "Text": null, "Helpfulness": 0.7142857142857143, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KJDBIJNWMDX1"}}, {"Date": "on May 20, 2014", "Text": null, "Helpfulness": 0.75, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SLWLITV6T1PG"}}, {"Date": "on May 26, 2014", "Text": null, "Helpfulness": 0.7777777777777778, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AG6FN1JDUWIFB"}}, {"Date": "on August 2, 2014", "Text": "always thought there was more to Manfred Bernardo than was to be found in other books so this was the chance to find out more, was even interested by adverts that mentioned a big secret ... more disappointment ... after the last Stackhouses that were sort of \"filler books\" I expected Harris to come out with all guns blazing ... decent mystery story but certainly not what it should have been", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35WGVT8AUEODN"}}, {"Date": "on June 8, 2014", "Text": null, "Helpfulness": 0.8333333333333334, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RPPSYKT1MA2D"}}, {"Date": "on September 8, 2014", "Text": "Not very good.  I've loved CH books for years, but after the way she ended the SVM, I decided to read this one after checking it out from the library.  I'm glad I made that decision.  It rooks me two weeks to get through this book, when a Sookie Stackhouse book was finished same day!  I am a big reader, but I could not get into the characters, nor did I care about them.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANF0W4D40AG6C"}}, {"Date": "on June 23, 2014", "Text": null, "Helpfulness": 0.8333333333333334, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AM18QC9FFR1"}}, {"Date": "on June 8, 2014", "Text": "It took me until almost half way through the book to care about any of the characters. I wanted to like this book because I loved the Sookie books, but it just wasn't as interesting. There were a couple of parts that had me turning pages, but for the most part I just didn't care much for Midnight Crossing.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19RE49EM1V2J2"}}, {"Date": "on April 24, 2014", "Text": null, "Helpfulness": 0.7040816326530612, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33J2VWP9HXDU9"}}, {"Date": "on April 19, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MT311233OHMQ"}}, {"Date": "on April 10, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UEB48LAWFUCW"}}, {"Date": "on March 26, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8GR4PH5NW96V"}}, {"Date": "on September 11, 2014", "Text": "Sore disappointment!  I'm a huge fan of Charlaine Harris but this book is uninteresting.  Usually I cannot put her books down and I had to force myself to keep trying to finish this one!  Bad Book! I agree with all the other critical reviews of this book.", "Helpfulness": 1.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JVDNELU5GUHU"}}, {"Date": "on July 19, 2014", "Text": "This first of the series novel just doesn't have the charm of the first stackhouse book. It feels like Harris is just planting characters as fodder for future books in the series, but failing to make them very 3-dimensional. Hoping the series improves.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHHN0H4I75F6T"}}, {"Date": "on May 26, 2014", "Text": null, "Helpfulness": 0.7777777777777778, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A218TW294T7CK0"}}, {"Date": "on August 22, 2014", "Text": "So far below the measure of her last two series. Very slow-moving plot. None of the characters is wildly appealing, and most remain two-dimensional. That said, it is just interesting enough to keep you reading to the end. But barely.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CT5YMW40YY7I"}}, {"Date": "on May 31, 2014", "Text": "Not worth the time. Honestly. Return it if you can. Borrow it if you feel like you must read it.", "Helpfulness": 0.8, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YTJ9F49EP39E"}}, {"Date": "on June 19, 2014", "Text": "I highly enjoyed Charlaine Harris's vampire series so I had high hopes for this one, to say the least. Unfortunately, it just didn't live up to those expectations. This whole story read more as an introduction, with lots of description and talk about who/what the characters are...but very little plot. It was a slog, to say the least.", "Helpfulness": 0.8333333333333334, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AM83WJG9BE2EP"}}, {"Date": "on July 16, 2014", "Text": "Very slow start...didn't enjoy this book very much. The storyline dragged on and was just boring. It got interesting toward the end, but by then I was just ready for it to be over.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36FO000B3LW71"}}, {"Date": "on July 11, 2014", "Text": "I used to like her books but no more for me", "Helpfulness": 0.8571428571428571, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12651JF0D8YYM"}}, {"Date": "on June 24, 2014", "Text": "This didn't seem like it was written by Charlaine Harris. For the first time ever, one of her books had wording that seemed a little awkward and didn't pull me in. I've read all her series, and this one wasn't nearly as good as the others.", "Helpfulness": 0.8333333333333334, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZYD979JTM1UJ"}}, {"Date": "on April 25, 2014", "Text": null, "Helpfulness": 0.7058823529411765, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1D5RCOILPC9LX"}}, {"Date": "on June 6, 2014", "Text": "I don't want to go into crazy specifics, but this book was different and odd with a cast of characters that  I found it hard to enjoy. Harris went back and forth with her writing style and I know why - she was trying to give it a quirky and magical feel. I guess if I wouldn't have had preconceived notions about Harris' writing - I would have like this novel better. She did a good job - it was compelling, it just wasn't what I was ready for and it wasn't for me. I do believe people that enjoy quirky reads with a cast of characters that aren't out of a CW casting - you'll really enjoy this. Again it wasn't an inbetween book for me because of the plot or the characters or the story - it just wasn't what I was expecting and I couldn't get into the right headspace for it.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2V98TS4QDDCG9"}}, {"Date": "on August 27, 2014", "Text": null, "Helpfulness": 0.8, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17ZPWZJUGKIPN"}}, {"Date": "on May 23, 2014", "Text": "I have read all of Charlaine Harris' series and enjoyed them each one.  Although I read this entire book, it didn't improve and bother to develop any depth or emotion.  Even the characters she salvaged from other series lost all their appeal.  Very disappointing.", "Helpfulness": 0.7777777777777778, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKS0LK15B4371"}}, {"Date": "on May 10, 2014", "Text": "Have read other books by her, I like that they are a little different.  But I would have to agree with another reviewer that said the characters had potential but never got there.  Also, I read fictional books to escape the everyday.  She needs to keep her left-wing, right-wing political crap out of the book.  I hear enough of this on the radio & tv.  The word is ESCAPE!", "Helpfulness": 0.7333333333333333, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UM3N58S1LUX7"}}, {"Date": "on July 8, 2014", "Text": "Slow. Hard to stay focused on this one. Wouldn't recommend the book to Harris readers. Maybe too compared to Sookie", "Helpfulness": 0.8333333333333334, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JMNO23000G74"}}, {"Date": "on June 5, 2014", "Text": "I loved the Sookie Stackhouse series at least up until the last 3 books. It seemed like she had no idea how to end a series on a high note and just beat it into the ground because she made good money on it with Trueblood being made and what not. That being said I picked up midnight crossroad with no expectations and that's a good thing because in my opinion it was dull. All the characters had weird names which annoyed me throughout and I felt no connection to any of the characters, and when things got revealed I didn't care I just kept reading to finish it. I don't think I'll be buying anymore of her books, not just in this series but also other books to come.", "Helpfulness": 0.8, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BOOW0V20P556"}}, {"Date": "on May 9, 2014", "Text": null, "Helpfulness": 0.7142857142857143, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25WX22UZJSPUU"}}, {"Date": "on June 19, 2014", "Text": "I loved the whole Sookie series so much I practically devoured them. This is the second time I've attempted to read one of her books about characters other than those in her southern vampire series. Sadly, I just could not get into the Harper Connelly series and I find that this one does not grab my attention either. It seems so odd to me that a writer who can pull me in so completely in one of her series could leave me completely uninterested in her other books and stories. I didn't hate this book, it's just not particularly entertaining, and definitely not enthralling.", "Helpfulness": 0.8, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CLWZGMC7M9Z1"}}, {"Date": "on March 14, 2015", "Text": "Okay, so the characters are great.  Very interesting group but the book dragged on and on.  I thought this was terrible.  Once I had read more than half the book, I started skimming over and even then I skipped to the last three chapters.  The ending was good. That's about all I can give of a good review.  This is not a typical Charlaine Harris book.  I was horribly bored.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NLGVVKC3MABX"}}, {"Date": "on June 4, 2014", "Text": "It is a little bit strange and frankly quite different from the witty Soocky Stackhouse stories. It is intriguing to a certain extent but it is not exactly what I have expected.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GDC4521YAMA8"}}, {"Date": "on May 30, 2014", "Text": "Charlaine Harris has written a few different series besides Sookie's, and in this book, she collects characters from all of them. The police officer is from her Aurora Teagarden series, Manfred is from the Harper Connelly series, and Bobo is from the Lily Bard series. All of those series are great, although these minor characters are not necessarily the most compelling. The most interesting part of this new series for me is thinking about how the worlds of all these series overlap. There's nothing supernatural in the Aurora Teagarden OR Lily Bard books, but now suddenly there are vampires, witches and shape-shifters in their world? Well, ok.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKZR5CMKRQG3F"}}, {"Date": "on May 27, 2014", "Text": "This was one of those books that I made myself read.  It took me about halfway through before the characters kind of made sense but still left with a lot of questions.  If you want to read it wait for the paperback, you won't feel like you wasted too much money.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4BT3ONHL4HJI"}}, {"Date": "on May 27, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UVWWUM57Y3A4"}}, {"Date": "on May 26, 2014", "Text": "Charlene Harris still has a way of describing places and bringing characters to life was great aplomb. However with that said this book still wasn't hitting me the way the Sookie Stackhouse series did. However my review is not going to be about how great the last series of books she wrote that I enjoyed was and how awful this one is as I wish to give some viewpoints. You do you really get to know on this book is the question I'd like to ask? Who do you really care about? I didn't like anybody enough to want to read the second installment-- if there is one-- to this series. The first book in a series really has to have some punch to keep you interested. It has to find his voice unlike a TV series, fairly early on or you lose interest. This book was just interesting enough to finish but other than that I'm just not that impressed. I am disappointed because Ms. Harris has a lot of potential to write another amazing series.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADYTOR9AK4OIN"}}, {"Date": "on May 9, 2014", "Text": "I love the first 8 or 9 of the Sookie Stackhouse series but thought that the remaining books jumped the shark or sucked the blood if you will. I also love the 'Grave' series. This book though is a snoozer. I have listened to the narrator, Susan Bennett breathe life into my favorite vampire trilogy by Christopher Moore and was totally enthralled; by the stories and the narration. She read this book like she was confused and the whole effort seemed disjointed somehow. The material, which IMO, is totally lackluster didn't help. I believe that ' stick a fork in me, I'm done' describes where I am in regards to Ms. Harris' work. It was fun while it was readable.  On to The Dresden Files....", "Helpfulness": 0.7037037037037037, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1O9AGWWBNJGNW"}}, {"Date": "on June 21, 2014", "Text": "I didn't really care for this book. I loved the Sookie series & the Grave sight series but this one just wasn't great. Its about an odd bunch of small town residents but its told in the 3rd person which may have been part of the problem. Charlaine is great with first person stories. She's new to 3rd person & her normal southern warmth was missing with the new writing style. The characters weren't very notable either.", "Helpfulness": 0.8, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2C9OYBR203D2H"}}, {"Date": "on September 22, 2014", "Text": "Well, I'm not really  a customer, because I got the book at the library.  But,  I really enjoyed it.  The tagline indcated that everyone in town has a secret and you learn about a few of them.  I just felt it was a really good read and I'm looking forward to more in the series.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2F3IQP819878Q"}}, {"Date": "on May 7, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BFDEBT5IV4UN"}}, {"Date": "on June 5, 2014", "Text": "I'm of mixed mind about this book.  I was happy to find familiar character names popping up as if everyone from Ms. Harris's other books were continuing their lives in their respective towns.  And the interest and suspense kept up pretty well throughout the book.  But unfortunately this book also has the feel of a freshman novel or a slapdash got-to-meet-a-deadline/hodge-podge novel.  I was often unsure of which universe the novel occupied (what kind of magic did the average Joe expect?).  There was a lot of moment by moment character exposition and then, all of a sudden, a sudden twist.  I guess what I'm saying is although the novel was entertaining in the style of what I've come to expect from Ms. Harris, it lacks the writing skill level that I expected.  That's disappointing.", "Helpfulness": 0.8, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NF85WJIYYOUD"}}, {"Date": "on May 19, 2014", "Text": "I have liked Ms. Harris' books in the past.  This one just really left me hanging.  It hinted at the supernatural a little but just never quiet got there.  I finished it cuz i started it but other than that,  its not one i would recommend unless you have nothing else to read and are killing some time.  It wasnt bad, it just wasnt that good.  Sorry Charlaine,  just didnt feel this one.", "Helpfulness": 0.8, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AH3CWR0ZO1B62"}}, {"Date": "on May 14, 2014", "Text": "I have read every book Ms Harris has ever written from Teagarden,Connelly,Bard and Stackhouse  and all the anthology's and in betweens and I loved them all...  This is going to have to get a lot better to compete with any of them..  The characters were \"ok\"  just needs to have more action or umph.. Maybe the next one will be better.", "Helpfulness": 0.8, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A68CBSEEW6KKX"}}, {"Date": "on July 9, 2014", "Text": "Really people... after the cluster f*ck that CH did with the end of the SVM series, I cannot believe anyone is buying this book. I did, and I should have probably shot myself in the head for doing it. Horrible writing, grammar, etc. Does she even have an editor??? Horrible, just horrible...there is nothing left to say,", "Helpfulness": 0.8, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KXVMJM8NUQJ1"}}, {"Date": "on August 18, 2014", "Text": "Very disappointed by this book.  I have read all of Charlaine Harris's books and this one took me forever to finish.  I could not capture any one character as my favorite and the proof reading really needs some work.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33CKDWXB0CPHN"}}, {"Date": "on May 14, 2014", "Text": null, "Helpfulness": 0.7142857142857143, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZVXGCT3CHIS5"}}, {"Date": "on November 12, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IE5OUZ87QPYR"}}, {"Date": "on July 30, 2014", "Text": "I have read all the Sooky Series and thought this would be an interesting book also.  Wrong.  Very boring and does not keep your attention. Not worth reading.", "Helpfulness": 1.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AT80IP0LTGHG2"}}, {"Date": "on October 4, 2014", "Text": "I bought this book at a used book kiosk for $2 bucks so for the money I spent... $2 bucks was about right. I've read other books by Ms. Harris but only really loved the early Sookie novels. I gave this book three stars because I read it all the way through without skimming any pages, the characters initially had potential and I like cats. No real like able characters which would be okay if the plot was interesting but it moved at such a slow pace. I found myself not caring about the mystery and solved it some time before the  end. Any type of relationships whether romantic, friendship or otherwise wasn't believable.  The few (very few) interesting characters were hardly ever used. If I find the sequel at the same price I'll probably give it another chance or barring that I'll check it out from my library but I won't spend any more money than that or spend any more time anticipating the next Charlainne Harris book.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABY4U2NHBZCIF"}}, {"Date": "on August 7, 2014", "Text": "I've read all of this author's books but found I could not finish this book.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36TYV4ARR554F"}}, {"Date": "on July 22, 2014", "Text": "It's okay but not nearly as good as her Sookie Stackhouse novels.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LYXWM47WW3UA"}}, {"Date": "on May 11, 2014", "Text": null, "Helpfulness": 0.7142857142857143, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VSNS3O0HF7YK"}}, {"Date": "on May 30, 2014", "Text": "Harris' writing style seems a little \"off\" in her newest book, which starts off reminiscent of King 's \"Needful Things\" in weird tone and set up. I couldn't get into her new characters which seem like they should be interesting, but even the gift astrologer came off dull and over detailed. Been happy with most everything else by the author, including all her other series and stand alone, but this didn't do it for me.", "Helpfulness": 0.75, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A215WH6RUDUCMP"}}, {"Date": "on August 29, 2014", "Text": "I had high hopes.  I should have lowered my expectations", "Helpfulness": 0.8, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DT13Y9CZSFZ7"}}, {"Date": "on July 3, 2014", "Text": "An entertaining read. No one charachter clearly came through as the protagonist. Felt like Ms Harris was laying the groundwork for a second book.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A201HFIOXM774X"}}, {"Date": "on June 24, 2014", "Text": "I love most of Harris's books, but this one lacks the attachment to the characters that the others have. I understand that she may be trying to save some of the characters' secrets for other novels, but since she kept changing the POV of the different characters I expected to learn something about them. And then at the end, the BIG REVEAL, has no lead up, no build up, and comes as a disturbing surprise. I will read the next one, this time hoping I can actually connect.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3S2MTT5IEWQHE"}}, {"Date": "on May 29, 2014", "Text": "Not well written could have been completed as a novella, but easy to read. Small surprise ending.  Certain there will be more Midnight Crossing books to follow.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADQVE1PGO06D9"}}, {"Date": "on June 5, 2014", "Text": "I was hoping this new series would take me back to the writing I loved by Charlaine Harris, but that didn't happen. I loved the small town setting and the descriptions of the town were vivid. The characters were ok, but I didn't care much when one was in \"danger\".  The plot was predictable and dull. I'm an avid reader and it took me along time to finish this book. There was too much fluff and not enough bite to hold my interest. Unless my library has the ebooks available I won't be reading anymore books in this series.", "Helpfulness": 0.75, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OGFIEIK65OTD"}}, {"Date": "on June 1, 2014", "Text": "I really did not know what I was reading the whole time.Maybe  the people of Midnight are supposed to be like your own next door neighbors?I just do not know?", "Helpfulness": 0.75, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ABLX397AL9ED"}}, {"Date": "on May 29, 2014", "Text": "Loved Charlaine Harris' True Blood series. This was not as good. Kept my interest but it wasn't nearly as fun to read or as humorous.", "Helpfulness": 0.75, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A279ZFRKOB7NB0"}}, {"Date": "on May 29, 2014", "Text": "It has some interesting plot-twists and surprises within the characters and it does share some of the elements of the Sookie novels (quirky characters in a weird town).  But it is definitely lacking the sparkle of the previous series.  I missed having a POV character to take me through the story unless Manfred or Fiji is intended as the POV.  I found neither character to be very engaging, though.  It did leave some open questions about the other residents of Midnight but perhaps those will be answered in the subsequent novels.", "Helpfulness": 0.75, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SBC240UWV6KI"}}, {"Date": "on May 29, 2014", "Text": "characters were a little flat and the story was not very exciting but it was an easy read. just expected more.", "Helpfulness": 0.75, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CEGFPS0C75X4"}}, {"Date": "on May 27, 2014", "Text": null, "Helpfulness": 0.75, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A209GZWU3CSIB6"}}, {"Date": "on May 23, 2014", "Text": "This is a well-written novella. Not a complete book. No resolution. Interesting while it lasts though.  I wish it had been a complete novel.", "Helpfulness": 0.75, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D91CQCH87CQ4"}}, {"Date": "on May 12, 2014", "Text": null, "Helpfulness": 0.75, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UQNOWD16ZEI0"}}, {"Date": "on June 2, 2014", "Text": "I didn't love it but it was an enjoyable read. After reading all of her other books the killer is easy to pick out. Some plot points are beyond ridiculous. However,I did enjoy the characters and their interactions.", "Helpfulness": 0.7142857142857143, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3G679OFPYS404"}}, {"Date": "on May 11, 2014", "Text": "Not one of Charlaine Harris better works. No intensities, no humor and no excitement. I rate flat, dull and boring.", "Helpfulness": 0.7142857142857143, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZX04QCPJHKW9"}}, {"Date": "on May 3, 2015", "Text": "This book was painfully boring.  I yawned more than that dang talking cat.  I loved sookie and I was looking forward to a new story from Mrs Harris. I keep reading waiting for something exciting to happen. 3/4 of the way through the book and It never did. I Push through until the end. Hugh waste of time!", "Helpfulness": 1.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PLDL8G7DSG71"}}, {"Date": "on May 18, 2015", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6GW0TQU85WDW"}}, {"Date": "on May 11, 2015", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1C7FN8KQSOH55"}}, {"Date": "on May 6, 2015", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AS6H3NGQ8V1PK"}}, {"Date": "on April 30, 2015", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2388PRX2ZV241"}}, {"Date": "on April 1, 2015", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RVRHXA5ARWFV"}}, {"Date": "on March 19, 2015", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOEP96629WHHA"}}, {"Date": "on October 14, 2014", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APUOUCG7PI545"}}, {"Date": "on August 4, 2014", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AG5CKM4WT4HHJ"}}, {"Date": "on June 26, 2014", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XCSAX4BRT89Y"}}, {"Date": "on May 20, 2014", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38K04MT5LR0JC"}}, {"Date": "on July 14, 2014", "Text": "Well this was certainly no Sookie Stackhouse. I thought it was boring and only finished it because I kept waiting for something good to happen and I don't like not finishing a book. Doubt I'd bother with a sequel.", "Helpfulness": 0.75, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AASXY3MJFUQVI"}}, {"Date": "on April 1, 2015", "Text": "Enjoyed this book tremendously. A gentle yet powerful change from Sookie, Fiji and the other mysterious residents of Midnight, Texas pull you into town and into their unusual lives. Highly recommended.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FAXDFGP2XZVM"}}, {"Date": "on March 9, 2015", "Text": "The characters could be very interesting if we were ever told anything about them. It's basically one long introduction to the town, with a thoroughly disappointing resolution to the mystery of Aubrey.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I80JZ4MEPNFQ"}}, {"Date": "on March 19, 2015", "Text": "I loved Charlaine Harris' writing for the true blood series. Maybe it's because she was introducing new characters, but this book was a big disappointment. It made me wonder if she really wrote it.", "Helpfulness": 1.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22DTU5KX5DAB3"}}, {"Date": "on March 12, 2015", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A269OQI2T4BBBH"}}, {"Date": "on April 7, 2015", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A198YM82SDC0AH"}}, {"Date": "on April 22, 2015", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LH7RNJDSNCUD"}}, {"Date": "on January 24, 2015", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OCIYEI5MYKDM"}}, {"Date": "on May 9, 2015", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2767ZSF7SB57"}}, {"Date": "on April 11, 2015", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JMSX54DO3LOP"}}, {"Date": "on April 7, 2015", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DIAWW6ER9RLN"}}, {"Date": "on May 20, 2014", "Text": "This was a change of pace in Charlaine's writing. the story line was good just needed more interesting characters and excitement.", "Helpfulness": 0.75, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17SMIXD0UL7TG"}}, {"Date": "on June 11, 2014", "Text": "It was an ok book I wasn't to impressed with it, it wasn't really a very good type mystery book to me it just didn't make sense", "Helpfulness": 0.75, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KBYGTPMGUASY"}}, {"Date": "on July 9, 2014", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3B21U2JWJN6WU"}}, {"Date": "on March 19, 2015", "Text": "If you go into this expecting a murder mystery, you're going to be disappointed, despite the dead body that turns up early in the book.  Both the body and the main character exist principally to facilitate the introduction to the odd and secretive community of Midnight.  In fact, had the main character not been in the book at all, very little would have changed in the events that followed- nothing he does makes any real difference to the outcome of events.  That having been said, Harris has previously demonstrated slowly unfolding threads through multiple books, and it was nice to see a couple of minor characters from her Harper Connelly and Shakespeare series coming back as main characters.  And the community of Midnight was sufficiently interesting that I will likely check out the next book.  It would be nice if the next one had an actual plot, however, with an opportunity for the actions of the main characters to affect the outcome.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37GQYOTV0SZXP"}}, {"Date": "on May 26, 2014", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A109L3WXD1SJFU"}}, {"Date": "on April 19, 2015", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XD1M9Y7HZ13I"}}, {"Date": "on March 21, 2015", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OTJH9MJPSB0C"}}, {"Date": "on May 22, 2015", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PUX4IU786EIB"}}, {"Date": "on March 19, 2015", "Text": "I had a hard time getting through this book. Infact it seems 3rd times plus jury duty was the charm. The overall plot was decent. I also enjoyed how this tied together the other series. All are now shown to be connected to the true blood world. In those books Jack Leeds made an appearance. Bobo the main character in this book  was from the lily bard series. Also, the sheriff was in the tea garden series and if course Manfred was from the grave series. The only thing that had me connected to the book  was my past love for those series. I just never got sucked in. It was...too many secrets and too many characters with no depth to any if them. I couldn't relate because there wasn't enough of a foothold of this is who they are. I will read the next ones just like I read her others because some I really loved.", "Helpfulness": "", "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2N9ERYOR1JRDW"}}, {"Date": "on March 26, 2015", "Text": "The residents of Midnight, Texas, a small town in the middle of nowhere, are mostly loners who keep their secrets to themselves, Although the early part of the story consists of learning that one is a witch, another a psychic, and another a vampire, we won’t be learning more about the others until later in the series.  The plot begins with the discovery of a decomposing body of a woman who has been missing.  It turns out that she has been sent undercover by an extremist militia group.  When the townsfolk find themselves imperiled by the gang, they fight back using their unusual powers. Unlike Harris’ other series, where main characters Harper Connelly and Sookie Stackhouse immediately stand out, this is more of an ensemble weirdness.  The book is a quick-read but, so far, not a must-read.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31CJROEQWBIO8"}}, {"Date": "on August 17, 2014", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SIOBZA3FHCE3"}}, {"Date": "on June 19, 2014", "Text": "Overall, I didn't mind this book.  It wasn't exciting, but I didn't find it completely boring either.  I see from other reviewers that at least one of the characters in this book is from one of Ms. Harris' other series.  Having only read the Sookie Stackhouse series of hers, I didn't feel I was missing out on anything by not knowing this before I read the book.  That being said, despite the lack of action, I found the characters to be interesting and fairly well rounded.  The story was kind of slow moving, but it did keep me interested until the end at least, although I wasn't sitting on the edge of my seat while reading it.", "Helpfulness": 0.6666666666666666, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8KM4YOB8FGGH"}}, {"Date": "on May 3, 2015", "Text": "LOVE all of her books. Each series of books keeps me riveted the whole time!  Must read!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APQIV6OGAU1OE"}}, {"Date": "on April 13, 2015", "Text": "I love Charlaine Harris and was excited to see a new series from her. Although I was wary, I wasn't disappointed. Full of the quirky and odd characters you're used to, Midnight Crossing is much lighter-hearted than anything of hers I've read before. Fiji and her cat, Mr. Snuggly, are my favorite characters. Fiji is a self-proclaimed witch with a heart of gold. Mr. Snuggly, on the other had, is a cat. 'Nuff said. But he's got tons of attitude and personality. Really cannot wait to read the next installment to see what else the residents of Midnight have to offer.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23SY7NU7HY3QY"}}, {"Date": "on May 12, 2015", "Text": "I am re-reading this book before reading Day Shift. I have read all of Charlaine Harris's books; but I read all of the Sookie books first. It is always difficult to get into an author's new series, and I think many people did not like the writing style of this book. At first I felt it was a little stilted, but then I realized it was because it was from the POV of each character, reflecting the way in which each character thought. This was a subtler book than her others and probably needs to be read (or listened) to twice be appreciated.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQ21FO0GZ8BNE"}}, {"Date": "on May 9, 2014", "Text": null, "Helpfulness": 0.6428571428571429, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARRITBOBA2LC7"}}, {"Date": "on April 19, 2015", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14P6VKZ8KJS0A"}}, {"Date": "on April 3, 2015", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TZT772GRG46Z"}}, {"Date": "on November 17, 2014", "Text": "I had read about this book several times, once I finally purchased it and started reading, well it has met the expectations that I had with Charlaine Harris. I was a Sookie fan, and I have started also reading about Harper Connelly, and all are great books by a really good author. the suspense is there, with Midnight, you never know what is happening and where it will lead, the characters are interesting, and since this is a series book, I can't wait to see where it goes!", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6DZ4CZYBGMMS"}}, {"Date": "on May 23, 2015", "Text": null, "Helpfulness": "", "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A138B98NLL3OLU"}}, {"Date": "on May 13, 2015", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AATJ9HJY5N0BC"}}, {"Date": "on May 11, 2015", "Text": "I'm an avid Charlaine Harris reader but I gotta be honest, this was not one of her better books. Sorry to say. This story was actually pretty lame. It took FOREVER to get the story moving along. Very anti-climatic. The only surprise was who dunnit. And even then it was a stretch. I don't think I'm going to finish this series of books. It just didn't do much for me. I love you Charlaine but this book was kind of a stinker.", "Helpfulness": "", "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FTFR6UOH4FDT"}}, {"Date": "on June 27, 2014", "Text": "I liked this novel a lot. More of a supernatural 'whodonit' than anything else - but there are no straight answers until the very end and even then... there are mysteries remaining.  Good set up to a new series.", "Helpfulness": 0.6666666666666666, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2E9K6HFGA1S6B"}}, {"Date": "on June 15, 2014", "Text": "The story line is pretty good but she really doesn't get to it until the end of the book.  The first 1/2 of the book is spent developing the charicters", "Helpfulness": 0.6666666666666666, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALPZJCCO1E1OD"}}, {"Date": "on May 25, 2014", "Text": "Easy read, interesting characters, not a lot of plotline... Ends somewhat abruptly making you look forward to the next book or get annoyed depending on your point of view", "Helpfulness": 0.6666666666666666, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32LX6GYQJ72WQ"}}, {"Date": "on February 20, 2015", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWBL310P3BJGE"}}, {"Date": "on May 8, 2014", "Text": null, "Helpfulness": 0.625, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1X2URS71RRMMF"}}, {"Date": "on May 11, 2014", "Text": null, "Helpfulness": 0.625, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IMLOJ2Z2QEU2"}}, {"Date": "on May 4, 2015", "Text": "I love it.  Cannot wait to find out the others secrets.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HL9FWGJQYLSO"}}, {"Date": "on December 30, 2014", "Text": "The mystery was ok, but a talking cat? And most of the characters have appeared in other Ms. Harris's novels. The culprit was just not believable and a major let down. Especially after the build up. Plus what's up with the shadowy creature lurking around in the middle of the night. I hope Day Shift is better because I love Charlaine Harris and a majority of her books are fabulous...so fingers crossed", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34NBDK0H9W80J"}}, {"Date": "on May 20, 2015", "Text": "I must admit that I was hesitant to read another series by Charlaine Harris but I am so glad I did.  This is a somewhat \"simple\" read about a very unique small town and its residents.  Each character is one that I grew to love as the story unfolded and I look forward to the next book in this series!  I just hope this series stays true to the original story line and doesn't wander into la la land.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A80LTFMZNREY7"}}, {"Date": "on May 21, 2015", "Text": "Charlaine Harris did not disappoint!  She surprised me by bringing people from other series into this book.  I liked it!  She writes in such a way that I really can't put the books down.  I try to pace myself but still just eat them up.  Anyone that enjoys ANY of her previous books is sure to LOVE this one too.  Midnight is a great place for strange things to happen.  Keep them coming Charlaine!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BP799JGJYQHL"}}, {"Date": "on October 7, 2014", "Text": "I'm such a huge fan of Charlaine Harris' books that I was excited that a new series is here.  I like the incorporation of past characters come together to provide a brand new story.  It was a little slow starting but once the story unfolded it peaked my interest.  Definitely looking forward to the sequel. She's right up there with Stephen King in my opinion.  Hope you enjoy it as much as I did.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A231C84KVIBJYW"}}, {"Date": "on May 12, 2014", "Text": "This story was like none I have ever read.  It was mildly interesting, but in all honesty, I did not find any of the characters likeable.  The mystery was wrapped up in a very disturbing story twist.  If there is another in the series, I will not be reading it.", "Helpfulness": 0.6666666666666666, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21ZQ4M0HTEGVA"}}, {"Date": "on September 10, 2014", "Text": "different, which  isn't a bad thing, it was one of those books that I picked it up/put it down, repeat. and would have to go to re-read because I forgot what had been happening when I left off then there was that \"aha\" moment. you can get the gist of the book from the publishers blurb, as I don't care to write a long, detailed book report, nor do I read them. try the sample.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UUM3UKC6PAV"}}, {"Date": "on May 25, 2015", "Text": "I've ignored children and dogs for the last two days (luckily it's a holiday weekend) to finish the first book in this series. It's been sitting in my wish list for months. WHY DID I WAIT SO LONG?! I'm a Texas girl, and I love that this book is full of what you'd refer to in my small town as \"characters\"...which is usually a nice way of saying odd. Bless their hearts.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7Q1P033JTFG"}}, {"Date": "on September 29, 2014", "Text": "This Book reminds me of a long walk in the country.  You have to take your time or you miss some of the plot twist and zingers. ( Unfortunately, I do not want to say more than that or I may spoil some surprises! )  The story does unfold at its own pace and you can not rush it.  Interesting start to a new mystery series.  I am very intrigued to see what happens next.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TQ1RD4P2ZC8"}}, {"Date": "on May 16, 2015", "Text": "I think I've read every novel Charlaine Harris has written over the past few years. I was a little disappointed in the last few True Blood books. I was a little hesitant to try this one. Pleasantly surprised at how some characters from the past had ties in this book, I enjoyed the unexpected laughs from some of these mystical characters. An enjoyable read.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2G5MR8IF75L61"}}, {"Date": "on May 18, 2014", "Text": null, "Helpfulness": 0.6, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NC665PP23A5U"}}, {"Date": "on July 31, 2014", "Text": "This book held my interest and the story line was fine. The characters need to be better developed.  No particular character stood out.  This is the first Midnight Crossroad book, I think.  So, probably there will be more development in future books.  The Aurora Teagarden and Dead series had characters who caught your attention in the first books.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JH4SPG2KULC9"}}, {"Date": "on December 1, 2014", "Text": "I enjoy Ms Harris' books, in all her series, but this one is another step away from the Sookie books.  An ensemble of strange characters, like in McCall-Smith's books, are the big payoff in this novel.  Read it for itself, and enjoy.  Go into it expecting something similar to what you've read of hers previously, and you may be disappointed.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PS0SNNDTQ2SR"}}, {"Date": "on May 14, 2015", "Text": "I wasn't sure what to expect from Charlaine Harris after the conclusion of the True Blood book series.  I was pleasantly surprised after finishing this book and I'm looking forward to book 2 of this series.  The town of Midnight seems to hold a lot of mystery and secrets and I'm anxious to discover more about it's inhabitants.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1J1RTVUJ78MQ5"}}, {"Date": "on April 29, 2015", "Text": "Harris is having fun with this book, her characters are fun, different, and a little odd.  Midnight Texas is just what I think a typical little Texas town would be like. There is a murder in town, some offbeat radical group and a confrontation with a witch. The community pulls together to protect themselves. Good story.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3L3Y6KVB9UGMT"}}, {"Date": "on September 22, 2014", "Text": "This is first of three or more novels which introduces and partly develops the back stories of the main characters. Two thirds is a mild mystery story wrapped in a slight supernatural aura mixed with some right wing nut job characters mainly because this is Texas and somebody has to bring the non-supernatural terror.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4N5RJXMPNEOX"}}, {"Date": "on July 14, 2014", "Text": "This book was not as exciting as the Sookie Stackhouse stories, it was slow to show the story line, I felt it was a little weak, some of the characters were not clearly defined.  And really went nowhere. Left a lot of questions unanswered", "Helpfulness": 0.6666666666666666, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QGO1S4519H2O"}}, {"Date": "on September 18, 2014", "Text": "I delighted in this book. It is unique in the way that it expresses disturbance, angst, folly, and utter cruely man is capable of. Yet, the conclusion is satisfying, substantive, and will haunt you. The best fiction of the year for me.", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SDEZD8LYT97R"}}, {"Date": "on July 29, 2014", "Text": null, "Helpfulness": 0.6, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AC0TOWPQSQHDV"}}, {"Date": "on May 1, 2015", "Text": null, "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Z5IZ93KBZKX8"}}, {"Date": "on February 27, 2015", "Text": null, "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34B6NBZL1IRNX"}}, {"Date": "on July 10, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4LOVS7UMSLQZ"}}, {"Date": "on May 5, 2015", "Text": "I've always liked Charlaine Harris books and revisiting some familiar characters is always fun.  This is like a cross between her detective and supernatural series.  There were twists I didn't expect and I enjoyed being able to get into the book quickly.  Can't wait for the next installment.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D1009QQ166OH"}}, {"Date": "on February 27, 2015", "Text": "Great first book of a new series by Charlaine Harris filled with interesting characters and great plot twists!! The best way to visit small-town Texas!! This was a quick read as it was hard to put down and wondering what was going to happen next! Looking forward to the next one!", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24N3K2BUAIB7Y"}}, {"Date": "on May 17, 2015", "Text": "Harris has begun another series with a strong protagonist and an eerie plot. I know I have said before that  she has a good touch with character, and she keeps to that traditional  excellence. I enjoy Harris greatly. Hope that the next installment is a satisfying read as well.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JGAU8J7PFXET"}}, {"Date": "on April 14, 2015", "Text": "This series is very different from the Sookie Stackhouse series. I read the whole thing in a day. It is a interesting little town,this Midnight Texas. I will be looking for the next novel to come out. A must read for all paranormal fans,you will not be disappointed.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CKBG8GC01FP8"}}, {"Date": "on March 4, 2015", "Text": "No review, but it was an interesting book, and I've pre-ordered the next.  Found another by Charlaine Harris and another author that I just finished and enjoyed a lot.  It was \"book 2\", I don't remember the name, it was two novellas.  It was well worth it.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1C96PBN3452JM"}}, {"Date": "on August 25, 2014", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35QWFV4WDD4VD"}}, {"Date": "on November 4, 2014", "Text": "It's been awhile since I've read anything by Charlaine Harris. Took awhile to get used to the new characters. Too bad Zelda couldn't have \"showed up\" in a few sentences. Or Harper. All in all, it was ok. Gotta luv the talking cat!!!!", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Y99DSQKKJNZH"}}, {"Date": "on April 26, 2015", "Text": "Great story. Great characters. This is looking to be another great series from Ms. Harris. I have loved every series by her so far and it was fun to see small parts of the older ones here. Cannot wait for the next book.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CF1VDGD2WVVO"}}, {"Date": "on September 26, 2014", "Text": "I like seeing some crossover from Charlaine's other series, but I would have liked some more of Manfred's talent. I do find the assortment of quirky characters interesting, and I'd like to see where she goes with this.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RGFEN11GJIV2"}}, {"Date": "on May 14, 2015", "Text": "I enjoyed this new series by Charlene Harris.  This first book was primarily an introduction of characters and plot establishment.  I have read the second book in the series and hope for more plot lines in the future.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39L8OWGI2JT7"}}, {"Date": "on July 28, 2014", "Text": "This is a VERY Different world than True Blood.. Know that going into it! This book was a world building/set up novel. It had an interesting story, but is definitely a great start to a new world for Charlaine Harris.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9XLH8A4NLP5D"}}, {"Date": "on July 8, 2014", "Text": "I have always been an enormous fan of Charlaine Harris long before everyone got on the band wagon and HBO ruined the Sookie Stackhouse series with True Blood.  This new book is very much in the \"Charlaine Harris spirit\" so if you enjoy her work, you'll probably like the book.  She sticks with her real life tales of supernatural characters set in the back drop of the American south (well, it's Texas but still pretty close to being southern).  I definitely fell in love with the spirit and companionship of Midnight, TX and the unique hodge podge of characters.  The only thing I felt that was lacking with the book was the fact that it didn't start off in the typical way that her other books do where they suck you in and leave you constantly wanting more.  It just felt like a good start to what may become a pretty good series.  I suppose every author has their \"Gone With the Wind\" where nothing else they do could possibly live up to that one pinnacle of their career.  Perhaps Charlaine Harris has reached her pinnacle with the Sookie Stackhouse series but I hope not.  I will definitely read more of the books in this series as she releases them and hope they continue to get better but, man, I sure miss Sookie.", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TOOTGECZLRHA"}}, {"Date": "on June 29, 2014", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IB6T6N3KOWUQ"}}, {"Date": "on May 23, 2015", "Text": "The characters don't jump off the page, the setting isn't convincing, and the plot feels forced. I absolutely loved all the Stackhouse books, so I'll try Harris's next series even if I give this one a pass.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GGTS852THIYD"}}, {"Date": "on May 6, 2014", "Text": "I've read everything Charlaine Harris has ever written, I think. This book is slower-paced than the Sookie Stackhouse series. It feels more like the Harper Connolly or Lily Bard series--somewhat melancholy, with relaxed pacing. The protagonists seem like real individuals, and I look forward to learning more about them. The white supremacists are more cartoon-like, though there is an interesting brief scene when you meet the parents of one of them. Another individual seems very like a character in _An Ice Cold Grave_. Harris slips in references to every other series she has written, even the Aurora Teagarden series, so fans will enjoy that.", "Helpfulness": 0.625, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATMKUEEC4JDL9"}}, {"Date": "on May 19, 2015", "Text": "Midnight Crossroad is like meeting someone for the first time yet feeling as if you've known them forever. Charlaine has again created a world with original characters that you just can't get enough of.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2W69FY01GMQ6I"}}, {"Date": "on February 4, 2015", "Text": "As always Charlaine's stories are very good but I was shockingly expecting for the book to continue when u got this \"review this book\". It will be quite interesting what new tales the book 2 brings.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QJLBSF78SPDJ"}}, {"Date": "on February 13, 2015", "Text": "I loved this light fantasy about lovely, strange folk that make the world larger and more interesting. It is easy, relaxing reading with a touch of excitement. I'm speaking as a witch of course.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJGBVSKPUEH2Y"}}, {"Date": "on June 26, 2014", "Text": "What a fun, excellent read! Charlaine Harris always delivers. I love these characters and I love this town. Mr. Snuggles--come live with me!", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LJLAQ48PAKWK"}}, {"Date": "on January 17, 2015", "Text": "Quick read.  Reminds you of the Sookie Stackhouse series but is still different enough to hold your interest.  I was glad to find another Charlaine Harris series.  Looking forward to book 2.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18BIRP0BQWA08"}}, {"Date": "on May 21, 2015", "Text": "Another great start to an awesome series by C.Harris . Definitely wasn't expecting that kind of plot or twist but was very happy with the turnout of the novel. Can't wait for the next book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BPMIUNTTH6V2"}}, {"Date": "on August 31, 2014", "Text": "I liked most of the characters and would have liked some back stories on them.  Overall the story was kind of boring and choppy.  Hopefully the next installment will be a better story line.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25KWOUNKD5YGT"}}, {"Date": "on May 10, 2015", "Text": "A real winner. You gotta love the residents of  Midnight.  Everyone different in their own way.  It they take care of each other.  Excellent read.  Once you start it you can't put it down.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1P2KUCNEYMFPS"}}, {"Date": "on March 31, 2015", "Text": "There were too many points of view in the story.  I have read other novels with multiple point of view, but this one was so disorganized that it brought you out of the story as you read.", "Helpfulness": "", "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AP6Q491GJ5CLU"}}, {"Date": "on January 6, 2015", "Text": "I enjoyed the book and will look forward to the next installment.  The characters were interesting and different but not as well developed as some of the characters in her other books.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AD8P8XKOJTVTI"}}, {"Date": "on February 22, 2015", "Text": "Not as good as expected but I think a lot was to do with establishing characters. I expect that the next book will be awesome now that we know who everyone is. Still enjoyable though.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SZY4Z8PE0RI4"}}, {"Date": "on October 27, 2014", "Text": "I always enjoy Charlaine Harris, and this doesn't disappoint. A fun new group of folks to hopefully follow around for a few books, and the end was a twist I never saw coming.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8RR8YQL7W6G"}}, {"Date": "on January 24, 2015", "Text": ".... but started to pick up a third of the way through. Glad I did continue to read. Fell in love with the characters and am interested in learning more about their stories.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AUYTPCJU366O"}}, {"Date": "on January 25, 2015", "Text": "I enjoyed this starter to a new series.  I thought it was clever to put character from past series together in one place. Can't wait to see what happens next in Midnight.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIH5VMCQP2LEN"}}, {"Date": "on May 21, 2015", "Text": "I so enjoy ensemble character storylines and am really enjoying this new series by Harris. Each  character line seems full of opportunities within opportunities.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FLDU3V4MWEXM"}}, {"Date": "on October 6, 2014", "Text": "The town of Midnight is my new favorite place to live. I loved this book. So different from Sookie's world, but just as mesmerizing. Can't wait for the next one.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JL1AAKVC1DU5"}}, {"Date": "on November 5, 2014", "Text": "Great start to what I hope is a long series.  Just enough hints of other series (Sookie and the Dead finders) to be familiar but wonderfully new and inventive).", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1W4GUOPAD3CTJ"}}, {"Date": "on January 11, 2015", "Text": "I've read worse books, but this was not up to the usual standards of Charlaine Harris.  Not enough character development and too much skipping around.", "Helpfulness": "", "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A224DPHKJ020KH"}}, {"Date": "on January 29, 2015", "Text": "This book started out slow but once I got into the book it was wonderful!  So many ups and downs and interesting people. I really enjoyed the book !", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AG87ZOCVF508W"}}, {"Date": "on October 14, 2014", "Text": "Things ain't exactly what they seem to be in the small town of midnight Texas. Everyone has a secret, specialty, or a charm that just isn't natural.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A309FUO9AZ07XC"}}, {"Date": "on February 20, 2015", "Text": "Great read. I really enjoyed the characters. I hope there are more books based in Midnight. I want to find out more about each of the residents.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AY0P1VLU1OQ3O"}}, {"Date": "on March 1, 2015", "Text": "Pleasant, easy read. Good tension, well developed characters, perfect location for these characters. Waiting to read the next installment.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18FZE0IQDRKJK"}}, {"Date": "on April 6, 2015", "Text": "I had read all the Sookie series and missed them..  But this was a fun, interesting story and I cannot wait until the next one comes out.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TRX7JSOIIQ9L"}}, {"Date": "on July 29, 2014", "Text": "I truly enjoyed this book and I'm excited to see how Charlaine Harris will develop these new characters. Can't wait for the next one!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VLJX7QGX8JPS"}}, {"Date": "on May 10, 2014", "Text": "After reading the other reviews I realized that this book is much more fun for people who have read the Teagarden & Harper & Bard series.  Having characters from previous series meet by accident in this little hidden town is great because in their back stories lie the reasons they would choose this place.  This structure makes me even more anxious to find out about the characters I don't recognize.  Thanks Charlaine, I can't wait for the next one.", "Helpfulness": 0.625, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3561FS3UH6THP"}}, {"Date": "on June 26, 2014", "Text": "I'm not a big fan of this authors more popular series but I found that I really enjoyed this book.  The story is good and fast paced.  There isn't a whole lot of supernatural/paranormal to it, but there's just enough to satisfy the genre.  Perhaps the part the I like the most though was characters.  All of the characters were vibrant and seemed to jump off the page, and maybe more importantly they all had something wrong with them.  Flaws both big and small.  It is refreshing to read about characters that are easier to identify with than the perfect little girls or god like vampires that seem to pervade a lot of other books.  I really enjoyed this book and I can't wait for the next one in the series.", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RUIKSDPI76H3"}}, {"Date": "on April 15, 2015", "Text": "Great characters. compelling tale. Want more. I was saddened at where the story took us but I like that no one was untouched.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SNN41E2Z215X"}}, {"Date": "on March 12, 2015", "Text": "This is the sort of mystery that I love! I wish there was a bit more psychic stuff in it and it would have been 5 full stars.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1T8L1O2ISAG9R"}}, {"Date": "on February 1, 2015", "Text": "Tried to make it last. Couldn't put it down. It was cool the way she worked character from her other series into the new one.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANZ6M9UBV1G3C"}}, {"Date": "on October 5, 2014", "Text": "Great character development in this quick & easy read. Can't wait to find out more secrets of Midnight.  Screenplay, anyone?", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GCK6GU9OCGSV"}}, {"Date": "on October 16, 2014", "Text": "love charlaine harris; her writing makes you feel like you're hearing the story from a friend; love her quirky characters", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JOPOLF3101JX"}}, {"Date": "on May 15, 2015", "Text": "I like the kookie characters and the off beat town. Not as captivating as the Sookie Stackhouse series but I enjoyed it.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22J5I32SX22YE"}}, {"Date": "on May 8, 2015", "Text": "Interesting characters. But not the same depth as True Blood. I am looking forward to the next one in the series though.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RM9VDNHB331"}}, {"Date": "on March 2, 2015", "Text": "I like her as an author, but I just couldn't get into this book.  Will still buy her books though, just not this series.", "Helpfulness": "", "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A318IM1C7J6DPX"}}, {"Date": "on May 5, 2015", "Text": "It's just slightly off. The names don't feel right with the description of the characters. Kinda all over the place too", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SXZQ3J8R44EJ"}}, {"Date": "on November 23, 2014", "Text": "Okay read. Not as well organized as the Stackhouse series. Maybe the characters will gain more depth in the next novel.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BVEX9IKJSAZB"}}, {"Date": "on January 2, 2015", "Text": "The characters in the mini town are great. They are like a family. I look forward to book number two of the trilogy.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIZZZV1JKU6QI"}}, {"Date": "on November 7, 2014", "Text": "This book was an easy read and an interesting departure for Ms. Harris.  It isn't laugh out loud fun, but it is fun.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KAD23W52R0EP"}}, {"Date": "on February 12, 2015", "Text": "This is a nice easy read.  Not great literature but entertaining and fun.  I enjoyed getting to know the characters", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TYNDGO3ZDOZM"}}, {"Date": "on May 9, 2014", "Text": "The POV changed randomly which meant the storyline got tangled and I just couldn't care how things turned out.  I saw a lot of potential in the premise, but it was very poorly written.", "Helpfulness": 0.6363636363636364, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KDIAVN06UP7A"}}, {"Date": "on May 21, 2015", "Text": "Love Charlaine Harris, we're happy to see Manfred again. That is all type type type type type type type thanks", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HJIXGW476KKZ"}}, {"Date": "on May 15, 2015", "Text": "Great story! I loved how the characters interwove with her other books! Just ordered the second in the series!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14R1K5CGSN3NE"}}, {"Date": "on November 21, 2014", "Text": "A little slow moving but with some very interesting characters who's develop I am looking forward to following", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EWGJQADP879H"}}, {"Date": "on April 8, 2015", "Text": "I'm not able to get into any characters in this book.  I'm not sure I will finish it.  The story is dragging.", "Helpfulness": "", "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A193QPMNMOB4EA"}}, {"Date": "on November 30, 2014", "Text": "It  kept my interest and I look forward to the next book in what  I hope ongoing series like her Sookie books", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AW19WQ8Z16VY8"}}, {"Date": "on May 19, 2015", "Text": "Definitely not Sookie and her friends. Still interesting tho. I will read the next one and see what I think", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31DJXIJT0SKEP"}}, {"Date": "on July 22, 2014", "Text": "I have a bone to pick with Ms. Harris!  As a Conservative, as well as a fan of her Sookie Stackhouse books, I was DISGUSTED to see her equate white supremacy with Conservatism!  It is an untrue and \"progressive\" distortion of the truth.  It would be like Ms. Harris being compared to a \"Stalinist\" communist because she has liberal views!  Enough already!!", "Helpfulness": 0.6, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AX3BUI5FJ1I7Q"}}, {"Date": "on September 13, 2014", "Text": "This is the first book of a new series by Charlaine Harris.  Most of the story line was setting up the characters. And, they are the most interesting characters! Charlaine Harris always gives a good story no matter what series she is writing and this was no different. One is drawn into the setting and the characters ' lives. The plot revolves around a murder that has occurred.  It is nicely written and holds the interest. I cannot wait til the second book in the series comes out. I like the characters as they all have such diverse personalities.", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38NAW1URYSJ9C"}}, {"Date": "on April 30, 2015", "Text": "My favorite is the cat.  Can't wait for the next one. My favorite is the cat.  Can't wait for the next", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1M61H61V4W3GI"}}, {"Date": "on October 1, 2014", "Text": "I enjoyed the new (and old) characters from her other books, but I thought she could have done better.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I73BW5LZVOC5"}}, {"Date": "on May 2, 2015", "Text": null, "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1579ZIJK0RF2L"}}, {"Date": "on March 19, 2015", "Text": "I love the series but this book is after the fact. Even for short stories it didn't flow well for me.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3O5IHYZ6P3XAJ"}}, {"Date": "on January 4, 2015", "Text": "Really isn't worth the time to write much of a review.  It isn't horrible but it was far from great", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1R8K69AV72G63"}}, {"Date": "on July 28, 2014", "Text": "Unlike many reviews I've read, I quite liked the characters. They were quirky and interesting. I could picture them in future books. I've read Harris' Sookie Stackhouse and Aurora Teagarden books and I just enjoy her writing style. The one thing that kept irritating me as I read the book was how I kept being hit over the head with Harris' political views. I've noticed it in her other books but was able to just kind of ignore the preaching and enjoy the reality escape. With this one I got tired of mentally rolling my eyes.", "Helpfulness": 0.5, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33CPPZV2989CW"}}, {"Date": "on August 22, 2014", "Text": "Not what I thought it would be.  Thought it would be more like the Grave books.  Still enjoyable.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32I0KUEK21GZZ"}}, {"Date": "on July 7, 2014", "Text": "Have read all of Ms. Harris' series, because her characters are so vibrant and fun it's a pleasure to hop into their world and go along for the ride.. Hoping this book is the start of her next series. We're teased with tiny glimpses of fascinating back stories and left wanting to know so much more about each player. 4 stars vs 5 is due to the frustration of knowing there's so much more to learn about all these folks, with no hint that our curiosity will be satisfied. Please give us more of Midnight, Charlaine!", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DJXPPB19L81B"}}, {"Date": "on January 22, 2015", "Text": "I thought this book was a bit hard to get into but once I did I had a hard time putting it don!", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DEG2J4E82BGQ"}}, {"Date": "on May 26, 2014", "Text": "I,'ve enjoyed many Charlaine  Harris books on the past and looked forward to reading this first book in a new series.  Unfortunately this read like an author's first novel, drug on with not much happening in the first half other than descriptions of the town and character introductions and I had to force myself to keep reading.", "Helpfulness": 0.6, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2D6ALPF0HH0F5"}}, {"Date": "on October 5, 2014", "Text": "I hope Harris writes more for this series. Great mystery with wonderful, colorful characters", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2O41EKFNXG49L"}}, {"Date": "on May 16, 2014", "Text": "I love Charlaine Harris books, but I found this a little hard to get into.  The new & old characters are very interesting though & it will be good to see what happens next.  The book certainly improved as it went on and I'm sure the next two will be even better.  I will know doubt be sorry when this series ends.", "Helpfulness": 0.6, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HL3Y3V5U2896"}}, {"Date": "on July 7, 2014", "Text": "It's a good solid book.  She spends a lot of the book slowly building the characters, making readers watch and wait to get our questions answered.  I have enjoyed almost all of her books ( the last couple of Sookie books were only 3 star) but my special favorites are the Aurora Teagarden ones.  I am looking forward to this series, but I worry that Ms. Harris is getting closer and closer to the dark side.  I am a cosy mystery reader, and like warm happy endings.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2F6O6AOFE0TP6"}}, {"Date": "on September 3, 2014", "Text": "Good opening series book, characters are not as developed yet - looks promising though.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DYF8RW0CJ9YV"}}, {"Date": "on October 28, 2014", "Text": "I really liked this oddball book and am looking forward to the next in the series!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUEEEP9HIJEJO"}}, {"Date": "on November 14, 2014", "Text": "Really liked it.  The initial book in a series that I am anxious to read more of.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AT0BSX708AE84"}}, {"Date": "on August 7, 2014", "Text": "This book was interesting enough to keep you reading, waiting for the next event.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HL7E94H3L18G"}}, {"Date": "on November 24, 2014", "Text": "Ok addition to Harris's bibliography. Not gripping, but amusing, passable read.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AG019GN8B6CXH"}}, {"Date": "on May 12, 2015", "Text": "Another great series by C. Harris. I look forward to the rest in the series.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RFD97HHNZ6J0"}}, {"Date": "on July 31, 2014", "Text": "Great return to mystery writing!  Loved the connections to her other series!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XXEE1H8ET19O"}}, {"Date": "on July 10, 2014", "Text": "There was a lot of character development through the majority of the book.  She delves into another world within our world and that makes this entertaining.  I liked the characters and look forward to learning more about them in the next book.  For those that are so critical about this new book, I can only say, \"It is fiction\"!  If you want bleeding heart reality, turn on the news.", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABOMOUV7HX4PJ"}}, {"Date": "on May 7, 2015", "Text": "the same lovely  writing and  querky  characters we have come to expect.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30O5DAS13M8OA"}}, {"Date": "on April 1, 2015", "Text": "I can't believe the same writer did Sookie.  This one was kinda boring.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26624RWQI9XYQ"}}, {"Date": "on July 9, 2014", "Text": "I love Charlaine's body of work - she is a truly talented writer.  I did find this book took a while to get into - the exposition of so many characters at the start was cumbersome to navigate but once the story found it's rhythm and complications where established, it became another great read.  I will definitely be buying the next installment of the series.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1K7CMHI014BOV"}}, {"Date": "on June 5, 2014", "Text": "I loved the Sookie Stackhouse series but I didn't want a repeat of that series. The introduction of the characters is slow however the story does start evolving with the characters about half way through the book. I will be I interested in the next book...", "Helpfulness": 0.5, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6UC132HWCB8A"}}, {"Date": "on June 3, 2014", "Text": "The book was just what I needed, light reading while on vacation. It was fun how she brought two characters from different series into the story.", "Helpfulness": 0.5, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OZ249KEZYYL1"}}, {"Date": "on May 21, 2014", "Text": "although i enjoyed the book , it wasn't as enthralling as id hoped for. still a good enough read and i will read the rest of the trilogy", "Helpfulness": 0.5, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOQRSRR1TU7IQ"}}, {"Date": "on May 19, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ISCJ7Z9FNRW2"}}, {"Date": "on July 12, 2014", "Text": "Loved it! A fun quick read with likable, enjoyable characters. I'm a fan of C. Harris's writing style, the ease of the supernatural merged with reality. Love the idea of a paranormal, mysterious town with a old 24 hour pawn shop and a vampire in the basement, plus a witch down the street and... Well, you get the idea. Can't wait for the next one!", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYXAD61QYRCIQ"}}, {"Date": "on November 9, 2014", "Text": "Really liked this book.  I'm ready for the next one in this series!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AG2J0AISJKAN"}}, {"Date": "on December 29, 2014", "Text": "I still love Harper the best but this is not a bad spin-off series", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2T7S3QFG3WGTR"}}, {"Date": "on September 20, 2014", "Text": "Humorous, fun, intriguing, and made me want to read the next book.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3T45M49SGG8QN"}}, {"Date": "on October 16, 2014", "Text": "Is especially good if you've read the dead series.Fun characters.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19L05EAP0QRH3"}}, {"Date": "on October 9, 2014", "Text": "This book was a good quick and easy read. Entertaining and funny.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2J9DZF8JADAAA"}}, {"Date": "on November 5, 2014", "Text": "Great beginning to what I hope will be a series to equal Sookie.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A138HGQMD6AG4E"}}, {"Date": "on July 30, 2014", "Text": "I loved this book, I hope she writes more with these characters.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4RX5DYIQQOI8"}}, {"Date": "on March 2, 2015", "Text": "Hopefully there will be another in the Midnight, Texas series.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UZVIK0Q5MPCD"}}, {"Date": "on September 11, 2014", "Text": "It's ok but didn't hook me like the Southern Vampire Series", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WL38SH9ZUKYR"}}, {"Date": "on September 6, 2014", "Text": "I was expecting more from her.  But did enjoy the book.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17YV3NSDY99KC"}}, {"Date": "on September 19, 2014", "Text": "i loved it and am looking forward to the next book.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1S80YIKYWB0U0"}}, {"Date": "on June 28, 2014", "Text": "I know some people were disappointed in this new story, but I don't see why.  Good plotting, good development, and a town full of people whose secrets will fuel several more books.  I enjoyed seeing 3 characters from her other series.", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XVC56Y3DCKI9"}}, {"Date": "on September 14, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34GB6TENL5Q6X"}}, {"Date": "on November 17, 2014", "Text": "Wonderful author - riveting book. Loved it.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2J5HTXR1XQZW9"}}, {"Date": "on July 11, 2014", "Text": "Interesting and fun characters with secrets that lock you into the story and their lives.  Very entertaining and addictive.  If you loved Sookie you will love this new series.  I can't wait for the next book!", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASNEKUCJSQZK8"}}, {"Date": "on April 7, 2015", "Text": null, "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18BHB6C2HGW5H"}}, {"Date": "on March 27, 2015", "Text": null, "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2R305K3F8WZQL"}}, {"Date": "on December 11, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AA6UDW8LST4AZ"}}, {"Date": "on August 7, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CSJRFPUZMUZW"}}, {"Date": "on May 13, 2014", "Text": "I never felt like the ending of the Harper Connelly series did justice to Manfred Bernardo's character, and so I was thrilled that he would be in this new series.  There is a murder mystery in this book, but it felt like that story line was meant to reinforce the larger mystery that is Midnight, Texas.  There is not a lot of action, especially in the beginning, and the reveals are slow but very clever, and the way Charlaine Harris brings out the secret details of Midnight's residents is extremely pleasurable.  At the same time, my major complaint is that the book is slow, and the murder mystery was not so much at the top of my list of concerns.  I was more interested in the residents and their interactions with each other.  I was also disappointed that Manfred came across as a bit of a charlatan and didn't exhibit any of the psychic prowess that I know he is capable of.  However, I am still in love with his character and will be back for the next book.", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZFU9IF86OABG"}}, {"Date": "on November 16, 2014", "Text": "it was different but I enjoyed the book", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJC3F59X3CFT"}}, {"Date": "on May 8, 2015", "Text": "Always enjoy reading Charlaine Harris!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHVECRLKPZ174"}}, {"Date": "on July 10, 2014", "Text": "I can't believe that I actually liked it. After doing a disgusting last three books in the Sookie Stackhouse series to say my expectations were low is an understatement.", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2B7XZKT7ZK862"}}, {"Date": "on November 1, 2014", "Text": "Hope she writes more on this town!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39G2RT95RAJ9C"}}, {"Date": "on September 19, 2014", "Text": "I love Charlaine Harris books.  This one was a nice change from some of her other ones, but still a good read.  I'm looking forward to reading more in this series.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IJ0SET01208W"}}, {"Date": "on October 17, 2014", "Text": "When does the next book come out?", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIM22QD6BBMSL"}}, {"Date": "on October 19, 2014", "Text": "absolutely up there with Sookie!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1N34EZYIV698V"}}, {"Date": "on July 6, 2014", "Text": "Good read. Nice to have something out by this author. I hope that there are as many in this serried as there were in the Sookie Stachouse saga.", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CDOHIIRRXP35"}}, {"Date": "on October 28, 2014", "Text": "Hope she writes more of these.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33J8M9XYCFNQI"}}, {"Date": "on December 18, 2014", "Text": "The characters are well thought out and developed. The plot moves along really well. Very enjoyable read from one of my favorite authors.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13EVXN4BOWJFX"}}, {"Date": "on July 10, 2014", "Text": "It is an interesting book since I have read many of her previous series and was already familiar with a couple of the main characters.", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UBNP53DE50OF"}}, {"Date": "on September 4, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WD0S9YEYN59S"}}, {"Date": "on October 19, 2014", "Text": "Can't wait for the next one!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VS36A2TOS5V5"}}, {"Date": "on July 6, 2014", "Text": "I love how Charlaine Harris has taken characters from other series to create a new one. The denizens of Midnight are intriguing!", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27ECYFH697H4H"}}, {"Date": "on November 21, 2014", "Text": "cant wait for the next one!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UEHL2IY4U82K"}}, {"Date": "on August 18, 2014", "Text": "Love that characters from her other books were mentioned. Well written, great story, i can't wait for more. Keep them coming.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOZDQHWW8ZYI7"}}, {"Date": "on November 4, 2014", "Text": "great story, want more!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HZF6RP9DSYYV"}}, {"Date": "on July 9, 2014", "Text": "I can't wait to read the next book. So far I haven't read a book by Charlaine Harris that I didn't like.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AD6ATT1N5TU"}}, {"Date": "on July 6, 2014", "Text": "Interesting characters, unique plot.  Keeps you interested from start to finish.  Great leisure reading", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3T4PKV9SBN4UD"}}, {"Date": "on September 28, 2014", "Text": "Just loved the fascinating group of characters created in this book.  Hope to see more of them.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34GMF2VCOI3ID"}}, {"Date": "on July 31, 2014", "Text": "Midnight Crossroad is my current favorite book.  I finished it last night and I’m still thinking about Midnight, Texas.  I loved everything about it!  This is the first novel in a new series by Charlaine Harris.  The plot starts out a bit slow, but her writing is so interesting that it doesn’t matter and it’s because she is introducing us to an amazing cast of characters.  I loved learning about Midnight, Texas and its secretive inhabitants.  My favorite character is Mr. Snuggly, all of my LOL moments involved the cat (and I did actually laugh out loud several times).  And I had no idea “who done it” until it was revealed, the whole ending was perfect!  If you haven’t read it yet go and get it now!  If you only buy one book this month make it Midnight Crossroad!  I didn’t regret it and you won’t either!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PY1D7C9SJC3I"}}, {"Date": "on July 10, 2014", "Text": "Ms Harris writes well, and I enjoyed her novel that breaks away from the Sookie mold.", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GPD3VBXYKA0W"}}, {"Date": "on March 1, 2015", "Text": "A good, easy read.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I1AMNF7OHHU1"}}, {"Date": "on August 25, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37QVR6S6UBUR4"}}, {"Date": "on September 30, 2014", "Text": "Super.  Great to have a new group of characters that only Charlaine can create!", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2R3UUKGNZ9QKW"}}, {"Date": "on July 8, 2014", "Text": "Very much like a Scooby Doo episode, \"those pesky kids\" kind of thing.", "Helpfulness": 0.5, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11BP9IQNAVH4V"}}, {"Date": "on June 30, 2014", "Text": "I love Ms. Harris and this little gem of a book was a fun distraction for me. I miss the Sookie universe, but travelling to Midnight made for a nice little holiday.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XD4HWA4ALT66"}}, {"Date": "on June 14, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2M0W65F18L64V"}}, {"Date": "on June 10, 2014", "Text": "It took me a while to really begin to like the characters but found myself immersed in Midnight,Texas without me even knowing it.  Another great book from Charlaine Harris.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WTWXZOGCU64J"}}, {"Date": "on May 20, 2014", "Text": "if your looking for some Pulitzer Prize winning novel, this is not it. But if you want an interesting, easy read, get this. I enjoyed it, finished it in two sittings.  I recommend it for sure.", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BVJL3PG4QOQP"}}, {"Date": "on May 18, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VEF6N9P740Y5"}}, {"Date": "on May 16, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35V1N17E446RX"}}, {"Date": "on May 15, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18FRUI57BHJ20"}}, {"Date": "on October 1, 2014", "Text": "I have ALL of Charlaine Harris' books, and this one is one of her BEST YET!!!", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25MLFI0ZL70JZ"}}, {"Date": "on May 20, 2014", "Text": "I love novel based in Texas (being a Texas girl) so I purchased this book. Normally I love Harris' novel, but the writing has been off a little for years. I am just disappointed in the overall depth of the characters I never feel like I got to know any of them well enough to care about them. Msybe things will be made clearer in the next novel.", "Helpfulness": 0.5, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DI2BPQQY0IB"}}, {"Date": "on August 29, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PHR7F16U23PT"}}, {"Date": "on October 31, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32ZCBZN79PG4D"}}, {"Date": "on February 23, 2015", "Text": null, "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XQ1JB4A3UWIK"}}, {"Date": "on March 7, 2015", "Text": "I really enjoyed this book! It was great reading about characters from all the other Harris universes such as Bobo from the Shakespeare novels and Arthur from the Teagarden novels. I've read all of Harris' works, so it was a treat to read a book where all these characters intercepted at the crossroads of a little town called Midnight. The mystery was well constructed, as usual, and left me guessing until the end. The characters were mysterious and amusing and the story well-written. Good to see Harris getting back to top form after the conclusion of the Sookie novels.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IRE4IUSQ9B8F"}}, {"Date": "on December 23, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AX0ZTNX6KVJ40"}}, {"Date": "on January 16, 2015", "Text": "I really enjoy reading Charlaine Harris.  The quirky world her characters inhabit are just full of interesting things-this author has a way about her, that's for sure, and once introduced to her books, you want more!  The population of Midnight, Texas does not disappoint.  I don't want to spoil the read for anyone by giving away ANYTHING.  Let's just say if you are a Sookie Stackhouse fan, or a Harper Connelly fan you will be a Midnight Crossroad fan too. An introduction to what could be a great series, I patiently wait for more-you will too!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MNQ4IOCZDUND"}}, {"Date": "on February 7, 2015", "Text": "Great series!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LZIXMCNHMHBN"}}, {"Date": "on October 1, 2014", "Text": "Hope there more stories about this group of people,", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27QUECXHF2MZV"}}, {"Date": "on December 18, 2014", "Text": "Great book! Loved hearing from familiar characters", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2A0ZYWDX9HCNS"}}, {"Date": "on September 1, 2014", "Text": "I'm happy to have a new series from Charlaine Harris and it feels like it will be another good one if she keeps going with these characters. We get to meet some old friends from previous books and the new characters are intriguing enough to make me want to read more. Midnight Texas is the perfect setting for the quirky world Charlaine has created and I thoroughly enjoyed this book! The sad part is how long I'll have to wait for another one.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1X2FXI4B1JWEJ"}}, {"Date": "on June 28, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9H2FYDV88S2L"}}, {"Date": "on July 30, 2014", "Text": "Loved this book. The first chapter or two was a little slow but after that I could not put it down. I can't wait for the next one to come out. My favorite character in the book was Fiji and her cat. I would still like to learn more about the rest of the crew and the mysterious trips that Olivia took plus what is in the old books that Lemuel was looking for. Midnight, texas sounds like a town I would like to visit.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEZ87BBYV3J39"}}, {"Date": "on June 28, 2014", "Text": "Was a great read.  Having read all the Snookie True Blood books, I wondered if Charlaine could repeat that success.  I now know she did, maybe surpassing it.  Am looking forward to the next book.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DPJYRH7ZGJ0U"}}, {"Date": "on June 12, 2014", "Text": "It took me a sec but I then realized some familiar faces!  Couldn't put the book down! Don't want to wait for the next installment! !! Excited to see what is next for the inhabitants of Midnight!", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXMZ6D1FF7E7B"}}, {"Date": "on May 29, 2014", "Text": null, "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATPPNCQBM9ASR"}}, {"Date": "on September 2, 2014", "Text": "I love you Charlaine Harris!!!!!  My favorite books of yours are the Lily Bard - Shakespeare series.  It took me a minute to realize where Bobo came from.  The Lily Bard series is my favorite of any of your series.  It's great to see him back again, I can't wait to read the next book.  Course a visit to Shakespeare wouldn't hurt.  Thanks so much for the hours of enjoyment!!!! You rock~!!!  Cathy T", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PEIU1R0O38LO"}}, {"Date": "on July 31, 2014", "Text": "I was so pleased to have found Bernard again! He was such a great character in Ms. Harris' Harper Connelly Series.  And then I found Bobo also in Residence at Midnight, TX! He's from the Lily Bard Mysteries set in Shakespeare, Arkansas. The other characters were interesting and \"real\". I honestly liked the book and would certainly like to read more about that interesting community.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3COLEW375TVDE"}}, {"Date": "on December 22, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OK0JL1RKC75"}}, {"Date": "on September 11, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MFN87DWKANNC"}}, {"Date": "on July 31, 2014", "Text": "I AM WAITING EAGERLY FOR MORE BOOKS IN THIS SERIES.  I REALLY LIKE THE MAIN CHARACTER, AND REMEMBER HIM FONDLY FROM THE HARPER CONNELLY SERIES OF BOOKS.  THIS IS A FAST READ, AND KEEPS YOUR ATTENTION TO THE END.  LOTS OF INTERESTING PEOPLE, WITH SOME NONHUMANS THROWN IN THERE, TOO.  REALLY GOOD, HOPE SHE KEEPS THIS SERIES GOING AT LEAST AS LONG AS THE SOOKIE BOOKS!!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1W229VNYZWOW0"}}, {"Date": "on December 13, 2014", "Text": "I loved this book.  I thought the characters were great. I thought it was a little hard to read but that didn't stop me and I found it was a great read. I read the Harper Connolly series and loved that as well.  I am not much on the other books but who knows.  I may try again and like them.  I cannot wait until the second book in the Midnight Texas books come out.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31RBXGZAT53IL"}}, {"Date": "on June 28, 2014", "Text": "Promising new beginning of a series.  Apparently will be built around a side character from one of her other series.  Watch the series.  I think it will be great.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36AMFSR5QWUAA"}}, {"Date": "on September 19, 2014", "Text": "Very good book loved it. . A must read", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A86ZMKFNFSICQ"}}, {"Date": "on November 2, 2014", "Text": "I stumbled across this book while looking for another author and bought on a whim. The quirky blend of magic, mystery, and relationships was intriguing enough entice me to buy it. Subsequently, I have purchased most of her other books. Ms. Harris is a wonderful storyteller of magical, contemporary fiction. Thoroughly enjoyed Midnight Crossroad!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FMO7F8D2PW2M"}}, {"Date": "on February 28, 2015", "Text": "nice read", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKD8WG4O5NS1A"}}, {"Date": "on August 31, 2014", "Text": "Written by Charlaine Harris (love all her stories/books).  I loved the \"new\" supernatural characters in it and that it was a mystery story (no spoilers).  Hard to write anything else outside of it was hard to put down...love her writing style.  Wonder if she will be writing a follow-up...new mystery with these characters.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GB9CMAK68JVD"}}, {"Date": "on May 2, 2015", "Text": "I'm a huge fan of the Sookie Stackhouse books. I started to gobble them up years ago like they were crack and I was an addict. So I was super excited to learn Charlaine Harris was coming out with a new series: Midnight, Texas. Midnight Crossroad is the first book in this series, and it didn't start off with a bang.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23OTLWIB9PXJY"}}, {"Date": "on December 29, 2014", "Text": "Loved it", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PQ61RDKZE5RN"}}, {"Date": "on May 13, 2014", "Text": "I thought it would be written in the style of her other books in which Manfred appeared. It was ok but a little unbelievable even for her.", "Helpfulness": 0.5, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADVDLC45GIKA1"}}, {"Date": "on June 12, 2014", "Text": null, "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FNNTE9HU247L"}}, {"Date": "on September 11, 2014", "Text": "I enjoyed this book on it's own and am looking forward to more in this series. The characters were interesting and the plot was full of twists. It heals my attention and kept me engaged. I have read most of this author's other books and enjoyed the little hints of them throughout.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AT3VJZX63HYAR"}}, {"Date": "on November 17, 2014", "Text": "Another great book from one of my favorite authors.  Charlaine Harris is just about the only author that I'd buy without reading anything from the book before hand.  She is really great and I've read all her books.  Now I just sit around waiting for her to write another one.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16YTQ5CQSJ6Y1"}}, {"Date": "on May 13, 2014", "Text": "I won't say this is the BEST book I ever read, but I enjoyed it the way I liked the Sookie books. I felt like I had taken a really interesting vacation after I had read it, was sad when I finished it and want to read the next one. It did start slow. After the intro, I thought \"hmmmm\", but then it started rolling. No need to discuss plot because others have done that and why ruin the book... just let it unroll and go with it. If you like Charlaine Harris books, you'll like this one. ---Mrs Mark Sheron", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AT3LMJIYWDFTA"}}, {"Date": "on August 13, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OED8SXA6GAMK"}}, {"Date": "on December 21, 2014", "Text": "Great book. Fast transaction.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JH9O97IY717S"}}, {"Date": "on August 17, 2014", "Text": "Me gustó. Me sorprendió el final. Nada parecido a lo que había leído de C. Harris, aunque al principio me pareció extraño que se desarrollará desde distintos puntos de vista según el personaje que protagoniza el capítulo, el ritmo es bueno y la historia me atrapó.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWK0DZN4Q37RQ"}}, {"Date": "on February 1, 2015", "Text": "I have read all of Charlaine's books!  This was a very fun and colorful story can't wait to read the next book.  What I really liked was she put characters from her other books into this series so clever!  Keep them coming, I can't get enough of her stories.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2X7JTIE39D77O"}}, {"Date": "on June 12, 2014", "Text": null, "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HM4GGGNKZ37B"}}, {"Date": "on December 29, 2014", "Text": "At first, I didn't think much of this story and several times I nearly tossed the book.  However, I stuck with it and by chapter six I couldn't put it down.  Weird town, weirder characters and attention-holding story.  Can't wait to get the next volume.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AC1ZXX9IBCTT"}}, {"Date": "on August 11, 2014", "Text": "This was a fun read, but I have considered each one of Charlaine Harris' series to have something interesting to offer.  I did have a bit of a problem with the perceived sound of one of the voices of a character, but I'm not an expert on familiars.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BZ2P70QJUBYN"}}, {"Date": "on December 25, 2014", "Text": "This book was a very interesting combination of Charlaine Harris horror and Charlaine Harris mystery. I enjoyed getting to know Manfred and the other residents of Midnight, and look forward to a deeper delve into their dark world in the future.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1F115ZQEM42TZ"}}, {"Date": "on September 4, 2014", "Text": "Another great read from Ms. Harris.  I really like the references to characters from her other books.  I like these characters, the setting, the other,everything.  Ms. Harris does not disappoint.  I hope there will be moreover set in Midnight.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28U0XONS8AG3E"}}, {"Date": "on June 29, 2014", "Text": "I wasn't sure about a new series but it was very good.. Eager to learn more about the people of Midnight.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27BWQIJK1J898"}}, {"Date": "on December 7, 2014", "Text": "I have missed reading new material from Charlaine Harris.  This is a great start to a new adventure.  At the end of the book there is a bit of mystery left for each character.  I'm looking forward to the next book.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIUD1W6E52LJ1"}}, {"Date": "on June 10, 2014", "Text": null, "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16BPF2Y7B8A2G"}}, {"Date": "on June 2, 2014", "Text": "I was really shocked to see so many negative reviews!!! I just finished this book and absolutely loved it! It seems to me a lot of people are upset that this isn't a Sookie Stackhouse novel and they really need to get over it. An author's work should never be judged by their previous works. Each creation is different. That being said, even I admit that I was saddened by the end of the Sookie Stackhouse novels and I was unsure if I would like this new series as much. All I can say is that I found the characters endearing and the storyline quite enjoyable! The writing is the same quirky style and there were a few twists that I didn't see coming that had me giggling with delight. I could hardly put this book down! I want to read the next one in the series ASAP! I'm looking forward to the rest of the series and I admit that after this book I'm a bit sad to learn that it will only be a trilogy. I think Midnight Texas is just as exciting as Bon Temps Louisiana!", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DCT6DTWTM2WT"}}, {"Date": "on May 25, 2014", "Text": "Midnight crossroad is a delightful,enent filled new town of the imagination. . She shapes a town so you can see it and believe that it is somewhere you could pass thru! I can't wait to see what happens next.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LMPLOWXRPON1"}}, {"Date": "on May 19, 2014", "Text": "This is the best book I have read in years. I always loved the Harper books and the people in them. To find this had Manfred in it was great.  I know some people were unhappy to see the end of Sookies series but it had ran its course.  I hope Mrs Harris writes more books about Midnight. This could be the best of all her series .", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QULXUH89WKHW"}}, {"Date": "on May 19, 2014", "Text": null, "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12O7QQ2SJRHP8"}}, {"Date": "on May 1, 2015", "Text": "I love how a character was pulled from a previous serious and the world of sookie mashed into this book. It's amazing how one serious crossed with another and I cannot wait to get a hold of the next book", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A225H23T6SH7O0"}}, {"Date": "on December 28, 2014", "Text": "gift.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZIX10R5YAED2"}}, {"Date": "on October 29, 2014", "Text": "What?", "Helpfulness": "", "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UMGU3KC451VK"}}, {"Date": "on September 13, 2014", "Text": "Better than expected.  I enjoyed the characters and the way they are intertwined to develop the story.  The ending seemed kind of rushed, though and didn't fit with the story as much.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1G9ZENZ6BMBIO"}}, {"Date": "on June 9, 2014", "Text": "I think as the characters evolve in the coming books this series will be really good. I love the easy going writing. I have to say my favorite characters are the cat and the reverend.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DK6K5KVP3E7O"}}, {"Date": "on July 8, 2014", "Text": null, "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9EJRIBZQI9U1"}}, {"Date": "on December 14, 2014", "Text": "Charlaine Harris creates massively interesting characters. I'm not sure how this will compare to Bon Temps, but I'm willing to go along for the ride and am waiting for the next book.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SW2SH4B9VQD2"}}, {"Date": "on August 2, 2014", "Text": "I rated this average for the quality of the narration, simple sentence structure and vocabulary.  Entertaining storyline.  Would recommend as good read for teens or advanced preteen.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2O2VISNT4QM7K"}}, {"Date": "on April 19, 2015", "Text": null, "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DTEC9ACOVYUV"}}, {"Date": "on January 7, 2015", "Text": "New series with some familiar characters starts well!  Nicely constructed- I didn't know \"whodunit\" til the end.  Next installment 5 months away- write faster!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JTP1NBCNPG3E"}}, {"Date": "on August 31, 2014", "Text": "Such a great book! I'm excited about this new series and love that Ms. Harris has integrated so many characters from her previous series. Can't wait for the next one!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GLEATHZISOFE"}}, {"Date": "on August 26, 2014", "Text": "I love Charlaine Harris and this book did not disappoint. I would say the only thing about this book was it took awhile to get to the plot. Once there it was awesome.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADG6BIDRHIY3X"}}, {"Date": "on January 16, 2015", "Text": "I loved this new series. I always appreciate how Charlaine Harris develops her characters...and this is no exception. I can't wait for the next one in the series!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1E02YIGN43G7S"}}, {"Date": "on January 3, 2015", "Text": "Loved it! Took me a few minutes to \"place\" some of the characters (who had been in her previous books). It was nice to see Bobo and Manfred again :)", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TV48YDVTMXX"}}, {"Date": "on August 20, 2014", "Text": "Welcome to Midnight Texas! Love love love all these new and highly interesting characters and the twists and turns  this story takes. Definitely recommend!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3A91JFG676EPA"}}, {"Date": "on August 31, 2014", "Text": "Loved this fun, fresh novel! I had always hoped to hear more about Manfred since the Harper Connelly series, and I was delighted to see him in this book.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHY7XWPBFR8FT"}}, {"Date": "on June 30, 2014", "Text": "I like Bon Temps, LA better, but Midnight, TX has potential", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DQ8EDRUJ443T"}}, {"Date": "on June 24, 2014", "Text": null, "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MY1XS8KPA4UQ"}}, {"Date": "on August 31, 2014", "Text": "Overall a cute story. However, I didn't care for the ending, and the details really dragged on so you thought there was something further.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGSP7A4R8PSUX"}}, {"Date": "on June 1, 2014", "Text": null, "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XWL66DBHJDBK"}}, {"Date": "on July 10, 2014", "Text": "OK.  Quick read. Didn't quite capture me like the Sookie books, but certainly an acceptable mystery and a good start to a new series.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27MBARXZGT6I"}}, {"Date": "on July 7, 2014", "Text": "I have read most of Charlaine's books & this one was a little light on mystery, suspense and drama. But if was a good summer read.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1R3M3PNKSO0JT"}}, {"Date": "on October 19, 2014", "Text": "It took at least half of the book to get into it. I never did figure out if I liked it enough to buy another if it is a series.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A172E124HRVC1I"}}, {"Date": "on August 17, 2014", "Text": "Excellent.  Could sense the authors style as I got into the book.  Would make a good film I reckon as good characters in it.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13G4UE4BBPVOY"}}, {"Date": "on January 11, 2015", "Text": "That was the best storybook I've read since her \"Harper\" books. I'm so happy Manfred got a series. Ready for the next one.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UZJTDWLD5F79"}}, {"Date": "on August 21, 2014", "Text": "Great small town .murder mystery! Charlaine Harris did it again! I have read all of her books and once again she delivers!", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BAAPIE4NKVK"}}, {"Date": "on May 9, 2014", "Text": null, "Helpfulness": 0.4, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACWTHJJQCYG03"}}, {"Date": "on August 31, 2014", "Text": "Enjoyable, with just enough weirdness to keep you reading.  I liked the characters, and look forward to the next book.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2T7LREA5CJ0B8"}}, {"Date": "on July 12, 2014", "Text": "I really enjoyed this book and was amused at how many of the characters I knew from other Charlaine Harris series.  Manfred is from the Grave series, Bobo is from the Shakespeare series, and Arthur Smith is from the Aurora Teagarden series.  I'm sure there are others.  I started reading the book and found it a little slow until I realized that I already knew some of these characters.  I started reading it again and really enjoyed it.", "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HJK87HXIAY1J"}}, {"Date": "on December 23, 2014", "Text": "I guess my  had expectations were higher because I loved True Blood. It is worth the read anyway.  Check it out.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2N2IV0SQ45LM6"}}, {"Date": "on May 18, 2014", "Text": "I first discovered Charlaine Harris only after True Blood came out on TV.  I read her Sookie novels and decided I liked her writing, so I checked out her mysteries and liked those too.  I expected this book to be more like her previous mysteries, but (no spoilers) it went in a different direction altogether, which I also greatly enjoyed.  I'm looking forward to the next two novels which are projected for this series!", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KIKZ86G7A4Y7"}}, {"Date": "on January 5, 2015", "Text": "I really enjoyed the start of this new series by Ms. Harris and I eagerly await the release of the next book.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2B9C3RJYGI5U3"}}, {"Date": "on August 19, 2014", "Text": "I loved her Sookie series, This was a good read, but I was not wrapped up in the characters, still an ok read", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NQZCVYZM3R73"}}, {"Date": "on August 7, 2014", "Text": "Characters were well defined and just plain fun and then sad and the glad and then mysterious a great read", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OOFDR6XABOLC"}}, {"Date": "on December 6, 2014", "Text": "Loved the quirky characters and even quirkier town.  I can't wait to read the next book in this series.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15PZPC15P7OIE"}}, {"Date": "on December 2, 2014", "Text": "I enjoyed this book. It was worth the read. I'm ready for the next book in this series. C.H. Write on", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27XTDULN6JBM1"}}, {"Date": "on July 5, 2014", "Text": "book is very strange.  Not much plot.  A good development of interesting characters but the story is lackluster.  It lacks imagination.  The story never seems to b going anywhere.  It never shows a natural progression.  I couldn't tell an still can't what genre it is.  Not a mystery, or drama or comedy or anything.  Definitely goes into the fiction cetegory of just strange.", "Helpfulness": 0.3333333333333333, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SLLSYIL43IZ9"}}, {"Date": "on August 31, 2014", "Text": "I loved this book. I liked how she brought in characters from other books to tell a great new story.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A371MKP2X17LMH"}}, {"Date": "on May 17, 2014", "Text": "Charlaine Harris has done it again, she created a world that is interesting with great characters that I loved.  Cant wait for the next book.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2X8FB8FEAHERO"}}, {"Date": "on July 14, 2014", "Text": "It was OK.", "Helpfulness": 0.5, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ORDQP51KNHQ7"}}, {"Date": "on June 30, 2014", "Text": null, "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SONSSNS6LBMS"}}, {"Date": "on June 24, 2014", "Text": "Charlene Harris has done it again.  A fun read.  Each character could be someone that you know.  (Maybe you do)  I look forward to more Midnight TX books.", "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WCQNZKPIQFFR"}}, {"Date": "on June 24, 2014", "Text": "Ms. Harris writes like a dream. She makes her charming characters and plots seem so easy she's a joy to read. Her novels are like a souffle made with blood and guts beautifully served by a Southern Belle. You find yourself deeply involved in her worlds and characters even if they are so light they hover off the page and are quickly forgotten. This first book in a new series shows great promise. It goes a long way to help the grief in the end of the Sookie Stackhouse books by offering us new characters and places to love. Ms. Harris consistently delivers the goods for escapism and light reading. Book two in this series, now that everything is established should be even more fun and is eagerly anticipated. I'll follow Ms. Harris wherever she wants to take me.", "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANSYDHKDV11HW"}}, {"Date": "on June 24, 2014", "Text": "Wonderful book, love all Charlaine Harris books.. Read all of the sookie stack house books. Plan on reading many more od her books", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1X86M7EZF0JIN"}}, {"Date": "on June 20, 2014", "Text": null, "Helpfulness": 0.3333333333333333, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JOPXFBICWJBD"}}, {"Date": "on June 14, 2014", "Text": "Midnight Crossroad had me Crossed! I loved Manfred Bernardo in the Harper Connelly books but, this story could have been told without Manfred. Short of his moving in and answering email, he did not add to this story at all, the people in the town of Midnight was the story by themselves. This is not Mrs. Harris best work at making the leading character the focus of merging in for the new storyline. The story was exciting and I enjoy it but, Manfred was not a big part of that  excitement.  I only hope Manfred Bernardo shine more in the next two books because he has a lot to show us if his intro from the Harper Connelly books are true to the hint of his talent at reading of minds.", "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FYX8QYJP61FH"}}, {"Date": "on June 13, 2014", "Text": "This is an interesting start to what is supposed to be trilogy.  Great character plots and love the style of writing.  Can't wait for the next one!", "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CEJ4GA6UWI2Q"}}, {"Date": "on June 12, 2014", "Text": "I'm am glad for new series. this book leaves waiting more about Midnight. Just what is the preacher? I plan to follow the series to find out just what is it about him that makes him so creepy.", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PAG1TVW3NSXZ"}}, {"Date": "on June 12, 2014", "Text": "Oh! I am so happy that Charlaine Harris has started this new series!  I fell in love with the characters immediately and can't wait to see them develop in future books!", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CEKQ24AFMLI4"}}, {"Date": "on June 12, 2014", "Text": "Thank God Charlaine Harris has finally ended the long sad nightmare that the Sookie Stackhouse series became.  I loved those first (fifteen?  whatever) books but it was time to end that bad boy.  And what a way to rebound.  I was almost afraid to read Midnight Crossroad but Ms. Harris delivered, with promises for the future.  Its still her funky paranormal, lightening seared universe with a twist and boy I didn't see this twist coming.  Good mystery that could have happened in any universe, but I am happy that it happened in a Charlaine Harris universe.", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PHCZMAF9CBKX"}}, {"Date": "on June 11, 2014", "Text": "Like all of Charlaine Harris' books, Midnight Crossroad is a gripping story following Manfred Bernardo, a psychic who appeared in the Harper Connolly books and who also knew Lily Bard. Lily made an appearance at Merlottes bar and met Sookie Stackhouse...and now we know we are in the Sookieverse! Midnight is a tiny Texas town where the inhabitants are very different and everyone has secrets. Manfred begins to make the acquaintance of his neighbors. Backgrounds are gradually revealed as Manfred becomes part of the community. I sincerely hope that there are more Midnight books to follow. I have unanswered questions about some of the inhabitants and I want to know more about Manfred!", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2S28805MV8RZZ"}}, {"Date": "on June 11, 2014", "Text": "I liked the characters in this book. There were some plot twists that were surprising and I liked that too. I look forward to the next book in the series.", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VSFSBCPKQVB9"}}, {"Date": "on June 10, 2014", "Text": "I always enjoy Charlaine's books because of the character development and the way you learn about the characters as the story unfolds.  Easy, quick read.", "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3N246RNPOMJJN"}}, {"Date": "on June 10, 2014", "Text": "Harris is simply a good 'mystery story teller' and I love her characters.  I really enjoyed getting to know her new cast of characters and look forward to the rest of the series.  Warning to True Blood ie Sookie Stackhouse & \"Eric/Bill\" fans - not seeing any great romance or sex on the horizon with this series - just a damn fine story.", "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AL1WXGPY6P55"}}, {"Date": "on June 10, 2014", "Text": "Lots of new quirky characters solving a new mystery. I hope we get another story of the 'sorta normal-supernatural' characters of Midnight TX.  This is a fun read.", "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10HGFNEL39R5J"}}, {"Date": "on June 9, 2014", "Text": "I did not read any of the \"Sookie Stackhouse\" books.  I do love True Blood on HBO.  I decided to try this on a whim and turned out I enjoyed it.  The characters are fun and the setting seems unusual enough.  I'd recommend it.", "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30YKD1GC8AYQP"}}, {"Date": "on June 2, 2014", "Text": "I really enjoyed this book.  As someone who has read all of Charlaine Harris's previous books it was so nice to revisit characters from her former series.  I think that the characters were well developed and interesting.  I am looking forward to reading future stories set in Midnight, Texas.", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YQPNRN70PYUT"}}, {"Date": "on May 31, 2014", "Text": null, "Helpfulness": 0.3333333333333333, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A255RT71F8VXRS"}}, {"Date": "on May 30, 2014", "Text": "It doesn't have the same level of craftsmanship as, say, the Harper Connelly series, but it's definitely a good summer's read.", "Helpfulness": 0.3333333333333333, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1C23IM1MP0AOO"}}, {"Date": "on May 27, 2014", "Text": "It seems Harris has begun another \"Sookie Stackhouse\" genre (only a male is the central person), but without the character development - perhaps in the next book there will be more substance as to who these people are that live in Midnight, Texas.  Strange muddle of happenings . . . without knowing who the characters are or their place in this community.  The book left me feeling like I had been plunked down in the middle of weird.  Still not sure I'd like to revisit it.", "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3L9JSTRLTVXG8"}}, {"Date": "on May 23, 2014", "Text": "Interesting book, somewhat creepy, but on the good side. A fascinating cast of characters, and I'm intrigued enough to want to know what will happen next in Midnught, Texas.", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18KRLX4HM33IU"}}, {"Date": "on May 22, 2014", "Text": "Nobody does quirky mystery quite like Charlaine Harris.  Midnight Crossroad introduces you to the residents of Midnight, Texas including psychic Manfred Bernardo (who we met in the Harper Connelly books).  Everybody seems to have their secrets and don’t push to know yours. There are more mysteries than just the town folk and Ms. Harris will have you staying up late to get to the find the answers.", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2E1BQDLHYGTNV"}}, {"Date": "on May 22, 2014", "Text": "Midnight, Texas, is an intriguing place, and it seems to attract intriguing inhabitants.  There are a lot of mysteries here, although the citizens are polite about not prying into one another's business.  Still, hidden things have a way of creeping into the light.  Charlaine Harris has created a town full of interesting characters and given them interesting puzzles to deal with.  I feel I should mention that the story is not told in the first-person point of view used in many of her other books, and this may startle some fans, but I think the varied points of view used here suit this story better.  There will be at least two more stories set in Midnight, and I, for one, look forward to them.", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FWE2OER9WI91"}}, {"Date": "on May 22, 2014", "Text": "I was so involved with Sookie Stackhouse that when Charlaine announced that she was ending the series, I was very sad.  I read the new Midnight Crossroad and can see lots of possibilities for a series just as long as the \"True Blood\" series went.  but I didn't give this book 5 stars because I didn't find anyone in it who I liked as much as I liked Sookie....  But I'm not giving up, I'm sure it will just take time and another book or two for me to love these folks as much as I did the gang in the woods of Louisiana.", "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A317V7V5ZGUZAV"}}, {"Date": "on May 22, 2014", "Text": "I really enjoyed this book. It had familiar faces that had links to Harper and Lily bard. Give it a try", "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5TXZAYX3LO2J"}}, {"Date": "on May 22, 2014", "Text": "Midnight Crossroad is a fun novel.  Even the name is a twist on what to expect.  At the crossroads, Charlaine Harris is bringing together some great characters from multiple series of books and having them meet new characters who are interesting and special in their own right.  I enjoy how the dialog is more mystery oriented and everything is not given away right away how I sometimes felt the Sookie Stackhouse character did.  Again it is a fun read and very entertaining.  Also it is endearing to those who like to find \"Easter Eggs\" within the text though it in no way would exclude anyone who is picking this up as their first Charlaine Harris book.", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3G63NPUZXC3C3"}}, {"Date": "on May 22, 2014", "Text": null, "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A200Z0648YPI6O"}}, {"Date": "on May 22, 2014", "Text": "I have recently discovered all the other characters that this author has created..I love them all. A good, sit down and relax book.", "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WGYXBSVNWSW3"}}, {"Date": "on May 22, 2014", "Text": "All the characters are quirky and fun! Can't wait for the next book! Hurry Charlaine! I can't wait for you to write another book!!", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2E7A75GE1US1T"}}, {"Date": "on May 18, 2014", "Text": "Another great series from Charlain Harris. I loved how she brought together some characters from her other series. She does mystery and the supernatural so well. This book should definitely be on your buy list!", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SRUKK47E9W35"}}, {"Date": "on May 18, 2014", "Text": "Harris delivers with a quirky, lighthearted, but suitably creepy tale centered around a small town and it's oddball inhabitants.  I thoroughly enjoyed this story.", "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16X7WJHR2RS42"}}, {"Date": "on May 17, 2014", "Text": "The first in a trilogy.  Nice setting and good characters.  Would wish for a little more complicated plot.  Will read the sequel when it comes out.", "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23D0R49FVM4NX"}}, {"Date": "on May 16, 2014", "Text": "The first book in the Midnight, Texas series does a good job of establishing the key characters and setting. A familiar character or three (one key to this new set of books) connect this with several of Harris' other series. But not -- at least directly that I see -- with Sookie Stackhouse although clearly the universes overlap with some of the same types of \"supes\". The story itself is more of a mystery cozy with supernatural characters and quirky settings. I actually thought it deserved three-stars as a standalone book; I added the fourth star in anticipation of where the story could go in the future. Let's hope we see these future (short stories, novellas, and books) frequently over the next couple of years. I don't see keeping up with this over a decade+ as with the Southern Vampire series. Bottom line: give it a chance, don't set your expectation too high, and use the time until the next book to chase down Ms Harris's earlier, non-Sookie works to see how this fits in with other stories.", "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RI05C8BVQIWB"}}, {"Date": "on May 9, 2014", "Text": "I am a big fan of Ms Harris and all her books. Sookie Stackhouse is not the only character that Harris got me invested in. I am so glad that her newest series will bring fresh blood to the pages of her novels. This book has a light feel but very interesting characters, living together and creating a community of strange. I will be traveling to Midnight Texas again, as soon as the next book is published.", "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OFIB2JD6ZIXM"}}, {"Date": "on July 28, 2014", "Text": "I loved this story! If you are a Charlaine Harris fan,I don't think you will be disappointed!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SK1T5RKI2OIG"}}, {"Date": "on August 9, 2014", "Text": "I really enjoyed this book. Great writing. I will be buying more Charlaine Harris book.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34OTLJ03WB4L6"}}, {"Date": "on August 8, 2014", "Text": "Charlie does not disappoint in this spinoff series.  I can hardly wait for next book.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KM8YYAJTTPB5"}}, {"Date": "on December 15, 2014", "Text": "Great new series.  I'm really looking forward to the next one in the series.  A++", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3L0OSJ7W85I67"}}, {"Date": "on December 24, 2014", "Text": "I adore this book and I can't wait for the next in this series!! Good read :)", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2V1FF6UM11XZG"}}, {"Date": "on July 15, 2014", "Text": "Charlaine Harris has done it again; can't wait for the next installment.  I got a little frustrated with Sookie Stackhouse as time went on and stopped reading those, but this one is a keeper.  Won't spoil anything for anybody, but if you enjoy this author, read this one soon.", "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LI6097NJKNHY"}}, {"Date": "on April 26, 2014", "Text": null, "Helpfulness": 0.5333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2F7OT4LYELENO"}}, {"Date": "on July 5, 2014", "Text": "These books are just fun to read!! Charlaine Harris has figured out that even a touch of magic is something we all want to have i her books, having magical creature there but not in the forefront of the story was a really fun read. can't wait for the next one.", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2640Z2PE70E8"}}, {"Date": "on September 4, 2014", "Text": "Ok", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1E55UJ3CF4DKY"}}, {"Date": "on May 22, 2014", "Text": "Its always difficult when a favorite series ends. So with some trepidation I opened this book. I was pleasantly surprised. It was fun. I like the characters and can't wait to see what will happen next. While it may not be Sookie, it was still a fun read.", "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5Q1BREY8NLEL"}}, {"Date": "on July 10, 2014", "Text": "love it", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3A64JLH6NRD1O"}}, {"Date": "on July 13, 2014", "Text": "I was very pleased to see a new Charlaine Harris book as I miss Sookie a lot! I enjoyed this book, it's not as good as the Sookie series but it is an enjoyable read. I love how there are always a few quirky characters in Charlaines books.", "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UWDJ5HH6PQQA"}}, {"Date": "on June 5, 2014", "Text": "This was a fun read, and a good start to a new series. The characters were interesting and I enjoyed the town and the people in the town of Midnight. Note that this book is paced in a far more leisurely manner than the Sookie series!", "Helpfulness": 0.3333333333333333, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1II9FXH44RNVU"}}, {"Date": "on July 6, 2014", "Text": "It took me a good 80 pages to really get into this book but once I did I have to say I enjoyed it immensely. I loved all the characters, especially, \"Mr. Snuggly\". I think Charlaine Harris has another winner on her hands.", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9N1YCU3GG1NV"}}, {"Date": "on July 7, 2014", "Text": "Charlaine Harris has done it again - created a \"cast\" of characters that are so fascinating you can't wait to get to know them!  Midnight Crossroad was a great read and I can't wait for the next book to come out!", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GQM1XW344S3M"}}, {"Date": "on December 18, 2014", "Text": "Charlaine Harris is a great writer, I love all her books.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XOLXHL7ZFRLT"}}, {"Date": "on July 14, 2014", "Text": "I was glad to read more about Manfred (I thought he was an interesting character in the Harper books).  Suspension of reality always needed in this type of book, but that's why I like to read.", "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LNNW7P0LERBJ"}}, {"Date": "on January 12, 2015", "Text": "All I can said is....... Wow, Wow and W ow!  Loved it!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11X2ZMBXQ4ZGG"}}, {"Date": "on July 1, 2014", "Text": "I think C.H. did a great job writing this!  She has some awesome new characters and so many new ways to write stories for all of them.  I can't wait to see if there is a second book!", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AVUXDKQ7XA6"}}, {"Date": "on July 7, 2014", "Text": "A great story that brings a minor character from another series to the forefront, while managing to be fresh and new. I devoured this in 2 days! Looking forward to the next one.", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AT2D50PFFQDE5"}}, {"Date": "on July 19, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AM9FOYPMUBHZV"}}, {"Date": "on July 16, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJVDOKO69NPEK"}}, {"Date": "on December 15, 2014", "Text": "Great book but Charlaine's always are.  Thanks", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FUGIZ4EQEI5"}}, {"Date": "on April 30, 2015", "Text": "Charlaine Harris has out done herself again!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37A6J01IZD7SC"}}, {"Date": "on July 7, 2014", "Text": "Can't wait for the second book. I love the characters, especially the taking cat. Leaves you hungry to find out more about Midnight and it's mysteries.", "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NGPYW9C20P59"}}, {"Date": "on June 10, 2014", "Text": "Love the Sookie books. This first book of a new series does not disappoint.  Looking forward to #2 book. Thanks for making it available on Amazon.", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NPNSBBAPUBF8"}}, {"Date": "on July 1, 2014", "Text": "I'm looking forward to the next book.  Interesting characters. Easy to read. I like the small town feeling.  I've really missed Charlaine Harris.", "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NRW311DSJGYK"}}, {"Date": "on June 14, 2014", "Text": "I have read many of her series. She takes a character from the Harper books and writes on him. I loved this book and would highly recommend it.", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21HU0JZ03S0LD"}}, {"Date": "on June 19, 2014", "Text": null, "Helpfulness": 0.4, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AI2GHIN4KLAVH"}}, {"Date": "on June 12, 2014", "Text": "Loved the book, the characters, the hints of more to come.  Thought the ending a little weak, but the next installment might clear that up.", "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16Y12DR1FJQY2"}}, {"Date": "on April 6, 2015", "Text": "I am looking forward to the second book.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2L7X1MBRSKOMV"}}, {"Date": "on July 12, 2014", "Text": "I love all of ms. Harris's books and Midnight Texas has captured my heart!!! Can't wait for the next book in this wonderful series!!", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TPWFVJMY9Q9D"}}, {"Date": "on February 16, 2015", "Text": "Super with a great cast of characters", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TU2W5K6XR0DA"}}, {"Date": "on April 26, 2014", "Text": null, "Helpfulness": 0.5294117647058824, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YGWL41MSMYBG"}}, {"Date": "on July 13, 2014", "Text": "Loving it so far! Almost done!!  I almost like it more than the Sookie books!! Love the quirky people and the town!", "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20E4F4WK1WVK3"}}, {"Date": "on May 13, 2014", "Text": "What a delightful collection of characters located in a small town in Texas.  When Manfred rents the house next to the pawn store he realizes that the employees there are a little different and the woman across the street can freeze people like statues.  Some similar characters to her Snookie series but I'm looking forward to learning more about the folks of Midnight Texas.", "Helpfulness": 0.4, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NANETIZT0MEO"}}, {"Date": "on June 12, 2014", "Text": "An enjoyable read, made me want to read more of her books. I am looking forward to the next book in the series.", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VP4X9258NWPE"}}, {"Date": "on June 18, 2014", "Text": "I whole group of new characters, well developed and totally unique.  The author has pulled me in to the world of Midnight ,Texas and I want to know more about these loners who have settled in this off the beaten path place. kudos to Charlaine Harris", "Helpfulness": 0.4, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2C4YMVIL86N38"}}, {"Date": "on June 16, 2014", "Text": null, "Helpfulness": 0.4, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UWP1ZFZCKFSQ"}}, {"Date": "on June 15, 2014", "Text": "I have been anxiously awaiting this book, needing something to fill the void left by Sookie and the Bon Ton crew.  It starts out with a lot of good character development, but it is a slow start.  She gives very subtle hints as to the true nature of some of the more quirky residents of Midnight, but it's a long time for the pay off.  The ending was unexpected, and I love the fact that I hadn't figured it out by chapter 5.  I would definitely recommend this book, and I will purchase the next.  Well written, without a lot of fluff to fill the pages.", "Helpfulness": 0.4, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2J0RRLUUD1NPU"}}, {"Date": "on June 2, 2014", "Text": null, "Helpfulness": 0.4, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D2TRTHESIMMH"}}, {"Date": "on May 26, 2014", "Text": "I can't wait for the next book in this series. Every bit as creepy & funny as the Sookie books.", "Helpfulness": 0.4, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VY5D2OUN3PMT"}}, {"Date": "on May 20, 2014", "Text": "I read the previous review of this book and still decided to purchase it and I am glad that I did. I enjoyed this book and the \"new\" characters. I have read and enjoyed the other series that this author has written, such as the Aurora Teagarden series, the Harper Connelly Series, and the Lily Bard Mysteries and was pleased to realize that several of the characters in this new series are characters that had roles in the other series that I listed. I found this new book to be an enjoyable read and I am looking forward to the next book with these characters.", "Helpfulness": 0.4, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2D1XC9XYUII4X"}}, {"Date": "on May 19, 2014", "Text": "When I saw Charlaine Harris had a new book out, I was anxious. Would it be a good as the grave books, as good as the Sookie Stackhouse books? And Yes it was, a interesting book filled with interesting people, I can wait to read more about the good people of Midnight!", "Helpfulness": 0.4, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A173KL7BMUO8BQ"}}, {"Date": "on May 19, 2014", "Text": "I have been a fan of charlaine for years and she didn't disappoint. I feel connected with the people of midnight, as I do with sookie,I guess that's the best review I could ever give", "Helpfulness": 0.4, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GD20KF89SQEN"}}, {"Date": "on May 14, 2014", "Text": "Weird town, weird people and a bit mysterious. Great book. Roped me in. The ending caught me off guard completely.  Looking forward to the next one.", "Helpfulness": 0.4, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1N7VGFNFKCD4E"}}, {"Date": "on May 14, 2014", "Text": "I am a big fan and long time reader of all of Ms. Harris's books and I am happy to say that I could not put this book down. There are so many surprises and guest appearances by characters from other books. I can't think of a better book to take to the beach or pool.", "Helpfulness": 0.4, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7AQJLODR7PNI"}}, {"Date": "on May 13, 2014", "Text": "Enjoyed the characters and the quirkiness of Midnight,Texas. Will buy the next book in the series. Not Sookie but enjoyable.", "Helpfulness": 0.4, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JBNVK4QG5YXV"}}, {"Date": "on July 13, 2014", "Text": "I can say another hit as usually. What a style, what a mind to create stories that captures her writers.", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1133N27PELNIM"}}, {"Date": "on August 28, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AQ7NZKYI10IS"}}, {"Date": "on April 22, 2015", "Text": "Ms Harris is great as usual", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUHN8C6TTY7EI"}}, {"Date": "on July 17, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MZ8TXGPG607T"}}, {"Date": "on February 16, 2015", "Text": "Charlaine Harris is back!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22YKUCGLGFJ9O"}}, {"Date": "on July 24, 2014", "Text": "I am a huge fan of the Lily Bard and Harper Connelly series and less so of the Sookie Stackhouse series.  I think that is why I loved this book. It can stand alone but you got to see old friends. The mystery slowly developed and there was no obvious - you saw it coming a mile away - solution, but it was solved in this book.  Then hours later you realize there were little mysteries hidden there that you missed.  Ones that will cause you to go back and reread the story - multiple times. Everyone has secrets but we didn't see most of them.... Where did the bodies go?  Where were the wings put?  What is/are Madonna and Teacher's secret(s)?  What is the reason she highlighted the juxtaposition of the antique store with a nail salon run by a gay couple?  What kind of harmful spells has she sold?  What is up with Rev?", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18P55KFS6AZFC"}}, {"Date": "on August 2, 2014", "Text": "Quick simple interesting", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACZJZCB793PQY"}}, {"Date": "on July 24, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3Q0LWWGXBCMZJ"}}, {"Date": "on July 14, 2014", "Text": "Another great story by Charlaine. I'm looking forward to more to this series!", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PCAQJ6A0T356"}}, {"Date": "on August 22, 2014", "Text": "I was very sorry that Charlaine Harris ended her Sookie Stackhouse series.  Her last book in that series \"After Dead\"  seemed almost a throwaway, a sop to her fans to tie up loose ends.  I was very disappointed in the format and the book.  I thought twice about buying \"MIdnight CrossRoads\", Because I have always enjoyed her writing, I decided give this series a try and am very happy I did.  It has a very odd grouping of characters, most of whom I enjoyed. I started reading it one evening, and it was finished two days later because I was so intrigued by the town of Midnight and its inhabitants and wanted to find out what happened to them. I am looking forward to the next one in the series.  I hope she will be doing more in her \"Grave\" series books also.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OKUAFDROT5JI"}}, {"Date": "on July 7, 2014", "Text": "Loved it!  Great characters!  Totally kept me guessing until the end.", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33COFN8LX4YG"}}, {"Date": "on February 20, 2015", "Text": "Just love her stories", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JUQR6AMRX3WT"}}, {"Date": "on April 23, 2014", "Text": "If you only know Charlaine Harris from the Sookie Stackhouse books (a/k/a True Blood), you should definitely pick up her four-book series of Harper Connelly mysteries.  Then check out Midnight Crossroad, the first in a new series by Ms. Harris.  At times I feel that I am reading a screenplay, with stage directions and casting advice, so maybe she hopes for this series to go to TV like True Blood.  Nevertheless, it makes the reading very visual!  One of the primary characters in the tiny and strange little town of Midnight is Manfred Bernardo, whom I met, along with his psychic grandma, in one of the Harper Connelly mysteries.  I enjoyed every page of Midnight Crossroad.", "Helpfulness": 0.5454545454545454, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BVNVJOFXGZUB"}}, {"Date": "on July 13, 2014", "Text": "Love Charlaine Harris's work-enjoyed this book a lot. Recommend!", "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34AHUYNW49787"}}, {"Date": "on May 7, 2014", "Text": "Although this book starts a little slow, introducing characters, keep reading!  It becomes an interesting and enjoyable read.  Charlaine Harris can WRITE.  I read it in a day and a half, but I didn't want this book to end.  Spoiler Alert: One of my favorite things was that she uses some characters from other series that she has written, as characters in this book. Like finding Easter eggs, BoBo (from the Lily Bard Mysteries set in Shakespeare) and Manfred (from the Harper Connelly Mysteries) are already known to readers of Charlaine's other multiple series. This is added fun. My recommendation is: READ IT!", "Helpfulness": 0.42857142857142855, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3N7KY1PBMF880"}}, {"Date": "on July 24, 2014", "Text": "Charlaine Harris's wildly popular Sookie Stackhouse / Southern vampire series has come to a close, so Ms. Harris has unveiled a new and exciting set of characters in MIDNIGHT CROSSROAD. The quirky individuals of Midnight, Texas, all have their secrets, and I won't spoil a thing by giving details away. Suffice to say that newcomer Manfred has found a spiritual, as well as a physical, home for his psychic talents. There's a murder to solve and an arms-seeking extremist to unveil. There are townsfolk to shield and those to rely on. And don't forget the talents of a certain delightfully grumpy cat!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MNLMQSN3GNC8"}}, {"Date": "on August 10, 2014", "Text": "This is the best book I have read this year!  I did not think I would like this story even though I have been a Charlaine Harris fan for years.  Was I surprised.  I won't describe the story line as others have already done that. Ms. Harris has spent the time to really develop her characters and they are weird but delightful - even the scary ones.  The ending was a total surprise even though I am a mystery buff and probably read 100 or more mysteries a year.  Why everyone does not love this book is a mystery to me.  This series will be very popular and is appropriate even for teenagers.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A352PZ9BSFX4CV"}}, {"Date": "on May 22, 2014", "Text": null, "Helpfulness": 0.25, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XNOB1T796Y6B"}}, {"Date": "on May 22, 2014", "Text": null, "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I2O9Y3X3HXLS"}}, {"Date": "on May 12, 2014", "Text": null, "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1E4HG8UI2JTZY"}}, {"Date": "on April 27, 2015", "Text": "Excellent read!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2J2735D2KWPV1"}}, {"Date": "on July 27, 2014", "Text": "This book was typica Charlaine Harris fare - enjoyable, fun, easy read but slightly predictable if you have read her other series. It was great to see her writing from a viewpoint of a male character ( and a likable one at that ) . I enjoyed the different characters intermingled with some crossover favorites from other series. I am looking forward to the next book in the series so that she can continue to develop some of the backstories of her mysterious characters.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NHL42NUY2QMJ"}}, {"Date": "on June 19, 2014", "Text": "I did enjoy this book. It was different from Sookie but I think that is why I liked it. I hope the second book comes out soon.", "Helpfulness": 0.4, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YADZN6MHA80"}}, {"Date": "on May 13, 2014", "Text": "The first few pages didn't grab me, but by the third chapter I started to get the story line. By the end I didn't want it to finish! Thanks again Charlaine! Loved the characters, they were quirky and interesting.", "Helpfulness": 0.42857142857142855, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QG9W8EBE1GF7"}}, {"Date": "on May 10, 2014", "Text": "As usual, Charlaine Harris does not disappoint with something completely unique and creative. What I loved most about her writing style in previous books is the in depth character development and the way she sets a scene.  In this book, the characters are complex and all have secrets, and you are quite sure you don't know them all.  There is even a twist on the mystery that I didn't see coming.  I can't wait for the next book in the series!", "Helpfulness": 0.42857142857142855, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3E42US6U1CK4W"}}, {"Date": "on May 10, 2014", "Text": "I have read all of Charlaine Harris' novels and am so thrilled to meet new characters while greeting familiar faces. This book is the perfect kickoff to a new series that wraps a tidy bow on all the series I have come to love.", "Helpfulness": 0.42857142857142855, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LDGSDMUQ5VXS"}}, {"Date": "on May 9, 2014", "Text": null, "Helpfulness": 0.42857142857142855, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SD8Y9Q1KESLB"}}, {"Date": "on May 9, 2014", "Text": "Loved how this tied in to the lily bard series. Can't wait for the next one! Or any new books from any of Charmaine's series!", "Helpfulness": 0.42857142857142855, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2I0F3YMMDSTDQ"}}, {"Date": "on July 12, 2014", "Text": "I have to say it was not as good as I had hoped it would be... but then again I rate everything on the greatness of the Southern Vampire/Sookie Stackhouse series. I think it promises to be a good series... ending surprised me which is always a good thing. I just had trouble 'liking' the characters right away. I will look forward to the next edition and see where we go from there.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SN43OGFTBWDN"}}, {"Date": "on May 7, 2014", "Text": "I'm only half way through the book and I love the series already.  Don't know why I didn't connect Manfred's name when I first ordered it but I'm very glad to see him in a story of his own.  The book so far is outstanding and I'm reading it too fast.  Hopefully the next books will come out sooner rather than later", "Helpfulness": 0.42857142857142855, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36ECVXRJKQQGA"}}, {"Date": "on June 13, 2014", "Text": "I'm a fan of most of Charlaine Harris' books and not just the Sookie Stackhouse (True Blood) series.  This one lacked her usual humor and the voice seemed off.  Got off to a slow start and didn't really pick up steam.  I'll read the next one because I've liked the way she has written so I'm willing to give it a chance.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OW5UG0FA3UTO"}}, {"Date": "on August 4, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EOGR0HXRFFMH"}}, {"Date": "on July 25, 2014", "Text": "What can I say? I liked the town; I liked the people. I sped through the book and enjoyed all of it. It was a pleasant surprise, as I wasn't sure I'd like it. (Some of the Sookie Stackhouse books were just too grim for me.) But I really like Midnight, and hope to visit it again. Looking forward to knowing the people better.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QOJ2M69D718I"}}, {"Date": "on March 2, 2015", "Text": "Excellent!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TG7IQSSCDRE7"}}, {"Date": "on August 3, 2014", "Text": "A wonderful  journey to another reality: Charlalne Harris' reality, where  mythical creatures exist and anything can happen. It's also a murder Mystery. The mixed genre approach, as well as the interesting characters, both human and supernatural, make this book difficult to put down  until you come to the very end.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JCB5QAOJTG1T"}}, {"Date": "on July 12, 2014", "Text": "Can't wait for the next book", "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1U7CDZUZPFP59"}}, {"Date": "on February 20, 2015", "Text": "Good read", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25U29H5EHAGFV"}}, {"Date": "on December 20, 2014", "Text": "loved it!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17BKQC4M62W3Y"}}, {"Date": "on June 1, 2014", "Text": "This is not a Sookie Stackhouse tale filled with shape-shifters, vampires, fairies and other sinister beings.  This story has it's own cast of mysterious, interesting and intriguing characters and Ms. Harris's style of writing pulls you right in.  And unlike the Sookie series the story is told from several points of view which added to it's interest for me.  I enjoyed this story enormously and wish the second book were coming out sooner than next year.  It was nice that Ms. Harris references Lily Bard from the Shakespeare series (which I thought could have gone on longer than 5 volumes).  And, of course, we just met Manfred Bernardo the psychic in a short story in Games Creatures Play, the annual compilation edited by Toni L. P. Kelner and Ms. Harris.  Welcome to Midnight; an eerie little town.", "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7TB3TX2GNCBQ"}}, {"Date": "on July 8, 2014", "Text": "Loved it and the twist..", "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARDGHRX5JWN6Z"}}, {"Date": "on April 27, 2014", "Text": null, "Helpfulness": 0.45454545454545453, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6XR7Y415RPD0"}}, {"Date": "on July 21, 2014", "Text": "I like a mystery that can stand alone, even if it refers to characters from other books.  This is a great little mystery in a fun town I'd like to visit again.  A strange little nexus of characters that go bump in the night, and people who say - Oh, OK!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GBUNPCTCPJCD"}}, {"Date": "on May 15, 2014", "Text": null, "Helpfulness": 0.25, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CW8OUDH7M079"}}, {"Date": "on August 28, 2014", "Text": "I love Charlaine! I recommend reading the Harper Connelly, Lily Bard and Aurora Teagarden series beforehand.  You don't have to, but a lot of the characters overlap and gather together here in Midnight, Texas.  Easy, fun read.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UX6MWTXVWONJ"}}, {"Date": "on February 16, 2015", "Text": "Perfect", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3U6S61IYIQ517"}}, {"Date": "on December 17, 2014", "Text": "love it", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23AJ8DDX2ZYNI"}}, {"Date": "on August 11, 2014", "Text": "Enjoyed and even laughed out loud at the cat! Would like a series on Manfred as he further explores and strengthen s his ability. Also like the Leeds/Bard connections. Those 2 keep popping up......more from them, too?????", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ITMQOXT40VVG"}}, {"Date": "on August 5, 2014", "Text": "After the final Sookie Stackhouse book I was not holding out high hopes for this book. I was pleasantly surprised when I was quickly pulled into the story. I am looking forward to the next installment of this series.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3H3VTHA3JLMQX"}}, {"Date": "on May 29, 2014", "Text": null, "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33C08C20U6DJ0"}}, {"Date": "on July 25, 2014", "Text": "I was a huge Sookie Stackhouse fan and now with the new Midnight Crossroad I believe my fan base will grow. Love how Manfred is weaved into the new environment. Great book. Can't wait for the next edition.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MHKS3QAUPKGR"}}, {"Date": "on May 13, 2014", "Text": "I read quite a bit, and I have been aware of the author for a while, but I just haven't been able to get around to her (so many books, so little time)!  Thought this would be a good time to give her a try, since this is a new series.  Started it yesterday afternoon, finished it up a little after (what else?) midnight.  Held my interest from the very beginning.  More than one review/blurb has called this book a mash-up of different genres, and that's a good way of describing it, in a good way of course.  There is a mystery, and a supernatural element throughout, but one does not overpower the other, there is a balance between the two.  And you have the life in a small town aspect, out in the Texas boonies (I lived in south Texas for five years back in the 1980's, so I really enjoyed the setting).  There is a very interesting cast of characters, which I think she develops well.  All in all, I enjoyed the heck out of this book.  Oh, and one last thought.  I believe that this has been advertised as being the first in a series of three, and I hope that is the case.  However, this book can stand alone, as the story is actually wrapped up at the end.  Which I appreciated, especially after enjoying it so much as I got deeper and deeper into the story, I wasn't looking forward to having a cliffhanger ending.  With this new setting and cast of characters, the next books can take off in any number of directions.  I'm already looking forward to the next book in the series.  Midnight, Texas rocks!", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1588Q12R88NYM"}}, {"Date": "on July 19, 2014", "Text": "Great collection of characters--several from pervious Charlaine Harris series!!-- and lots of mystery and spookiness. Can't wait to read the next Midnight, Texas book", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BCW1RA7VLH3"}}, {"Date": "on August 29, 2014", "Text": "I always enjoy Charlaine Harris's books, and was pleasantly surprised to find the characters in this new series were drawn from various other series written by her.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4LRF89YAIMMG"}}, {"Date": "on June 18, 2014", "Text": null, "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28OB1QLXN5BM6"}}, {"Date": "on June 9, 2014", "Text": "I see from the reviews of Midnight Crossroad that the Charlaine Harris \"Hate-Mail Brigade\" has taken the field yet again. Actually Midnight Crossroad is a hoot. I enjoyed it and found myself smiling at the author's clever twists and turns in the plot. Some characters were familiar and welcome in a new location.  Fiji is a delightful character and Lem is just hugable. I was surprised by the guilty party: didn't see that one coming at all. Beware the negative reviews of Harris's work. Some readers feel that buying an author's books somehow gives them ownership over the author's work and decisions, a bizarre concept. In this case, they seem outraged by how Harris ended the Sookie Stackhouse series. Personally, after watching two painfully obnoxious episodes of HBO's True Blood, I can only imagine how Harris, a true Southern lady, must have felt.  Had I been the author, I would have kicked the Stackhouse series into the back 40 as quickly as possible in response to that miserable HBO series.", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IHTJMNHJD1CL"}}, {"Date": "on June 24, 2014", "Text": "Quite a change from the Sookie Stackhouse mysteries! I enjoyed every page! The town of Midnight and it's residents have hooked. Can't wait for the next book!", "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APLHO27IO57BP"}}, {"Date": "on June 24, 2014", "Text": "Thought at first that the book was too odd, and that I wouldn't like it. Kept reading and I was hooked. Very interesting and creative story. Enjoyed it very much", "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Q223IAZH4MBL"}}, {"Date": "on June 22, 2014", "Text": "I liked it. Weird and quirky, just like her other books. The characters were very interesting and I couldn't wait to see what trouble would find them next.", "Helpfulness": 0.25, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IUNP6T5MOT4G"}}, {"Date": "on June 22, 2014", "Text": "I've enjoyed all of Charlaine Harris' mystery series through the years. I loved having Bobo Winthrop from the Lily Bard books, Manfred Bernardo from the Harper Connelly series, and Arthur Smith from the Aurora Teagarden series in the same book. These were all interesting characters and it was like revisiting old friends", "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A274JWQTZE4ZI7"}}, {"Date": "on June 22, 2014", "Text": "I looked forward to reading Charlaine Harris' new book and I was not disappointed.  Her characters are great and it kept my interest in gear for every page.", "Helpfulness": 0.25, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12BEN555C7C2V"}}, {"Date": "on June 22, 2014", "Text": "Another page turner from Charlaine.  A marvelous cast of new off beat characters that you will love, in addition to some old friends.  I will be looking forward to the next adventure in Midnight, Texas.", "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KEIU4A9TXA90"}}, {"Date": "on June 22, 2014", "Text": "So far, I like it. It took some time to get into the story but by the end I was loving the story line and the characters as well. Looking forward to the next one!", "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OVBRVZ8UFJ8G"}}, {"Date": "on June 21, 2014", "Text": null, "Helpfulness": 0.25, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3A6GXILVT9JNW"}}, {"Date": "on June 20, 2014", "Text": null, "Helpfulness": 0.25, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A130S2JFDYJ9RD"}}, {"Date": "on June 17, 2014", "Text": "If you are looking for Sookie Stackhouse then this book is not for you. However, if you have read other series by Charlaine Harris you will appreciate this book. We still have some of the supernatural characters that inhabit the other series along with some quirky and funny characters thrown in for good measure. I hope she continues this series.", "Helpfulness": 0.25, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GC4QIRVB7Z32"}}, {"Date": "on June 17, 2014", "Text": "Although it was slow starting, this wonderful world of Midnight, Texas, grabs you and gives you characters you learn more and more about. See if you recognize,all the inside jokes Charliane sprinkles throughout the story. I would give this book 5 stars but for the slow start.", "Helpfulness": 0.25, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UAI18LJVRQ3X"}}, {"Date": "on June 17, 2014", "Text": "I really enjoyed this book and look forward to the next installment. Fun, quirky characters, all with secrets yet to be discovered. This is not deep literature folks, but it is a fun read.", "Helpfulness": 0.25, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LVA14UJX07IG"}}, {"Date": "on June 16, 2014", "Text": "Midnight Crossroad is the first book in the Midnight Texas trilogy by popular American author, Charlaine Harris. Midnight, Texas looks like a pretty standard dried-up western town, with lots of vacant buildings and few full-time inhabitants. The people who do live there, as new resident, psychic Manfred Bernardo soon discovers, are a bit unusual, although most are friendly and helpful. His landlord, Bobo Winthrop runs Midnight Pawn during the day; at night his basement tenants, the chilling Lemuel Bridger and the beautiful and very capable Olivia Charity take care of the business. Fiji Cavanaugh, self-proclaimed witch, runs The Inquiring Mind in a cottage left to her by her Great Aunt Mildred, along with her unusual cat, Mr Snuggles. The reclusive Reverend Emilio Sheehan looks after the Wedding Chapel and Pet Cemetery. Madonna Reed cooks wonderful meals at the Home Cookin diner. The aptly named Joe Strong runs the Antique Gallery and Nail Salon with his partner Chuy Villegas. Shawn Lovell runs the busiest concern in town, the Gas N Go, while keeping a tight rein on his pretty daughter, Creek and handful of a son, Connor. Not long after Manfred’s arrival, the body of Bobo’s missing girlfriend is discovered, and suspicion initially falls on Bobo. A pair of strangers also threatens the peace of the town, and Midnight’s residents take steps to protect their own. A diligent sheriff from nearby Davy, Arthur Smith is determined to flush out the killer. After a somewhat slow start as Harris sets the scene, the pace picks up and this novel is as intriguing and enjoyable as Harris’s other short series: Aurora Teagarden, Lily Bard and Harper Connelly. Fans of those series will recognise Bobo from Shakespeare’s Champion, Manfred from the Harper Connelly series, and Sheriff Arthur Smith from the Aurora Teagarden series. Harris peoples this series with interesting characters, her dialogue is witty and sharp, and the plot includes a vampire, white supremacists, gays, kidnapping, Halloween traditions, arson and a truly shocking climax. Readers who enjoy this instalment will look forward to the next book in the trilogy.", "Helpfulness": 0.25, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QZVW56O4WSBT"}}, {"Date": "on June 14, 2014", "Text": "I really enjoyed Ms. Harris' latest, and I think the unfavorable comparisons to the Sookie Stackhouse series are unfair. Was this the action-packed, edge-of-your-seat-er that that last few Stackhouse books were? No. But it couldn't be. She had a lot of years and a lot of books to establish those characters and that universe - by the end, it was easy to jump right into the action, because all the introductory stuff was done 5 or 10 books before. We don't know who the people of Midnight, Texas are yet; that is what this book is for: to introduce these characters and this new world - or new segment of her other worlds, if you prefer - to provide a jumping-off point for future stories. By the end of the book, I genuinely cared about and was curious about these people, and I'm really looking forward to finding out more about them over the next few years. Here's hoping she's already working on #2!", "Helpfulness": 0.25, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37SFKWVNJWZJM"}}, {"Date": "on June 14, 2014", "Text": "Really liked it, quick easy read and would like to read a sequel l. Not as great as sookie though", "Helpfulness": 0.25, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25X9W6F9C6KRL"}}, {"Date": "on June 14, 2014", "Text": null, "Helpfulness": 0.25, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UBH7H55A1ZNT"}}, {"Date": "on June 12, 2014", "Text": "Loved the characters, the story and the town! Another great book of one of my favorite authors. I can't wait to know more", "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29LDUSC86VWUV"}}, {"Date": "on June 9, 2014", "Text": "Midnight Crossing revolves around a group of people living in a small town and how there lives intertwine over the period of a few weeks. I loved it. It is very much in the style of CH's other mystery books, The Aura Teagarten Mysteries and the Lilly Board books. In fact one of the charactors in this book is from Lillys series. He moved to the town at the end of the last Bard adventure. There is not a huge amount of action or anything really in these books. It is all about the relationships of the characters to each other and the landscape. When I finished this book I missed the people and their odd dynamic in my life. This will be a great series.", "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AM2J2JJOV8F0L"}}, {"Date": "on June 8, 2014", "Text": "You know right from the start that things are not what they seem in this small town. Made me want to move to Midnight.", "Helpfulness": 0.25, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33OQCYJAYPUML"}}, {"Date": "on June 8, 2014", "Text": "likable characters and easy to read story keep's things moving along. a twist or two that you don't expect make it worth reading.", "Helpfulness": 0.25, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AX4JKFGGKQ898"}}, {"Date": "on June 8, 2014", "Text": "Having read all of Charlaine' s books it was fun to see characters from her other series.  Good plot line with a lot of room to build on.", "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TIRS7AIPSVXQ"}}, {"Date": "on June 7, 2014", "Text": "Loved the characters and the setting for story.  Vivid descriptions puts you there,  would have liked to find out more about Manfred and his \"gift\".", "Helpfulness": 0.25, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHJTX98U4M6BA"}}, {"Date": "on June 4, 2014", "Text": "This is very small town with very big secrets. I enjoyed reading this book. A small town full of magic and magical creatures was a fun read. I will be following this trilogy and can't wait for the next installment. The mystery keeps you guessing through the book. I was completely surprised and had was totally unexpected.", "Helpfulness": 0.25, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MFE8R835VO0I"}}, {"Date": "on June 4, 2014", "Text": "Being a college student who has a lot of other \"activities\" I could be taking part of instead of reading, I have to say this book took hold of my relatively short attention span and held me in until the very last page. I feel that anyone who picks up this book will enjoy it immensely. Harris takes a unique approach to mythological creatures that have been favorites of all for generations (i.e vampires, witches etc.). You won't be disappointed, I highly recommend it. It's a book that if a movie was made, that followed the sequence of events and the script closely, it would instantly become one of my favorites", "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CUHHR55S3PB5"}}, {"Date": "on June 3, 2014", "Text": "OK, there were alot of characters thrown at me in just the first few pages but they grew on me.  By the end, I was not ready to leave the tiny hamlet of Midnight Crossing because I was pretty sure something noteworthy would be happening while I was waiting for my next book.  Charlaine Harris has the story telling gift of making me feel as if I actually might know her characters - even the most outlandish of them. I got a little tired of the Sooky crowd, after a bit, but I loved every last moment of the Harper Connelly series so, I was glad a friend of Harpers had shown up in this book.", "Helpfulness": 0.25, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MAYGVUVEUS2"}}, {"Date": "on June 2, 2014", "Text": "I liked that not all secrets got revealed.  Some moved the story along, some kept till the end, others were only hinted at, and at least one will hopefully reveal itself in the next book.  Cause there better be a next book! Liked seeing into the thoughts of the main characters with all their flaws open to us, just the way we think about ourselves, not hiding our foibles.", "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38YUOGJATOQGE"}}, {"Date": "on June 2, 2014", "Text": "Once again Charlaine Harris is able to develop characters which I found engaging and interesting. I love the depth of her characters and felt as though I knew them.", "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A380N6BYTFH1WI"}}, {"Date": "on June 1, 2014", "Text": "Enjoyed this book all the way around!  Loved that it was set in Texas, all of the interesting characters, including Mr. Snuggles.  Can't wait to read the next book in the series.  I'm looking forward to finding out more about the residents of Midnight, Texas!", "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EE7Y30SXSYUO"}}, {"Date": "on June 1, 2014", "Text": "I enjoyed all the characters. I hope there is more to come now that the Sookie Stackhouse series is over.", "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24CJOTMNEE0LC"}}, {"Date": "on May 31, 2014", "Text": "Charlaine Harris has done it again.  She has created a community of people who happen to have eccentricities.  I am exited about future books in this series.  Well done!", "Helpfulness": 0.25, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BPF792FF5UIG"}}, {"Date": "on May 30, 2014", "Text": "I was a big fan of the Sookie Stackhouse mysteries. And Harris has not lost her touch. The reader does enter the \"minds\" of more characters whereas with the True Blood books you just had Sookie as the clear protagonist. This book proposes a small community as the protagonist. A fun read, light but captivating with a couple of fun surprises.", "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ES47IMO0WH1P"}}, {"Date": "on May 29, 2014", "Text": "At times, the characters were confusing. The story's plot, however, was good. I can see potential if these characters and their relationships are developed.", "Helpfulness": 0.25, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GDDAGJJJMX0X"}}, {"Date": "on May 29, 2014", "Text": "Hooray for Charlaine Harris!  She has once again created a community where the bazaar and supernatural become family. I certainly pray there will many more to follow. I have got to get to know these people better.", "Helpfulness": 0.25, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A837W47HEUZDY"}}, {"Date": "on May 29, 2014", "Text": "Charlaine Harris has another winning series.  Fascinating characters.  A new twist on small town living.  Where will she take us next with these characters?", "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALBYFPN0TBHFT"}}, {"Date": "on May 29, 2014", "Text": "Having read most everything Charlaine Harris has written, I was concerned about an ensemble book featuring also-rans from her pre-Sookie series. However, I always liked Manfred Bernardo (from the Harper Connolly series) and certainly thought Bobo Winthrop (Lily Bard series) was a character who could stand to be fleshed out, so I gave it a try and I'm glad I did. I'll pick up the next book in this series when it comes out. It's nice to see Bobo all grown up (minor gripe: while it's perfectly normal for Southern men in small towns to have weird names in their hometown - my grandfather, Davis Bruce, was known as Doodle-Bug his whole life to his family - when they move, especially if they are trying to leave their past behind, they usually start using a grown-up version of their name. I hear there's an Aurora Teagarden crossover as well, but since that's the \"most\" in \"most everything,\" (the series bored me after awhile), but I can't say who. That said, this book reminded me more of her earlier books, especially the Lily Bard series, and the last few Sookie books, where character and viewpoint shifts and the plot is in the interactions and small doings of a little Southern town, and not so much wild vampire sex and life-or-death supernatural politics. If you enjoy cozy mysteries with a drop of the supernatural, you'll like this. If you picked up the Sookie series because you have read every (repetitive and badly written) book Laurell K Hamilton has published and you wanted more vampire sex, you will hate this book. Like most cozies, the murder (off-screen and without detail to a disagreeable character) is not a central focus, and is simply there to provide a reason for character interaction. This book is more \"Aunt Dimity\" in Texas and less Anita Blake. Thank God.", "Helpfulness": 0.25, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AM79QH1TAC449"}}, {"Date": "on May 27, 2014", "Text": "One of Ms. Harris's best efforts to date.  This group of characters has the potential to be as entertaining as the \"Sookie\" book series.", "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1E5B5TXFXC1W6"}}, {"Date": "on May 26, 2014", "Text": "She has written another spell binding story of just weird people. Her stories keep you hanging on chapter after chapter. I couldn't put it down until I finished it!", "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XBXI3LV71MA4"}}, {"Date": "on May 26, 2014", "Text": "Another winner from Charlaine Harris.  This time the story is set in a small town called Midnight, Texas.  Manfred Bernardo has moved here following the death of his grandmother. What he finds is a very odd group of people.  Wonderful story and the characters keep you enthralled.", "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GQ2UI5BKCCRD"}}, {"Date": "on May 25, 2014", "Text": "I love it Charlaine  Harris at her best. I could not put it down. I planed on it lasting me threw a road trip but read it all cover to cover. She always surprises me and know how to make you think and lol at the same time. Thumbs up for this one. :D", "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1X244G3BO3KZ5"}}, {"Date": "on May 25, 2014", "Text": "Charlaine Harris writes light, otherworldly mysteries that are good for those times when you want to be distracted and entertained, but not depressed. Midnight has a collection of oddball characters. I especially like the cat.", "Helpfulness": 0.25, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RIGC6OUSKQ8R"}}, {"Date": "on May 25, 2014", "Text": "Loved the characters and story. Really liked the tie ins to the other books!  Quick and interesting story. Hope she does more for a series.", "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AX2GW9N02AXJT"}}, {"Date": "on May 25, 2014", "Text": "I really enjoy reading Midnight Crossroad.  I bought the book at a book signing and looked forward to reading it.  I love the cast of characters in the book.  While they did not all seem to fit in Midnight, Texas, I feel that was on purpose, to show how different each character is.  Midnight seems to be a place for misfits and this book brought each character to Midnight and brought friendship to people that are very different from each other.", "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2N8E3XNVFI79A"}}, {"Date": "on May 24, 2014", "Text": "Finally! I was so disappointed in the last couple of Sookie books (they seemed rushed and not as entertaining), Charlaine Harris has returned to the style I've enjoyed from her. Witty, creative, enjoyable; she blends the supernatural in with the natural in a way that is... well.... um.... NATURAL. There's no \"wow\" factor, it's just existence. I appreciated and respect it. Thanks for coming back!", "Helpfulness": 0.25, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IKCHYOO6HU73"}}, {"Date": "on May 24, 2014", "Text": "I loved this start of a new trilogy. All of the characters were interesting & quirky. I am a fan of the Sookie Stackhouse books, but have never gotten into any of her other books. This book is exactly what I like about Ms. Harris. Well paced, fun & funny. Light reading for sure but total entertainment. Loved it, can't wait for the next one.", "Helpfulness": 0.25, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1A7TNW8J2LQ6O"}}, {"Date": "on May 22, 2014", "Text": "I loved that CH brought in characters from her other series into this book.  I can't wait for the next book in the series!", "Helpfulness": 0.25, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFTDYXPGQNVZG"}}, {"Date": "on May 21, 2014", "Text": "I GAVE THIS BOOK 4 stars be cause I really enjoy MS HARRIS Style of writing. Her books always surprise and entertain. Makes me anxious to see what is next.I love her regular stories full of strange characters.", "Helpfulness": 0.25, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29ANC1GKSW10R"}}, {"Date": "on May 21, 2014", "Text": null, "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZTEE4XWDD285"}}, {"Date": "on May 21, 2014", "Text": "Charlaine Harris does it again. Enjoyed the characters and the story line. Midnight, TX is a very interesting town to visit.", "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RJVKM79C5RWH"}}, {"Date": "on May 20, 2014", "Text": "Midnight Crossroads introduces the reader to an interesting group of citizens of Midnight, Texas.  This promises to be yet another great series from Charlaine Harris.  I can't wait for the next one.", "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22YV3JJTEKGG4"}}, {"Date": "on May 19, 2014", "Text": "Another interesting book from Ms.  Harris.  A unique gathering of characters in a little Tx town. All with something special about them. There was a carry over from her series set in Shakespeare.", "Helpfulness": 0.25, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HM0XAYRCCIXU"}}, {"Date": "on May 19, 2014", "Text": null, "Helpfulness": 0.25, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NERI188VDHOS"}}, {"Date": "on May 19, 2014", "Text": "Ms Harris is an excellent writer, and I have enjoyed all her scenarios. The ending was neat. Looking forward  to next book.", "Helpfulness": 0.25, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9GH1J06K0JIB"}}, {"Date": "on May 19, 2014", "Text": "This is a great book. I love the Sookie Stackhouse books & this one as we'll.  I highly recommend it.", "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29COVCE4J5FVZ"}}, {"Date": "on May 19, 2014", "Text": "Became addicted within the first few pages! I can't wait for the next! I fully recommend this book! It has it all!", "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VCB0QQ7ULGO"}}, {"Date": "on May 19, 2014", "Text": "I have loved all Charlaine Harris' previous books and series. Initially, I was not impressed with her choice of a main character...but he grew on me. I am still amazed at her ability to create eccentric characters  that I come to adore. I will look forward to the next book in this series, as I have with all her others. Ms. Harris, you done good. :)", "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3U3ZWKMIWZC9Y"}}, {"Date": "on May 18, 2014", "Text": "Thank you Ms Harris for coming back. You tied up the \"Grave Secrets\" series beautifully with the kind of restraint more should show and brought in a wonderful new/old character. My favorite line in the whole book is \"Little Timmy fell down the well\" It starts off slow and never really rolls too fast but is a delightful read.", "Helpfulness": 0.25, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PKQ8HDLMMCEM"}}, {"Date": "on May 18, 2014", "Text": null, "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEQYAIOKG0UMX"}}, {"Date": "on May 18, 2014", "Text": "I adore the way she writes about people, they come alive in her books!  I plan to buy and read all of her books.  The Shakespeare stories with Lily Bard and Harper C. stories are all entwined to my delight with Midnight, Texas.  She always has a few surprises that are delightfully unexpected.", "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DOMJV2FY8RJ9"}}, {"Date": "on May 18, 2014", "Text": "It was great going back to Manfred's story.  I liked that the story was more about the town than any one person.  So instead of one interesting character you have a whole towns worth.  Sometimes the story seems to move slowly but than I realized I was getting to know the characters and I enjoyed the pacing.  I read it in one day and wish I had the next installment to dive into!", "Helpfulness": 0.25, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10LT12MUFBS2Q"}}, {"Date": "on May 17, 2014", "Text": "Midnight is a quirky, maybe a little spooky, town. If you read Charlaine's Harper books you will recognize Manfred Bernardo, psychic. Manfred moves to Midnight. He's finds a place where his eccentricities are accepted, because every resident has them. The residents are not perfect or even always smooth, but throughout the book each character develops and we learn a bit more about them. There's a murder, a white supremacy group and lots of secrets.  I really enjoyed this newest book and look forward to the next installment!", "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TMFDW56AZ32W"}}, {"Date": "on May 17, 2014", "Text": "I love Charlaine Harris's imagination! Here is another real great tale I hope goes on for awhile because you can really feel that you are part of the story and has some interesting characters living there. Midnight,Texas will work its way into you like Bon Temps, did. You will want to put this book on your \"to be read\" list.", "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WU50OLEVDF52"}}, {"Date": "on May 13, 2014", "Text": null, "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2J4AM1MXG4UZA"}}, {"Date": "on May 12, 2014", "Text": "Just needed a bit more on the plot in this book, but the basic characters are good - a bit unlikely, but isn't that the point?  Good stories yet to be told about the Rev, the owners of the antique and nail salon, the newcomer, etc.  I felt this was the first chapter and the story is yet to be told.  Hope there's more of a plot and suspense in the next one!", "Helpfulness": 0.25, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3P317WRV0V7N9"}}, {"Date": "on May 12, 2014", "Text": "I liked this story, and I really liked the characters! I think there's potential for a darn good series here. I hope to see more.", "Helpfulness": 0.25, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AD9JDG28WZYSO"}}, {"Date": "on May 12, 2014", "Text": "Somehow when I pre-ordered this book I missed that some of my favorite characters from other Charlaine Harris series are in it. Needless to say, I read it in one sitting the first time. & now I'm reading it again to savor it at a slower pace. &  I must admit that I am grieved that I have to wait who knows how long for the next book in the series since it just came out. . . can't wait to see what happens next in the series.", "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24LV5BRTMXU1R"}}, {"Date": "on May 12, 2014", "Text": "Ms Harris knows how to tell a story. I want to read more more about these new characters. Bring Them", "Helpfulness": 0.25, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A139R1Z2ZGXWY8"}}, {"Date": "on May 19, 2014", "Text": "I've been reading Charlaine Harris's books since way before the TV show and I really enjoy them.  This one was well worth reading - mostly due to how fascinating the characters were.  It starts out a bit rough with too much exposition, but it kept getting better and better.  I'm definitely interested in where she will go from here.", "Helpfulness": 0.25, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMWAGVSOEGMKS"}}, {"Date": "on July 25, 2014", "Text": "This book made me laugh out loud.  Every character had their own little quirks and made the whole story come together.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TRDUL3SEDWGY"}}, {"Date": "on April 11, 2015", "Text": "Not her typical Sookie characters.  It took me a little while to get into this plot, but once I did, I enjoyed it.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DS3XXGMS8HWS"}}, {"Date": "on May 26, 2014", "Text": "I wasn't sure about this book at first, but as I read it, I thoroughly enjoyed getting reacquainted with some of the more interesting secondary characters from Ms. Harris' other series. I'm very intrigued by the new characters she's added, and I can't wait for the next book in this series.", "Helpfulness": 0.25, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XF3OASZB0NUR"}}, {"Date": "on May 17, 2014", "Text": "No matter what Charlaine Harris writes, and I think I've read everything, her characters charm me and make me feel as if they could be my friends. Perhaps this is really a 3.5, but it was enjoyable and intriguing. I'm glad she has a new series I can look forward to reading.", "Helpfulness": 0.25, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DBTEVIFV30N8"}}, {"Date": "on May 28, 2014", "Text": "I did not want it to end. Being a seasoned reader, it is hard for me to find a book that is enthralling, funny, frightening, and impossible to put down ... Charlaine, Please write more than three of these novels of Midnight and it's residents ... and HURRY!!!", "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1O82NFTBTHRSI"}}, {"Date": "on May 10, 2014", "Text": null, "Helpfulness": 0.375, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HJEO2Y3SBS97"}}, {"Date": "on June 8, 2014", "Text": "I enjoyed this book. It was a pleasant read, very character-driven, and I'm interested in finding out what happens next. There's not a ton of action, but the revelations about the characters are well paced and it kept me interested to the end.", "Helpfulness": 0.25, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1M5LDSMFHLFA3"}}, {"Date": "on May 19, 2014", "Text": "I truly enjoyed the story line and am looking forward to the next one.  Per usual Ms. Harris has a widely unusual cast of characters from the normal to the abnormal.  It is amazing what can happen in a small community in nowhereville.", "Helpfulness": 0.25, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZZZT0KJR46UV"}}, {"Date": "on July 15, 2014", "Text": null, "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3T1K32TM6YGPC"}}, {"Date": "on May 7, 2014", "Text": "I don't know how you feel, but I'm awfully glad that the Sookie Stackhouse series, with the massively popular TRUE BLOOD HBO series, didn't completely derail Charlaine Harris' writing career. I've always enjoyed her other series, so I'm especially pleased to see this new Midnight, Texas series begin. The off-beat characters, most with something \"a little extra,\" are engaging and multilayered. Manfred, the psychic/showman from the Stackhouse novels, starts to evolve and grow and we get to learn about him as he finds out about himself. The action is fast-paced and, somehow, the supernatural is made plausible. I look forward to more of this engaging new series, but, then, I'm always a sucked for a talking cat of Mr. Snuggles ilk.", "Helpfulness": 0.45454545454545453, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GQSUK696R9FM"}}, {"Date": "on August 15, 2014", "Text": "It's the beginning of a new great series by Ms. Harris! I loved the characters.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RRPC127YJHXR"}}, {"Date": "on May 27, 2014", "Text": "This book was wonderful! It has interesting characters and a great story line. A fast, easy, fun read! I can't wait for the next book in this series.  Charlaine Harris is one of my very favorite writers.", "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FKLW05NQ8U9W"}}, {"Date": "on May 24, 2014", "Text": "A great start to a new series by Charlaine Harris.  The book is filled with quirky characters, each with their own secrets.  I'm looking forward to reading more about the residents of Midnight.", "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I72FFFTKWVLT"}}, {"Date": "on July 21, 2014", "Text": "I can't wait to read the next book. The charter development is wonderful.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VD0BCOMK4RGK"}}, {"Date": "on June 17, 2014", "Text": "I enjoyed this book and look forward as for what's to come in this new series. This is the 1st book in the series so I didn't expect all that much however it was pretty good", "Helpfulness": 0.25, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24BRXO3H15ORU"}}, {"Date": "on July 14, 2014", "Text": "Perfect for a quick entertaining summer read by the pool or beach!", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UT61MN2HA071"}}, {"Date": "on May 16, 2014", "Text": "This is a far cry from the Sookie Stackhouse series but so far it is a very interesting read.  It had me wondering what these people were, where they all came from and wondering what they are.  It is a bit slow at first but then picks up and gets more spell binding.  I would recommend this book for any that are interested in sci-fi and mystry come together.  Well done.", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SRUMO9YVDRZM"}}, {"Date": "on May 16, 2014", "Text": "Great new 'branch' series using an intriguing character from a previous series - looking forward to seeing where the characters go!", "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IXGIJLMQMTJ6"}}, {"Date": "on May 15, 2014", "Text": null, "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JGT6YCCTC5MK"}}, {"Date": "on May 14, 2014", "Text": "Love Charlaine Harris' books.  Midnight Crossroad gives the reader imagination and imagery in a familiar Harris world.  Can't wait for the next book in this new series!", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GFOXHTH77JQL"}}, {"Date": "on May 14, 2014", "Text": "While I am sorry the Sookie series ended (all good things do) this feels like it will be quite interesting.", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9GE72PJ9O5QR"}}, {"Date": "on May 13, 2014", "Text": "Character development is lovely in this little book.  I very much enjoyed reading this, and hope there is an entire Midnight series.", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CMNFCERQSMIN"}}, {"Date": "on May 11, 2014", "Text": "I've been looking forward to the release of this book and was not disappointed. I devoured it in one day. Manfred, who is a character in several other novels has moved to Midnight, Texas. The town is full of people with secrets. We learn some of those secrets in this novel. I'll be looking for the next novel in this trilogy.", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A279Z8OZSY33BF"}}, {"Date": "on May 9, 2014", "Text": null, "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33QXPNA48RNA1"}}, {"Date": "on May 9, 2014", "Text": "Charlaine Harris has another winning cast of characters and I can hardly wait for the next of what I assume is a new series. If you've loved True Blod, you'll love this one too. The cat is a caution and the humor is great!", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XG62J3BQSNQG"}}, {"Date": "on August 10, 2014", "Text": "Item as described, fast shipper!!! Highly reccomend!!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3A5MXHI8QSN0B"}}, {"Date": "on July 20, 2014", "Text": "Enjoyed the story and all the colorful characters.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TLY7HUXE5EY2"}}, {"Date": "on July 14, 2014", "Text": "Excellent, Item delivered on time, was as described, will buy again recommend to ALL!!!", "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CYNL0D83YFZG"}}, {"Date": "on July 15, 2014", "Text": "Great follow-up to the Sookie series, can't wait for the next installment!", "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4ZFN8TWMOR17"}}, {"Date": "on June 29, 2014", "Text": "Great", "Helpfulness": 0.4, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TKBY8GE4K0FC"}}, {"Date": "on June 4, 2014", "Text": null, "Helpfulness": 0.2, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33SGA7BQ1X7XG"}}, {"Date": "on July 18, 2014", "Text": "I am a huge fan if this wonderful author.  I have read almost every word she's written, and truly enjoyed almost all of it.  This book is no different.  I love how she brings characters from one series into another, seemingly just as a treat for her readers.  But this time, she made one of the more minor characters in her Harper Connelly novels one of the main characters in this book.  There is more than a bit of the paranormal in this book, but it has a very different feel than her other series.  Each series has its own personality and I just fall in love with them.  This small Texas town houses some great characters.  I truly couldn't put it down.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3Q1N069UIAFCU"}}, {"Date": "on July 6, 2014", "Text": "Amazing and can't wait to read the next one!!!!!", "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AOOKN9X7ZQIF"}}, {"Date": "on July 20, 2014", "Text": "Enjoyable read.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AF6Y67NVN9OCC"}}, {"Date": "on May 11, 2014", "Text": "This book is wonderful, both on its own and as a staging for things to come in a series.  One of the things I like best about Harris is the easy, comfortable way she has of doing narrative.  It feels as if a friend who speaks like you do is telling the story.  That's no different here.  It does forgo the first person narrative but that's no sacrifice since the story is as wonderfully told as any Sookie book.  She also spreads the wealth in storytelling, letting you get to know intimately (after a bit) most of the residents of Midnight and they are an intriguing, well thought out bunch.  Oh and something I only realized near the end?  We have a psychic, a vampire, a witch, and maybe even a shifter and the main adversity they face are not  any that couldn't have happened to totally human characters, which just adds to how I and probably everyone else can relate to them!", "Helpfulness": 0.4, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HCU8MKAF7K2O"}}, {"Date": "on May 7, 2014", "Text": "I love Harris' work. I read the entire Sookie series, as well as her Lily Bard series and a handful of one-off books. With Midnight, Texas she took one of the best characters from the Harper Connelly series, Manfred Bernardo, and gave him his own book. The characters, mystery, and town are absolutely delightful. Highly recommended, and can't wait for the next one.", "Helpfulness": 0.4, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AB6CO5R2AOXL3"}}, {"Date": "on May 25, 2014", "Text": "Enjoyed the new characters from Charlaine Harris.  Especially Mr. Snuggly (but I am a cat lover).  Will miss my beloved Sookie but maybe this group can take over", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LPLWVJTGXDFP"}}, {"Date": "on July 19, 2014", "Text": "I'm a fan of Charlaine Harris. Have enjoyed all of her series.  This first in a new series didn't disappoint. The characters are interesting, varied and well-rounded. All of her series are different from each other. In each she tells a good story. I am looking forward to the next and the next and the next.........", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFTVNP6GFWGBK"}}, {"Date": "on June 22, 2014", "Text": "I have to say I really love this new series. Midnight and its zany citizens are wonderful. The mystery is intriguing but it is the lives and personalities of the characters that kept me turning the pages. I was left wanting MORE book:) I cannot wait for the next installment of this series. Charlaine Harris gets a perfect score with this wonderful new series.", "Helpfulness": 0.2, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKCEREKZKNDDB"}}, {"Date": "on June 22, 2014", "Text": "Love the characters & the story! Charlaine Harris has created another great series! I can't wait to read the next book in the trilogy!", "Helpfulness": 0.2, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A335RKS380X530"}}, {"Date": "on June 22, 2014", "Text": "The quirky cast of characters drew me in right away and the story was a quick and intriguing read. Hope there's another midnight book soon!", "Helpfulness": 0.2, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NVJ81QXQZVC3"}}, {"Date": "on June 15, 2014", "Text": null, "Helpfulness": 0.2, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1A356JKE684FX"}}, {"Date": "on June 5, 2014", "Text": "After Sookie and the Grave series' I didn't know if Harris could do it again.  I really enjoyed Midnight Crossing.  Another book filled with likable characters.", "Helpfulness": 0.2, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33SOVK7V6F1LU"}}, {"Date": "on June 4, 2014", "Text": "Having read the sookie novels and loving them I gave Midnight Crossroads a try and I am glad I did. The style and tempo of the book are very different from what I was expecting but this introduction to a whole new cast of characters proves intriguing and engaging.", "Helpfulness": 0.2, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31U5ISIG1YIJV"}}, {"Date": "on May 30, 2014", "Text": "This is a very different book by Charlaine Harris, I loved it! It reads easy and keeps you interested the whole time. Great characters, each had their own unique roles and abilities, great book!", "Helpfulness": 0.2, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A676VMPDY4G5W"}}, {"Date": "on May 29, 2014", "Text": "I really enjoyed it even though I didn't remember the characters from Dead in Dallas.  I like all of Charlaine Harris' series, and am looking forward for the next one in the Midnight, Texas series!", "Helpfulness": 0.2, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A233O3WA39WGCO"}}, {"Date": "on May 29, 2014", "Text": null, "Helpfulness": 0.2, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1276AG8SV1UUK"}}, {"Date": "on May 27, 2014", "Text": null, "Helpfulness": 0.2, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AA74YA15FLEX"}}, {"Date": "on May 27, 2014", "Text": "Enjoyable. Different from herlast book. Answers some questions but leaves you asking more about each character. Want the next book!", "Helpfulness": 0.2, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CMJB1HKUCPYO"}}, {"Date": "on May 24, 2014", "Text": "The small town and unique setting gets you from the start. If you like Sootie Stackhouse this is for you. Waiting for the next book is a little disappointing. I want to know what happens next.", "Helpfulness": 0.2, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DWN0N1JW9VGY"}}, {"Date": "on May 23, 2014", "Text": "So great that she's created a new trilogy and it's off to a great start! I was so excited that she's brought back Manfred from the Harper books - he's a great character. I liked all of the other characters and am looking forward to how the storyline progresses.", "Helpfulness": 0.2, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LPF8JK0HNTZ6"}}, {"Date": "on May 17, 2014", "Text": "I liked the story. I had enjoyed the story line that this spun off of. Hopefully this series will grow, and we will have more insight into this town.", "Helpfulness": 0.2, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6NWX7AZKA6AH"}}, {"Date": "on May 15, 2014", "Text": "Charlaine Harris has done it again.  Same universe but new area and set of characters we get to know and love.  Did not see twist at the end coming at all.", "Helpfulness": 0.2, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VYU42XI2MASR"}}, {"Date": "on May 15, 2014", "Text": "I loved this book so much!  I can't wait to hear more from the residents of Midnight!  My only complaint about this book?  It wasn't nearly long enough!", "Helpfulness": 0.2, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZMO2ECHWVJUE"}}, {"Date": "on May 15, 2014", "Text": null, "Helpfulness": 0.2, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JA7T1AFU163R"}}, {"Date": "on May 15, 2014", "Text": "I was sad to say good bye to Harper and Sookie but now I can't wait to become better acquainted with Manfred and the other citizens of Midnight, Texas.", "Helpfulness": 0.2, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33ZXPV7ALZSYI"}}, {"Date": "on May 13, 2014", "Text": "Some of the best characters in the best setting imaginable. A fascinating plot with twists only a mystery writer of her talent could conceive of. Just awesome. I hope there are more than three stories about Midnight. That's really the only downside. READ THIS BOOK.", "Helpfulness": 0.2, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PE7DUHPEKHTX"}}, {"Date": "on May 12, 2014", "Text": "It's always nice when an author takes a minor character and gives you stories about them.  In this delightful book, not one but two minor characters appear.  I'm looking forward to more from Midnight, Texas.", "Helpfulness": 0.2, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4A2JLEZ4ZVPE"}}, {"Date": "on May 12, 2014", "Text": "I've read all of Harris's series. Loved all the characters from past series brought together. This book was a truly enjoyable read", "Helpfulness": 0.2, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AV8GNRC3YF4TO"}}, {"Date": "on May 11, 2014", "Text": "This was a great read! My only regret is that I have finished it and there are no more. I had the good fortune to discover Ms. Harris and read her different book series after they had all been released and I am disappointed, having finished this one, that this is all there is for now. I was thrilled to have an expansion of Manfred's character as it is her characterization of him that I find most compelling. I must said that the anthropomorphism of the cat really threw me but in the end it was simply as camp as the rest of the book and added another character somehow comparable to the ones that had already been developed in this tiny town. This is a book that anyone at any age level could read. Certainly ideal for Potter fans since it is built on strong and very different characters trying to find a safe haven.", "Helpfulness": 0.2, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1B2GLHFU2VN1C"}}, {"Date": "on May 11, 2014", "Text": "A little mystery, a little action, a lot of character. I especially like how Harris seamlessly switches POV in a way that should have been impossibly awkward but instead succeeds nicely. Huge potential for this series!", "Helpfulness": 0.2, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XUA7EVQFYCE8"}}, {"Date": "on May 11, 2014", "Text": "This story brings together old friends from Ms Harris' other series.  A mystery with a touch of weirdness mixed in, the characters are relatable and likeable.  A promising series with lots of possibilities.", "Helpfulness": 0.2, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YWX7TAIZCK8E"}}, {"Date": "on May 11, 2014", "Text": "I cannot wait to see what else will become of the Midnight family.  while this book started off kind of slow,  it did not dissapoint.  I love Charlaine Harris and any book she writes.  I was shocked at the turns, and twist in the plot.  left me speechless.  great read highly recommend book to her fans.  I also love all the characters she threw in from her other series as well.  Great way to include.  This series will definitely make its way to the top as the rest of her have.", "Helpfulness": 0.2, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6IVBNAAHZ6RD"}}, {"Date": "on May 9, 2014", "Text": "I've been a fan of all of Ms. Harris' works, and loved this quirky tale. Fans of her previous fiction will recognize a number of the characters in this novel, including Bobo, Manfred, and Arthur Smith, from the Lily Bard, Harper Connelly, and Aurora Teagarden mysteries respectively. Having said that, familiarity with any of those series is not a necessity; it is, however, a lovely nod to longtime fans.  Midnight Crossroad isn't the most action-packed novel, but the characterizations and subtlety kept me turning the pages as I fell in love with the ambience and wanted to learn more about the town and its off-beat residents. Part of the slow pace may be the author setting up the trilogy, but I enjoyed the slightly dark & humorous tone, and cannot wait for more. Ms. Harris never fails at hitting the nail on the head when it comes to human emotions and needs, and her unique packaging creates a work that draws you in to the human condition while somehow keeping you grinning enough to see through to the emotional highs and lows that make up this thing we call life.  (Hopefully that didn't sound too ponderous.)  (Edited solely for grammatical errors I caught retroactively. I can't STAND seeing myself commit a grammatical atrocity.)", "Helpfulness": 0.2, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TY69BM1T89QI"}}, {"Date": "on May 9, 2014", "Text": "I fully enjoyed the first book in this new series. I was able to read it without being bored. I hope the rest if the series is quick to follow.", "Helpfulness": 0.2, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CHAFWWB26GBX"}}, {"Date": "on May 8, 2014", "Text": "As in all of Miss Harris's books I enjoyed this Book! Her books are well written and well plotted. I hope this is the beginning of many books in this series!", "Helpfulness": 0.2, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13HOI5N1NU8LJ"}}, {"Date": "on May 7, 2014", "Text": "Great start to a new series. Interesting characters, kept my attention from beginning to end. Eagerly awaiting next book in the series.", "Helpfulness": 0.2, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SIFS29V1I8AP"}}, {"Date": "on July 19, 2014", "Text": "A FABULOUS NEW START FOR CHARLAINE HARRIS WITH SOME CAMEOS THAT WILL PLEASE FANS OF SOME OTHER SERIES AS WELL.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12SCC4F59WPZ7"}}, {"Date": "on July 22, 2014", "Text": "I love her books. I read all the Sookie books and loved them. I think this will be a good series too", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LCM0OZ82IDID"}}, {"Date": "on July 26, 2014", "Text": "Charlaine Harris never disappoints so when I saw this book I knew I was in for a treat. Great book!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1E6BHISCR5WCV"}}, {"Date": "on July 15, 2014", "Text": null, "Helpfulness": 0.2, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6DO1LH9L5OUI"}}, {"Date": "on May 14, 2014", "Text": "Great book! She took characters from 2 earlier series and put them in a new series. Perfect!  As usual I can't. Wait for the next!", "Helpfulness": 0.2857142857142857, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOP8LDSTCNXQT"}}, {"Date": "on May 14, 2014", "Text": "The moment I started this book I could see that this was the beginning of another yummy series.  I loved the Sooky Stackhouse series, the Harper Connelly series and the Shakespear series.  this was a great start in Midnight Texas.", "Helpfulness": 0.2857142857142857, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYI9M5DXLVB5"}}, {"Date": "on May 14, 2014", "Text": "Ms. Harris has did it again. Midnight Crossroad is a start to another great series.I am looking forward to next book.", "Helpfulness": 0.2857142857142857, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29X6BRCAFI1LU"}}, {"Date": "on July 25, 2014", "Text": "I hope this is the start of a series. The characters are very interesting and enigmatic.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D6GEFEIXWIJM"}}, {"Date": "on July 12, 2014", "Text": "Great characters, easy read. Can't wait for the next book in the series.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QHR72CFUX15C"}}, {"Date": "on May 10, 2014", "Text": "After being a Sookie person, I was not sure that I would enjoy another series as well. I'm pleased to say, I was wrong and I look forward to reading the next installment of Midnight, Texas.", "Helpfulness": 0.2857142857142857, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXBW57X95LF99"}}, {"Date": "on May 14, 2014", "Text": null, "Helpfulness": 0.16666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXU4F6TAYPQZW"}}, {"Date": "on June 3, 2014", "Text": "Loved loved loved this book! Charlaine does it again. Great story great and great characters! I can't wait till the next one comes out. If you are a fan of Charlaine's work then you will also enjoy this book.", "Helpfulness": 0.16666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ANACSKPO420L"}}, {"Date": "on June 3, 2014", "Text": "I enjoyed the story of the people of midnight. Was a good read, a little slow at first but once it got going was hard to put down. Can't wait for the next book!", "Helpfulness": 0.16666666666666666, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I3BMG9RN9L7P"}}, {"Date": "on May 29, 2014", "Text": "Loved the development of the characters. I am ready to read more about each one. To find out who they are and their  back stories. Excellent start!", "Helpfulness": 0.16666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JEDSPD9CZ6DJ"}}, {"Date": "on May 15, 2014", "Text": "Charlaine has done it again! This is one mysterious town and so are the characters. I really enjoyed trying to discover all the little quirks about the townspeople and tying my darnedest to figure them all out. Charlaine has a way to make the extraordinary supernatural feel down right normal (in a good way) and really ties three of her previous series all together. I can't wait for the second book and I feel a bit sadden that I read this so quickly. If you enjoyed her previous works, you will enjoy this book.", "Helpfulness": 0.16666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVQ0X5FMS7093"}}, {"Date": "on July 22, 2014", "Text": "Another world to love from Charlaine Harris. Suddenly, I'm not so lonely for the stack house series. I feel like I know the characters already and I can't wait for more.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RHT0OOL798TX"}}, {"Date": "on May 31, 2014", "Text": "I like the character development over the course of this book. Ms. Harris gives you just enough to make you wonder about each character's secrets.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IGLSIGUI3MZ3"}}, {"Date": "on April 24, 2014", "Text": null, "Helpfulness": 0.35714285714285715, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33UZDO4KB4S0H"}}, {"Date": "on May 10, 2014", "Text": "Great mystery set in a small tow.  Very unique cast of characters, loved the vibe.  Totally different from the Sookie series,  but really a great read.  I hope there are more books set in Midnight.", "Helpfulness": 0.16666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DPUZ1L9OBVUU"}}, {"Date": "on May 13, 2014", "Text": "I LOVE ANYTHING BY CHARLAINE HARRIS. HAVE READ ALL OF HER STOOKIE STACKHOUSE BOOKS. THIS SHOULD BE JUST AS GOOD AS ANY THAT I HAVE READ BY HER.", "Helpfulness": 0.16666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CQ99W0NFVGEE"}}, {"Date": "on May 8, 2014", "Text": "Wonderful story with a villain I didn't see coming. You have a . Mystery the Supernatural, physic. Great writing. Wonderful characters. Excitement galore. ENJOY", "Helpfulness": 0.3, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23B9YR9W29YUQ"}}, {"Date": "on May 23, 2014", "Text": "I have read just about all of Charlaine Harris Books and enjoyed them all, but Midnight looks like it will be my new Favorite. !!!!!  NEXT ONE PLEASE", "Helpfulness": 0.35714285714285715, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYKGYNPBZC2LS"}}, {"Date": "on August 15, 2014", "Text": "a", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANV1V67H2XB38"}}, {"Date": "on May 7, 2014", "Text": "Manfred has been one of my favorite characters from the Harper Connolly books. Great read but over much too quickly.", "Helpfulness": 0.2222222222222222, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AX85FUGSMBAPF"}}, {"Date": "on May 7, 2014", "Text": "\"Midnight CrossRoad\" was amazing.  I read it in just a little over a day! Got it yesterday, I haven't been so captivated about characters and plot since picking up the first Sookie Stackhouse Mysteries!!!!  I highly recommend and praise to Charlaine Harris for bringing us a new wonderful and supernatural world!!!", "Helpfulness": 0.2222222222222222, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A149EK5HGL6KHC"}}, {"Date": "on May 7, 2014", "Text": "Truly an original book, with a paranormal plot of great originality. This is a new series from Charlaine Harris and although I was originally sad this wasn't a continuation of her other magnificent series, I now long for future book in this extremely well written new series.", "Helpfulness": 0.125, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABKAT13I4YBBU"}}, {"Date": "on May 7, 2014", "Text": "I loved this book just as I love all of Me. Harris's books. I'm glad that the stories of old friends from former books have been continued. In my humble opinion she can do no wrong!!! :)", "Helpfulness": 0.125, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16MZ12GDPK8OO"}}, {"Date": "on May 6, 2014", "Text": null, "Helpfulness": 0.18181818181818182, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWJTICLONZJ9C"}}, {"Date": "on July 21, 2014", "Text": "Gift to a friend", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1G3571PIKO29N"}}], "ReviewUrl": "http://www.amazon.com/Midnight-Crossroad-Novel-Texas/product-reviews/0425263169/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.0 out of 5 stars"}, "OfferPrice": "$7.73", "Salesrank": "#7,958", "ListPrice": "$9.99"}