{"Category": "in Books (", "Name": ["Foundation"], "Timestamp": "2015-05-24 23:48:14.723009", "itemurl": "http://www.amazon.com/Foundation-Isaac-Asimov/dp/0553293354", "Reviews": {"TotalReviewCount": "1,322", "ReviewList": [{"Date": "on June 19, 2008", "Text": null, "Helpfulness": 0.8931506849315068, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JZLZGQZ62RSO"}}, {"Date": "on November 19, 2002", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A217JLPIBQ80HW"}}, {"Date": "on October 6, 2002", "Text": null, "Helpfulness": 0.8848920863309353, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SIA5ZT4ST0BC"}}, {"Date": "on September 13, 2003", "Text": null, "Helpfulness": 0.8571428571428571, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AK81WLVD5KGUX"}}, {"Date": "on November 22, 2013", "Text": null, "Helpfulness": 0.881578947368421, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CK2WH6MO0VWG"}}, {"Date": "on July 25, 2007", "Text": null, "Helpfulness": 0.8888888888888888, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I2O9Y3X3HXLS"}}, {"Date": "on November 12, 2010", "Text": null, "Helpfulness": 0.8666666666666667, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2A8FHD88I383D"}}, {"Date": "on August 26, 2002", "Text": null, "Helpfulness": 0.8518518518518519, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KVUYPLEW4LXT"}}, {"Date": "on June 12, 2000", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1H09IHY4LZQK0"}}, {"Date": "on February 2, 2000", "Text": "This is a gerat book to read. I read it first from all the other books in the series, and now I own all the books. That is really a great start. If you are just begining to read the series, here's somehting to help you know  the order- 1) PRELUDE TO FOUNDATION 2) FORWARD THE FOUNDATION 3) FOUNDATION  4) FOUNDATION AND EMPIRE 5) SECOND FOUNDATION 6) FOUNDATION'S EDGE 7)  FOUNDATION AND EARTH (it's out of print) ALL of these books are available  at a great price here on Amazon.com, even Foundation and Earth. read the  whole series if you're a big sci-fi fan, like I am!", "Helpfulness": 0.9523809523809523, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on August 13, 2002", "Text": "Asimov's classic original trilogy comes to a close in this ambitious finale. Here Asimov has really gone over the top with political and intellectual intrigue, which propels the two main plot elements. As with the two previous Foundation novels, there are actually two shorter stories here that take place decades apart. In this installment Hari Seldon's plan gets back on track after being disrupted by the mutant known as the Mule, with the mythical Second Foundation starting to peek out from behind the scenes. Who works for whom, who's a traitor or not, and whether or not the Second Foundation even really exists are all intricately played out by a series of intelligent and conspiratorial characters in relentlessly tangled webs of intrigue. In fact, this book has the most well-defined characters yet to appear in the Foundation series, especially the young Arcadia. The original Foundation saga is wrapped up nicely here as the original trilogy comes to a close. Of course, Asimov's creation is so expansive that there was plenty of room for more speculation and development of the story, leading to the prequels and sequels that Asimov continued to crank out for this classic series.", "Helpfulness": 0.9166666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2B9Y0WXNSN17U"}}, {"Date": "on May 31, 2003", "Text": null, "Helpfulness": 0.9166666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHUT55E980RDR"}}, {"Date": "on February 19, 2006", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VLAZEPO9UJEA"}}, {"Date": "on June 25, 1999", "Text": "This is the first published volume (which was originally published as four short stories in \"Astounding Science Fiction\" magazine, 1942-1944, with an introductory section written in 1949) of Asimov's famous  trilogy, which affected many later works. This trilogy, which won a special  Hugo Award in 1966 for the best science fiction series of all time, was  later expanded into further volumes by Asimov (in fact, two prequels are  Asimov's \"Prelude to Foundation\" and \"Forward the  Foundation\"; after Asimov's death in 1992, other authors [for example,  Gregory Benford's \"Foundation's Fear,\" Greg Bear's  \"Foundation and Chaos,\" and David Brin's \"Foundation's  Triumph\"] have contributed to the series [note that there are now five  novels that serve as prequels to Asimov's first published Foundation  book!]) . In these stories, spacecraft travel over large distances via  \"jumps.\" The ships spend most of their time in a form of  hyperspace, each jump being aimed at a certain target star. The central  character, Hari Seldon, is a psychohistorian. Psychohistory is the  mathematics dealing with the reactions of very large masses of mankind to  social and economic stimuli (and the recent advances in chaos theory in  advanced mathematics lends credibility to Asimov's psychohistory). His  calculations predicts an end to the Galactic Empire (an empire remarkably  similar to the Roman Empire on Earth). Two Foundations are set up to ease  mankind through the dark area predicted (or else, the dark period will last  30000 years) and, after a thousand years, will join together to form a  second Empire. Although Asimov's early writing style leaves much to be  desired (recall this was all put together in his early 20s during World War  II when he worked for the U. S. Navy and when he was finishing his graduate  work at Columbia Univ.), it is still fun reading; I enjoy every time I  reread it. It is particularly enjoyable in the context of the other  volumes. This first published volume has five parts. In \"The  Psychohistorians,\" an introductory tale (which begins about 46 years  after the events described in \"Prelude to Foundation\" and  thirteen years after the events described in the last story of  \"Forward the Foundation\"), Dr. Hari Seldon and a young colleague  are arrested on the planet Trantor (the governing center of the Galactic  Empire) and tried for treason. Seldon's group are to be exiled to the  planet Terminus on the galactic rim where they will form a scientific  refuge. Seldon also plans to set up another group somewhere else. We later  learn, in Part III, that this other group (the Second Foundation) is  located at a place known as Star's End at the other end of the galaxy. In  \"The Encyclopedists,\" taking place about fifty years later, a  large number of members of the original Foundation are on the planet  Terminus and are compiling a massive encyclopedia to prepare for the  upcoming dark age. But, why were no psychobiologists and only one  psychologist present among the original colonists? The remaining three  parts continue the development of the Foundation on Terminus.", "Helpfulness": 0.8846153846153846, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MQXFVZ9DCE8M"}}, {"Date": "on March 14, 2004", "Text": null, "Helpfulness": 0.9375, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PHBBZZQNZML5"}}, {"Date": "on March 1, 2005", "Text": null, "Helpfulness": 0.8666666666666667, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWLFVCT9128JV"}}, {"Date": "on February 2, 2002", "Text": null, "Helpfulness": 0.9, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30KEXFT9SILL6"}}, {"Date": "on March 1, 2000", "Text": "First I should say that this is a great book. It is the second book in the Foundation Trilogy. And if you need some help on the order of the books, here tis : 1)Prelude to Foundation 2)Forward the Foundation 3)Foundation  4)Foundation and Empire 5)Second Foundation 6)Foundation's Edge 7)  Foundation and Earth. #s 3,4, and 5 are the original trilogy. I have  reviewed all of them. They're all good. This particular book has two parts.  In the first part the Foundation is faced with the dying but still strong  Galactic Empire, and in the second, more interesting part, they face the  rising Mule. A few words bout him, he's not what or who you might think he  is. The next sentence might be considered a spoiler, so choose to read it  or not. The Mule is actually Bobo( this word only appears once in the book,  and might be missed). Well, have fun reading!", "Helpfulness": 0.8269230769230769, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on July 31, 2001", "Text": null, "Helpfulness": 0.8823529411764706, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31GT8U32CIKW0"}}, {"Date": "on May 25, 2000", "Text": null, "Helpfulness": 0.8571428571428571, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASLK4P92EXOXG"}}, {"Date": "on January 26, 2011", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4UL27HNJL88T"}}, {"Date": "on June 25, 1999", "Text": "In this third volume of the first Foundation series (originally consisting of two stories published in a magazine in 1948 and 1949), survivers of the First Foundation, as well as the Mule, hunt for the Second Foundation.  Asimov later published a sequel, \"Foundation's Edge\" in 1982.  I've now read this series twice (I first read them in the early 1960s).  But, my father has read them ten times. It just shows how popular the  series has been. In Part I, titled \"Search by the Mule,\" five  years have passed after the end of the events described in \"Foundation  and Empire.\" The Mule (now, in effect, ruler of the Galactic Empire)  goes in search of the Second Foundation which he regards as a serious  threat to his rule. The Second Foundation, which is quite vulnerable, has  to find some way to dissuade him and return the galaxy to the path outline  by psychohistory. In Part II, titled \"Search by The Foundation,\"  the history begins about 95 years after the end of Part I. A small group of  individuals in the First Foundation, including an electroneurophysiologist,  come to the conclusion that the Second Foundation's ability to control  people's minds is repellant. They attempt to locate the secret center of  the Second Foundation. At the same time, a warlord on another planet seeks  to defeat the First Foundation in battle.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MQXFVZ9DCE8M"}}, {"Date": "on June 13, 2010", "Text": null, "Helpfulness": 0.9166666666666666, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34QO2WV64JJRQ"}}, {"Date": "on November 21, 2002", "Text": null, "Helpfulness": 0.9166666666666666, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1L192HS9BK9Y5"}}, {"Date": "on November 25, 2005", "Text": "im a huge fan of isaac asimov for many many reasons. the fact that he wrote my all time favorite story is just coincidence. but he did. this incredible tale told in 3 volumes originally in the 1950,s and then continued years later in the 1980,s was based on THE DECLINE AND FALL OF THE ROMAN EMPIRE by GIBBONS that was written in the 1700,s. asimov decided to place the tale in the far future , in a galactic empire that includes thousands of worlds throughout the galaxy. the empire is falling in to barbarism and one man HARI SELDON has figured out a way to save it from falling.  not totallly from falling mind you, that is way beyond help at this point but hes figured a way to cushion the fall so to speak and then make it rise again faster than it would through his discovery of \" PSYCHOHISTORY\". Physchohistory is the study of history and its past and what the future may bring based on what has happend combined with psychology and what very may well happen in the future. he creates TWO foundations on opposite ends of the galaxy to guide and help the whole of civilization along the next few million years to keep things from getting too bad, but something happens. some THING throws a monkey wrench into the works long after seldon is dead that threatens the whole  of his work. or does it? the first 3 novels written in the fifties are markedly different in style from the ones written the eightys naturally and they can almost be considerd 2 seperate tales but they all work together well. so well in fact that even though asimov is dead the storys are continued by other science fiction writers like  greg bear and gregory bedford. in fact they may continue forever with permission from the asimov estate but the original works are sheer genius. easy to read and simply written in the typical asimov style. great idea thats well thought out.", "Helpfulness": 0.875, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PNEUHPISPOWT"}}, {"Date": "on June 11, 2001", "Text": null, "Helpfulness": 0.875, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AUBGENRIZODO"}}, {"Date": "on June 25, 1999", "Text": "This is the second volume published of Asimov's classic Foundation series (originally published as two novellas in 1945). Part I is titled \"The General.\" A military leader in the Old Empire sees the Foundation as a  threat (about forty years after the end of the events described in  \"Foundation\"). He gets permission from the emperor to wage a  campaign. The Foundation must find a way to stop him. Fortunately, the  mathematics of Hari Seldon has already considered a course of action. In  Part II, called \"The Mule,\" a mutant with unparalleled power  (power never considered in Hari Seldon's psychohistory; he can control the  emotions and commitments of others) fights and defeats the Foundation about  300 years after the start of the novel \"Foundation.\" But, now the  Mule has to go in search of the Second Foundation which is made up of  psychologists and psychohistorians (the First Foundation had been set up  primarily with physical scientists). When \"The Mule\" appeared in  magazine format in 1945, it wowed the readership. With these stories, the  series really began developing a following. I am in my 50s and have read  the books a couple of times. But, my father has read them ten times!", "Helpfulness": 0.9166666666666666, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MQXFVZ9DCE8M"}}, {"Date": "on March 28, 2000", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AO8DQCVUS8ZRV"}}, {"Date": "on November 13, 1997", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": ""}}, {"Date": "on March 3, 2002", "Text": "Foundation is a landmark in science fiction, and epitomizes the best of what Isaac Asimov stood for. This book proves that you don't have to have a lot of sex and mindless violence (\"-the last refuge of the incompetent\") to make a book suspenseful and a page-turner. The book is entirely without action and romance in the normal sense, and consists almost entirely of dialogue. What makes it so interesting is the ideas (and reversals of ideas) that it presents, in all their aspects, subsequently debates, and solves. It has an aura of almost detective story fascination with regards to political ideas. What is interesting is that the book takes a pacifistic approach to politics, and thereby forces itself to present a plausible solution to occurring problems (say, rebellion, anarchy, and war) without degrading into violence. Each self-contained story (the book is not a novel, but a collection of stories that were originally published stand-alone) is therefore a sort of logic puzzle (much the same, in principle, as Isaac's Robot stories) that you must delve into and accede all its ramifications, and come out with an answer that will work, without using violence. It's a credit to Asimov that he could not only achieve this, but make it interesting, and, indeed, arresting. This is an essential science fiction read, and perhaps Asimov's apex.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EKTLUL24HDG8"}}, {"Date": "on April 27, 2000", "Text": null, "Helpfulness": 0.9, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NUM3JIE6II0F"}}, {"Date": "on March 5, 2011", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27L9UA2CAZSO4"}}, {"Date": "on April 29, 2003", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NJO6YE954DBH"}}, {"Date": "on January 19, 2002", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ITEMEL0DTX8A"}}, {"Date": "on June 3, 2001", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MAG8BDOVJHTT"}}, {"Date": "on January 10, 2000", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EYYAKH4VF70T"}}, {"Date": "on January 15, 2000", "Text": "I recently read Foundation, all I can say is Wow!.  First let me say this is not STAR WARS and it isn't STAR TREK, This is what Science Fiction is all about.  Truly epic in every sense of the word, Foundation offers us a  window into a future so far away Earth is forgotten completly.  And like  any good epic, their is no main character, instead the story is a series of  short stories.  Each story features new characters and plots decades,  sometimes centuries apart.  The best part of this book is that its only  part one!  I can't recommend this book enough!  If you consider yourself a  serious Sci-Fi fan then get this book today.", "Helpfulness": 0.9, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XZ5072KF4ETH"}}, {"Date": "on October 31, 1999", "Text": "I think asimov truly showed his ability in Foundation and Empire. Whether or not Foundation was better is debatable. But to create 2 knockout novels  is pure gift. All the people who say it is bad are wrong. they say you  should read a classic. It is a classic! A modern classic! the series  deserves a place among Dune and other SF greats. The Mule was stroke of  genius. The surprise ending was wonderful. whatever they charge you for  this it is a deal.", "Helpfulness": 0.8571428571428571, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on May 8, 2005", "Text": null, "Helpfulness": 0.8888888888888888, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YF4ZMECJVLK9"}}, {"Date": "on June 3, 2000", "Text": null, "Helpfulness": 0.8888888888888888, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1K1JW1C5CUSUZ"}}, {"Date": "on March 5, 1999", "Text": null, "Helpfulness": 0.8888888888888888, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on May 26, 2008", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FZ9AN04PJY16"}}, {"Date": "on December 12, 2005", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31DIT4W29RVS5"}}, {"Date": "on May 1, 2001", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZAJCZHFV7OZD"}}, {"Date": "on September 8, 2000", "Text": "Keep in mind: this is the first book in a trilogy. Even though each book  stands on its own as a classic of science fiction, you have to take them as  a whole, I think. Besides, once you've read Foundation, you'll want to read  the others. That said, I first came across this trilogy in the library and  was reluctant to read it. On first reading, I was weighed down and a little  turned off by the politics, and I almost lost interest. Hari Seldon, a  mathemetician, predicts that the mighty Empire, centered on the giant  planet/city Trantor, will be destroyed in 500 years, which will be followed  by 30,000 years of barabarism and social decay. Only after that will a new  Empire emerge. He devises a plan to shrink that dark period to 1,000 years,  and new rulers of his design will take over. After a trial, Seldon and his  band are exiled to a backwater planet, Terminus, surrounded by stronger and  more resourceful enemies. What band? Those working on a great Encyclopedia  to preserve the knowledge of mankind once the dark period strikes. They  wouldn't travel to the other end of the galaxy on their own accord. Forced  exile was the only way Seldon's Plan would work. Soon the true purpose of  the Plan is revealed. Seldon was dead before the Foundation established  itself on Terminus. But he appears as a hologram during times of crisis. It  turns out Seldon predicted these crises, and the Foundation's actions are  forced down one path. The Foundation slowly gains advantage over its  enemies. It will still be centuries before they are strong enough to take  on the Empire.  The Foundation gains these advantages sometimes by  heroic acts of its leaders. But according to Seldon, the actions of the  individual are unpredictable and can't be counted on. So is there some  greater power guiding this whole scheme? The question is not approached  until the next book, Foundation and Empire. We and the men of the  Foundation know that Hari Seldon formed two Foundations, and that's all we  know.  You might spot elements that George Lucas borrowed for his Star  Wars movies: Empires, small versus the mighty, parsecs, blasters, and as  you read further, mind control.  Foundation sets up the series strongly.  Read it, and keep reading. The politics don't bother me so much anymore.  They are a necessary part of the story. That's why I say to take the  trilogy as a whole. All three books are essential to the whole story, one  is not necessarily the best, but the real excitement and surprise endings  are saved for the next two books.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28FMB1W9FX4Y6"}}, {"Date": "on September 5, 2011", "Text": "The other reviewer missed the point of the scratchy first  minute of the recording. It was to represent an old recorded history.  The rest is perfect.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AJOBL8CWONND"}}, {"Date": "on December 26, 2003", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UMOD23RX1Z5D"}}, {"Date": "on April 16, 2002", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1O66CYSE9ZW0W"}}, {"Date": "on January 9, 2014", "Text": null, "Helpfulness": 0.875, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MZXTOZTTS8ZM"}}, {"Date": "on April 12, 2008", "Text": null, "Helpfulness": 0.875, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GAY5VH2LDFWK"}}, {"Date": "on October 4, 2010", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A250XPRB8642Y8"}}, {"Date": "on June 24, 1999", "Text": "This book is the last in the classic Foundation Trilogy and is a perfect example of a truly captivating story. The series builds up exponentially into this finale and the plot moves faster and faster, not dropping off until the very last sentence and being easily the greatest conclusion to a  story I have ever read, leaving me laughing maniacally and wondering how  such a profound literary mind could possibly exist. The sheer grandness of  it all is simply superhuman, and the best part is the way you would never  suspect it before the point, but once you get there, everything falls into  place perfectly and you know that no matter how much you had to struggle  through the first two books, it was worth the ride. And such a ride it was.", "Helpfulness": 0.8333333333333334, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on December 19, 2004", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQ77TOADJSYVW"}}, {"Date": "on January 29, 2002", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ITEMEL0DTX8A"}}, {"Date": "on November 27, 2001", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MAB5Q4XA209W"}}, {"Date": "on July 15, 2006", "Text": "I personally enjoyed ever word of this particular work.  Many other reviewers have gone into the plot, etc. so I will not do so here to any depth.  This is one of those works of SiFi that will appeal to certain taste, while others may find it not to their liking.  There is a great deal of politics (almost Pre WWI European) involved in the story line.  As the story covers (all books included) over one thousand years, there are many, many characters to track and keep track of.  This is indeed a series of short stories, all linked.  I personally enjoy this sort of thing but can see where some might not.  That being said, it, the book, can certainly be regarded as a classic in this particular genre and certainly should be read by any student of such. You certainly cannot fault the author's story telling ability and imagination.  I enjoyed this one a lot and do highly recommend it.", "Helpfulness": 0.875, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MC6BFHWY6WC3"}}, {"Date": "on December 20, 2006", "Text": "The foundation is setup to secretly monitor mankind through its darkest hours. It reminded me a little of Orwell's 1984. In placing humans away from the central government on a planet with few resources. They are forced to develop quickly. This is a novel more about political machinations than about action. The contradictions in human nature are here to analyze. The characters use guile, spirit, & cunning to survive. Some 80% of the book is dialogue & the character development is a bit shallow. Nonetheless, Mr. Asimov portrays the future in poignant & diverse ways. The predicted conflict makes the story of galactic history entertaining, especially since this was written in 1951. Some 7 years before Sputnik was launched. The author deserves praise for his imagination that was well ahead of his time.", "Helpfulness": 0.875, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IHT31N8RLPN8"}}, {"Date": "on April 17, 2006", "Text": "For its time `Foundation' by Isaac Asimov was a tale that predicted futurism as the calculation of the eventual outcome of each technological economic progression that mankind could, and would, go through, if it stuck to certain paths, especially the implementation of the concept that \"small is better\" with an economic drive that produces its best results when under stress, such as wartime. This model is pretty much the way the world works today with technology leaps made when there is a demand for it to do so and at no time is this demand greater than when a nation is faced with a possible crisis. Asimov's `Foundation' is a story about a society of colonized scientists that have been chosen by Hari Seldon, the creator of psychohistory, who sees a crisis developing in the cosmic empire that can only be avoided if certain conditions are met for each impending emergency that is predicted through psychohistorical analysis. He sets up an off world colony at the unknown edge of the galaxy, the foundation, that goes through several generations, with each generation reaching a hidden 'Seldon crisis' point that becomes the focus of several successive stories in the book. Futurism was actually an artistic movement originating in Italy around 1910 whose aim was to express the energetic, dynamic, and violent quality of contemporary life, especially as embodied in the motion and force of modern machinery. Nowadays it means to believe that the meaning of life and one's personal fulfilment lie in the future and not in the present or past. Foundation symbolizes these ideas. Although not the most exciting or action packed SF you could read, is also somewhat limited in its SF feel, is more of a revelation of economics and is the kind of literary material that would impress the business and politically minded reader more than the seasoned SF reader. None-the-less this is still an important work that remains relevant today as it did in the early 50s, but the sequels might be a bit of a hard sell on the bases of this educational SF novel.", "Helpfulness": 0.8181818181818182, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AD0J5KK4WQXNS"}}, {"Date": "on March 9, 2002", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EKTLUL24HDG8"}}, {"Date": "on October 30, 2003", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A55MRYPUAX4QU"}}, {"Date": "on October 29, 2003", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VRPQZ49PUXTT"}}, {"Date": "on November 19, 1999", "Text": "Foundation is an amazing story about the ingenuity of one man whose quests bring him to the brink of barbarism-- in a time a million years from now. Hari Seldon is the character we'd all like to be, and Isaac Asimov is the  writer we'd all like to be. Definately five stars. I recommend for anyone  with a likeness to math, history, or science, or anyone who has read  anything by Asimov, Brin, or Bear.", "Helpfulness": 0.875, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OB9HCONH8068"}}, {"Date": "on February 21, 2011", "Text": null, "Helpfulness": 0.7777777777777778, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33UOIP7UFFURZ"}}, {"Date": "on March 19, 2010", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABMX8XUNPR3LP"}}, {"Date": "on February 27, 2012", "Text": null, "Helpfulness": 0.7857142857142857, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21HKDOW2FWVX"}}, {"Date": "on June 17, 2003", "Text": null, "Helpfulness": 0.8571428571428571, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34NHLTQUNDPTS"}}, {"Date": "on October 26, 1999", "Text": "This is the last part of the trilogy (Foundation, Foundation and Empire, Second Foundation) where everything seems to be explained. Asimov could  stop the Foundation series right here. However, there were still too many  things unanswered. If you want to find out what was REALLY going on, read  Prelude to Foundation, Forward the Foundation, Foundation's Edge,  Foundation and Earth as well as the robot series The Caves of Steel, The  Naked Sun, The Robots of Dawn, Robots and Empire.", "Helpfulness": 0.8181818181818182, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on November 17, 1999", "Text": "Isaac Asimov's Foundation is one of the most extraordinary books I've ever read. Its brilliant plot, minute detail and far-ranging scope are unequaled. Another plus for this book is that you realised it didn't focus  on 1 main character; it's focus was on the evolution of the Foundation as a  whole. More, it's the first book in the most famous science fiction series  ever. A must-read for any serious SF fan.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on January 15, 2003", "Text": "This book has flaws, yes, as some of the earlier reviewers have pointed out, but they are seriously missing the point if they give the book fewer than 2 stars.  Asimov was a man of great ideas and scientific knowledge, but I do not believe that he ever took a creative writing class.  He was writing back in the days when a writer wrote, rather than talked about writing.  So, OK, some of the characters talk as though they are in a cowboy movie.  So, OK, some of the dialogic phrasings are awkward or stilted.  So, OK, there is only one teeny tiny female character (as a black man myself, I might aslo point out that we of the African Diaspora are noticeably absent from the futuristic roll call).  The whole idea of psychohistory is so engaging that you sit there for hours pondering it and thinking, and he was so young when he wrote this.  So young.  This is a great book, a true classic.", "Helpfulness": 0.8571428571428571, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FBV6BC7N8WKW"}}, {"Date": "on April 7, 2000", "Text": "This is the first book I have read on my own and really fallen in love with. I am in 8th grade, and I found it very easy to understand and tremendously engrossing. I just couldn't put it down after I started it. Sometimes I would laugh out loud as the characters would pull such  amazingly witty and ingenious double-crosses on their enemies. A definite  must read for any sci-fi fan.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on February 22, 2000", "Text": "This is just about the best SF series ever, and this book is the best in the series. If you want to get into Asimov's universe this is the place to start. Just as good are his Robot series. Every one of Asimov's characters  are expertly defined and easyly remembered. One of the best reads I ever  had. Excellent (that's why I won't spoil the plot).", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GVN0D20PS4SM"}}, {"Date": "on June 13, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGDMKXZE2QT1D"}}, {"Date": "on March 29, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19VJA4IMAGAKG"}}, {"Date": "on August 25, 2005", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NJO6YE954DBH"}}, {"Date": "on August 1, 2004", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AG0K8NHQ8XS97"}}, {"Date": "on May 15, 2004", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DF7LMEQOND63"}}, {"Date": "on July 24, 2002", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NNFVSGCJNIX1"}}, {"Date": "on September 5, 2008", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A284WCZ6TKNAKX"}}, {"Date": "on July 31, 2009", "Text": null, "Helpfulness": 0.8571428571428571, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UWDCYEQWN7IR"}}, {"Date": "on December 2, 2013", "Text": "Don't even consider buying this book.  It is only an \"adaptation\" created by the BBC which means it's a silly script that they used at some time.  If all you want is what someone else considered the most important parts of the Trilogy then I would suggest Cliff Notes.  Total disappointment, especially since I bought it as a gift.  I returned it immediately.", "Helpfulness": 0.7857142857142857, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NDUPW3K3ANCR"}}, {"Date": "on August 3, 2000", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32PBNS7SGYRWE"}}, {"Date": "on February 18, 2006", "Text": "I know I'll take some major heat in saying this, but I wasn't that impressed with this beloved classic. Oh, the idea intrigues me, surely, that of humankind eons in the future existing across the galaxy on a multitude of worlds, so far removed from earth that eminent masters of science themselves debate whether earth was even the planet where human life began, but once the dust settled from an idea that lofty, what did Asimov really DO with it? He used it for unexciting little tales of science v. military might. I love the parallel between the fall of this vast space empire and the fall of Rome. The way bands of scientists struggled in a dark age to keep the light of knowledge alive was thought-provoking (which is high praise in my lexicon) but this was backdrop, and the plot Asimov employed in telling the story of all this was (sorry to say) dull, slow, simple, and unworthy of the imaginative concepts he thought up in his setting for this tale of knowledge overcoming strength of arms. I haven't read the later Foundation novels, so maybe they're the ones where the brilliance of the series exists, but I found this book from Sci-Fi's golden age so demanding on my patience that I didn't finish it the first time I tried to read it and barely made it to the end the second time. I wish I shared the glowing praise for this classic that millions of others claim they feel, but to be honest, I just don't.", "Helpfulness": 0.75, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28WJUJF6D2ULA"}}, {"Date": "on July 2, 2006", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AR89Z050QFYR"}}, {"Date": "on January 26, 2001", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATOY4NGAV65W0"}}, {"Date": "on July 31, 2002", "Text": "I am making my way through the original Foundation trilogy for the third time now, and I'm still gaining new appreciation for it. Fifty years after it first appeared, Asimov's Foundation series can still justifiably be called a classic. A clear influence on the Star Wars saga, and probably Star Trek as well, along with a large chunk of all science fiction that has come since. Sure there are a few things to quibble about with this series, and with this first book in particular. Asimov's vision of the distant future, with its nuclear reactors, microfilm communications, and picture phones, all seems ridiculously quaint today. As the story blasts through several decades, interchangeable characters come and go without making much of an impression, and this first book is so obviously part of a trilogy that it doesn't have a chance of standing on its own. But that's not the point, and by focusing on these quibbles you're missing the forest for the trees. Here Asimov has created a tremendous masterpiece of the imagination that is larger in scope than just about any other literary creation. The saga is built around the intriguing concept of psychohistory, in which the movements of huge masses of people can be accurately predicted over thousands of years (while it is still impossible to predict the actions of any one person). An ossifying empire, obviously based on the Roman Empire in its death throes, is on the verge of horrific collapse when the Foundation is created to subtly change the course of history behind the scenes, and gradually rises to prominence and tries to usher in a new golden age. The entire saga (not just this first book) takes place over a thousand years across a whole galaxy, while Asimov believably incorporates a full palate of psychology, politics, and sociology to lend the story credence. Still a masterpiece after all these years.", "Helpfulness": 0.8333333333333334, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2B9Y0WXNSN17U"}}, {"Date": "on September 8, 2000", "Text": "If you've read Foundation and Foundation and Empire, I see no reason why  you wouldn't want to read this last installment.  Foundation and Empire  ended on the most amazing twist ever put to paper. A review would be  pointless. Besides, most reviews are a sharing of opinions between people  who have read the books,  rather than providing insight for those that  haven't. If you haven't read them, please do, and do so like the first  Foundation, blindly and with no knowledge of the secrets that are to come.  By now you know who the Mule is, his powers, and his purpose. Asimov so far  only hinted at the Second Foundation, and why it must be kept secret. To  defeat the Mule, they had to reveal themselves. That makes up the first  half of the book. What would happen when a group of psychologists with  superior mental powers face a mutant with equal or greater powers? There is  no actual \"battle,\" and this might be disappointing. The  anticlimax builds to a quick defeat for the Mule, but I think it was the  only way Asimov could have handled it. Asimov wanted to end the series  there, but his editor at the time, John W. Campbell, would have none of it.  Good thing, too, because it gets more exciting.  Now that the first  Foundation is aware of the Second, their actions are now random, based on  their belief that the Second Foundation will help them through any crisis,  and therefore unpredictable. The Second Foundation must now come up with a  plan of their own to convince the first that they no longer exist. No small  feat. The first Foundation let themselves be guided for so long, that they  no longer think or act for themselves, despite their military and economic  might. Hmm, maybe we could learn something from this. The Foundation is not  yet ready for a ruling class of psychologists, and would resent their  authority. Is the Second Foundation therefore their enemy? You might ask  yourself this.  This last part of the book centers on Arcadia Darell,  the granddaughter of Bayta Darell, whom you know from F&E. Her romantic  and adventerous spirit leads her to stowaway on board a ship with her  \"uncle\" to search the Mule's records, and find out more about the  Second Foundation.  Asimov is not only one of the best science fiction  writers, he is also an excellent mystery writer, and \"SF\" reads  like a great thriller. But don't skip to the end, which is just as amazing  as Foundation and Empire. When you think you know everything, guess again.  Each of the books stands on its own as a classic of science fiction, but I  prefer to take these books as a whole. The other books in the series are  okay, but redundant. All the excitement is concentrated into these three  books.", "Helpfulness": 0.8333333333333334, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28FMB1W9FX4Y6"}}, {"Date": "on December 28, 1999", "Text": "If you had bothered to read the entire series, you would know that one of the major heroes in the book is a young girl, Arkady.  In fact, once the Foundation books tie in with the Robot series, you will find another woman  hero, the \"mother of robotics\", Dr. Susan Calvin.  So your  comment about the \"deplorable\" lack of women in the Foundation  books is off the mark.  And the characters are not poorly developed - what  you learn about characters like the Mule is staggering - but you wouldn't  know that because it is in the second book.  I hope you don't do this with  all literature - try getting the facts first, then give an honest opinion.  You will be well respected for it, even if most people disagree with you.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGISHRJAV0DLQ"}}, {"Date": "on October 30, 2005", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16JTNAEKD139I"}}, {"Date": "on November 28, 2005", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ERBVY57L6JJR"}}, {"Date": "on January 29, 2004", "Text": null, "Helpfulness": 0.8333333333333334, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AP5NXS66INNOB"}}, {"Date": "on February 4, 2001", "Text": "The second book of the original trilogy, this book is an amazing follow on to \"Foundation\". The seven books of the Foundation series together form what I consider to be the most complete and astonishing blend of deep reality with science fiction. The septet, for the uninitiated, include (in the order I believe they should be read in): Prelude to the Foundation, Forward the Foundation, Foundation, Foundation and Empire, Second Foundation, Foundation's Edge and Foundation and Earth.  Do yourself a favor, buy them all. If you don't drool over the books by the time you're done with them, read them again.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NM9023KLTWL3"}}, {"Date": "on August 10, 2004", "Text": "I have not readf the Foundation series in years.  However, the other day I was thinking about how much fun the trilogy had been. One has to remember that most of the scifi you read today has at least some of its roots based in Asimov's work,  Asimov was not the best writer, nor was he the most creative.  What he did accomplish was selling you another time and world that you could believe in.  So, taking it for what it is, not a great piece of literature but a really enjoyable trip, i need to give the trilogy 5 stars.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YNIRQA2JJTKQ"}}, {"Date": "on August 29, 2009", "Text": null, "Helpfulness": 0.7777777777777778, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZWWXOB11VDSE"}}, {"Date": "on September 18, 2004", "Text": null, "Helpfulness": 0.7777777777777778, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1K1JW1C5CUSUZ"}}, {"Date": "on June 23, 2009", "Text": "This is a wonderful edition of this classic series. Very nice, slightly glossy, pages and excellent binding. I would say this should be considered as the \"definitive\" version. If you're a new-comer to the Foundation series, or a veteran looking to replace those battered old paper-backs with a shiny new edition, this one should be top of the list. The story itself is 5-star greatness, of course! The price is also excellent and shipping was super-fast, for me.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQN3VCPCOPIA2"}}, {"Date": "on December 28, 2003", "Text": "This volume of The Foundation Series is my favorite of the entire set. The First Foundation, sent out to survive the fall of the Empire, now faces an insidious enemy. The Second Foundation may have originally been set up by Seldon to influence and maintain the plan, but now they are undoubtedly corrupted by a mindchanging influence. The plot takes many delightful twists and turns, making this a masterful mystery as well as a good sci-fi tale.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IU7S4HCK1XK0"}}, {"Date": "on February 20, 2000", "Text": "This novel, the first in a (50's) series of three, has not dated one bit since its first appearance. Like The Lord of the Rings, it should really be read in combination with its sequels, but the book contains its own strong  moments, especially the first section on Trantor. I was amazed and moved by  the cleverness of Asimov's plots, something he is of course well-known for.  Highly recommended.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACIW8J8AQI2RI"}}, {"Date": "on January 2, 2002", "Text": null, "Helpfulness": 0.75, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XGHUCI1MYGRE"}}, {"Date": "on November 26, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6OY2DIUTE197"}}, {"Date": "on September 22, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A353S31FPSCZ6J"}}, {"Date": "on January 6, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12RRA597ZWRL"}}, {"Date": "on September 3, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1V09ASZ9HWQAE"}}, {"Date": "on July 4, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AG7R3MMF8QLDT"}}, {"Date": "on April 11, 2011", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VKTL2STG4482"}}, {"Date": "on March 19, 2011", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NBL1TI2M3CW1"}}, {"Date": "on October 1, 2010", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QSSKI2U33K4R"}}, {"Date": "on July 7, 2009", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AU503HFYAB0IG"}}, {"Date": "on October 15, 2008", "Text": "Second Foundation (despite its title) is the third part of the original Foundation trilogy by Isaac Asimov, and it's a hell of a good book, as well as an extremely bleak book in its portrayal of the human future. The first part, Search By The Mule, published as Now You See It... in the January, 1948 edition of Astounding Science Fiction, concerns the search for the Second Foundation of Hari Seldon by the mutant who has conquered almost the whole of the galaxy within a few years, including the First Foundation, by dint of his ability to control the emotions of individuals. Each chapter within this section ends with an antichoros section told from the point of view of the First Speaker (of the Speakers ruling body) of the Second Foundation, as he monitors the goings on.... Overall, Asimov's masterpiece (the trilogy) is one of the bleakest works of art ever put forth. While there are great characterizations within, it all seems futile, to the point that fatalism renders even seemingly tragic heroes into moot gray pawns. Most characters are even alienated from alienation. The Second Foundationers seem in firm control, the First Foundationers believe they are, having seemingly rooted out the Second Foundation's threat, and the subject peoples of the galaxy seem contented to let the Psychohistorical plan play out about them. Could this be more apt to many current belief systems- political, religious, philosophic? The only bright side that the trilogy leaves the reader is to be found in not the Mule, himself, but in what he represents- the living embodiment of the Fallacy Of Uninterrupted Trends. Somewhere in the future of the galaxy there has to be an even greater, and higher speed bump for the Second Foundation, and in that bump could lay human salvation. Isaac Asimov's trilogy is not just a science fiction masterpiece, but one of the great works of fiction, period. Yes, there are dated attitudes and science, but the trends and actions of the tale's players are recognizable from far off. And that is because they are not so distant, after all. In such parallax is great art given life. Breathe it.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SFO2GSP5CVSM"}}, {"Date": "on September 29, 2006", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MNB9PF4QMK9P"}}, {"Date": "on May 8, 2004", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DF7LMEQOND63"}}, {"Date": "on April 12, 2004", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMW6Q2PG5BI8A"}}, {"Date": "on February 17, 2004", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QEQ26KKK6DIM"}}, {"Date": "on September 8, 2000", "Text": "On first reading of this trilogy, starting with Foundation, I was a bit  bored by the politics. But all three books were in one volume, so I kept  reading. I'm glad I did! Every time I've read them since, I discover  something new to love. The ending of this book blew my mind! If there is  such a thing as a literary high, I was on one for a week after reading this  eight years ago. No book or movie you can name comes close to this kind of  thrill or scope. And just when I thought Asimov couldn't take it any  further, he does, with a character's last statement.  By now the  Foundation has gained dominance over its surrounding enemies. All part of  Hari Seldon's (the Foundation's founder) Plan. And they are strong enough  to face the Empire.  The first half of the book is a power struggle of the  leaders of the Empire, more politics, and a small band of traders, rebels,  and scholars, who wait for the coming of the \"magicians\" to  someday be their saviors.  The second half of the book follows a small  group of people belonging to the Democratic Underground who expect major  political changes for the next Seldon Crisis. They hear of a man who calls  himself the Mule. Generals surrender to him without a fight. His worst  enemies become his most faithful subordinates. They seek him out, thinking  he can help their cause. No one can explain the success of the Mule. Where  did he come from? Was he planned by Hari Seldon? Hari Seldon appears, as  before, as a hologram, explaining the crisis and the course of action. But  he makes no mention of the Mule. Everything has gone awry, and Seldon's  plan is out of whack, and the galaxy might revert to the 30,000 years of  barbarism Seldon was trying to avoid.  Hari Seldon counted on several  things, that there would be no major changes in the galaxy's technology,  such as something that could withstand any bombardment, or strange  neurobiological weapons; and, that human reaction to stimuli would remain  constant. If it's not the first, it must be the second-- the Mule has  mental powers. How do they fight him? By seeking out this Second  Foundation. Hari Seldon mentioned it vaguely, but  there is no record of  its purpose, and no proof of its existence. This same small band from the  D.U., including a psychologist (as the Foundation considers one), set off  to the center of what's left of the Empire, The planet/city Trantor, to  search Seldon's records. The whole time managing to stay out of the way of  the Mule's path of destruction, and ends with the awesome climax I  mentioned.  Does the Second Foundation even exist? What is their  purpose? The psychologist, working on overdrive, seems to have found its  location. \"It was so simple,\" he said. But he doesn't live to  reveal his discovery. Did he really find it, or was his mind too distorted  to make any sense? There are more surprises  and excitement to come in the  trilogy's third installment, Second Foundation.  Some people have the  gall to call these books wordy or boring. Keep in mind that Lord of the  Rings had its slow parts, too, but the few exciting parts are what you  remember and hold it all together.  It's better to take these books as a  whole. For that, one is not necessarily better than the other two, they are  all essential to the whole story line.  Perhaps someday we can look  forward to a mutilated Hollywood version, then go back and re-read the  books, and hold them dear to our hearts.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28FMB1W9FX4Y6"}}, {"Date": "on August 5, 2013", "Text": "To start, I've never been a big Asimov fan. He has such wonderful ideas, but his characters are always dull and one dimensional and his prose is clunky. Still, there are some fascinating concepts  in this series. It'd be nice to see some more emotional writers take a spin at the universe.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2E8G78TRNNT1M"}}, {"Date": "on January 9, 2002", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23REWL3UN83V2"}}, {"Date": "on July 25, 2009", "Text": "A science fiction book where the science is more political than technological. Psychology  had advanced to the point where mathematical models of mass psychology could predict large group social behavior far into the future ( rather like the meteorological models attempt to predict weather several days in advance). The predictions in this case extended over several centuries and predicted the galaxy would undergo a dark age in which civilized learning and behavior would decrease and collected knowledge could be lost. A Foundation was formed at the far edge of the galaxy with the sole job of organizing and saving all knowledge. Since the book takes place over a long period of time we follow the adventures of several heroes involved with the Foundation's effort to not only maintain knowledge (for the time when civilization will return) but to do so while maintaining peace. This was done first by creating a religion based on the fact that only the Foundation had technology, most importantly nuclear power. This source of power, needed by all, then became an object of worship, and priests were trained in how to present the dictates of the Foundation (Source of Power) as a reason for good behavior. When this sham began to fail, it was found that trade between the high tech Foundation and the low tech other nations was more profitable than war, and could maintain peace. This is the first book in a series of three, so most likely the next book tells how the trade idea worked out. Although my description does make it sound boring, I found it to be an interesting book, the politics of which sound familiar in today's world - I may read the next in the series.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOP5K4K01B0PH"}}, {"Date": "on February 5, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIQEHMC9TKGK5"}}, {"Date": "on October 19, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30NFG0FXCJT9J"}}, {"Date": "on September 11, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXFTSEZXAR95F"}}, {"Date": "on September 11, 1998", "Text": "The first time I tried to read Foundation, I was six years old, and it was  simply too complex for my developing mind.  Just a few months ago, however,  I was cleaning out my attic and came across the same old book.  To  ascertain it's actual nature as interpreted by the adult mind, I read it  again.  I was amazed not only by the sheer brillance and ingenuity of the  ideas contained within it, not only by the grandiose size of the subject  matter, but mostly by the writing, which I regarded as absolutely horrid.  The plot is clunky, the conversations roll off the tongue like sandpaper  covered in peanut butter, and the descriptions could have been written  better by some obscure species of mosquito.  As a book, it could be  improved by changing the title from \"Foundation\" to \"How Not  to Write a Book\" or \"Please Steal These Ideas and Rewrite Them in  English.\"  I highly reccomend it to people for use as a very expensive  and ineffective paperweight.", "Helpfulness": 0.75, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AO8FT8WSAEA18"}}, {"Date": "on September 4, 2002", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12FFFY7WOZIZS"}}, {"Date": "on August 14, 2005", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQOGAX8SCA765"}}, {"Date": "on November 7, 2010", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EAR10P5PK8BY"}}, {"Date": "on September 10, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15N2KH9PWTN6Y"}}, {"Date": "on September 25, 2006", "Text": null, "Helpfulness": 0.8, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MNB9PF4QMK9P"}}, {"Date": "on January 30, 2002", "Text": null, "Helpfulness": 0.8, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WKMAU450WXCT"}}, {"Date": "on September 28, 2000", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BQE4QGYJ0UWW"}}, {"Date": "on July 8, 2008", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EIZI23F1Z6MP"}}, {"Date": "on May 31, 2000", "Text": "I thought the book was somewhat dull compared to the first \"Foundation\" novel, because there are no brilliant characters such as Salvor Hardin or Hober Mallow and no great accomplishments. The  first part of the book about Foundation's struggle against the Empire is  not impressive. The second part about the Mule was moving sort of slow  until a brilliant ending. I was absolutely shocked at it and I thought that  it was definitely worth reading the entire novel for the ending. In fact  the emotion that I experienced must have been something like what people  influenced by the Mule felt! I also realized I had a great affection for  the Mule, it is fabulous that a person who is predicted to be a pathetic  loser in life makes it beyond all expectations. I know that the Mule is  supposed to be a bad guy, so now that I am reading \"Second  Foundation\" I hope that its ending would not be overly dramatic for  him.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28V4HHQM3UDXB"}}, {"Date": "on August 2, 2012", "Text": "Foundation is great science fiction for the scientific minded, no deus ex machina here.  The only fault I find with this 1st book is that the 3 main characters are exactly the same person.  Seldon, Salvor Hardin and Hober Mallow are the exact same character.  All calm, cool and collected.  Perfectly confident and perfectly logical.  No difference in dialogue and problem solving skills, you wouldn't be able to tell from Asimov's writing that these characters are from different time periods and are from different cultures. For that matter, every character in the book seems to be of the same culture and dialect. I realize Asimov uses a minimalist style of writing, like Hemmingway, there are good and bad sides to this.  No fleshing out of characters has to be considered weakness in Asimov's writing.  It may have made for a longer book, but his characters would have been better served if they all didn't behave as robots.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QUO19DK6U83X"}}, {"Date": "on February 12, 2010", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A186UU1WUA4KGE"}}, {"Date": "on April 20, 2014", "Text": "I became an avid science fiction fan when I was in the third grade. Heinlien was my first, followed by Asimov and Clarke and a host of lesser stars. Reading science fiction created an overnight interest in real science. In those early years there were conflicts between what was portrayed in the trilogy and what was taught in the science classroom. But every so often things like chaos theory came long to make me go..ah... Asimov was just ahead of his time. No doubt the Foundation series will remain the greatest of its kind for generations. This series started my love of literature. I had finished the series over 50 years ago...reading each several times. Now, as I enter the final months of my life I have gone back to my beginnings. Sorta like that story of the elderly folks who climbed up into the attic to rediscover the toys that brought such joy so long ago.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1K118QNRN5AWB"}}, {"Date": "on April 10, 2002", "Text": null, "Helpfulness": 0.8, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYKU7U6G4P4XL"}}, {"Date": "on April 20, 2009", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEWPLEGJUNW2Q"}}, {"Date": "on October 7, 2002", "Text": "This is truly a defining book for the genre of science fiction. The beauty of this tale is that Asimov began penning it when he was only twenty one years old.  The story centers around a falling empire and the many characters throughout its history that define it.  It also deals with a sort of scientific prophecy in what is termed \"psychohistory\".  This is the manner in which the future can be predicted using scientific evidence and the laws of probability.  This is truly a masterpiece of the genre.  A standard which all sci-fi authors should hope to attain.  I would recommend this read to anyone that is a science fiction fan.  Many readers are familiar with Orson Scott Card.  This is the novel which prompted him to become a writer. That this novel is a cornerstone in the genre is an understatment.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Y5JUHKS4KD7G"}}, {"Date": "on March 6, 2002", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30KEXFT9SILL6"}}, {"Date": "on November 2, 2001", "Text": null, "Helpfulness": 0.8, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31GT8U32CIKW0"}}, {"Date": "on October 30, 2005", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16JTNAEKD139I"}}, {"Date": "on December 22, 2008", "Text": "Asimov is not my favorite author--nor is he my favorite sci/fi writer (that would be Simak).  Be that as it may,  This is my favorite work of sci/fi.  Not due to the quality of the prose,  but because of the ingenious stories and characters here.  I also like the great span of the trilogy.  But,  the main reason I keep re-reading it year after year is because of The Mule.  The Mule is one of the most evil and tragic personas ever to grace a novel.  The depth of his solitude is on a par with Ophelia,  Gollum,  or Count Dracula.  The Mule is all powerful,  pathetic,  depressing to the point of suicide.  An unforgettable character in all of literature.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADMZXQ714FFUR"}}, {"Date": "on August 2, 2002", "Text": null, "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37XGUQ1VH0XM6"}}, {"Date": "on January 9, 2001", "Text": "Re-reading Foundation showed it to be rather dated in its depiction of an advanced galactic empire, rooted in its 1940s science fiction environment. The overall plot, such as it is, betrays the novel's origins as separate short stories, and the characters tend to be wooden. Foundation and Empire, the next book in Asimov's original Foundation trilogy, is a much better novel, especially in its depiction of the character of the Mule. However, the concept of psychohistory introduced in this work is fascinating and the key to the other books by Asimov and others describing past and future developments in the Foundation universe.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17JSYLFT9PM2L"}}, {"Date": "on August 23, 1998", "Text": "This book is astonishing! Foundation was great, but this book was even  better. I was hooked from the moment I started reading. It immedietly  strung together details in the first book which I thought were meaningless.  Although the war between Foundation and Empire was good, the best parts of  the book was the story of the Mule. This was one kick-a** story!  The  moment when everyone found out that Hari Seldon's plan had gone wrong in  the Vault was one of the series' finest written moments, and the end, oh  don't even get me started about the end of the book. I won't spoil it for  you, but it is a great plot twist!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on February 22, 1998", "Text": "From Selvor Hardin taking power from the encyclopedists to Hober Mallow conquering Korell by doing absolutely nothing, I found this to be the best sci-fi novel ever. Ender's Game and Dune don't hold a candle to it. Each story is a 10 on it's own.  The way the foundation grabs victory from apparent defeat is amazing. Even though Isaac Asimov (my favorite sci-fi author) has nuclear power be able to do anything, it doesn't take away from the story. It's the best book of the foundation series for sure.  If you read sci-fi, you've got to read this.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on January 20, 2005", "Text": null, "Helpfulness": 0.7272727272727273, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YF4ZMECJVLK9"}}, {"Date": "on January 1, 2003", "Text": "This fantastic trilogy takes you through the fate of the universe.  Of course which universe isn't ever exactly clear.  The greatest feat of these three books, is their ability to never use any amount of action though, aside from the basic walking in and out of rooms, boarding craft and whatnot.  In one of the later books in the series, (These first three were the original, but society demanded more), Asimov even himself said that he was surprised at the lack of action.  Wonderful books though.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VMF1QR68KJQ8"}}, {"Date": "on February 11, 2010", "Text": "When I was a teenager, I was stunned by \"The End of Eternity\".  When later I started reading the Empire and Foundation novels, I was unpleasantly surprised by the style simplification that seemed to accelerate with every novel. Now, when I've read them all, I think I understand what happened: there was no time for a better literature craftsmanship, new universes took all the time. Somehow, it resembled Federico Fellini's movies - same feeling of creation of the worlds just in front of  you.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27GRAGDTE4M2"}}, {"Date": "on February 5, 2002", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30KEXFT9SILL6"}}, {"Date": "on November 26, 2014", "Text": "Read this more than thirty years ago, and this time I paid more attention.  Certainly the main characters act like products of the 1940s, somehow placed in the far future.  Certainly, as a woman, I noticed that female characters are almost absent and the single woman with a few speaking lines is a virago.  But this IS a book with interesting ideas, and the 7th and 8th graders in my book club find those ideas compelling and easy to discuss intelligently.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17CX4O0FHB5UE"}}, {"Date": "on January 27, 2005", "Text": "I always enjoy reading Isaac Asimov's writing, and foundation was no exception.  The plot is imaginative and original, like much of Asimov's writing.  Foundation is set in the future, a time when our galaxy is ruled by a failing empire.  Hari seldon, a psychologist, must prevent the galaxy from falling into anarchy and barbarism by creating a foundation of scientists.  Foundation is fun to read, and provides ample entertainment.  I recommend reading it.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BZMNBFPT3UG2"}}, {"Date": "on May 15, 2007", "Text": null, "Helpfulness": 0.8, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFCQWNNJW6S9G"}}, {"Date": "on November 24, 2004", "Text": null, "Helpfulness": 0.8, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZQE3IXHBA6NY"}}, {"Date": "on July 4, 2001", "Text": null, "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on August 19, 2008", "Text": "Great book!  First in the series of three novels, all three are worth the read.  I read all three in about two and half weeks.  It might be interesting to read them in conjunction with Kuhn's Structures of Scientific Revolutions.  Every \"Seldon Crisis\" brings about a \"new world\".  Really fun stuff.  Don't miss out!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HEEDADJKS9YZ"}}, {"Date": "on May 22, 2009", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A57EDR4YJW18A"}}, {"Date": "on May 28, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I671P68DQ0TM"}}, {"Date": "on August 19, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A363RAQ1NTCXTW"}}, {"Date": "on March 20, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIQEHMC9TKGK5"}}, {"Date": "on August 10, 2011", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A141INATZF2WOC"}}, {"Date": "on July 26, 2011", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LI8P7VU8UWPU"}}, {"Date": "on June 22, 2011", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NBL1TI2M3CW1"}}, {"Date": "on May 16, 2011", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GB62ZVE8C1VC"}}, {"Date": "on March 19, 2011", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NBL1TI2M3CW1"}}, {"Date": "on March 9, 2011", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEAUJ447F9ZVS"}}, {"Date": "on October 25, 2010", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2U7OXTUGIE5S8"}}, {"Date": "on August 10, 2010", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMVC9WTXYKNJ1"}}, {"Date": "on May 31, 2009", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RTALBQFR3TTZ"}}, {"Date": "on February 13, 2009", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29T5SSBQX59BC"}}, {"Date": "on January 21, 2009", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MQAQT8C6D1I7"}}, {"Date": "on November 30, 2008", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AX29022MMHYS"}}, {"Date": "on October 31, 2008", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3E8QNDC7CV44"}}, {"Date": "on October 2, 2008", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SFO2GSP5CVSM"}}, {"Date": "on May 11, 2008", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GAY5VH2LDFWK"}}, {"Date": "on January 24, 2006", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HVMK2W17T9ZU"}}, {"Date": "on March 5, 2005", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWLFVCT9128JV"}}, {"Date": "on April 30, 2004", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YF4ZMECJVLK9"}}, {"Date": "on December 23, 2003", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AUBGENRIZODO"}}, {"Date": "on August 2, 2002", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2B9Y0WXNSN17U"}}, {"Date": "on December 15, 2000", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10KKJMBY5L7TK"}}, {"Date": "on December 4, 2000", "Text": "\"The Foundation\" by Isaac Asimov is a very thrilling science fiction book.  This book takes place so far into the future that they do not know which planet humans came from!  This book spans over 160 years and shows the developments of the Foundation. The Foundation is a group of people sent to a remote planet to preserve information and to secretly start a new empire.  When the old Galactic Empire begins to crumble, Hari Seldon starts the Foundation.  He and his followers work on an encyclopedia to help shorten the barbarian age that results from the destruction of the empire.  Seldon's true plan for the Foundation is to raise the next empire that would control the galaxy.  As the book continues, the Foundation grows and tries to spread their beliefs across the galaxy.  Powerful neighbors become jealous and try to conquer the foundation and destroy it.  The Foundation wins usually using non violent means unlike their violent foes.  When  the Foundation starts to conquer the other surrounding worlds, they expand and send out traders. Traders hold the Foundation together and keep up the economy by trading with the inhabitants and bringing them the Foundation's beliefs. Much of the galaxy is unaware of the Foundation's secrets and the power it holds!  This book is divided into five sections, starting at different time periods with new characters and conflicts. The beginning of each section is difficult until you learn the new characters. However, the books flows well since the ideas of  people in the past sections are presented in each new section as historically important. Each section is exciting with descriptive characters and a suspenseful plot.  The book is a fast read, written for pure enjoyment and entertainment. It does a terrific job of both. I would highly recommend it to anyone who is looking for a good book.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6VP0PHGUHKJO"}}, {"Date": "on December 2, 2008", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AC3C00YW5K55B"}}], "ReviewUrl": "http://www.amazon.com/Foundation-Isaac-Asimov/product-reviews/0553293354/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.3 out of 5 stars"}, "OfferPrice": "$7.04", "Salesrank": "#6,238", "ListPrice": "$7.99"}