{"Category": "in Books (", "Name": ["Coraline: The Graphic Novel"], "Timestamp": "2015-05-24 23:35:30.916656", "itemurl": "http://www.amazon.com/Coraline-Graphic-Novel-Neil-Gaiman/dp/0060825456", "Reviews": {"TotalReviewCount": "71", "ReviewList": [{"Date": "on August 7, 2009", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1D2C0WDCSHUWZ"}}, {"Date": "on April 8, 2009", "Text": "This book is a graphic adaptation of Gaiman's original novel.  It tells the story of Coraline, a curious young girl who discovers a secret door in her house.  The door takes her to what seems like a duplicate of her house, with parents that look like hers but have buttons for eyes.  They want to keep Coraline and she has to use her bravery and cleverness if she wants to escape from this other world and return to her own.  This was the first graphic novel that I have read and I was very impressed.  The artwork was done beautifully and really grasped your attention.  My only complaint is that it took me much longer to read the book than I expected because I was so interested in every detail of the artwork.  The story was very good, and would appeal to older children who enjoy fantasy and horror stories.  Some of the pictures are frightening, so I would not recommend it for young children.  I am now very interested in going to see the movie!", "Helpfulness": 0.8571428571428571, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1B07OKFD7L843"}}, {"Date": "on January 29, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13G1TKIKHGV3F"}}, {"Date": "on September 12, 2008", "Text": "My 10 year old daughter is not a big reader and given her age she's in the \"between\" stage.  I read the book first and could not put it down.  After I gave it to her, she could not put it down. She likes it so much she shows it to all of her friends.  I definitely reccomend this.", "Helpfulness": 0.8571428571428571, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AY2E3PEAFCKVQ"}}, {"Date": "on October 11, 2008", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATS7LYGLUX34L"}}, {"Date": "on August 22, 2008", "Text": null, "Helpfulness": 0.8, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JP0URFHXP6DO"}}, {"Date": "on September 15, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Y9LPVKLJHZBE"}}, {"Date": "on May 11, 2009", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2APZCZ0IKOBU2"}}, {"Date": "on March 21, 2011", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EDZH51XHFA9B"}}, {"Date": "on April 17, 2010", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3J508PGRZHBHV"}}, {"Date": "on August 25, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AIE9DO5QSVBD"}}, {"Date": "on November 25, 2011", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2B30ST9GPD0DH"}}, {"Date": "on September 10, 2011", "Text": "Nothing will ever match the deliciously understated horror and shimmering brilliance of Gaiman's classic first edition, nor the perfection of Dave McKean's intuitively spot-on original illustrations (including the fine film adaptation), but this is a winner as far as graphic novel adaptations go. Noted illustrator P. Craig Russell does a consistently compelling job in communicating the mundane and ethereal horrors of Gaiman's story and tailoring the images in such a way that they can be appreciated by children as well as by adults. The emphasis here is more toward impressing children, I would wager, even as McKean aimed for a universal audience with his stark interpretations of Coraline's harrowing adventures with the \"Other Mother\". The result is a graphic novel that incorporates the bulk of Gaiman's original text and combines visuals that truly complement the trajectory and tones of the overall story. Nicely realized work. Your graphic novel collection, if you have one, ought not to be without this rendition of a classic.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A311626XD2C4T2"}}, {"Date": "on June 26, 2011", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9CA7D2TZ0M4O"}}, {"Date": "on July 30, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DV8U8I3AN3ZK"}}, {"Date": "on November 23, 2009", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3O5RMXRQBWWVX"}}, {"Date": "on April 5, 2013", "Text": "I have a confession to make. I have never read the original Coraline novel.  My 13 year old son is OBSESSED with Coraline in all its forms and has begged me to read it and I mean to, but I haven't gotten around to it.  I loved the movie and when he recently received this graphic novel as a gift to add to his Coraline collection I grabbed it up and read it before I think he even had a chance to.  I am now hooked on Coraline and I know I have to move the novel to the top of my TBR pile.  This is just a chilling, mesmerizing and beautiful story.  I got the creeps just reading this version.  The illustrations were a nice contrast from the movie version visuals I know so well.  I really was taken in by the story and the differences between it and the movie version.  I thought the illustrations were lovely and brought just the right feel to the story.  I don't know that graphic novels in general will be my thing but this one was such a fun way to spend an hour.  Neil Gaiman has such a great imagination and talent for putting a world into words.  I look forward to reading more books by him including Coraline.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17U562HOY2OQV"}}, {"Date": "on January 21, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TXR85WQLE32N"}}, {"Date": "on April 7, 2013", "Text": "This is the fifth collaboration between Neil Gaiman an Phillip C. Russell. It is about a young girl, who likes to explore everything new and so she finds a door to an other world, where there's her another mother, who want her to stay and be a lovely daughter. I am from Germany and we just have read the book \"Coraline\" at my school. I think that it would be a great book for younger people to read it, because for them it would be a nice entertainment. For young children Coraline is a brave hero, who discovers a scary world. But for learning English it would also be useful to read the comic for older children because of the fitting vocabulary. P. C. Russell is very talented and the pictures are really great and so it is funnier to learn vocabulary and it isn't like an exercise to understand English texts, but you learn. Although I didn't really liked the book, because I don't like fantasy books and apart from the vocabulary it was easy to read it. For me it seems to be the perfect bedtime story and not nice graphic novel for teenagers.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHB39JWAER8AV"}}, {"Date": "on December 4, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KWQ2ID3VIAAZ"}}, {"Date": "on February 16, 2010", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CLOUNAICQ1M8"}}, {"Date": "on December 3, 2008", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13NHCGO34VAL7"}}, {"Date": "on May 3, 2013", "Text": "Quite frankly, I found this rendition of the tale a bit boring. I haven't read the original Coraline, but I assume this graphic novel, adapted and illustrated by P. Craig  Russell, follows it pretty closely.  All the colors are pretty muted in the artwork and it definitely lacks the intensity of other Gaiman graphic novels (I'm thinking the early Sandman Chronicles). Now I love Gaiman's work, so it is a little hard for me to say this: Coraline lacks magic. Yep. There it is. Perhaps I am, in part, saying this because I have seen the animated movie Coraline with all it's colors and odd beauty. So, I went into this graphic novel expecting something similar. Still, with that honesty, I still say it lacks. I almost did not finish it.", "Helpfulness": 0.6666666666666666, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APTLGKB7IVL9Y"}}, {"Date": "on January 20, 2010", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14C4SEXBZDUD2"}}, {"Date": "on September 24, 2008", "Text": "I have to admit that most of my exposure to Gaiman is through the hands of other artists.  In fact my introduction to Gaiman was via Dave McKean.  While I did not read the printed version of \"Coraline\" the graphic edition caught my eye and I picked it up and found I could not put it down.  Russell's visual adaptation gave me enough to establish boundaries, but left enough open visually for the head to bring the pages to life.  I find interesting the genre of materials (books, movies, graphic novels, music) that are related through the eyes of children, but are best experienced by adults.  \"Coraline\" fits this mold well.  I watched Jan Svankmajer's \"Little Oti\" last night--I would place that in this pool as well.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HVBB19LSOESX"}}, {"Date": "on February 8, 2010", "Text": "This graphic novel comes into its own using the now famous story of Coraline, a girl who feels frustrated with her parents only to find another set just like them behind a bricked up door.  It seems that these are the dream parents she's been waiting for but somehow evil lurks underneath.  The graphic novel doesn't have pictures like the animated movie but it doesn't matter, the pictures are quite effective and the reader soon doesn't care if the illustrations are similar or not.  In fact the pictures are creepier in this book.  The graphic novel is quite effective and absorbing.  I'm planning to use it as a reading in my middle school classroom.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25KKXUQQ0OLWB"}}, {"Date": "on June 4, 2014", "Text": "As a fan of Coraline, I had to read the graphic novel! I noticed immediately that she looked different, or actually, MORE normal than the Coraline I was used to seeing, which took a little while to get used to. The book used mostly all of the direct text from the book. Since I read the book Coraline countless times, reading the graphic novel was a a bit of a struggle for me since it was exactly like reading the book again with visual aids which, to be honest, weren't the best. If you haven't read the book Coraline or watched the movie, I recommend reading this first...Overall a nice, short read and ok artwork. I would recommend buying this.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19ASEBI6CXY24"}}, {"Date": "on January 25, 2015", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADN8TW9LZKYH1"}}, {"Date": "on October 31, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ENOOLF3ZXK71"}}, {"Date": "on September 10, 2009", "Text": "I love graphic novels, and have seen my fair share of them over the years.  This one ranks right up there.  I was very impressed with the story and the artwork.  The \"Other Mother\" was very creepy, and I found myself up during the middle of the night taking peeks at the artwork.  It is definately too scary for my 6 yr old.  I'm wondering if the movie is less intimidating and less frightening.  I have yet to see it.  But I can recommend this as a great graphic novel...the art is great and the concept is first rate creepy.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EZHMGGWY74HY"}}, {"Date": "on December 3, 2014", "Text": "It’s been a few years since I last read Coraline the full novel, so I can’t honestly compare the two. I remember my imagination giving it a darker feel than the more cheerful illustrations in the graphic novel version. However, it was extremely well done and I always enjoy a good graphic novel since they are more likely to find their way into the hands and hearts of reluctant readers than the original.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A316LY6HYM4SDM"}}, {"Date": "on February 20, 2010", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XKNHXWUSX8Q9"}}, {"Date": "on March 25, 2015", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14IIS966IMRQ4"}}, {"Date": "on October 1, 2013", "Text": "Item arrived before the actual delivery date, awesome!!! I don't even know what happened to my copy of coraline but when I doid have this I read it over and over it's just like a comic book and I do love those. As I watched coraline go through so much I felt like I was there with her, but as I do all books I recommend this to anyone who likes reading.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VOIIP3CAUCR4"}}, {"Date": "on August 3, 2009", "Text": "Today at the library,I picked up a copy of this book because I had it on hold.I believed it was the original text version,but I like this sooooo much better.I think it is a better representation,of the actions originally placed in text,and gives a better insight on the characters' roles.I recommend it to any of the text book lovers!Great!!!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on September 15, 2009", "Text": "Neil Gaiman never disappoints his fans. I thought the book was scary and full of action. Coraline shows how smart and brave she is when she faces her fake mother in the other world. The author kept the graphic novel true to the original story. I highly recommend reading this graphic novel.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PR4VEKXHZ0JU"}}, {"Date": "on March 15, 2011", "Text": null, "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2A1XYSB692L6J"}}, {"Date": "on December 14, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GBZKQSJTL68J"}}, {"Date": "on April 13, 2015", "Text": "Not only does Coroline look a LOT like my niece, but the graphic novel shows us a new dimension to the horror/thriller tale! It shows specific points-of-view and allows the reader to really immerse themselves into Coroline's reality. Great for kids and adults alike!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17FJ5RSFN16Y2"}}, {"Date": "on November 21, 2011", "Text": "What a great kids' story. I would have liked parts of it to be expanded and for the end not to feel as rushed, but that's a combination of always enjoying Gaiman's worlds and not being the right age group for the story.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7S7Q73V7K898"}}, {"Date": "on July 24, 2012", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1X2GRM3LPG5N8"}}, {"Date": "on September 6, 2011", "Text": "Coraline the Graphic Novel was alright for a children's book, I'm not sure if there was a difference between the regular and the graphic novel, but in all its a good children's book.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32WAWJAGMSJLS"}}, {"Date": "on March 22, 2010", "Text": "My little girl fell in love with the movie and when I saw this I had to pick it up for her.  She loves this graphic novel and I would recommend for any Coraline fan ;)", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AT2YSHVYOVJZW"}}, {"Date": "on October 21, 2012", "Text": "This product was great!! Everything I expected, and my little sister loved it!!  She's 8 now, and can read it to herself pretty easily.  Arrived in great condition.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AC5UTZZDM7745"}}, {"Date": "on June 18, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1464VJXQLLTVO"}}, {"Date": "on March 12, 2014", "Text": "This graphic novel was quite entertaining. The movie was a lot like the book, but there were A LOT of differences between them.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TU9MV9S3238V"}}, {"Date": "on January 10, 2013", "Text": "This book has been a huge hit with my students---okay, with myself, too. Even my kids who \"hate to read\" like this one.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AM4PGEYX2MVQC"}}, {"Date": "on June 17, 2013", "Text": "It's very different to most of comics you can read nowadays. A good script and a master like P. Craig Russell. Marvelous!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6FW5X6WMLNR4"}}, {"Date": "on November 10, 2013", "Text": "I bought this for my 11 year old after seeing the movie and becoming a huge fan - She could not put it down.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30BK0NTU9FRXC"}}, {"Date": "on May 24, 2014", "Text": "I know I'm too old to be scared by a graphic novel, but I was. It gave me nightmares. Yeah, I'm a wuss.", "Helpfulness": "", "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19Y1YM2A9GULJ"}}, {"Date": "on May 3, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HDAB54NU9RNQ"}}, {"Date": "on November 9, 2014", "Text": "Love the movie and this was even better! It was great seeing the difference between the two.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37KH73OX9680G"}}, {"Date": "on November 2, 2008", "Text": "I'm just an adult child at heart and love graphic novels. This one moves to the head of the class. Meet Coraline who has just about anything a child could want but is bored. She discovers a hidden world just next door. Tis similar to her world and yet vastly different and she learns a bit about life. Come join Coraline on her adventure. Perchance you may learn a bit about your life.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JWMUVY62O5P5"}}, {"Date": "on July 28, 2008", "Text": "One of the best of Neil's work. Coraline was clearly written in a manner more approachable for yonger minds. It is dark, in much the same way Charlie and the Chocolate Factory is, and requires an ability to imagine worlds outside of our reality. Some of the reviews less enthusiastic about this book seem to be written by people who think imagination is limited to envisioning yourself winning the big game. If you hate concepts like parallel existence, the possibility that sprites, faries and elves could have or still do walk our earth, and genearlly find sci-fi and fantasy a bit confusing - avoid this book. If you are of a broader mindset - this is a must have. It is also a great book to share with anyone ten and older.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SORZL733985Z"}}, {"Date": "on December 27, 2014", "Text": "Good choice for Gaiman fan", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NL4WD1O8NMFB"}}, {"Date": "on March 14, 2015", "Text": "Really cool. I love it!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29RNSY1K523PZ"}}, {"Date": "on September 8, 2014", "Text": "Wunderbar!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36ZFNQI7ONYNF"}}, {"Date": "on November 21, 2008", "Text": null, "Helpfulness": 0.5454545454545454, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AA3X67I602EAE"}}, {"Date": "on March 27, 2015", "Text": "Good!..", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASQFGHT7FCJ7Z"}}, {"Date": "on December 24, 2014", "Text": "Thanks!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20RDMAEKHI4SC"}}, {"Date": "on September 12, 2008", "Text": null, "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TX179XAT5GRP"}}, {"Date": "on November 15, 2009", "Text": "I didn't realize the book was a comic, but any_book was extremely helpful in dealing with me and refunding my money. The book arrived pretty fast and I would definately purchase from any_book again.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A240WMSSRNFNGS"}}, {"Date": "on August 18, 2008", "Text": "Wonderfully written, beautifully illustrated.  May we all appreciate what we have now, before we end up on the other side, with the singing rats and the button eyes... ;o)", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MEZBKAWIAIAZ"}}, {"Date": "on February 6, 2015", "Text": "good", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NLD5P886TTLC"}}, {"Date": "on August 5, 2013", "Text": "The story line is great but the book is written in a comic form. It would be great to be rewritten as a novel.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IJBD12F16WFY"}}, {"Date": "on February 28, 2009", "Text": "I bought this for my 9-year-old daughter prior to the release of the movie.  She had never read a graphic novel before.  She was quite enthralled by the book, and read it in a day...", "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJPT1TBPQSKX2"}}, {"Date": "on August 4, 2010", "Text": "AVOID AT ALL COSTS!! The original Coraline book with illustrations from Dave McKean is amazing and wonderful. This graphic novel sucks all joy and inspiration from the original. McKean was able to say everything in a handful of illustrations and not only does P. Craig Russell not add a single thing to the story he actually takes away the imagination and visual playfulness.  Buy the original book by Neil Gaiman with illustrations by Dave McKean.", "Helpfulness": 0.375, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HNUFYKNP3XXO"}}, {"Date": "on December 20, 2008", "Text": "CORALINE is a wonderful book...one of the best children's/Young Adult books ever penned (although I know more adults who've had the heebie jeebies scared out of them by this fine novel).  For reasons unknown, Neil Gaiman seems to allow artist P. Craig Russell to adapt Gaiman's prose work, turning them into \"graphic novels.\"  It's not a match made in heaven.  Russell's illustrations add NOTHING to Gaiman's fine prose.  If anything, Russell's illustrations tend to steal the thunder of unleashed & wild imagination that comes from reading a Gaiman story or novel.  P. Craig Russell's artwork is pedestrian (at best)and, truth be told, \"mundane\" would be a more accurate word to describe it.  His illustrations are so mediocre that they actually detract from Gaimans' fine storytelling abilities.  I do not know why they continue this collaboration...perhaps they're trying to hit the audience with Attention Deficiency Disorder, those who might not otherwise read a book unless EVERY last detail is reproduced in colorful illustration.  Much of CORALINE'S magic works in the same way that old radio programs worked (in the pre-television days) or the way songs worked so well (in the pre-MTV days)..Gaiman's prose allows the reader to open up the mind's cathedrals to conjure up our own nightmarish & magical worlds.  Russell's intrusion on this sacred bond between writer &  reader breaks an otherwise near-sacred relationship.  A movie version of this book?  Yes.  I can see how this will allow the story to flourish in a new way and direction (although I imagine some of the more gripping psychological aspects of CORALINE might be lost when released in cinema houses...of course, this remains to be seen).  As with P. Craig Russell's other adaptations of Neil Gaiman's prose works, his illustrations only cheapen what are otherwise masterfully told stories.  Please DO NOT think that I am knocking P. Craig Russell's known abilities/skill as an artist: his collaboration with Neil Gaiman on an ORIGINAL/JOINT effort, such as their joint work on SANDMAN'S \"Ramadan\" remains one of the finest comic books in existence.  However, Russell's adaptations of Gaiman's prose work are worlds removed from their beautiful, landmark issue of SANDMAN...and, instead, makes the CLASSICS ILLUSTRATED comics of old seem like masterpieces by comparison.  I'd love nothing more than to see Gaiman/Russell collaborate on a comic-book such as \"Ramadan\" (or the later SANDMAN-related story \"Death in Venice\").  However, Russell & Gaiman should do their reputations...as well as their readers...a favor and stop creating graphic novels out of Gaiman's fine prose.  It insults Gaiman's legacy, as well insulting  the intelligence of Gaiman's readers.", "Helpfulness": 0.375, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AIIEGC9MKHMV"}}, {"Date": "on November 11, 2008", "Text": "The story was very interesting but I was shocked to find out this was a comic strip book.  I think I would of enjoyed this book more after I read the novel.  I felt this book lacked the details in the story.  After reading the normal novel, then get this book - you'd enjoy it more.", "Helpfulness": 0.125, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28QZPPRKLFKWM"}}, {"Date": "on March 19, 2009", "Text": null, "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MUUD8ADY4JRS"}}, {"Date": "on May 21, 2010", "Text": "I didnt realize this was a graphic novel when i ordered it, so I was incredibly disappointed that I didnt get the book that I have been so excited to read. If you like graphic novels, then go for it. If you are looking for the book, be careful, this isnt it!", "Helpfulness": 0.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOE0ZENBK34BW"}}], "ReviewUrl": "http://www.amazon.com/Coraline-Graphic-Novel-Neil-Gaiman/product-reviews/0060825456/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.4 out of 5 stars"}, "OfferPrice": "$9.63", "Salesrank": "#77,443", "ListPrice": "$9.99"}