{"Category": "in Books (", "Name": ["Paul: A Novel"], "Timestamp": "2015-05-24 23:44:27.498682", "itemurl": "http://www.amazon.com/Paul-Novel-Walter-Wangerin/dp/0310243165", "Reviews": {"TotalReviewCount": "60", "ReviewList": [{"Date": "on August 29, 2000", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16QQ6B39GDNNC"}}, {"Date": "on April 19, 2001", "Text": null, "Helpfulness": 0.9761904761904762, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1S0B0384D3LE7"}}, {"Date": "on September 6, 2000", "Text": "Take the book of Acts and then try to fill in all the details by painting  a written portrait of what things might have been like.  That is basically  what Walter Wangerin does in this engaging novel.  Staying true to Biblical  sources, Mr. Wangerin shows us Paul in a way that many people may have  never seen him before.  The Paul we see here is one who is often disliked  by his fellow believers, but always respected.  We see Paul as a man of  such strong convictions that people can't help but have strong reactions to  him, either positive or negative.  The only complaint I had about the book  was that it slowed down in places.  Otherwise, this is a very well-written  fictional account of someone who we know about only in Scripture.  This  novel does a neat job of taking you back to those times when God was moving  in his people and letting you play with the idea of \"I wonder what it  might have been like to be there.\"  It is well worth the read.", "Helpfulness": 0.9642857142857143, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IADLWBLBN7W0"}}, {"Date": "on August 16, 2000", "Text": "The book was a pleasure to read.  The author concentrates on the more dramatic and literary events of Paul's life, leaving the more general  history (travels, healings, etc.) to intersperced narratives by Luke.  The  reader is made aware of the intense purpose and charged passion of the  first generation Christian.  There are also insightfull interpretations of  events and personalities which differ from the sunday school version of  Paul in your head. You find yourself grabbing the New Testament for  reference and reminding yourself that these are real people in dangerous  times.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on January 28, 2001", "Text": null, "Helpfulness": 0.9473684210526315, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39BAS6VFE2L5L"}}, {"Date": "on July 23, 2000", "Text": "This is a great novel that enables the reader to better imagine the people in Paul's life and ministry.  It also opens the readers eyes as to the cultures and events of Paul's time.  It is hard to put down.  A must buy!  Get it for yourself or as a gift for a friend or family member.", "Helpfulness": 0.8571428571428571, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on October 29, 2002", "Text": "Wangerin is a favorite author of mine, especially in his non-fiction essays.  I have found some of his previous fiction too dense and unwieldy to enjoy, so was a little apprehensive about reading this book, but found it to be completely engrossing and enlightening.  Mr. Wangerin has done extensive research in compiling this story, told from the perspectives of Paul's contemporaries and companions.  The result is amazing.  On almost every page, I found myself saying, \"Oh, that's why Paul wrote that!\" or \"Yes, that would make sense.\"  The scene of Paul's reconciliation with Barnabas brought me to tears.  My only disagreement with the author would be in the ending.  I give James more credit than the author does, and see no inherent contradiction between his letter and Paul's writings.  Wangerin seems to picture James as the prototype of leadership in what would become the Catholic church and Paul as the seed of the Protestant Reformation, and he imagines the division already implicit in the first century church.  Aside from that complaint, which only emerges in the last few chapters, I wholeheartedly recommend this book to anyone who loves historical fiction, especially the subset of that number who also enjoy the Bible.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUO4F5LR90DSD"}}, {"Date": "on April 7, 2002", "Text": null, "Helpfulness": 0.9230769230769231, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27KNXAROMSJ7A"}}, {"Date": "on February 11, 2001", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATN9NJKYJ35KF"}}, {"Date": "on December 2, 2002", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on November 27, 2001", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30I1GSOW4ZN9V"}}, {"Date": "on September 5, 2001", "Text": "PAUL, A NOVEL, is a dramatic story of the apostle Paul's life journey from his experience of Christ on the road to Damascus, to Rome, with graphic details of  travels, cities, and characters along the way. The way is revealed with a skillful  blending of imaginative narrative, words from the Bible, and dialogue, that bring Biblical scenes to life. The reader feels that this is a picture of the real Paul, with all his strengths and frailties, often tragic, frequently heroic. It tells not only the story of Paul, but also of the early church the early apostles were struggling to establish. We see Paul through the eyes of his various friends and companions, most of whose names we know, and their characters also come through in their actions, manners of speaking, and styles of writing. The author has even included Seneca as one voice in this group, not as an associate of Paul, but as a writer and personage of the age, with a knowledge of Rome and its culture contemporary with Paul.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GS63ZWVSO8VV"}}, {"Date": "on January 3, 2002", "Text": "I highly recommend this book! My favorite chapter was the one in which Saul debates Stephen (before the stoning of course). I must also mention that I loved the way that the author would interject some of the letters of Paul; he made the letters come alive.  I did not like the chapters about the Jerusalem conference of Acts 15.  But remember this is fiction and as such I found it very uplifting and insightful.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A377J6GBU9IMSA"}}, {"Date": "on April 19, 2001", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1S0B0384D3LE7"}}, {"Date": "on April 26, 2006", "Text": "Having just started some serious study of Paul's letters in my Sunday school class, I realized I knew so little about who he was.  I wanted a book that wasn't so \"scholarly\" and more about him as a person...in other words, a novel. This book was just that.  I liked that each chapter was a different voice - it gave the reader different views of him from men, women, and enemies.  I admit I would have liked it more had it flowed a bit more easily from one voice to the other, and if it had at least one chapter from Paul himself.  However, I enjoyed the book immensely nonetheless.  Probably best for those who want a \"light\" read (as if that is possible when speaking of Paul!) I should also mention that I am no Bible scholar, or theology student, just a reader and student of the Word.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14KP0633CVB6Q"}}, {"Date": "on October 29, 2002", "Text": "After reading this book and then reading the Bible stories about Paul, I fealt as though I knew the characters in a more personal way than ever before.  I know that it's fiction but it's written in a way that you believe it could have happen that way.  I especially like the way he described the difference between Paul and James.  Oh one other thing his copy of the book of Galatians is great.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A377J6GBU9IMSA"}}, {"Date": "on December 6, 2004", "Text": "Wow - when I finished reading this book, I felt like I had been right there with the Apostle Paul through all of his missionary journeys, trials, and triumphs!  I felt like Paul was my close and personal friend!  The author takes the basic historical facts and truths about Paul and weaves a story around it. It made me want to get out my Bible and read Acts and other Pauline epistles. (Which I did...)  Although this book is long, please don't let that intimidate you. It is worth the read!", "Helpfulness": 0.8, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AITGXFGVM1T2"}}, {"Date": "on May 19, 2002", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALU1GOMP90PZP"}}, {"Date": "on January 17, 2011", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TJPQDW2GB5X8"}}, {"Date": "on July 3, 2003", "Text": null, "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A270VN12EAFCIQ"}}, {"Date": "on May 26, 2001", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UMQT1HJTEQJF"}}, {"Date": "on October 17, 2001", "Text": "I had to read the book for a Acts of the Apostles class that I am taking at Cincinnati Bible College.  It really opened my eyes to what really went on in the life of Paul.  It was very easy to read.  Over all it was just an awesome book.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on January 20, 2014", "Text": "I bought the book, so I could follow along with the audiotapes.  The story is fast moving.  The author's reading of all the characters is very invigorating to the text.  I enjoyed it thoroughly.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZMQ6TXCIBSU9"}}, {"Date": "on December 17, 2009", "Text": "I love how this is written.  The beginning is so real.  The story just opened my eyes to Saul then Paul, and told of his devotion and love for God.  What a great book, as with all of Wagerin's books.  What a gift to readers.  I just finished the Book of God, and now I'm about to get \"Reliving the Passion\" and \"Preparing for Jesus\".  I have read \"Jesus\", I did back in 2007 when I was on my way to Kuwait, and I loved it.  The \"Book of God\" brought me to tears many times.  I truly love how he told the story of Jesus' crucifiction.  Wow, is all I can say.  One of my favorite parts is where he told of the gratitude Jesus showed to Longinus, and how it changed his live to care for Barrabus' neice.  My other favorite part, no matter how many times I read it, is the story of the other two who were crucified with Christ.  Marvelous reading!  I look forward to reading more.  I have added Wagerin to my favorite authors like Orson Scott Card and Marek Halter.  If you are like me and you love to read biblical fiction, but you want it true to the bible, read these authors.  I want to add that the end of \"The Book of God\" has a great reference and study guide.  I will use it after I also get it in Hard Back. My paper back has been just tortured because I travel so much.  Thank you Mr. Wagerin.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KMBUTSBTGIV5"}}, {"Date": "on May 5, 2010", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I78HZLE3O1SD"}}, {"Date": "on October 5, 2007", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A147PVUOPZM9A6"}}, {"Date": "on July 3, 2003", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A270VN12EAFCIQ"}}, {"Date": "on June 11, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10N41XMS5LW4D"}}, {"Date": "on February 2, 2002", "Text": "I found the book a great read and rather authentic, although I have to say that I wonder how close to the New Testament accounts it is and would have to study them very closely again in order to be sure. The Paul of this book certainly fits the physical and characteristic picture I have of him, small and gangly and yet the ability to hold people's attention within an instant. The account of his journeys and the Churches he set up certainly had me riveted.", "Helpfulness": 0.6666666666666666, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HP1V4SQJKI51"}}, {"Date": "on June 13, 2007", "Text": "Walter Wangerin Jr. once again weaves his spell as he brings the Bible to life.  His knowledge enables him to successfully entwine information from different Books of the Bible which helps improve one's understanding of Paul's journeys.  The reader gains greater insight into his letters to the Galatians, etc.  The rich details bring this period of time into perspective and often you remark to yourself ....\"So that is why that happened\".  This has, as with his other books, added to my appreciation and understanding of the Bible.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MQDGHRDBWUNN"}}, {"Date": "on February 18, 2013", "Text": "I thought this book was excellent.  Bible study can be boring and impersonal.  Some find it hard to make it relevant and the difficult-to-pronounce names from the Old Testament don't help.  This novel provides context that is often hard to see in the Bible itself.  By giving personalities to the names and placing events in context, Wangerin makes the story real and tangible.  He makes it easier to imagine and appreciate the struggles of the early church and the apostles.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AUZISUBU7O8X"}}, {"Date": "on August 5, 2002", "Text": "This book lacks nothing.  Without giving a history lesson, Mr. Wangein has given us a looking glass into life 2000 years ago, and in particular, the life of Saul of Taurus a Pharisee, prosecuting the new Christians and becoming the Apostle Paul a Christian champion.  Beginning with his conversion, Paul's life was filled with enormous challenges, and even greater successes.  Opposition from Rome, Jews and even Believers, Paul feared none and conquered most.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LAYXSLY902EW"}}, {"Date": "on July 28, 2014", "Text": "I love Walter Wangerin, and i'm really glad I read this book! Made Paul and his ministry come alive! Now i'm gonna re-read acts and pauls epistles and see where I was. This provided a fantastic backdrop of Pauls story. And it was really nice to finally get a handle on where everything is in the old bible days. Like all the places Paul went. Great Book, a little slow at times, thats why the 4 stars, but awesome.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CA7RVHQTBOH7"}}, {"Date": "on May 20, 2014", "Text": "I read this book several years ago and it has stayed with me ever since.  Walter Wangerin was able to tell the story of Paul in a way that opened my eyes to better understanding this man and how God used him to continue to reach the unsaved.  I HIGHLY recommend this book as part of your collection in paper and audio.  I really hope they'll do an eBook as well.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CGFKLVSOKDUQ"}}, {"Date": "on November 3, 2006", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUUQKZZ4TMWIK"}}, {"Date": "on December 28, 2007", "Text": "The more I read the more I wanted to read. It told Paul's story from so many different points of view-people that knew him and liked him or disliked him and from Paul's own point of view as well. I just could hardly put it down! It's a book about Biblical times and characters that was interesting and best of all NOT DRY. I definately recommend it~!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3N74F2A1D6N65"}}, {"Date": "on October 25, 2013", "Text": "I chose the rating because I like the book and I am not done reading it yet, but I have read other books that have held my attention more than this one. This one is  interesting in that it the author allows the reader to see  Paul in a deeper way than you can see in scripture. It is also good to get to know the people who traveled with Paul .", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NIWNWQN50WSP"}}, {"Date": "on March 3, 2015", "Text": "First review of this was rejected. Not sure why, but I think because I pointed out that this was a library book. I sure hope I didn't purchase a \"hot\" book.  It's the book I love, just with the standard library plastic cover and some writing throughout the book.  Had I known, I would have bought a new one.", "Helpfulness": "", "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35KCREHZUL8JK"}}, {"Date": "on May 8, 2001", "Text": null, "Helpfulness": 0.5, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3U8NSMZ3EY0CG"}}, {"Date": "on July 28, 2013", "Text": "This book brought the life and ministry of Paul to life. Very enjoyable. I've read it twice and bought a copy for a friend. I've recommended it to hundreds of people. I am a minister.  Job well done, to the author. Look forward to reading \"The Book of God\"", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AHGULY4K5RYR"}}, {"Date": "on July 8, 2013", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VB1RLG1ZZ82Y"}}, {"Date": "on November 11, 2014", "Text": "Walter is an amazing writer with a special talent of turning a one-minute event into a 5-page stop-the-clock intensive view of what is happening.  I did not agree with his heavy charasmatic emphasis in it.  But the rest of the book was superb.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AOY0IWL8B8D5"}}, {"Date": "on June 28, 2008", "Text": "Great book. I cried and cheered. My wife wondered what was going on as I read it and now she's doing the same thing as she reads it. After reading this I have purchased two more of Wangrin's books and am enjoying them too.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIXW73PFDQ8XQ"}}, {"Date": "on August 27, 2010", "Text": "Although this is a novel, it's based on Scripture, and gives a good insight to Pauls' travels and description of the problems of the culture and the interplay between the biblical characters, such as Barnabas, Titus, etc.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NA7EJYDMIT2V"}}, {"Date": "on August 8, 2012", "Text": "I purchased this book after my husband started reading it at a family member's home. He was so excited about how well it was written that I sent for it as soon as we returned from our trip. He is very pleased.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TOFRVX4N9UT5"}}, {"Date": "on May 11, 2015", "Text": "Quick delivery, perfect condition, and great price. I read this book years ago after checking it out from a library. No ebook version is available for this great novel, so I bought the hardback to read again.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1G2P8SQZW7NU"}}, {"Date": "on March 13, 2002", "Text": "This book really pulls you into the past with great descriptions of the characters and places.  I could see myself walking with the disciples in all the cities of the past.  It's definitely worth the cost!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JYZ4J4FU9EBW"}}, {"Date": "on October 12, 2009", "Text": "This is a very well written book.  The author keeps you guessing and still provides enough facts to make the book read so you feel you are a part of the events taking place.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22DOMF5GYVSEQ"}}, {"Date": "on August 19, 2013", "Text": "Excellent read.  Good historical fact interwoven with the novel and just enough suspense to keep me reading.  I'd recommend this book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A127MZGKZN7RRW"}}, {"Date": "on April 8, 2014", "Text": "This book is really good and I've enjoyed reading it.  It's a keeper  for my collection to be read again and again!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AO6Z94NXJ9DN"}}, {"Date": "on February 16, 2013", "Text": "Along with Jesus and The Book of God - this is an enjoyable read. I have purchased other copies as gifts.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EYVQMU2C6161"}}, {"Date": "on March 1, 2015", "Text": "Pretty good.  He protrayed Paul as a different kind of man as I thought.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A328Z5IAIE75O0"}}, {"Date": "on May 8, 2001", "Text": null, "Helpfulness": 0.5714285714285714, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3U8NSMZ3EY0CG"}}, {"Date": "on August 29, 2014", "Text": "good condition", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GSRFD4OBOPV0"}}, {"Date": "on August 30, 2014", "Text": "Thank you!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7L3O2TJMUWPS"}}, {"Date": "on February 9, 2015", "Text": "EXCELLENT", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LMTIVIUPBXDN"}}, {"Date": "on April 22, 2005", "Text": "I really wanted to like this book.  The subject was compelling to me, but much as I tried, I was bored.  Some of the charachter development was rich, but all together it wasn't worth the time it took to read.", "Helpfulness": 0.5, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LOAA1COCIT8S"}}, {"Date": "on September 3, 2000", "Text": "I am not a novice Bible student, but Walter Wangerin Jr. brings my New  Testament heroes alive like no one I've ever read.  What a sanctifying  experience!", "Helpfulness": 0.4444444444444444, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I2IWNHI5KYM5"}}, {"Date": "on April 1, 2001", "Text": null, "Helpfulness": 0.22727272727272727, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A225L5OAVB44DO"}}, {"Date": "on July 12, 2001", "Text": "Don't read this book if you are seriously interested in the religious issues of the first Christians and how they might differ from what the historical Jesus taught. The book fails to convey the seriousness of those amazing times and dwells on superficialities of how Paul looked and got beat up, that kind of thing. What could be religious ferver and meaning has been replaced by sentimentalism. Your eyes will not go popping out of your head at this one. --Strephon Kaplan-Williams", "Helpfulness": 0.17391304347826086, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ETUNYLSMOAU6"}}], "ReviewUrl": "http://www.amazon.com/Paul-Novel-Walter-Wangerin/product-reviews/0310243165/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.5 out of 5 stars"}, "OfferPrice": "$13.94", "Salesrank": "#386,404", "ListPrice": "$16.99"}