{"Category": "in Books (", "Name": ["Breakers (Book 1)"], "Timestamp": "2015-05-24 23:17:35.329871", "itemurl": "http://www.amazon.com/Breakers-Book-Edward-W-Robertson/dp/1479395226", "Reviews": {"TotalReviewCount": "769", "ReviewList": [{"Date": "on February 16, 2012", "Text": null, "Helpfulness": 0.9052631578947369, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36WXZPBPW4M1X"}}, {"Date": "on May 21, 2012", "Text": null, "Helpfulness": 0.9113924050632911, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Z3A4NW4OIXBZ"}}, {"Date": "on July 14, 2012", "Text": null, "Helpfulness": 0.9230769230769231, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUT1RFL5PR9VJ"}}, {"Date": "on February 18, 2012", "Text": "As RandITS has provided a satisfactory synopsis I will not go there. I will say that the character development was excellent. They say half the fun is in getting there and that certainly goes for Breakers. The characters' physical journeys as well as their transitional trips from a bohemian existence to survivalists is accompanied by a constant patter of clever thoughts and dialogue. I stayed up late one night and finished it the next day. Thoroughly enjoyable!", "Helpfulness": 0.8809523809523809, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I8DOKR00E4K7"}}, {"Date": "on March 16, 2012", "Text": "Took me a little while to finish, but what a fantastic story! I kind of felt like I was reading The Stand (my first King novel) or one of Stephen Baxter's excellent books. Great effort that kept me surprised, intrigued and wanting more. I look forward to your next book! Thank you!", "Helpfulness": 0.8333333333333334, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKG41ICI3XBHK"}}, {"Date": "on September 20, 2012", "Text": null, "Helpfulness": 0.8636363636363636, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10PEXB6XAQ5XF"}}, {"Date": "on February 11, 2014", "Text": null, "Helpfulness": 0.8823529411764706, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1E04NOTIYO6P5"}}, {"Date": "on March 23, 2012", "Text": null, "Helpfulness": 0.8461538461538461, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32RALE1C4F3HL"}}, {"Date": "on January 27, 2014", "Text": null, "Helpfulness": 0.8888888888888888, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2R133Q2BUN494"}}, {"Date": "on July 20, 2012", "Text": "I picked this book up as a free Kindle offering. The book reads like two tales in one, it begins as an apocalyptic end-of-the-world story that turns suddenly into an alien invasion plot halfway through. I found the two main characters interesting enough that I didn't get that feeling one sometimes gets with divergent plotlines based on multiple characters, where you lose the flow of the story when the perspective switches from one character to another. The buildup to the two main characters meeting was so drawn out that it was a bit of an anticlimax when they finally joined up. I often found myself thinking, \"I wouldn't have done that in that situation,\" which told me I was getting drawn into the plot. Often the characters themselves would later comment on a foolish decision they had made, in a way that made it believable why they had taken that action at the time. I found Walt's nihilism a bit off-putting at first, though ultimately I ended up rooting for him as the author kept throwing disasters in his path. His transformation into an action hero was a bit jarring, but I thought that the author delivered with an ending that resolved the various threads he'd set up. I also liked how the two main characters were set off each other, one seeking oblivion, the other just trying to keep himself and his wife alive.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10BLMM5EFVH4N"}}, {"Date": "on December 31, 2013", "Text": null, "Helpfulness": 0.8333333333333334, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QR2T1HKUCVZH"}}, {"Date": "on August 5, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24YBXREJDUU6Q"}}, {"Date": "on April 14, 2014", "Text": "I found this book enjoyable. There are some parts that drag on a little too long. But the story is good. The plot was interesting. I have to say it wasn't what I expected. Now, there are some editing errors. Forgotten words here and there. But not enough to ruin the story. I really got to know and feel for the characters. I felt the author did a great job of humanizing them. I'm really hooked on Walt and will most likely pick up the next, just to see what he does! It was great following his journey and seeing him evolve as a person. If you're into Sci-Fi or Post Apocalyptic stories, read this!", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AABXUSGGXUY1Q"}}, {"Date": "on May 23, 2012", "Text": "I wasn't sure what exactly to expect from this book.  What I didn't expect was to be sucked in from page one.  This was one of those \"couldn't put it down\" books for me.  I think the author stayed focused on his goals through the entire book, and it showed.  I found the plot to be tight and well-paced.  I appreciated the alternating between Walt and Raymond's points of view as well as the different ways they handled and moved forward with the disaster.  But even with the limited POV, the side characters were always well-developed and meaningful to the story.  Never did an event, action, character, or location feel gratuitous, as if it were thrown in there for no real reason.  Every bit of this book felt intentional and planned, there was obviously a great deal of thought and effort put into the story outside of the actual writing.  I've read other books that fall in a similar plotline to this one and I think this is the finest example of the basic storyline that I've read in a long time.  I'll have no hesitation purchasing and reading other works by this author.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2B0AJCUNDNWM6"}}, {"Date": "on January 4, 2014", "Text": "This book was recommended to me by Amazon, as I've read a lot of post-apocalyptic \"what if?\" thrillers. It started out promising -incurable, indiscriminate virus mismanaged by government bureaucrats - but after a while, all of the different sub-plots started to get tedious. The main character is not particularly likable, which is certainly an interesting way to tell a story, but I found myself feeling no connection at all to him or any of the other characters.", "Helpfulness": 0.8571428571428571, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOXJTFXHUL6DO"}}, {"Date": "on May 22, 2012", "Text": null, "Helpfulness": 0.8571428571428571, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22R14O58J1F20"}}, {"Date": "on February 26, 2012", "Text": null, "Helpfulness": 0.8, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TG0IHO7NBGA1"}}, {"Date": "on April 26, 2014", "Text": "This book was very disappointing and I couldn't finish it . I like details and character development but I don't like page fillers and that's exactly what 80% of this book is, I prefer quality over quantity so this book is definitely not for a person looking for an excellent read.", "Helpfulness": 0.8571428571428571, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17RZBCZGQF0OM"}}, {"Date": "on July 13, 2012", "Text": "Breakers is a fantastic book. It opens with a bang and the pace never lets up, right to the end. The author paints a vivid and compelling vision of a dystopian future. Sure, it's bleak - the world is kinda ending - but liberal sprinklings of wicked humor (and artful asides on the modern world) keep things ticking along. There is also a great dose of humanity in this book. Through the eyes of various characters, we see what happens when people get pushed to extremes. To survive, people will do almost anything, but there are unexpected moments of warmth and charity too. A great book, and I'm hoping there will be a follow-up.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACMJDHPEGW6YQ"}}, {"Date": "on March 28, 2014", "Text": "I was really wrapped up in this book for maybe the first 1/4 or so.  Maybe it's my fault and I didn't read the entire description of the book prior to buying it, but I bought it thinking it was an apocalyptic book about a pandemic that wiped out the majority of the planet.  The first part of the book did a great job explaining the spread of the virus/whatever and told a great story from two different parts of the country.  I immediately liked it because one part of the story had a couple choosing to \"survive\" in place, by defending and prepping in a house.  The other part of the story had another guy \"surviving\" on the move, making his way from the east coast of the USA to the west.  SPOILER ALERT:  Needless to say, the book took a massive downward fall when it is revealed that aliens infected the planet and were now \"conquering\" the planet.  It gets pretty far-fetched after that revelation.  Had I read that it was an alien-apocalypse I wouldn't have bought it.  If you're into that kind of thing, it's a decent read.  I won't be continuing the series beyond book 1.", "Helpfulness": 0.8333333333333334, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WA1EK4IQWWUK"}}, {"Date": "on December 28, 2012", "Text": null, "Helpfulness": 0.7692307692307693, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVXTGIEMEUXXM"}}, {"Date": "on June 5, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28KO4B0YNKLW"}}, {"Date": "on May 8, 2014", "Text": "It jumped around too much for me.  I didn't like anybody enough to care if they lived or died.  They only kid I did like, the main character killed for no reason anyway.  I just didn't get it.  It wasn't for me.  Too dark I guess", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWR140EVYCRXQ"}}, {"Date": "on May 26, 2014", "Text": null, "Helpfulness": 0.8, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OK8RCZILZ4EZ"}}, {"Date": "on May 5, 2014", "Text": null, "Helpfulness": 0.7142857142857143, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13ME6X8RTKE6I"}}, {"Date": "on April 25, 2014", "Text": null, "Helpfulness": 0.75, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Z3IXZ17E88J4"}}, {"Date": "on May 27, 2012", "Text": null, "Helpfulness": 0.6981132075471698, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A145T9G98W5L33"}}, {"Date": "on May 24, 2012", "Text": "I am just amazed at all the good reviews this book got.  It is basically just a cheap rip-off of the Stand, with a little War of the Worlds mixed in.  I almost didn't even finish it, but I had to see if it got any better...  And it didn't.  There were several parts in the book that could have been expanded on to make the story somewhat more enjoyable, and way too much time spent describing how miserable the main character is.  It was just plain awful.", "Helpfulness": 0.7058823529411765, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UV4TI3SLGVTF"}}, {"Date": "on April 11, 2014", "Text": "A review of 'Breakers' is  a little difficult. It's part adventure, part end-of-the-world apocalypse, part science fiction, and part urban survival guide. Ordinarily, trying to fit all those things into one story usually ends up with a disjointed mess, but this is not your ordinary saga. I won't go into details about the plot as others have done it far better I can, except to say that there are great plot twists, really well written action sequences, terrific characters, and great dialogue, but boiled down, this is a story about people...ordinary people...and how they react and cope with the unthinkable. I actually read this book a few months ago and just now re-read it and it went from being good (the first read) to DAMN good! If you read this book (and you owe it to yourself to do just that), don't skip the epilogue...it is simply beautifully written!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3F0AMUI5FEPPP"}}, {"Date": "on April 7, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27FWOKWNLOZB"}}, {"Date": "on April 1, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZGX1RL5HQ2XF"}}, {"Date": "on January 10, 2014", "Text": "I liked this book - the prose is good, characters are mostly believable.  By the time I got towards the end, I knew what was coming and skimmed it.  It's got that been there done that feel to it.  It's still a good read, but if you're familiar with the genre, it's predictable.  Not sure if I'm going to pursue the series.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SHCF4CU58XPY"}}, {"Date": "on December 29, 2013", "Text": "Almost too slow for half the book. Long time dedicated to mundane life of characters before anything happens of interest. Almost gave up. Character development was somewhat disjointed. There are some confusing narrations due to errors. However the suspense at the end was great and the story really picked up near the end.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IT3TOPL1MUHS"}}, {"Date": "on December 28, 2013", "Text": "This was an awesome read!!!!! I could not put it down till I finished it. Had me turning pages just to read what came next. If you like sci do this is the book for you. Author has well planned storyline no typos or misspelled words to muddle through. Can't wait to read the next one.. Thanks for a great book. I thoroughly enjoyed.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAZIR497Q2U6P"}}, {"Date": "on December 26, 2013", "Text": "Kept me reading right to the end. Great characters, which didn't necessarily mean they survived! I really want to read the next books in the series!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A339E0YQ51G44F"}}, {"Date": "on October 9, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5N3LRVSC01Z5"}}, {"Date": "on January 1, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13FUIUSVR1315"}}, {"Date": "on December 13, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGI7SYAGP3XLS"}}, {"Date": "on May 19, 2012", "Text": "I wasn't sure about this book when I first tried it.. Then I started reading and couldn't put it down until I turned the last page. Rocky in some areas but overall a very well done armageddon style book. The characters are really what makes this novel what it is. The characters are not some super powered or even your regular do anything kind of people. They are very human and very fallible. Which unfortunately is where it becomes rocky in places. The characters are so human that the story looses its thread every now and then and drops here and there in quality. However it is not often enough to detract from the overall quality of the book. So if you enjoy a good pandemic/space invasion/simple people become hero's without anyone else knowing.. with a lot of rich detail, (sometimes a little too rich as there was a point or two I was glad I wasn't trying to eat while reading it) full on thrill ride of a novel you will enjoy this one!", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XITMZC9NYON1"}}, {"Date": "on June 21, 2014", "Text": "Needs an editor. The ideas are okay, but not developed. Objects were not described in a way that could lend a visual. Tons of grammar errors that were annoying and made paragraphs meaningless. Why do Sarah and Anna become totally irrational for no reason? Why are women so irrational? Why all the little life lectures and advice?", "Helpfulness": 0.8, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JWF4IA8QIVG9"}}, {"Date": "on August 23, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3449V2TEMAAGL"}}, {"Date": "on November 6, 2013", "Text": "Couldn't make myself read past the first chapter. Stilted and awkward in spots.  Needed a good editor and maybe it could go somewhere.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Q5B1ATOPGQFJ"}}, {"Date": "on May 4, 2014", "Text": "Too crude for my taste, which is unfortunate because besides the language and crude comments it was shaping up to be a good story.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1107BDK92HTUA"}}, {"Date": "on February 11, 2014", "Text": "One of those books that can go either way. I just didn't enjoy the plot or characters. I will try something else by the author.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3886QZPJYV6Z5"}}, {"Date": "on June 20, 2012", "Text": null, "Helpfulness": 0.7, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XPD3WFBJ38WK"}}, {"Date": "on December 13, 2013", "Text": null, "Helpfulness": 0.75, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31LG3PDX1ENJE"}}, {"Date": "on July 23, 2014", "Text": "I thoroughly enjoyed this gripping and surprising book.  Got it free a week or two ago, and it did exactly what it was supposed to do--dragged me deep into the world and guaranteed my purchase of the rest of the series.  The writing is crisp, yet not by any means rushed.  I love when an author has the skill to draw out the scenes, taking their time with descriptive writing without dragging out the story needlessly, and Robertson has that skill in spades.  He is also skilled at wry humor and clever observations without being \"too\" clever.  An absolute gem of a story, full of surprises, intrigue, and humanity (even of the alien type).", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CCMZWE2F14TW"}}, {"Date": "on October 11, 2013", "Text": "A horrible disease kills off most of humanity. Much better done by Stephen King and others. The virus was sent by incoming alien invaders, invaders who look a lot like giant insects. Steal from Ender’s Game? The remaining humans, none of whom are presented as highly likeable, fight off the aliens. Some succeed. Some succumb. When even married couples are described as f—ing and scr—ing, and every character seems self-centered and cynical, I find myself thinking that apparently all of the people I might care about died in the plague. Thus I don’t much care what happens to the survivors. I certainly have no desire to read the rest of this trilogy. And who or what are the Breakers of the title? Robertson never says.", "Helpfulness": 0.75, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUE2R5YNID7RB"}}, {"Date": "on March 6, 2013", "Text": "I love post apocalyptic fiction, but I don't like unnecessary foul language.  I can understand a word now and the, but when its repetitive the \"f\" word really doesn't add anything to the story unless you're a teenager writing for shock value. I deleted this one.", "Helpfulness": 0.6811594202898551, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ESPROM08C969"}}, {"Date": "on January 4, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IEROUAOFTUJJ"}}, {"Date": "on September 23, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AR3IXZM3MGPYY"}}, {"Date": "on November 21, 2014", "Text": "Was not expecting too much from this book due to it being free.  The description was fairly good so gave it a try.  I was extremely surprised at how well i took to this book.  I liked it so much that i have bought the second in the series.  i am enjoying the second one just as much and plan on buying the rest of the books in the series.  highly recommend this series to all you dooms day readers!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AL8BHI9YV2NIE"}}, {"Date": "on September 2, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AL1OD7OVK1LC"}}, {"Date": "on June 24, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARFHS6IU8WI0"}}, {"Date": "on June 24, 2014", "Text": "I would recommend to anyone who likes SciFi, futuristic type books.  It was very engaging and well-written. It kept my interest and intrigue to find out what was coming next. Looking forward to book 2.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5PO4WJHYFTX7"}}, {"Date": "on June 18, 2014", "Text": "Not typically the type of book I would choose but I did enjoy it. A little long  winded at times.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BQQYRDF7PUZ"}}, {"Date": "on April 25, 2014", "Text": "As if serviving an epidemic wasn't enough, imagine the horror of finding out that Aliens were the cause of it all.  Follow the night mare of those who have servived a world wide pandemic only to be hunted like vermin by aliens who want their world, do you give in, or fight?  Find out if humanity can be broken.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AJE83EZ5AIBD"}}, {"Date": "on April 22, 2014", "Text": "I really got in to this book. I felt that it was well written and I completely got lost in the characters. A different spin on the aliens from space to take over the planet theme that jumped out to hold my attention from the beginning. I would recommend this book highly.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARBWW3IV36CAT"}}, {"Date": "on March 8, 2014", "Text": "I had to buy this series.  I was not disappointed.  I find that writers generally fall into one of two categories when it comes to human nature; optimists or pessimists.  Edward Robertson is no exception, however he manages to bring out the worst in people while bringing out the best in people.  I was sucked in by the first book, enthralled in the second, stayed up late to finish the third and I am working on the fourth.  So far this universe has not exhausted itself.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3541SR1XDG1DO"}}, {"Date": "on March 3, 2014", "Text": "I'm a big fan of post apocalyptic fiction and have read quite a few books about surviving after the end of civilization. This book popped up when I was searching for zombie books, and while it wasn't exactly what I was looking for, I'm really glad I had the opportunity to read it. It was an engaging story with lots of twists and turns to keep it exciting. The characters were well fleshed out and believable. I liked that they weren't too cliche, but had depth and grew from their experiences. It was well worth my time to read and I'd strongly suggest downloading it if you like survival/sci-fi/end of the world type stories.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IL2G7BIVWER9"}}, {"Date": "on January 18, 2014", "Text": "I waited until I had read all the series before writing my thoughts. One of the best series I have read. often i have found that a single book leaves you wanting more but a seres starts to drag. This wasnt the case with this series. Excellent. I hope there may be one or even two more books which would round this out, as I enjoyed it so much", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WPQYGJJGUTRL"}}, {"Date": "on January 3, 2014", "Text": "In the beginning I decided to get this book because I thought it was about zombies. The more I got into it the better it got. Aliens. If I would've known I never  would've read this. I'm not much of an alien person. It was amazing. The way it was written, the characters were pretty good. At first a bit annoyed by Walt (one of the main characters). The more I read, the more cliff hangers there were. I couldn't put it down. Definitely worth reading.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ENL9K4UKM2OL"}}, {"Date": "on November 26, 2013", "Text": "I've now read all four in this series and have thoroughly enjoyed them all.  They have just the right balance of credibility, wit and humor I enjoy in a book.  Lots of surprises and hard to put down - even though I'm not a fan of anything with aliens.  Even though I'm predisposed against this kind of book, I really did enjoy reading the series.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5JSIVI0E8R3H"}}, {"Date": "on September 16, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CMWQEKOVO0JY"}}, {"Date": "on September 10, 2013", "Text": "I read voraciously, sometimes with streaks of apocalyptic fiction from the endless supply here at amazon. Breakers stands out among them.  Not only is it a great mashup of deadly virus and aliens, it has characters with depth, moments of hilarity in the dialogue, and some genuinely moving use of language that i rarely find in these kinds of books. The author is a talented writer and has joined my shortlist of those I will follow.  I also liked the fact that, although there are sequels, this story has a graceful closure to it. So many simply stop, perhaps attempting hamhandedly to leave the reader wanting more. I genuinely enjoyed this book and will happily buy more of Mr. Robertson's work.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AT4G8URYTLWK9"}}, {"Date": "on September 9, 2013", "Text": "To steal dialogue from a Paul Rudd movie:  Wow, just...wow!!  Mr. Robertson is one of the very best writers today and you have got to read the whole Breakers series.  The author recommends starting with the prequel he wrote recently for the series, Outcome, and I agree.  (Altho I didn't get a chance to read Outcome 'till after the 1st, Breakers, and it didn't ruin anything for me.  But if possible, do try to start with Outcome 1st.  So:  Outcome, Breakers, Melt Down, Knifepoint & Reapers.)  What fantastic storytelling, character development--there's not a 1-dimensional character in any of the books, in fact, the characters are extremely multi-dimensional and so interesting.  I couldn't turn the pages fast enough.  Highly recommended and not just for SF or post-apocalyptic fans either since the writing is so excellent.  Thank you for your art, Mr. Robertson!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LFNK56W22K2Y"}}, {"Date": "on August 29, 2013", "Text": "Bit of a roller coaster really and disappointing.Started good, was a bit painfully slow then the Aliens , brilliant!, shame ran out of steam and poor ending.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DUM4BPXB62C6"}}, {"Date": "on August 26, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RBSGLJR5C0U8"}}, {"Date": "on August 25, 2013", "Text": "If like me budgetary restrictions have led you to free Kindle ebooks, and you download 100's and only happen upon 10 that you truly enjoy, this book will knock your socks off! Warning: you will end up buying more of this author, but you won't mind it one bit!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YX0A1466E2AW"}}, {"Date": "on August 25, 2013", "Text": "The premise of the book was interesting but the storyline seemed a little jumbled at times and did not always keep my interest. A fairly easy read. Short but worth reading. Perhaps the other books in the series will have more substance", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQ9CZKBFN7WNH"}}, {"Date": "on July 27, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WPFIZ8P3O86V"}}, {"Date": "on June 30, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AN8JD8P57J7TV"}}, {"Date": "on May 14, 2013", "Text": "The character development is what really got me about this book. Walt, whose girlfriend died from a mysterious virus that wiped out most of the population, decides to walk from New York to LA where he intends to die. At the same time Raymond and Mia are trying to manage in an inherited house in LA.  These characters are really fleshed out as their adventure in survival is revealed.  The thinking is what would be expected of regular, everyday people in the same situation.  I found this book to be interesting and, at many times, exciting.  Thought about it last night in bed after staying up past my bedtime to finish it.  Went back to 80% this morning and reread to the end. I will be buying the sequel as soon as I post this review.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFNTYGLWJJY"}}, {"Date": "on April 13, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIWQ5RDWDBSLN"}}, {"Date": "on April 11, 2013", "Text": "I liked this book. Just liked. It was entertaining. But perhaps I failed to care enough about these people. I think after too many people die and too many characters bite it... I'm a bit numb. Where's the desire to go on? Why live, why read further? I enjoy a good apocalypse novel. I dig the whole \"end times\" thing. But not without some hope. Perhaps hope lies in the next book?", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQQUSQ9U6I7QB"}}, {"Date": "on March 30, 2013", "Text": "The story is entertaining and I look forward to reading his other work. The writer injects originality into a genre that has become as mass appealing and formulaic as a boy band. I enjoyed the writing style.  His characters are clever. Despite the fantastic plot twist, there's a pragmatic sensibility. The writer bounces from smartass to profoundly insightful. Thanks for reworking the plots of idiotic blockbusters into a smartly entertaining story!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JO1TCCHTE5LQ"}}, {"Date": "on February 27, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MJ3KTK1WTFFY"}}, {"Date": "on February 23, 2013", "Text": "It was good, but I just kept expecting lines from other books I've read to appear on the next page.  It was almost but not quite the same story.  Like an almost De-je-vue.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AM0CSGOB06ZJG"}}, {"Date": "on February 22, 2013", "Text": "Sufficiently compelling to entice me into purchasing the entire trilogy...the characters and social commentary are interesting enough to elevate this above the level of a typical end of the world scenario.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AT8VMRZSRCHYG"}}, {"Date": "on December 17, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ERCS5WMFMQCY"}}, {"Date": "on November 19, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A52Y0XBX1ASPF"}}, {"Date": "on September 10, 2012", "Text": "This was a great read! Thank you, Mr. Robertson, for writing such an exciting, believable story. When you are able to place yourself into the story and leave the real world you are in, you know you have a GREAT author. For some stories you wish there a special star--a sixth one, if there was, you would definitely get one from me! * * * * * *", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AU1CZ4HCHYSA0"}}, {"Date": "on June 15, 2012", "Text": "Have I read parts of this plot before?  Of course.  It's an apocalyptic story and there's only so many plots you can come up with. I'm not going to try and bore you with some elitist literary review.  I appreciate every author who tries to entertain me with their writing.  I like trying authors free books because if I like their style I will pay to read more of their stories.  This book was worth the read and the story is engaging enough to keep you interested.  I hope you enjoy it as much as I did.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYQYP8EB6BFHG"}}, {"Date": "on June 12, 2012", "Text": "Good, quick scifi. It took an unexpected twist part way through. I haven't read simple non- technical sci-fi in quite some time.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19ZDPDAYGVG30"}}, {"Date": "on May 25, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27VAPW9LSI9RS"}}, {"Date": "on December 5, 2013", "Text": "Interesting concept, but the writing was only OK. The characters were not well defined--the two male protagonists became essentially interchangeable for me, and I never got a real clear feel for any of the women, with one exception of one who had a brief but pivotal role late in the book and was vivdly drawn. There was LOTS of suspension of disbelief required, even for a scifi book, especially toward the end. That caused my interest to wane, but I managed to finish despite rolling my eyes several times. My distinct impression was that this was not written out of a love for the story, but as a trial balloon for a screenplay. It seemed to me that the author was framing the shots for Spielberg in every transaction in the book, not really trying to write for the sake of creating a memorable written work of art. Such artifice drops me out of a story because it is disingenuous to the reader. The worst thing about the book by far was the cutesy dialog that EVERY character delivered EVERY time he/she had to say something. There was always a quip or sarcastic remark that sounded like poorly-imitated Neil Simon. This became cloying and distracting, and disappointing because I can tell the author could have done better, and made his characters more real if their dialog had been more realistic.", "Helpfulness": 0.75, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CC4ABZYYDDE0"}}, {"Date": "on June 12, 2013", "Text": null, "Helpfulness": 0.75, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TGOGOHNSUNE0"}}, {"Date": "on June 15, 2012", "Text": "I liked this book it was ok. I liked that the story was written from 2 different men's perspective. But the towards the end the two men meet up and work together at the end. My only huge problem was I felt the story went on forever and not in that good way u never want it to end but in more of the is this over yet. The main character Walt and Raymond were well writen I just wish the story didn't feel like it went on forever", "Helpfulness": 0.75, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A399IH9QO7J279"}}, {"Date": "on June 11, 2012", "Text": null, "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AU4408DT4Y1G0"}}, {"Date": "on April 11, 2012", "Text": "This book is like two novels in one!  The first half is a post-apocalypse novel about a virus killing most of the population...The second half is an alien invasion!  It's a good thing I love both stories!", "Helpfulness": 0.75, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALZJRNEA9ELA3"}}, {"Date": "on March 14, 2012", "Text": "Extremely well written. Read it in one sitting on my Tab, yes my butt is sore. Characters are fully developed and each scene is carefully described. Little details are woven into the narrative so you know what is going on and why. It's not The Stand but close enough to be an entertaining read. Then ending was a little simplistic but the rest of the story riveting. With a little more practice and a good agent he books will climb a lot higher on the rating chart.", "Helpfulness": 0.7142857142857143, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RS068D88U4MX"}}, {"Date": "on February 2, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22BC4FPEF0P1J"}}, {"Date": "on August 11, 2014", "Text": "I have read all 6 of the Breakers books and I have really  enjoyed them.  I really like how the author kept bringing back main characters in each of the books.  I am sure that when you get done with the first book that you will want to keep reading the rest.  Have fun.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BRXK5RO3IQMF"}}, {"Date": "on June 29, 2014", "Text": "Slow start, intriguing middle with a promise unfulfilled, and a weak ending which neglected to wrap thing up. It was a unique twist on an old subject and kept me from putting it down for a while. I was just disappointed with the non wrap up at the end.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A222U26SSNEJ5J"}}, {"Date": "on November 19, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IYTNZTDHZW0Y"}}, {"Date": "on September 10, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2432BOOC041P7"}}, {"Date": "on May 26, 2012", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22ELCZ3XZQWOL"}}, {"Date": "on March 5, 2015", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A270WQDVN0X6J7"}}, {"Date": "on November 26, 2014", "Text": "Sci-fi or horror, it nails it.  The author brings an interesting cast of characters and doesn't mind killing  them off--one by one.  Sometimes it gets far fetched, but still made me by the $.99 set of the 1st three books to see what's next.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JN4W4TCJLWXT"}}, {"Date": "on October 6, 2014", "Text": "Well, I can think of one….. bad.  At the time of this review 352 people gave this mess five stars. Unbelievable. The book is loaded with similes that were laughable to say the least, disjointed awkward sentences, and uninteresting characters.", "Helpfulness": 0.75, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1V6HBWXG533JZ"}}, {"Date": "on March 11, 2015", "Text": "Following Walt's twisting character arc through the plot line is worth the free read.  Though the hybrid genre flashed early chapter promise, I felt the final delivery proved too light and predictable for sci-fi vets.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AT1M29ERDCI83"}}, {"Date": "on January 31, 2015", "Text": "A new favorite series in my catalog of Post-Apocalyptic reads. Breakers is the story of two couples on different sides of the country who were both struggling prior to an outbreak that killed most of the planet. One couple has a guy fearing his girlfriend is cheating on him, and lies to re-earn her affection. The other couple has a guy who... well I don't remember what he did, but after the outbreak he and his partner find a way to farm and take care of themselves. I really enjoyed both storylines. The twists throughout did a great job of sustaining suspense. Robertson's writing is very strong and I loved that he focused so much on the relationships, while also adding in enough description and tone to give us a visceral sense of the world in its post-apocalyptic existence. Without spoiling anything, I'll just say he kept me eagerly consuming the story straight to the end and beyond. That you can get the first three books for $.99 is a steal. The audiobook narration is superb. Ray Chase is one of my new favorites. If there are drawbacks, the finale wasn't a knock it out of the park shot, and certain events left me caring less than I had hoped to be in the end. That said, I'm very curious to see where he takes it in book two, let alone the remaining seven books in this series.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUA8E8NYKC35S"}}, {"Date": "on August 27, 2013", "Text": "Meet Raymond and Mia, trying to find work and hold onto their inherited house on the west coast, and Walt, struggling to hang onto his beautiful girlfriend in New York.  Normal twenty-first century humans with normal human problems. That is until a mysterious flu-like virus wipes out close to 95% of their fellow human beings. Thus begins a struggle for survival in an almost empty world where nothing new is manufactured, no government aid is available, and each survivor is left to fend for himself.  Raymond and Mia hole up in a \"borrowed\" mansion on a seaside cliff where they plant food crops and raise chickens in between looting forays to abandoned houses, and Walt embarks on a cross-country trek on foot across America.  Bad enough, right? (Light spoiler ahead) Then add to the mix the mother of all death stars coasting in silently from who knows where and setting up shop over Los Angeles, disgorging fighter pods of alien warriors who proceed to seek out and destroy or round up for some undisclosed reason all human survivors. Well-written story and engaging characters with a bit of a tongue-in-cheek style of dialogue. The author seems to have had fun with this book, and you will, too. Will read sequels.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1E7AM0V0T2BPP"}}, {"Date": "on June 23, 2013", "Text": "I really enjoyed this book Couldn't wait to start the second one. It gets a little draggy at times, but they are worth wading through. great if you are a sifi fan.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IRAOGE9S93A6"}}, {"Date": "on September 3, 2014", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39IE30D6XP4KS"}}, {"Date": "on April 9, 2015", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZVFNHE8G1Q6E"}}, {"Date": "on October 31, 2014", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22N7BSBRGZ76R"}}, {"Date": "on December 31, 2014", "Text": "Author tried too hard with the humorous one-liners. Fun story though. Could have been a bit shorter or had mor story line. Just too much empty dialog.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJ79G52IEWRFL"}}, {"Date": "on July 17, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33YGDICCQVSAD"}}, {"Date": "on January 10, 2014", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FT07MPPSJ9C0"}}, {"Date": "on August 26, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24TJFZ38UVMAA"}}, {"Date": "on August 10, 2014", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3F3E2UIR1ZGGG"}}, {"Date": "on December 13, 2014", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1O2WZDH4D9C9T"}}, {"Date": "on October 27, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EYBH1X1T0UV"}}, {"Date": "on August 31, 2014", "Text": "Please get yourself an editor.  Misspellings, forgotten story lines, and improper word usage, what a mess.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1P3M6W7LMSEX8"}}, {"Date": "on January 7, 2015", "Text": "All the characters seemed the same to me. All smart asses. Explanations of situations droned on too long.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWZK69U060T8M"}}, {"Date": "on October 9, 2014", "Text": "Not up to par with its class IMHO. Was a struggle getting through it. The plot has potential though", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2W3N6AKC10WQ7"}}, {"Date": "on May 8, 2015", "Text": "the storyline is good and the setup is there but I just couldn't relate to the characters.  There is something missing.  I don't see them as everyday Joe's that managed to survive the end of the world.  They are just blah.  Not likable before the world ends and they didn't get any better after the crash.  I really wanted to root for them or care if they lived or died.  But, I just couldn't.  There is no hook to pull me into the story.  It is readable and at the price I will read the 1st 3 books because I bought the bundle but truthfully I don't know if I will complete the series.  The writer has potential but sure does need an editor to catch the typos and to pull the story together.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10CBQVSCTVVPE"}}, {"Date": "on September 13, 2014", "Text": "This is an interesting read worth giving it a try. It starts off with a sickness that kills off most people. On one coast a survivor decides to head for the west coast. On the west coast survivors also learn to survive as death surrounds them. Into this then come the aliens who perhaps started the plague and came to take over. How human beings survive and then learn to fight back is the story. This is the first of an ongoing series so after reading this I do think I will go forward with the books. Is this great literature? Well it keeps your attention and does make you think but it's written in a breezy style. It's more like storytelling about a horrendous happening. A worthy effort.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1454XF9BAW888"}}, {"Date": "on October 5, 2014", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BVUINRCEI3DT"}}, {"Date": "on September 3, 2014", "Text": "Edward Robertson writes in a way that is extremely comfortable and approachable. So much so that you honest to God root for the protagonists because you feel a connection to them. You really do become emotionally entwined in the story. I gave the book 4 stars because, on occasion, he goes a little bit overboard with his colloquial way of writing. I'm also going to give him the benefit of the doubt and reserve judgement on some aspects of the book that don't seem to jive...hoping they will be flushed out more further in the series. Bottom line, however, is that we have a major talent on our hands with Edward Robertson. Bravo!", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8HEKJGBBV23T"}}, {"Date": "on October 25, 2014", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12XXWHO3F4A25"}}, {"Date": "on March 20, 2015", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37WSNFFY3PGQ4"}}, {"Date": "on March 23, 2014", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KNEY13DRGYPS"}}, {"Date": "on May 11, 2015", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IBAH812UITOC"}}, {"Date": "on September 19, 2014", "Text": "Did not really like this book. Unsure if this is truly a Zombie book:)", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2H4TQZL5Y5RZM"}}, {"Date": "on August 9, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3F2HZIDXEFHOE"}}, {"Date": "on June 12, 2012", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYHZ0LPGKZ6N5"}}, {"Date": "on December 22, 2014", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UH7WC6XQ9J77"}}, {"Date": "on November 17, 2014", "Text": "I enjoyed this book because of how I could easily imagine myself in the same situation.  The daily lives of some the characters at the beginning of the book are very much like my own and it was interesting to read about a situation that could very well happen at any moment (except the space alien part).  The author did a great job of keeping my interest by developing story-lines for several different characters and then bringing them together to conclude the story.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UQHOYMBRA3RE"}}, {"Date": "on June 26, 2014", "Text": "Bland, boring, dumb,  characters and story and that's being generous. Suspending disbelief is not enough to make this stinker plausable.  NYC native wimpy metro-sexual who cops a feel upon finding his girlfriend's dead body instantly transformed into Olympic class swimmer and expert sniper and wilderness survivalist. couldn't finish this.  Lots of typos and incorrect word usage.", "Helpfulness": 0.6666666666666666, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30SZZRI8L5I1Y"}}, {"Date": "on September 26, 2014", "Text": "I thoroughly enjoyed this book.  I enjoyed the various characters, the pace and even the author's willingness to let important characters die.  As realistic as expected for this genre, but not too graphic.  I will definitely be checking out other works by this author.  The book was well written and edited, which is sadly not true of far too many books I select online, so if you enjoy this genre, feel confident you will not be disappointed.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AP7WJPG6EZVTH"}}, {"Date": "on March 29, 2015", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29HTPTAH1VKXL"}}, {"Date": "on November 4, 2014", "Text": "I read a lot of self-published work, looking for new, up-and-coming authors. Very, very rarely am I impressed. Maybe one in one hundred catches my attention. Breakers was that one in one hundred. Though the beginning was a little slow to start and there are the understandable typos now and then, they in no way distract from the story. I was riveted and am off to purchase the sequels. I have very high hopes for Mr. Robertson. Bravo!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9PPCMD77JBYM"}}, {"Date": "on September 20, 2014", "Text": "This book was a good light read.  Interesting enough to hold my attention.  Negatives:  old plot - aliens invade Earth, use biological weapons, no big surprises or twists.  Main characters were interesting but seemed under developed, granted it was a short novel and there wasn't much time or space for development. Entertaining, a light read, I would like to see a second installment with more fleshed out and interesting characters.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BWTFJEB77014"}}, {"Date": "on September 23, 2014", "Text": "Great book. Very well written. This writer is very talented, unlike so many young writers today. I have read the whole series so far and cant wait for the next book. This could be the next Stephen King. Characters are strong but not unbelievably so. You start out hating the main guy, but he grows a backbone after suffering loss. Have the Kindle version but plan on buying the books for my library. Yes, they were that good.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A293WKSELZI7O1"}}, {"Date": "on April 13, 2014", "Text": "I gave Breakers five stars not because it's great literature but because it is a great end of the world novel -- and I've read more than a few. It's well written, fresh and full of twists and turns. It made a bout of insomnia pleasurable and I found myself neglecting other tasks to read it, right to the suspense-filled end. Don't miss Breakers.", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1N9HGKXR0P03T"}}, {"Date": "on November 13, 2013", "Text": "I wanted to love it, tried to love it. I could not get past how long it took in some cases to just get to the point already. Although I like to have descriptions of places, people, things, etc. It was just too much for my taste. That being said I enjoyed parts of the book and believe other will too.", "Helpfulness": 0.6666666666666666, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AY19IPKCS98YG"}}, {"Date": "on March 10, 2013", "Text": "This author has a very good way with words, somewhat similar to Stephen King. The whole mankilling virus and end of civilisation was well done, until we got to the deus ex machina of a still functioning radio station announcing arrival of an alien mother ship. From there the story went downhill, although it had its (well told) moments. Unfortunately it just seemed to get sillier and sillier while ALL the heroes get killed, which is annoying after reading a whole book getting to know them. It was certainly worth the $0.99 I paid for it to my kindle, so I have no complaint there, I just feel that this author has great potential and sort of frittered away what began as a great read of sound and fury into much ado about nothing.", "Helpfulness": 0.6666666666666666, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2C0Y63ABM5L3U"}}, {"Date": "on July 4, 2012", "Text": "My perspective is different: I spent 25 years as a cop of one kind or another and I have been a UFO researcher for 30 years. I just finished BREAKERS and I was blown away. This is all of the questions of existence- why evil exists and takes out the innocent, explores why the Universe may not care if all of humanity disappaears, and how we carry on anyway. All of this against the backdrop of an extinction-threatening plague and aliens who don't care that this rock was ours first. The author plays action against introspection elegantly and takes a brutally honest look at how people are. He still managed to stay positive about real love between people but it was never naive or sappy. I will be ordering more work by Edward W. Robertson right away. Thank you for one great book.", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWXH3NVCFXTAT"}}, {"Date": "on June 17, 2012", "Text": "The author does a great job taking you to the story world. I expected a re-hash of the Stand, but it turned out to be unique with a nice flow and believable story line. Big turn-offs for me are when a story resorts to unexplained supernatural phenomena or time travel (over-done to nauseousness) to keep reader interest. This didn't do either. I give it two thumbs up.", "Helpfulness": 0.6666666666666666, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJRFTVJEGV8XC"}}, {"Date": "on June 15, 2012", "Text": "This book was a great read. Very entertaining and quick paced. I did not ever get bored with the story line. Others have referred to it as a rip off of The Stand and War of the Worlds, but I do not agree. Yes, it does have some themes that are common in Science Fiction- \"I Am Legend\" was written in 1954 and included plague. It does not, however, negate the storyline of this particular book. Very enjoyable read. I will be looking for other books by this author.", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QV8UYF24HBAS"}}, {"Date": "on May 22, 2012", "Text": "End of the world plot, with fantastic wit, depth and character development.  Wish I could give the book 10 stars.  Its only flaw - it had to end.", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KD92LQCFPKTJ"}}, {"Date": "on May 20, 2012", "Text": "well worth reading. could not put it down and finished in one day. good competition for ID4. Interesting characters doomsday scenario I am looking for more from this writer!", "Helpfulness": 0.6666666666666666, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HRXIE5KT41CY"}}, {"Date": "on February 28, 2015", "Text": "Robertson has a great writing style - gritty realism and snappy dialogue. I loved the beginning of this story, with its alternating focus on Raymond and Walt and the subtle/dramatic onset of the Panhandler epidemic. With the onset of the aliens, however, things became a bit less clear and bit more removed from the realism I was really enjoying. For me, it is a 4 star book, but Robertson's writing is really, really good.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32S0AHQW36QFZ"}}, {"Date": "on February 22, 2015", "Text": "I found the language stilted and I didn't like it at all", "Helpfulness": 1.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OW9GIRWSTCHH"}}, {"Date": "on February 9, 2015", "Text": "Fans of Stephen King’s “The Stand” will enjoy “Breakers”.  I found there to be some similarities in the two, but not so much as to call it a copycat, but there was dome of that dejevu when reading it.  The plot is interesting and well thought out.  The characters are engaging and dynamic and there is enough action to go around.  A highly entertaining read for the post-apocalyptic and horror fans on your list!", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXAA7WYV0T785"}}, {"Date": "on December 16, 2014", "Text": "This book was pretty good. I liked the story about deadly virus, post-apocalyptic life. Four stars are for the beginning of the book which was too slow for me. It looked like story about two losers and their miserable lives and it took few chapters since I was totally hooked with the story. Let the beginning be one or two chapters longer I would quit reading, but I'm happy I make it through.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IXM075VM1P9T"}}, {"Date": "on April 19, 2015", "Text": "Interesting take on post-apocalyptic life.  No zombies, which seems rare these days :).  Starts off with a disease, and follows two separate people from opposite sides of the country (well, one person and one couple) and relates their stories.  Very interesting, and I like the fact that even though this is a series, there is a definite end to this story.  I would read the sequels.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3Q1N069UIAFCU"}}, {"Date": "on December 9, 2014", "Text": "If you enjoy Stephen King's writing style you will find Edward W. Robertson's as original and thought provoking. The story line is strong criss-crossing at interesting points throughout the next two books that I have also read and thoroughly enjoyed. An amazing value as I thought the books were worth far more than was charged. A great Christmas deal. Thanks, January Bain", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2489S3HZPDEBR"}}, {"Date": "on September 27, 2014", "Text": "As an EOTWAWKI aficionado I go through Kindle books on the topic like potato chips, sometimes the whole thing in one sitting. This book was one of those. As soon as I finished book one I downloaded the remainder of the series, even if they're not quite as good, the author deserves the sales (and the proceeds) for the enjoyment he gave me for Book 1.  Thank you.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1R35GLNHUWLU6"}}, {"Date": "on August 12, 2014", "Text": "I wanted to like this book in the beginning but as it progressed I found that I did not like some of the characters. Low and behold the characters I liked were all killed off. I gave 3 stars because the story held my attention \"almost\" to the end. This story needed a hero and I think the wrong one was chosen. He was not heroic, just insanely suicidal.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AF3CGXYZFB36N"}}, {"Date": "on May 1, 2015", "Text": "Pretty good book...I'm not usually into syfi stuff but I did like this book.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1S2VRLNTDU5UB"}}, {"Date": "on July 14, 2014", "Text": "Not a bad book enjoyable.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACE8IYDK7GJA"}}, {"Date": "on July 14, 2014", "Text": "will continue reading this series, no doubt. great style and development", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NJDO5P3X0HZ0"}}, {"Date": "on July 14, 2014", "Text": "Realistic, ordinary folk who manage to survive a plague that knocks out most of humanity. Nicely done. Aha! A bunch of aliens show up to add further wrinkles and are the probable source of the aforementioned plague. Plenty of room and reasons to make a series. A little too Red Dawnish  at some parts.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IGYPDXSF1NZ3"}}, {"Date": "on July 13, 2014", "Text": "I enjoyed this.  An interesting take on how our civilization ends", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOC7KOEJMWLLV"}}, {"Date": "on July 13, 2014", "Text": "Robertson manages to render previously used situations fresh and entertaining.  Allow the book a few chapters to warm up, then settle in for a great ride! Just be sure to block off some time on your schedule: this is a book you won't want to set down until you reach the final page.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24PR2OEJYFP5A"}}, {"Date": "on July 11, 2014", "Text": "Good story, kept my interest. Enjoyed the various characters, and the wondering of what was going on helped keep the interest.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19BMP9S4PVVLK"}}, {"Date": "on July 11, 2014", "Text": "Awesome book, look forward to reading more in the series", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DH8H0CMF6K99"}}, {"Date": "on July 10, 2014", "Text": "Great read and it was free but author is smart since  I ended up buying the next book :)", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TZ29ZXA6BC1Q"}}, {"Date": "on July 9, 2014", "Text": "I have just finished book 6 and now chomping at the bit for the next one. Love the characters, their development and the plot. Write on", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BD2QE1P71G3L"}}, {"Date": "on July 9, 2014", "Text": "Very exciting storyline and gets really fast paced. The suspense is well sewn in and the characters are easy to understand and relate.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36HXKKZ7TSCWA"}}, {"Date": "on July 8, 2014", "Text": "A good tale, I would read this again. The author did the research need to not fall into a trap of inaccurate facts and data.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11AQ9ER2CUPIV"}}, {"Date": "on July 8, 2014", "Text": "Love it! Great characters and plot. I've already started Book 2 and it's just as gripping as Book 1.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHCXPQG6N5HVF"}}, {"Date": "on July 6, 2014", "Text": "was acceptable if I did not have another book to read", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IAAO2EW0FPMC"}}, {"Date": "on July 5, 2014", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MN7873BEDPXX"}}, {"Date": "on July 4, 2014", "Text": "Started slow, but became very interesting, enjoyed the twists.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3INTFE7P189DT"}}, {"Date": "on July 3, 2014", "Text": "great book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38SD3LH4XGNG6"}}, {"Date": "on July 2, 2014", "Text": "Great Book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5GP2YH5K90IX"}}, {"Date": "on July 2, 2014", "Text": "I thought I was reading a book about a virus that wiped out 99% of the world's population and how the ones left were going to survive. Then it flipped into an alien invasion and that they released the plague upon us!!\"it was a great read with good characters I cared about!! Can't wait to read the rest of this series.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KNCX8CG58JA7"}}, {"Date": "on July 1, 2014", "Text": "I THOUGHT IT WAS A GREAT BOOK. WOULD LOVE TO READ THE REST OF THE SERIES. I LOVE THE VISION THAT THE AUTHOR HAS. THIS CULD SO HAPPEN ...SOMEDAY.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AB28FNK8V8WPA"}}, {"Date": "on June 30, 2014", "Text": "I enjoyed the alternating viewpoints of the story between Walt and Mia and Ray. If you enjoy post apocalyptic stories you'll enjoy this book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BKM14YWCFV6C"}}, {"Date": "on June 30, 2014", "Text": "A very intriguing and SURPRISING storyline! Very well written. One of those stories you hate to put down until you get it all read!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3C4CGW3G5EZ29"}}, {"Date": "on June 29, 2014", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EFVO05NGDFOJ"}}, {"Date": "on June 22, 2014", "Text": "Started a little slowly, but turned out to be a good read after the initial character development. Would recommend it to those who enjoy SciFi.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXWQIMBPUKKK3"}}, {"Date": "on June 19, 2014", "Text": "Breakers is a good story involving a dystopian future after the virus outbreak, and a science fiction-alien invasion story as well. I judge these types of novels by whether or not I start to care about one or more of the characters.  Most of the characters are interesting in their own right.  A good read as they say.  Unfortunately I am rather jaded right now with the plethora of dystopian series out there so I shall take a break from the genre for now. However, if you are looking for a new series I recommend this one.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKWN8NWVUQL79"}}, {"Date": "on June 19, 2014", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HO6X041SSVI6"}}, {"Date": "on June 18, 2014", "Text": "Really good reading. This book will make you lose sleep. I would recommend this book to all sci fiction readers.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXOWKTZJE2AQC"}}, {"Date": "on June 18, 2014", "Text": "I really liked the premise of this book.  I thought the writing was well done and the characterizations plausible.  I really like the twist in the middle.  Didn't see that coming which isn't usually how that goes for me.  Thank you so much for this.  I am now purchasing more of this author's work.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SU83N5R2M7YL"}}, {"Date": "on June 17, 2014", "Text": "kept my interest from the beginning right on through to the end.  great characters.  good plot.  not too predictable.  worth reading for sure.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SSGNIPF8DVOB"}}, {"Date": "on June 16, 2014", "Text": "I keep adding more and more authors to my \"watch for\" list, and this one went on after a few chapters.  Good read!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1H78D4HCXTCFA"}}, {"Date": "on June 14, 2014", "Text": "A real page turner. Stayed up a lot later than I should have. Just could not put it down. Can't wait to read more by this author", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADZ1WSMQ4QU7J"}}, {"Date": "on June 14, 2014", "Text": "Not my favorite post apocalyptic series. The story had some promise in the beginning but just didn't pan out. I didn't like the way each book was a separate story and there was a lot of repeated parts of the story in each of the books.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASDJ4W07EM6UN"}}, {"Date": "on June 12, 2014", "Text": "book started off slowly, I almost quit it then the tone of the book changed and i finally saw where things going. It's not the best but  not the worse. I plan on continuing with the series.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8XMCQKSK3THK"}}, {"Date": "on June 11, 2014", "Text": "I'm on the fourth book of this series, and am pleasantly addicted. I even have King's new book waiting while I finish up the whole series! Intriguing, different, and every single character is not only relatable, but very likable. Raymond and Mia were sweet, lovable characters. Walt was the type of guy you hate to love. The aliens were just the right amount of creepy. The story line itself isn't drastically new, but the authors ability to create such a dynamic way of telling the story leaves you feeling as if you're right there with each character. This is an author I not only will be following, but suggesting to family and friends, also. Highly recommended!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3COJXZLK9G1BA"}}, {"Date": "on June 11, 2014", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SIQ00IMR190E"}}, {"Date": "on June 10, 2014", "Text": "It 'was' OK.  Excellent writing skills.  Slow start, but OK.  Then you lost me with the UFO thing, and had to hang it up.  Never finished it.  Can I have my money back?  No?  Didn't think so.  :)", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34DCWBZHNVG67"}}, {"Date": "on June 8, 2014", "Text": "this was a great read to anyone that loves sci-fi I recommend this alien tale. I really enjoyed it a lot.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VLH7DHSIB9A8"}}, {"Date": "on June 6, 2014", "Text": "This reminds me of the war of the worlds with a twist.  I plan to read the rest of the series, can't wait to see what happens next.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34IWHZGJJCFG0"}}, {"Date": "on June 6, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9J8X2MEDH376"}}, {"Date": "on June 6, 2014", "Text": "This story shows that very ordinary people can save the world. A fun and fast read. Also makes you think about what really matters, what skills are essential, what knowledge is critical for survival.  Looking forward to the sequels.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A059360538W5QBLKQPTMU"}}, {"Date": "on June 5, 2014", "Text": "Interesting and entertaining, with humor throughout in the midst of tragedy. Well written with few if any grammatical mistakes.  Recommend.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HRLT36FVX1E0"}}, {"Date": "on June 5, 2014", "Text": "I keep getting surprised with the quality of books that I have been able to get from amazon kindle. I look forward to more books from this author.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4THCX0OLVAMQ"}}, {"Date": "on June 5, 2014", "Text": "I kept reading and wondering if I was actually going to \"endeavor to persevere\".....glad I did.  Turned out to be a good story.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26UMMB9RVPWG7"}}, {"Date": "on June 5, 2014", "Text": "Really enjoyed this book.  The double plot was complicated and the characters were flawed enough to be unpredeictable and interesting.  I have already bought the two sequels in anticipation of what might happen next.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VC3VFW2N7ZK0"}}, {"Date": "on June 3, 2014", "Text": "I enjoyed this book even tho it borrows from other scifi books and/or movies. I found myself returning to the story over and over again. If Independence Day had not already been made, this book might be done as a movie.  Good reading.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KEK0L6WK8GBD"}}, {"Date": "on June 2, 2014", "Text": "I got this in a six pack of post apocalyptic stories and before I reached the end, I had to go buy the rest of the series. My son had given a Kindle to me for Christmas so I went overboard with the 99 cent hookers. Well, this one really worked for me. I loved it.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYT09BTRN889A"}}, {"Date": "on May 31, 2014", "Text": "A good read.  Interesting plot developement.  Will be reading the rest of the series as soon as I can download them.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APLP8KD56EK1G"}}, {"Date": "on May 29, 2014", "Text": "Different than my expectation going in but enjoyable.  I will have to check out what else this author has written.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2O5O9B3QHJGPM"}}, {"Date": "on May 29, 2014", "Text": "Usally I read mystery books. This one caughq my attention. I am glad it did. Ecitng and well written with great character background.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZPXDTWY5M5MQ"}}, {"Date": "on May 29, 2014", "Text": "Finally a story that doesn't sound like it was written by a 14 year old!  Smartly written.  Plot moves after an early period of getting to know the characters.  Thoroughly enjoyable read.  Thanks!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Z3W23WXVDAA7"}}, {"Date": "on May 26, 2014", "Text": "I read this imaginative story in 2 days, ready for the next. A good read with a few spelling and usage mistakes.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1O19BPT7L78FE"}}, {"Date": "on May 25, 2014", "Text": "Usually when you download the cheaper books from Kindle, you get what you pay for: recycled stories with bad editing.  Breakers showed up on my Bookhub selection and I downloaded it, expecting very little from it.  I began reading and read it every night, looking forward to my new dystopian world before sleep.  The characters are very well written and the author spares none of them.  Crap happens to the good and not-so-good.  The aliens really don't figure in until the last third of the book, and that's okay.  I just wanted to know more about what motivated them to come take our planet, and that question is not answered in this book.  I will read the rest of the series to  find out more.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GURAV8NYG8KL"}}, {"Date": "on May 25, 2014", "Text": "Other than killing off one character that didn't work for me, the book was great. Liked it a lot lot", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATP6R2W1AH3LB"}}, {"Date": "on May 24, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AU5MPGZYJL31G"}}, {"Date": "on May 24, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFVSJCCCDR5E5"}}, {"Date": "on May 23, 2014", "Text": "The story was hard , to get into at first. After the first couple of chapters things got very interesting and I could not put it down", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3THPTRRKNP00L"}}, {"Date": "on May 23, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Z1HX46SBWP37"}}, {"Date": "on May 23, 2014", "Text": "This book is a good read, entertaining and holds your attention.  Enjoying the series and recommend it for others to purchase.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IBD3N9Z2SDAW"}}, {"Date": "on May 22, 2014", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2E5DLNTL2M348"}}, {"Date": "on May 22, 2014", "Text": "First I want to say I liked the book. I was a little dissapointed in it though, I wanted to connect to the characters and survivors more but couldn't get there. It's got a great idea but just didn't pull me in enough to want to continue on to the next book. I might read the second one in the future, but I'm still on the fence.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HK2FFHW6XEGZ"}}, {"Date": "on May 22, 2014", "Text": "Lots of action and interesting appocalyptic plot. I liked the characters and the ending. I recommend this book for you.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AL5HW41SJKE8K"}}, {"Date": "on May 21, 2014", "Text": "If you love Stephen King's novel \"The Stand\" you will love this book!  If you loved the movie \"Independence Day\" you will love this book.  If you love stories about people who can think on the run, you will love this book!  I  actually chose it on a whim, and loved every minute of reading, finding I couldn't put it down, and even took it along when I walked the dog.  It is a good tale of love and loss and survival, leaving the reader at the end with the feeling of hope, and of the goodness of mankind.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZ8W0IEMACG07"}}, {"Date": "on May 21, 2014", "Text": "This was a really fresh take on an end of the world plot. It may be survival of the fittest in almost every end of the world story line, but this one has a different take I found enjoyable.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10HSS4Z1WITKO"}}, {"Date": "on May 18, 2014", "Text": "I was prepared for a soap opera and was pleasantly surprised to find well drawn characters and a plot that hangs together nicely. It will be interesting to see how the next book develops.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3R8JIVXJ37W92"}}, {"Date": "on May 18, 2014", "Text": "Not nearly as predictable as so much sci-fi. Good story, likable charcters, mostly. An enjoyable end of the world read for a summer day on the beach.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JY4ZEB1P28TN"}}, {"Date": "on May 18, 2014", "Text": "Great story. It's definately worth the price. I think the author is worth a chance and 5 stars. I believe I will go start reading the sequel now.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGWZPU1M6WQQU"}}, {"Date": "on May 17, 2014", "Text": "Great book couldn't put it down. Nice spin on the apocolypse without the zombies. Very well written and proof read", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QQDP7IWV1SCZ"}}, {"Date": "on May 17, 2014", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2L0YLTNBCNSOP"}}, {"Date": "on May 17, 2014", "Text": "Refreshing perspective and a surprising angle on this science fiction novel.  Looking at the cover I thought the novel was about time or space travel; but I got pleasantly surprised by the development.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JIRKDGLY7LN4"}}, {"Date": "on May 16, 2014", "Text": "I am an avid reader, and I have always bought books by well known authors (Koontz, Patterson, Clark, King). I have always had the idea that if you want to read a well written, interesting book, you're going to have to pay top dollar for it. Book 1 of this series was free, and it is one of the best books I have read recently. Usually, the free Kindle books are corny, or not written as well as other books, but this one was a pleasant exception. I plan on purchasing the other books in the series to read soon.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PK5P8YMIL9BW"}}, {"Date": "on May 12, 2014", "Text": "A new take on alien invasions.  How do you survive a new pandemic, then survive the arrival of the beings that caused it. The characters are engaging and the plot well written. Although a part of a series, it can stand alone as well. Worth your time. It was hard to put down.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3B4QG7P8S1RU1"}}, {"Date": "on May 12, 2014", "Text": "Characters actually behave somewhat reasonably - no obvious Gary Stu.  Would be better if the twist wasn't included in the book summary.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32WU91R4G3AR3"}}, {"Date": "on May 11, 2014", "Text": "I was pleasantly surprised by this book.  It is an interesting twist on alien invasion vaguely reminiscent of war of the worlds.  The main two characters are well-developed and represent a basic psychological study of how people are motivated and react to devastating loss and life-threatening situations.  This is a fast-paced, well-written story, that provides a study of human nature through a variety of character types, and how each type responds to stressful situations.  For readers interested in only a fast-paced, action-packed sci-fi story, this book delivers that as well.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34XJO3AOQ8O7F"}}, {"Date": "on May 11, 2014", "Text": "The first part was a bit slow, but in hindsight it was important to understanding the characters and their eventual transformation. There were lots of surprises and twists. Do yourself a favor, and do not ready any of the summaries or story synopsis. Buy it, and enjoy the ride.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PZTORMJ5HCUL"}}, {"Date": "on May 10, 2014", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JX6RTZY3BZ8"}}, {"Date": "on May 9, 2014", "Text": "this is a good book. I would recommend it!! I also bought the second book but havent started it yet, but plan to tonite.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3V7UL3XQXSJU5"}}, {"Date": "on May 9, 2014", "Text": "The beginning of this book suggested something very like \"The Stand\" (Stephen King), but without the semi-religious plot line of good versus evil.  It morphed into an alien invasion, becoming more like Red Dawn.  The problem was the very lethargic plot development and unappealing main characters.  It made for a slow read, despite an interesting conclusion to this first installment of a series.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SMNK6IBIVX9X"}}, {"Date": "on May 9, 2014", "Text": "I was hesitant to read this since the reviews were not overwhelmingly good.  So very glad I did.  Some folks wrote that the characters were flat, undeveloped, and boring.  Were they reading the same book I did?  I read perhaps 3-4 books a week and this is by far one of the better ones I have encountered in months.  I admit I did an actual double take about halfway through when the ship showed up in the sky and the story went from a survival tale to an alien invasion but was rewarded with a smooth transition and even further character growth.  Walt is one of the better characters I've read in some time and I look forward to reading more of Mr. Robertson's work.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PQUIFCNO7RUS"}}, {"Date": "on May 9, 2014", "Text": "I read a lot of \"humans vs. aliens\" stories and many of them are long on action and short on character development. Not the case here. It's not an action story but it is post-apocalyptic science fiction and some really horrific events occur. Yet, since you're in the heads of the main characters from the get go, the focus quickly shifts from these events to how the characters respond and adapt. At least, it was this way for me.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AL4CVRKHS3KIC"}}, {"Date": "on May 9, 2014", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33XDOHIYREE23"}}, {"Date": "on May 7, 2014", "Text": "A flu like virus wipes out 98% of earths inhabitants! where did it come from? No one knows until a mothership shows up and the few survivors start being imprisoned or just outright killed by some very weird looking aliens. Finally one man who had walked across the United States decided he was either going to stop the madness or die trying. Can he do the impossible and sneak a bomb into the hovering mothership? Sorry you will have to read to find out. Kind of slow in many areas but does end well. Not my favorite book from Edward Robertson but it is okay.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2O7LGW678P1X2"}}, {"Date": "on May 5, 2014", "Text": "Believable story line that kept me very interested and involved with the characters throughout the entire book.  Already on to Book 2 and loving it!!!!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUB7LI4ELK7WY"}}, {"Date": "on May 5, 2014", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1M91191SQLBMK"}}, {"Date": "on May 4, 2014", "Text": "interesting book sometimes hard to follow sometimes a little bit out there but I'm not much of a sci fi reader", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NS0M9M7D096X"}}, {"Date": "on May 4, 2014", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1J9Y8E6DP936E"}}, {"Date": "on May 3, 2014", "Text": "I liked the book, it kept me reading until I finished.  It was a little different twist to other science fiction stories, so found that to be refreshing and interest  holding until the end.  Then immediately went on to the next book in this series, which I have not finished at this time", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALSYT4D5KEXBQ"}}, {"Date": "on May 3, 2014", "Text": "The book takes a while to develop the  irresolute characters of the protagonists who through the course of the story discover strength and resolve within themselves they never suspected they had.  The beginning phase of the story does not give a hint of  what is to follow.  I will stop here lest I give the plot away.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15Q1Y63QWOCI7"}}, {"Date": "on May 2, 2014", "Text": "Unexpected twists. I thoroughly enjoyed this book. As a born survivalist, not much was missed, and nothing was incorrect. Bravo!", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XH721I7JX64Y"}}, {"Date": "on May 2, 2014", "Text": "Didn't really know what to expect when I got this book.  I was very pleased with what I read.  Has a twist I didn't expect.  Very good story and very well written.  Looking forward to t the next book by this author.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GQ2UI5BKCCRD"}}, {"Date": "on May 2, 2014", "Text": "i loved the two coast story and the relationships of Raymond and Walt and their girlfriends!  I will recommend to my friends!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23IEOTRLK2KG9"}}, {"Date": "on May 2, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AS9GWVMFHBH2P"}}, {"Date": "on May 2, 2014", "Text": "The interlocked stories that began this novel about the apocalypse began rather slow in pacing although the characters were singularly unique. After a while, the stories gain momentum and the reading is pleasurable. I was a little put off by the insertion of aliens as the cause of the plague. Nonetheless, the stories stand on their own. I liked this book enough to continue on. --Gand", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RXD1ZQ14FAVI"}}, {"Date": "on May 2, 2014", "Text": "very solid look at a viral breakdown and post-apocalyptic scenario.  Good characterisation, and sufficient depth to make the characters appealing.  plot and pace deliveryexcellent. perhaps a little heavy with the personal philosophy, and I am not sure where book 2 is going to go, but I recommend highly for a quick \"end of the world\" Read.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KBN9QN1YJ9WC"}}, {"Date": "on May 1, 2014", "Text": "Exciting, good, thought out with precision. The story line sounds believable, the people are everyday persons who rise up to defend our world. Read this in one setting and am looking forward to the next readings of Mr Robertson's books.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEWK7PM300WXM"}}, {"Date": "on May 1, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SV5G759BE177"}}, {"Date": "on April 30, 2014", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A387Z8M6R35BTF"}}, {"Date": "on April 30, 2014", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NQAW6Z8LAX7A"}}, {"Date": "on April 30, 2014", "Text": "Really engrossing story. Such a unique take on a \"War of the Worlds\" type story. Great characterization. I loved the two family storyline concept. Just a great book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJWU3W8H5KXKM"}}, {"Date": "on April 30, 2014", "Text": "The beginning was great and the end was good too.  However, I didn't like that nearly every single character was so darn sarcastic that you always had the awareness that you were reading a book from an author who doesn't seem to be able to vocalize beyond his own inner voice.  Nonetheless, while the characters did blend together because of this, they still had enough personality in their actions to distinguish them in the story.  In the end, I'll be reading book 2 and perhaps the rest.  :)", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1N1405A4Q9UTE"}}, {"Date": "on April 29, 2014", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATGOXCNSUDRCB"}}, {"Date": "on April 29, 2014", "Text": "Probably the best dystopia I have ever read, and I've been reading them for the past 67 years.  The characters are varied, believable and flawed to some degree (i.e.: human).  The catastrophes are both startling and precisely detailed.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A147OKNDLSNRN1"}}, {"Date": "on April 28, 2014", "Text": "Have just completed the first 4 books in the series, all within a week!  Could not stop reading!  Characters are all so interesting and real and the whole story about trying to survive and stay alive after most of mankind is wiped out by a virus! Wow. Highly recommend the series. Just purchased book 5, Cut Off, and can't wait to start reading it, but a little sad that there are no more in the Series after it!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DYPYHDJSOI03"}}, {"Date": "on April 28, 2014", "Text": "At first I was bored and I thought Walt was a wuss.  He didn't seem to have a backbone and was his own pity party.  But somewhere along the way Walt became beyond awesome.  I ended up loving him and couldn't wait to see what he'd come up with next.  The other characters were great, as well, but (SPOILER ALERT!!) but they were gone too soon.  Half the time I was shocked when another character bit the dust, but it was a war, and it was never for the shock effect - it was more sad, more mournful.  I ready all three books and I enjoyed everyone of them.  Each had their characters you come to love, to enjoy, but I think Walt could have had his own stand alone book!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1R6ZXPSWEX1TP"}}, {"Date": "on April 28, 2014", "Text": "Enjoyable read.  Mr. Robertson takes a tired topic (end of the world) and gives a new twist.  Spends a lot of time on character development of two very different protagonists.  Enjoyed the slow trip through EOTW and then the carpet gets yanked with a plot twist.  Very enjoyable and would recommend for those looking for a little different yet finely written take on a disaster situation.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1L131DNEOO7DN"}}, {"Date": "on April 24, 2014", "Text": "It was a pleasure to read a book that the author took the time to have someone proof read before publishing. The book started a little slow while the author developed his characters, but on the positive side, you really get to know them. The author has a good imagination and spins an entertaining story.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HLEHNU5XN5RD"}}, {"Date": "on April 23, 2014", "Text": "I was engaged with the writing and the characters - there was detail but it supported the story line rather than gratuitously adding words like a high school assignment - a few good twists that were no expected", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEDVG3BE9SNOZ"}}, {"Date": "on April 23, 2014", "Text": "I enjoyed this story a great deal. It was well written and the characters were engaging. I particularly liked watching Walt as he grew throughout the story. It was slow moving  in places with quite detailed descriptions. They were well done, but I admit I skimmed over them to get back to the action.  I will most likely try another in the series.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2N8IO2RKUYV9W"}}, {"Date": "on April 23, 2014", "Text": "Breakers was an easy, fun, fast read. I appreciated the fact that the characters were just \"folks\", not conveniently surviving geniuses, politicians, rocket scientists or naturalists. I'd like to imagine the people in the book would be the type who survive, and while imperfect they figure it out as they go. Looking forward to the next book.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FXZM4F0LLBQT"}}, {"Date": "on April 23, 2014", "Text": "Wow, did not expect the twists and turns this book took.  I really enjoyed the characters and how they developed as the story weaved to its huge and very cool ending.  I plan on checking out the next book in the series!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Q5M51K0A4UO5"}}, {"Date": "on April 23, 2014", "Text": "A thoroughly entertaining non-zombie apocalypse story.  Smart, witty writing, some real insight into the human condition looking at love, relationships and the every day things that make us happy, sad, frightened, brave, defeated and just plain annoyed.  I was almost disappointed with the story twist towards the middle because I enjoyed all the detail following Mia & Raymond and Walt,  but the book took off faster than a hot air balloon from then on.  I lost sleep reading it because i wanted to know what happened next,  now I'm sad it's done.  On to the sequels....", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6YRY40BO2A1R"}}, {"Date": "on April 23, 2014", "Text": "This was a well written apocalyptic story with believable characters, so descriptave you feel like you know them personally. I enjoyed the read so well, I will continue on with the series. The only negative comment I feel I have to give, is that Mr. Robertson goes into so much detail that at times I lost some interest in it till it picked up again. Other than that, I thoroughly enjoyed it.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7LTQ1PMCBPGZ"}}, {"Date": "on April 22, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CY9ESB4B9VV3"}}, {"Date": "on April 21, 2014", "Text": "I might have rated this 4.5 if it was possible. I enjoyed the concept of the story, but I felt it drag in parts. The author kept enough twists to keep you guessing. I unhappy with the death of one certain character. I mean really. That said it is a good read and I will most likely read the next one in the series.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VUEZCZFODKI2"}}, {"Date": "on April 21, 2014", "Text": "Really four books in one, first the plague, then what some people did to survive AFTER the plague.  Then the aliens, and finally how they survived the aliens.  I liked it, maybe it took a few liberties with the science, but so what, a good time, and a fun book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37ISWGLU1A1FB"}}, {"Date": "on April 21, 2014", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PZ8JVKC8593J"}}, {"Date": "on April 21, 2014", "Text": "So much fun. Well written well thought out. Great characters. Just the kind of sci-fi/apocalypse stuff I really enjoy. Buying the next one right now!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYILWBNII542O"}}, {"Date": "on April 20, 2014", "Text": "A5 rating for the story, I like the way the story line moves and the twist in it now and then. I enjoyed the way the author keeps the characters and the story line real. A book to be enjoyed by most people. I will look for the next in line.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IVEQ5ZV6CGSY"}}, {"Date": "on April 19, 2014", "Text": "Distinctly different type of book. I'm excited to read the next book in the series discovering how humanity survived  and regrouped.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15U82EXA4DGHA"}}, {"Date": "on April 19, 2014", "Text": "Cant wait for the next one. End of world survivor stories are the greatest! Written with detailed precision. More please!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13GO55SPXWDBU"}}, {"Date": "on April 17, 2014", "Text": "I downloaded this because it was free, and am glad I did. It's an interesting idea, and well executed - not to mention entertaining. I definitely am going to check out the next one (even though it costs money). ;-)", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TE0G7KBLR51J"}}, {"Date": "on April 14, 2014", "Text": "Good book but it simplified to many parts of the story. So much more could have been done with the book.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13X1EPZGQSCD4"}}, {"Date": "on April 10, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12X068OGZ9AY6"}}, {"Date": "on April 9, 2014", "Text": "Believable story line......wait, did I say believable?  End of the world, a few lone survivors, then aliens?  Sounds ridiculous, but it works!  I was totally mesmerized by each of the characters, their failings and their successes.  Fresh with graphic details, I felt like I was there.  More please.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OZXG76F0NVBZ"}}, {"Date": "on April 9, 2014", "Text": "Good story telling s a twist U don't expect.  Really liked views of New York and getting out of the place", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A262C01RHNUDB8"}}, {"Date": "on April 5, 2014", "Text": "a friend read this book and told me about it.  i read Breakers in 2 days because it's that good.  it's been a while since i read a book that made me not want to put it down!  i can't wait to start book 2!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CGWJW8AIYURH"}}, {"Date": "on March 30, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5QQLCBLQFXBO"}}, {"Date": "on March 29, 2014", "Text": "I enjoyed Breakers quite a bit, but it seemed like nearly all the main characters, those who survived the virus, were overly (unrealistically) sarcastic. But that won't keep me from reading the second book in the series.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NKR6USQTN926"}}, {"Date": "on March 26, 2014", "Text": "Exciting, well written, non stop reading. If you think you know what will happen next, you may be surprised. You live with the characters in this thriller. I like that it had an ending which didn't leave you hanging for the sequel, only desperate to read more of this author's work.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12CVL3OEBNQNZ"}}, {"Date": "on March 25, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZPR1DOQUN2KE"}}, {"Date": "on March 23, 2014", "Text": "Fantastic read, could not stop reading it, its 5 in the morning and I just finished it. Went and ordered the next 2. If you love Sci FI then you have to get this. Well written. Thanks for this great read", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3P8JDACXJ5AQX"}}, {"Date": "on March 22, 2014", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3O77Z7CIKOZHR"}}, {"Date": "on March 16, 2014", "Text": "I expected a thin, weak story with adolescent characterization and implausible circumstances. I got a fast paced, totally entertaining apocalyptic sory eith complexity and characterizations filled out enough that you could actually like or dislike the person. The only negative was that my imagination never could create an alien that fidnt remind slightly of a character in a certain cartoon with a pineapple under the sea.  I'll have to work harder on that as I read the sequels.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AUXU6XPUW3IS"}}, {"Date": "on March 14, 2014", "Text": "I am not a science fiction reader, but this author may have changed that for me. When reading this book I felt like I was watching a movie. Robertson's descriptions are so clear that you feel like you are seeing the events unfold. His characters are the kind you remember long after you finish the book. This book is also thought provoking and makes you think about how quickly things can fall apart. It's also a great reminder to live and love fully whenever you can.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UNIN902U39T5"}}, {"Date": "on March 13, 2014", "Text": "Was a little predictable plot line for most of the book and a couple of times I nearly stopped and gave up, but the ending is pretty good and the characters end up redeeming themselves.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YAUVGO96SA20"}}, {"Date": "on March 11, 2014", "Text": "I have read this first book only ...so far. As i was reading i thought maybe it will be a little Swan Song or The Stand. It's different though, not a bad different. It was a good book, i am deciding if i want to read the other 2 since i think they go onto other people(?) No matter what ...a sci fi/apocalyptic fan should be happy w/this book, it's a fast and fun read. It gave me a surprise.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A386OKKDU2URJP"}}, {"Date": "on March 9, 2014", "Text": "Enjoyed this book immensely. Good story with a great cast of characters who are fallibly human. Looking forward to the sequels.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AM75P5G74BEMS"}}, {"Date": "on March 1, 2014", "Text": "Would you survive the end of the world? An end brought on by a supervirus? It is not so far fetched an idea since we already have \"antibiotic resistance super bugs\". But who or what is the creator of THIS supervirus? Definitely a must-read story.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJAHL954HP04K"}}, {"Date": "on March 1, 2014", "Text": "It may seem like a well worn idea, but Mr Robertson writes in a fresh fast-paced and interesting fashion. I enjoyed this book, and will seek out the next in the series.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7XZ22BDN7BBH"}}, {"Date": "on February 23, 2014", "Text": "A good read. A dark and stark story about people you get. To know ok w well enough to miss.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QFMLCY9TQKL7"}}, {"Date": "on February 22, 2014", "Text": "Good characters, good description, some pretty fair action sequences, but our aliens are an odd combination of smart and stupid.  They plan clever traps in human defensive installations but do not protect their mother ship from aerial attack.  Good, not great.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EZRW5DHLCA8Y"}}, {"Date": "on February 18, 2014", "Text": "I loved this, believable characters and great storyline, I look forward to reading more. First  book from this author I have read.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMGLGPBWUQBWU"}}, {"Date": "on February 17, 2014", "Text": "I have read a lot of \"end of the world as we know it\" books and this is one of the best.  This is one of those stories that keeps you reading late into the nite .  Good job.  I bought the rest of the books in the series.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SSFXQRVO8JBZ"}}, {"Date": "on February 13, 2014", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GIYC3W9F6IXT"}}, {"Date": "on February 9, 2014", "Text": "Usually I read zombie apocalypse novels, however, they have become redundant so I decided to try something new. I am glad I tried this. It was a good book and I liked the characters. It definitely kept my attention. I'm not sure yet if I will read more books from this series, but this book is definitely worth reading.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UMRDNM625ZSH"}}, {"Date": "on February 8, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3V9RRGSKZT05N"}}, {"Date": "on February 7, 2014", "Text": "By the time I did, I was too hooked to stop reading it. Great plot twists and turns with lots of moral dilemmas to consider. Now I have to read the sequels to find out what happens next.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I7WD05OGKRFM"}}, {"Date": "on February 6, 2014", "Text": "This is no hearts and flowers, happy ending lighthearted read, but rather a story that could, maybe, happen... Someday... Chilling and grim.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25D34MFIZDQK4"}}, {"Date": "on February 6, 2014", "Text": "I especially liked this book because even though it was part of a series it seemed to finish the story.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RR9FMUXVJ7WP"}}, {"Date": "on January 30, 2014", "Text": "These books take a familiar premise and run with it. Good character development, good descriptions, good pacing. The books deal with the apocalypse itself and then the aftermath in a surprisingly realistic and engaging way. Definitely worth reading.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VFVUUEOYWMKR"}}, {"Date": "on January 28, 2014", "Text": "i like this book because it's well written and adited - so few are nowadays. (i'm 81). The story is even believable to a point, which is amazing for pure fantasy. i usually read two or three books at the time (not simultaneously of course but this one fascinated me enough to stick to it until finished. Looking forward to the sequels.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3C5IUUD21E0MQ"}}, {"Date": "on January 28, 2014", "Text": "I read for entertainment and information. These books have both. There is a dual story going on and each chapter ends with a good hook to keep you reading. Aside from the sci-fi alien aspect, the series is believable. The series paints a good picture of a world after a catastrophic pandemic event: the good, the bad, and the ugly. Preppers should love this series of books. Lots of practical insight and applications in a shtf or wrol event.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KXJ6NCCE1QW1"}}, {"Date": "on January 23, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XDOGGWDRJEWG"}}, {"Date": "on January 22, 2014", "Text": "Almost didn't get this book because from the descriptors it sounded lame. In fact it was quite well written with good plot twists that weren't glaringly obvious. A little heavier on the f-bomb (both as a figure of speech and as a verb) than I really needed, but overall it was quite good and I am very likely to get the sequel.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASH0OHAMF2Q2X"}}, {"Date": "on January 22, 2014", "Text": "After reading some of the negative reviews on here, I find that a lot of them have valid points. There is a lot of back story interspersed throughout. Some of the characters are unlikeable, but I don't have to like a character to find him/her interesting. There was a lot of description, but I enjoyed it. At times the dialogue was a bit Hollywood. I liked the playful banter between Mia and her husband; didn't care so much for the perpetual snarkiness that abounded elsewhere. The book did have a Stephen King feel with its similarity to The Stand in regard to the killer virus, but I thought it was quite a different story than that told by King. I think part of the reason I liked this book so much might be because I liked The Stand so much. I don't know about typos because I listened to most of the book on my Kindle. In listening, it seemed to move smoothly and came across as a well-written book. There definitely were a few spots where I had to back up and listen again to clear up some confusion. And parts of the story strained credibility, but it is fiction, after all. The way that supposedly main characters got killed off reminded me a bit of The Walking Dead. However, even with superficial similarities to other works, I still found the story original enough to be very intriguing. Now, after that assessment of the other reviews, I will say this: I enjoyed this book. I looked forward to going back to it to see what happens next. I felt the author overall had a very professional approach to his craft. I even enjoyed the parts about planting the garden and looking at the breakers. Those were moments of peace where I could relax a bit before the next action scene. I would definitely read more by this author. I think he's very talented.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LMEF754V1EJS"}}, {"Date": "on January 16, 2014", "Text": "First book I read in series,,read rest now..give it a go....and its free switch is always a bonus..thank you...the end", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GMCS326NL5E1"}}, {"Date": "on January 16, 2014", "Text": "Odd at first but it grows on you. You'll suddenly find yourself totally engrossed in the story. We'll done in how it melds end of the world with Sci - Fi.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30M1UF4OSOWE1"}}, {"Date": "on January 14, 2014", "Text": "I enjoyed this book. Interesting enough to keep me reading without a break. Too bad there were not more hero survivors.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKOQRCCCNVRLT"}}, {"Date": "on January 13, 2014", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13QI2V4TQWQ5J"}}, {"Date": "on January 9, 2014", "Text": "Great book! Loved the twist on the post apocalyptic world (no spoilers here). I look forward to reading the next one!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16Q974NKGKEZL"}}, {"Date": "on January 5, 2014", "Text": "I really enjoyed this fast paced thriller. I am starting book 2 straight away ! I loved Walt, an unlikely hero.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKTDNZ0IJ9M2B"}}, {"Date": "on January 5, 2014", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1V3Z4Z78OSNHS"}}, {"Date": "on January 5, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HZK2DCJT3B7F"}}, {"Date": "on December 24, 2013", "Text": "A good story with enough surprises and tension to carry you through a few slow spots to a satisfying conclusion. I'm giving this only 4 stars only because the author sometimes tries to be way too clever with dialogue. This can be distracting or unintentionally funny. Look for a very tense moment in which a cop refers to “mustard.” I almost gave up right then, but, on balance, I'm glad I didn't.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIY8CLAR32UKA"}}, {"Date": "on December 23, 2013", "Text": "How can I give anything other than 5 stars? It was free and good. I have to admit, I wasn't prepared for a major plot shift that happens too near the half-way point of the book, but I didn't know at the time that this was a longer serial story. A great deal for free.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39M7J418TDJ2N"}}, {"Date": "on December 23, 2013", "Text": "I've been on a kick of reading \"survival\" type novels.  But I generally don't go for \"alien\" storylines so I  wasn't sure I'd like this.  Once I got \"hooked\" into the characters I couldn't stop reading.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APMLGN1N4PHH7"}}, {"Date": "on December 11, 2013", "Text": "The book was pretty good at first, but seemed to lose direction until the very end.  And the book left so many questions unanswered... like why the aliens showed up?  What was the alien's purpose?  Are there more of them?  More ships?  etc etc. I might have continued to book 2, but from the description of book 2, none of the unanswered questions in book 1 are addressed.  In fact, all the following books just appear to be new stories, unrelated to the characters and happenings in book 1.  I did finish the book, so I gave it a 3 stars.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A281IKRQEIZIE"}}, {"Date": "on December 10, 2013", "Text": "I'm reading Breakers and am enjoying the plot very much.  I wish the author would describe the characters more and give them more depth.  I like the story and his writing but don't feel like I'm getting to know the characters well.  It's like reading a long newspaper article where the focus is on what's happening rather than who is doing it.  Looking forward to completing the series though.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVR0GB7ST8JDU"}}, {"Date": "on December 9, 2013", "Text": "How on earth  did this  happen  you ask  that's what  mAkes this novel so compelling  a little  too windy  at times but  you get the message  I  would recommend it  ..", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GXPA70TVIGTL"}}, {"Date": "on December 5, 2013", "Text": "This is actually a very good read for being FREE!  I like how it progressed. Thanks Ed, it made me think.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJVWG47KCSK5P"}}, {"Date": "on December 4, 2013", "Text": "What can I say about a book that I haven't read yet.  It arrived fast & as described.  I'll update after I read it.  Thanks.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YGUFU306JKGK"}}, {"Date": "on November 30, 2013", "Text": "I really enjoyed this imaginative story. Looking forward to the next book in the series.  I'm new to sci do but loving it.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A99FLE04V2ZP9"}}, {"Date": "on November 29, 2013", "Text": "Love it and have bought the other books in the series - interesting take on the dystopian future.  Unusual characters and scenarios.  Kept me interested through three books and I get bored very easily", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27P3LFHAG674T"}}, {"Date": "on November 27, 2013", "Text": "I really enjoyed this book. I will definitely read more from this author. Maybe I will get the next book right now.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27I4QLTJUGV6Z"}}, {"Date": "on November 26, 2013", "Text": "Had lots of plot twists n turns. Read quickly. No slow reading parts. Ready for the next one! Loved it!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OQ1UV7I6VS3C"}}, {"Date": "on November 23, 2013", "Text": "I downloaded the Kindle edition for this book yesterday evening and since then I haven't stopped reading. I am a fan of dystopian and apocalyptic novels and I have not for a very long time really come across a book that caused me to stay up all night.  Most of the reviews discuss the story of the initial pandemic as the beginning of the \"end\" as the characters knew it, so to speak, so I won't repeat it.  I like that there a multiple story lines for a few characters so it breaks up the story yet can increase the tension.  The author is a wonderful wordsmith and gives his characters believable personalities and actions.  Highly recommended.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XXT7D7DR4821"}}, {"Date": "on November 22, 2013", "Text": "I was VERY surprised and pleased with Breakers. I couldn't put it down. Can't wait to read the sequels. Read it!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A47V9PVN1EC8K"}}, {"Date": "on November 21, 2013", "Text": "Great book, story line kept me up reading a few nights in a row until the book was finished. Pleased with the ending. Would have preferred less profanity. But good book.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27BBRSPSLZAX2"}}, {"Date": "on November 19, 2013", "Text": "Started a little slow but drew me in by the 5th chapter. The writer must really hate craw dads or lobster .", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QUAVCD0RPG1V"}}, {"Date": "on November 19, 2013", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A478KU5BQEURI"}}, {"Date": "on November 18, 2013", "Text": "Yes I actually read it all. It was a good read. Did not disappoint. I did not like the ending but the book itself was good reading...", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZKTZ5FC6UMXF"}}, {"Date": "on November 16, 2013", "Text": "Took a while to get going and the best part of this is the way the characters develop.  There are some logic gaps, but not bad.  I find myself thinking about those characters and how they make out in the following book.  Good sign.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FE2MUMKJYXKF"}}, {"Date": "on November 13, 2013", "Text": "I did not have any idea what this was about when I started it, but it turned out to be the kind of book I could not put down. Disaster flick meets Battlestar Gallactica. Looking forward to book 2 in the series.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32PEBG8JPGNMI"}}, {"Date": "on November 6, 2013", "Text": "This story is well written and loaded with characters who grow and change as their world changes around them. One character in particular, Walt, was my least favorite person in the beginning,  but as the story progressed I really started to care about him. Long before the heroic climax Walt had won a place in my heart! Breakers has everything I look for in a good book ; a quick pace, an original story line, action,  and people to both love and hate! I would definitely recommend this book to anyone who loves a great end -of -the -world story.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18KTS5V3R88ES"}}, {"Date": "on November 3, 2013", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RFHGN0CCIZRG"}}, {"Date": "on November 3, 2013", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXHVL1M22JNLN"}}, {"Date": "on November 1, 2013", "Text": "Simple straight forward post apocalyptic read.  Quick-easy-enjoyable. Good character development with entertaining dialect and fun banter. Action with a side of humorous and don't forget the classic movie quotes.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4JZ8BFZC85YF"}}, {"Date": "on October 30, 2013", "Text": "The story teller created a good backdrop throughout the progressing saga. I'm looking forward to the next book in the series.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15MROZVKLJYR6"}}, {"Date": "on October 24, 2013", "Text": "I really really enjoyed this book.  So much so that I bought all of the others and read them right away as well.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8RCZSI0AVEF0"}}, {"Date": "on October 24, 2013", "Text": "It is one of those books that you can't put down. Once you finish reading it you will want more. Hook, line, and sinker.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2COUO56LC9Y3N"}}, {"Date": "on October 21, 2013", "Text": "i'm hooked, very good concept, i'm about 2/3rds the way through the trilogy and continue to lose sleep each night to get my fix!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VA39ZZRPSXL6"}}, {"Date": "on October 19, 2013", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2W8BS0EJP5ADE"}}, {"Date": "on October 15, 2013", "Text": "As post apocalypse stories go, Breakers (the series) delivered in some surprising ways. I found myself liking characters I did not expect to like, and appreciating that the author wasn't making any character or storyline 'bullet proof.' It can be hard for authors to not godmode their main characters through a story, and this was definitely not the case in the Breakers series.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYP72TUVCF2B9"}}, {"Date": "on October 14, 2013", "Text": "I really liked this book. It is unique (in a good way) and the humor is dry - the best kind!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AISK8LWOQGRNM"}}, {"Date": "on October 10, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3P1DAUZX73RLV"}}, {"Date": "on October 10, 2013", "Text": "What a weird, strange, wonderfully interesting story! I would highly recommend this story to all those sci-fi lovers out there!", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A375JX4VF7ZNIY"}}, {"Date": "on October 9, 2013", "Text": "Breakers by Edward W. Robertson, is an apocalyptic fiction not of the zombie genre but of the alien genre. The book revolves around two separate groups of characters and follows them as they struggle through learning how to live after a virus wiped out most of the world’s population. Things don’t get any better when a ship appears in the skies and it becomes clear that the virus that wiped out most of humanity was not created on Earth but from the stars. The reader is taken on a journey as the people left alive on Earth scramble to try and resist this alien force that is bent on annihilating mankind.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16KH5MRXZDUBE"}}, {"Date": "on October 5, 2013", "Text": "No spoiler here, a terrible flu kills nearly everyone. The spoiler is where it came from. We follow a couple of main characters in their efforts to stay alive after most of humanity dies and the real animal in some of us comes out. Incidental wimpiness makes you kind of hate the guy who has decided to go for a long, long walk. But he gets it together. I really liked this book and if you like apocaliptic books you will be all in nearly right away.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GIIYLMEZY9XS"}}, {"Date": "on October 1, 2013", "Text": "I already left a review of the three book series (please read it if your interested) but wanted to put my two cents worth in on this book. I'm hoping that an extra 5 star review will help it get noticed more because it deserves it. It's  great book series that I thoroughly enjoyed. I almost didn't pick this book up because it was free and I couldn't imagine a free book being all that great. I couldn't of been more wrong. If you like action, sci-fi or post apocalyptic type books you should really enjoy this series. I actually liked the second book even better than this one.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32VARG1QP36OA"}}, {"Date": "on September 30, 2013", "Text": "what can I say? free is always great...especially when it has anything to do with books! I love reading on my kindle!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZTEDU4THRAI8"}}, {"Date": "on September 29, 2013", "Text": "I never was interested in the  science fiction books until I read this one. I could not put it down. I really enjoyed the style and quality of the authors writing. The descriptive narrative kept my interest till the last word. Walt was a character that was truly alive and a modern hero. Thanks for this book. I look forward to the sequel.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RYWEI7I49861"}}, {"Date": "on September 28, 2013", "Text": "Really enjoyed this book. I'm looking forward to reading the next. Although this story was nicely self contained and could be read as a stand alone, the characters were so well done that you can't help but wonder what happens next.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RG6TVBM80LHO"}}, {"Date": "on September 26, 2013", "Text": "A new spin on an old topic. A good science fiction plot made better by excellent writing. I hope this authorcontinues to expand into other genres.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29G8N190DCWRI"}}, {"Date": "on September 23, 2013", "Text": "Our fascination with post-apocalyptic fiction is in itself fascinating. We have imagined our world's end in a wide variety of creative ways. Here Robertson breathes new life into the alien invasion scenario. Breakers is part of a three novel series and now there is a novella set at the beginning of the first novel. This first outing was highly entertaining and given I bought the entire series for $0.99, it is an amazing value. The book is a great escape to a scary new world and Robertson shows glimmers of strong writing not often found in the volume of work in this genre, \"Smoke rose from Los Angeles County. They crossed the mountains to the east. Walt's impatience rose with the smoke. Its particles contained timbers and curtains, roof-tar and bedsheets, but also, no doubt, the aerosolized remains of human beings.\" I am looking forward to the two sequels that I intend to read with a potent libation and roaring fire (the latter composed of wood only).", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BVQHM1C6B9UW"}}, {"Date": "on September 22, 2013", "Text": "Decent book. I will probably read the sequel. I like the authors style of writing. Definitely worth the read, for sure.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KALZFPZWVP64"}}, {"Date": "on September 22, 2013", "Text": "Finally a post apocalyptic book simply about surviving without civilization and not about some spiritual phenomenons or personal dramas. Simple, interesting, well developed story allowed the author to simply tell it without trying to insert action sequences every 20 pages.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZ1X0ZX5OHAAU"}}, {"Date": "on September 21, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEVG82FHHVPR0"}}, {"Date": "on September 20, 2013", "Text": "Unlikely hero sort of saves the day with very good back story any very good pace.  I believed the aliens were planning well until I realized they were as desperate as the humans.  Visual theme of the apocalypse were well rendered. Enjoyed the story.  Easy to follow.  Thanks Edward.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37QQ6CX18YKO2"}}, {"Date": "on September 20, 2013", "Text": "This novel follows two stories, Walt from New York and a couple from Los Angeles.  Earth is stuck by a fatal flu virus that slowly kills most of the population.  The story follows the characters through the slow crumble of civilization and into the inevitable chaos that follows.  But we're not done yet.  Turns out the virus was manufactured by aliens who wanted to clean the slate before they started colonizing.  The author does a great job of bringing alive the chaotic times and paints a realistic picture of what life might be like in the aftermath. The aliens are believable and the characters are flawed but well worth caring about.  Loved this book and will be reading more.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1N4M3ZF8QFR4C"}}, {"Date": "on September 19, 2013", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NQ6I7GXMEZVA"}}, {"Date": "on September 18, 2013", "Text": "This was a good tale well told.  I most especially liked his take on offing the bad guys.  It was unique and probably even possible.  The only drawback to this otherwise great story is that he killed off too many of the good guys.  Way to many.  I realized that this was a time of doom and gloom but the author overdid it.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CVJSXMQJDBBV"}}, {"Date": "on September 17, 2013", "Text": "This story had me hooked from the beginning.  I was not crazy about the twist in the middle at first but it worked. I am now into book two", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3L8RAUK3B73DZ"}}, {"Date": "on September 16, 2013", "Text": "Started slow but then began to roll along at a rapidly flowing electrifying pace. I could  not read fast enough then it was over. I cannot wait to get on to the sequel.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A214145RU6F3N"}}, {"Date": "on September 15, 2013", "Text": "I really enjoyed reading Breakers.  I read it in less than 24 hours!  I didn't want to out it down even when my family needed me.  I highly recommend if you like this genre.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7QENHOPOKQXU"}}, {"Date": "on September 15, 2013", "Text": "The story moved along at a good pace. At the end you really wanted to see what came next for everyone.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28ETQ74HH75IR"}}, {"Date": "on September 14, 2013", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23UQMKRZNYHDX"}}, {"Date": "on September 13, 2013", "Text": "I really liked this.  I would have liked a little more time spend on the flu and breakdown of society, but it was still very engaging.  I usually lose interest when aliens show up, but this had weird interesting aliens.  I also read and enjoyed one of the spin-off stories.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19ZI1PM163HOX"}}, {"Date": "on September 13, 2013", "Text": "For some reason I was expecting zombies, but this was a very refreshing turn of events.  I would have never thought of or expected and I enjoyed following the characters stories.  The reason I gave it 4 out of 5 stars is because I found myself skimming through paragraphs to get to the next dialogue, which may just be a fault of my own. ;)  I would definitely recommend this book to friends and family interested in this genre.  I looked forward to reading it every day.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AA6U3Q4DXR4DE"}}, {"Date": "on September 13, 2013", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NRPE1ILAE96C"}}, {"Date": "on September 11, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UHAKWGIKB9BZ"}}, {"Date": "on September 10, 2013", "Text": "War of the worlds, the stand, Independence Day, falling skies, all rolled into one. Quick read, good characters. Looking forward to the other books in the series", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1E02DXO0F5SNE"}}, {"Date": "on September 9, 2013", "Text": "Well, I am an avid post-apocalyptic fan. This book mixed in diseases, biological warfare, aliens, and humanity at its worst. What can I say? I loved it! I did start to lose interest at the end, but I am so glad I finished. I will continue to read the breakers books, and follow this author", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LKIW9AQ9Q7BW"}}, {"Date": "on September 8, 2013", "Text": "Amazing story and well written novel, my only complaint is that it seem a little too short, at the end it left me wanting more. If you like the apocalyptic-collapse of civilization-innvasion type of novel you must read this one, you will not be disappointed, this author is right up there with the great ones!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Z772KYMCYQFM"}}, {"Date": "on September 7, 2013", "Text": "This was a very readable and well flowing post-apocalyptic themed book. I will keep reading the books that follow in the series. No digital age spelling errors or grammar crashes, just a few missing single words  two or three times, good deal!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ISOG8NBHAJYB"}}, {"Date": "on September 7, 2013", "Text": "I've read a lot of apocalypse-themed books, and this one is the cream of the crop. Ordinary people become heroes, leaving the reader to ask him or herself if they could step up to the plate and merely survive or save the world. A gripping read.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2K69Y3K0SN7LF"}}, {"Date": "on September 6, 2013", "Text": "A good sci fi book is like a crisp, cold beer on hot summer day: refreshing and easy to swallow. Author Edward Robertson writes well, develops his characters and throws enough curveballs to keep things fun. I'm moving on to \"Melt Down.\"", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QJVEOAK5YP0J"}}, {"Date": "on September 6, 2013", "Text": "This was a great book. It kept me fully engrossed from beginning to end. There were a couple of characters that I never could really bond with, their dialogue was a little weird, but it didn't really detract much from the story. If you are a fan of post apocalyptic fiction, you won't be disappointed. I'm looking forward to starting the next book in the series shortly!", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FBMG2JFHGCXK"}}, {"Date": "on September 5, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAS8SGUA66ZYA"}}, {"Date": "on September 5, 2013", "Text": "Great apocalyptic story.  Aliens have practically wiped humanity off the face of the earth.  This is a tale about survivors.  Gritty and realistic.  You could see it happening just like this.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2U8YWPP1PYHJM"}}, {"Date": "on September 4, 2013", "Text": "Good invasion story. Good plot, cast and execution. Fulfilling as a stand-a-lone book as well as a series. This is an easy read with a satisfying closure.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3T4VOAQP9D6NR"}}, {"Date": "on September 4, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NVRXYZISIW3E"}}, {"Date": "on September 3, 2013", "Text": "Loved this book. Writing was good, grammar and punctuation were good and the storyline was very believable. Will be looking for more books from this author. I'm heading for Amazon to get the other 3 in this series. Thank you for a good read.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KQYNRER6HYCI"}}, {"Date": "on September 3, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADUNW1XOKZ5N4"}}, {"Date": "on September 2, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1H6567Z6PB9YK"}}, {"Date": "on September 1, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XAV40WUU7QE1"}}, {"Date": "on September 1, 2013", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MDO8RZCZ40B0"}}, {"Date": "on August 29, 2013", "Text": "I really liked this story.  It was easy to get lost in while reading.  At times I had to stop as I got a bit maudlin with the whole of the grittiness. There were a few gaps and bits that left questions.  I felt like the characters were well developed and relatable, if somewhat more self-sufficient and maybe even more skilled than their histories would have you believe. In short, was imaginative &  fun & sad & gritty & entertaining. I'm definitely purchasing the next books.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2U47KOHJFJ0UX"}}, {"Date": "on August 29, 2013", "Text": "This was a great read and I think would make an excellent movie.  The characters were well fleshed and Breakers has an excellent premise of a plague (virus) being a sneak attack prelude to an alien invasion and the dystopian future that follows.  It's like Cormac McCarthy's \"The Road\" meets Stephen King's \"The Stand\" with a bit of \"War of the Worlds\" tossed in for good measure, except it's all its own animal.  I already purchased the second one.  Great job and highly recommend.  I'd be disappointed if they never consider making a movie out of this because it'd be one I'd go see for sure.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AD3DS9LYMEO27"}}, {"Date": "on August 29, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AP639Z0GV9T9M"}}, {"Date": "on August 28, 2013", "Text": "Breakers will keep you on the edge of your seat.I could not put it down and did not want it to end. Hope to see this book become a movie.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TY2SBCPFBH70"}}, {"Date": "on August 27, 2013", "Text": "This book was pretty good... Yes, it smacks of The Stand, Independence Day and Outbreak, but it was an enjoyable read. I may even read the sequels", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TZ1526ABXK96"}}, {"Date": "on August 27, 2013", "Text": "I love apocalyptic fiction and this was right up my alley. The characters are modern and realistic, like someone you know. I generally catch lots of errors in spelling, grammar etc. but there were hardly any here. All around first rate writing. I will look for more from this author.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LG0YDKY892XK"}}, {"Date": "on August 25, 2013", "Text": "I really enjoyed this book. I was with the caracters from day one and felt their terror and hope. I didnt ecpect mia to get killled so that was a twist in the story and for walt to be the hero. I think walt was so hurt by his girlfriends death and he rose above all of it to help people and to kill the aliens. He was very resilent and brave, I like how he just wanted to die but life wouldnt let him go. I really was glued to this book until the very end.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJUKLVY1HXW28"}}, {"Date": "on August 23, 2013", "Text": "This book was absolutely amazing. I finished it in a few days, but I absolutely couldn't put it down. I would l d definitely recommend to anyone who likes virus/postapocolyptic/alien stories. Similar to HALO or CRYSIS. Can't wait to read the sequel. Great book, especially how he merges the two separate storylines at the end. Truelly excellent.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A373SSIUZWPXYK"}}, {"Date": "on August 23, 2013", "Text": "Very much enjoyed this book, had a hard time putting it down.  I liked the characters a lot and found the story very interesting.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWT34Q7SXHCIR"}}, {"Date": "on August 21, 2013", "Text": "There are survivors of the virus, this is a long story, a very inventive tale with twists to keep you reading.  Walt makes friends and they fight back.  I am not going to let slip the Big surprise, you need to come to it yourself. Enjoyed it and so will you.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15D5QQBSMUZBV"}}, {"Date": "on August 16, 2013", "Text": "Excellent free book, good theme that keeps the interest up with separate character story lines.  Good mix of post apocalypse and sci fi.  I for one will now be paying to purchase the Sequels.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I2XIU54CW4N8"}}, {"Date": "on August 4, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9GMAPP9FQXK8"}}, {"Date": "on August 3, 2013", "Text": "Very good book well worth the read! Main characters are well defined and interesting. Looking fowrd to the next book and se how Walt fares in the world.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZZKZFOXWDG6X"}}, {"Date": "on July 28, 2013", "Text": "Fantastic read. Will definitely be getting the other books  had to keep reading this book cover to. cover one of the best I've read for a long time", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22DGS6HKGVYK2"}}, {"Date": "on July 26, 2013", "Text": "I was extremely impressed at how the characters were developed throughout the book. Not to mention it's fast paced, fun and original. Just had to finish the book in one long sitting because I couldn't put it down.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2F0ETLOQS9JU4"}}, {"Date": "on July 25, 2013", "Text": "This book kept my interest from start to finish.  Fabulous writing, believable characters, creepy, interesting, well thought out.  The humor along the way was a nice diversion from the often dark text (and laugh out loud funny at times).  I'd honestly say this is one of the best books I've read this year.  You won't regret it.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3U839CH1BI3A3"}}, {"Date": "on July 24, 2013", "Text": "I don't know how I came across this book, but I'm glad I did. This book took off liken  rocket from the start ad never let down until the very end. I look forward  to reading the rest of the series I have  waiting for me.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JRPFAE26K0M3"}}, {"Date": "on July 16, 2013", "Text": "I haven't read this series in order.  Started with Meltdown, then Outcome, and now Breakers.  All are good.  Each a separate story, so you won't have a problem starting with any of them.  Will be reading book 3, Knifepoint, next.  Hear there is another book in the series coming out in August.  Can't wait for it.  Don't know how many the author has planned, but I will be reading them all.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A51BAKGGSL34P"}}, {"Date": "on July 12, 2013", "Text": "Author Edward W. Robertson starts slow in his novel \"Breakers,\" which chronicles the incubation and fallout of a runaway virus that kills nearly everybody it infects. He spins the tale through two main characters, Walt in New York City and Raymond in Southern California. Both are twenty-somethings who aren't the most successful, intent on plugging away at life despite the seeming urge to surf the couch most of the day. Then change begins. In a way, the arrival of the virus that kills indiscriminately offers both characters a way out of their boring existence. Raymond gets a job mostly because he's \"clean\" helping a shady character, and Walt has to deal with the fact that his jerk girlfriend is dead and he must get on with life. Walt takes a bit of convincing, but his storyline definitely is the more interesting. Raymond acts like an observer who's forced to participate. His wife, Mia, is a bit under-used but is a more dynamic character. And dynamic is what they need. Nobody who sits around moping about the situation does well in this situation. The economy tanks, services shut down and chaos descends. And then the fun begins. Robertson injects first person observation of his choice of locations. I can tell he's lived in New York from the descriptions of sights and smells. Likewise, he's spent some time on the coast in SoCal. But he has a talent for adventure yarns. The pace of this book picks up about a quarter of the way through and doesn't ease up. It's really not an apocalyptic survival tale. The story has more going on than that, elevating it to a bright up and comer in the sci-fi genre.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GR1WW5YOGBKR"}}, {"Date": "on July 6, 2013", "Text": "This is the first time I've read a book by Edward Robinson,I thought it was very well written. It kept me reading well into the night.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AV5FNPPBHGCQO"}}, {"Date": "on June 27, 2013", "Text": "Love these stories. As someone else mentioned this book has a similar feel to Stephen King's The Stand. I actually think the writer of Breakers did a better job. Looking forward to reading the rest of the series, having already read number 2.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQZNS1W6KTH5T"}}, {"Date": "on June 20, 2013", "Text": "Can't believe I got this book for free. Clever offer though I bought the other 2 in the series great read I was a little dubious when the aliens showed up but needn't have worried. The story pulls you along and keeps you hooked. I think it starts brilliantly has a slight lul when the aliens first turn up and then gets better and better the further in you get. Highly recommend", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A263BZR4C6DZHC"}}, {"Date": "on June 16, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36KWF1ZY7LSFB"}}, {"Date": "on June 12, 2013", "Text": "This story has some of the best character development I've read in any genre, and it was particularly refreshing in a post-apocalyptic tale. Sometimes the heroes were noble; sometimes they were jerks. The author didn't waste time establishing establishing an alien pov - they're aliens and they came and screwed the earth over. What else do you need to know?", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1T2Q6IQ6TMW9W"}}, {"Date": "on June 10, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AN7LWDPGIJJB7"}}, {"Date": "on June 6, 2013", "Text": "With some indie sci-fi, you almost feel as if you are doing the author a favor by slogging through the book. Not so in the case of Edward W. Robertson's Breakers series. This is a highly entertaining, amusing, fun, interesting, and suspenseful addition in the post-apocalyptic genre. From the obvious, yet original premise, to the amusing moments that accurately reflect the quirky or slightly perverted facets of human behavior, the book consistently entertains. Probably one of the better sci-fi books I've read in the last few months. Will be looking forward to Chapter 4 in the series.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RLEDE6EUC9T0"}}, {"Date": "on May 25, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWTSAEVDJBYW8"}}, {"Date": "on May 24, 2013", "Text": "Good fun read!  Kind of \"Independence Day\"  with better Aliens and better characters.  Part survivalist, and part war novel.  I'm looking forward to reading \"Meltdown\".", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1X5IRLC22J1DD"}}, {"Date": "on May 13, 2013", "Text": "Very good indeed, couldn't put it down. The story an characters were believable. Worth the read, will look out for the sequel.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3I1S4O3JGH81V"}}, {"Date": "on May 10, 2013", "Text": "Great story. Highly recommended. Just finished it and so good going to get the sequels right now! You will not be disappointed!!!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HONA78XT6XFI"}}, {"Date": "on May 7, 2013", "Text": "What a fantastic series. I can't wait until the 5th book! It's about a virus that wipes out most of the population. The book follows two people through their expirences. A must read if this is the type of books you like.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27OT7QF2GMTAD"}}, {"Date": "on May 6, 2013", "Text": "I'm officialy hooked on the Breakers Series.  When Walt was introduced, I couldn't stand him and was wondering how I was going to make it through the book when his point of view was being told.  As the book progressed and as he grew, I really started to enjoy his character.  Just finished reading the final book and that was wonderful too, but the first one is still my favorite.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHP248WDSFZNE"}}, {"Date": "on May 4, 2013", "Text": "This is a GREAT series. These are the type of books I enjoy reading the most. This series doesn't have as much technical detail of the situation, but doesn't need it.  GREAT series.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BQ8OG43T8ERR"}}, {"Date": "on May 2, 2013", "Text": "After the very slow start I finally got into this book. There was a lot of \"stuff\" that could have been left out and unnecessary but I learn to skim over those parts. Otherwise it was a very good well written book. Off to buy number twp", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12GID1HOOBX8L"}}, {"Date": "on May 1, 2013", "Text": "Very intriguing. I didn't really read the little blurb about by the book before  I picked it up for cheap, I just knew it post apocalyptic. Definitely didn't see the twist that came half way through. The characters were awesome. I highly suggest you read this, you will not be disappointed.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2K0ALIXY12TLH"}}, {"Date": "on April 28, 2013", "Text": "I love post apocalyptic books and this one is that with a twist. The characters are rich and the story line is engaging.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14WFEVR027NOP"}}, {"Date": "on April 28, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GS45WDMMF5HP"}}, {"Date": "on April 27, 2013", "Text": "Horrifying,engaging,thought provoking. DO NOT read before going to bed. . Can't wait to start Part 2.....this scares me....must go stock my bunker..", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KEQYOHG1RN45"}}, {"Date": "on April 25, 2013", "Text": "I didn't know if I would like this book as I'm normally into fantasy and crime but I really got into it. I absolutely loved the first half but when the big twist came I wasn't sure if I would be able to continue. This lasted for about 2 pages! It is very well done and kept me gripped to the end. I am now reading the novella that accompanies this series and then I'll be moving onto book 2. I will also be looking at this author's other books. This is a must read for any prepper!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19QVNYIKBX9SJ"}}, {"Date": "on April 24, 2013", "Text": "this is by far the best alien invasion book i have ever read .The characters are so real and the story so well told you just can not put it down.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BXSDCE9HX4T5"}}, {"Date": "on April 20, 2013", "Text": "I've read a lot of end-of-the-world stories (what can I say, I'm an optimist!), and this is my favorite. Fast-paced, grab you at the first page & never let you go thrill ride. Enjoy! I sure did! Now I have to go read the rest of them!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A115FQU49GAZXR"}}, {"Date": "on April 19, 2013", "Text": "Good writer.  Great Plot!  Well written book, as good as a Niven or Pournelle.  Look forward to reading the next in the series", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2L0JNKY8MNP8X"}}, {"Date": "on April 15, 2013", "Text": "Wow, I paid 99 cents for the Kindle edition so I wasn't expecting much. Boy was I pleasantly surprised. This guy is the real deal! Great read! I am so looking forward to the next books. It's always a pleasant surprise to run into a great series! I love apocalyptic novels and this one had a unique spin. Love it!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2N2UGT4AAX6QZ"}}, {"Date": "on April 15, 2013", "Text": "Much better quality than some of the apocalypse dreck out there that suffers from a fatal lack of editing.  Very funny one liners left me snorting on the treadmill, in the elevator, on the couch.  Not your usual mix of panicked, blubbering fools only accidentally making it through via blind luck.  Still reading Book 2 in the series, which has a tie-in to a character from Book 1 that I wondered about.  Do yourself a favor and read the series.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HVI64TUHX6ZM"}}, {"Date": "on April 15, 2013", "Text": "As a sci go lover, you will enjoy this book.  Invasion from outer space along with a plague weapon which kills most of humanity, this book does not miss a beat. I especially enjoyed the psychological implications of society's breakdown and the thought processes of the survivors.  Good reading.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARDSR0QCKIWUO"}}, {"Date": "on April 15, 2013", "Text": "A strange flu strikes the world, killing those infected within days.  The majority of people on earth are soon dead or dying.  This book is about a very few who for some reason did not get infected.  It is the first book of a series, and the author does a good job of getting you to care about the characters.  A very interesting story!", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VB5MBDX6RC3X"}}, {"Date": "on April 12, 2013", "Text": "Will I read the next book? Don't know yet. Maybe and good thing kindle books are less expensive or it would be a no for sure. Sorry, just didn't hold my interest. A good book will take me 2 days to read. This one took 2 weeks.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28PMVE0T8GUHC"}}, {"Date": "on April 11, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38R9XX28WK3PI"}}, {"Date": "on April 11, 2013", "Text": "A great story with great twists and turns and for me a surprise hero. What a wild ride. Could not put it down.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3T2ZX38ICEQVA"}}, {"Date": "on April 10, 2013", "Text": "Great read. Smart. Funny. Excellent character development. Plot moves right along.Very entertaining. LOOKING FORWARD TO READING MORE BY THIS AUTHOR.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUV9FE3XVPXR5"}}, {"Date": "on April 9, 2013", "Text": "After what I thought was a slow start the story gained momentum until I found myself totally engrossed in the story. it's a gritty saga of human determination to survive and fight back. Be prepared to lose some of the characters in the story. My only fault with the story was when the description of the garden that was planted for survival had some errors in the way plants grew. Very small price to pay for a good read.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OQB0JPG6WU5Y"}}, {"Date": "on April 8, 2013", "Text": "I really enjoyed these 3 books.  A great post apocalypse story told from many different perspectives. Excellent character development which meant that I really cared for all of the characters.  Witty humor which helped move the story along.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1N5WOOSBNLIEF"}}, {"Date": "on April 8, 2013", "Text": "This book has a unique twist right in the middle of what appears to be a end of the world plague book, congrats to the author.  The writing perspective is a bit different and takes a little getting used to, but it does keep you reading.  The two main heroes don't meet until much later than I expected and under circumstances I did not predict.  Yes, the editing could be better.  I'm surprised this is the first book in a series because it \"felt\" finished when I read the last page.  IT IS NOT A ZOMBIE BOOK -YEAH!!!  It also is not a rich prepper/landowner book - also yeah!  Read it if you like to stretch your reading tastes a bit.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1STSIBS59744U"}}, {"Date": "on April 7, 2013", "Text": "WOW! The Breakers Series is an excellent way to spend your time. The characters are real people and I could barely put it down. The story line is outstanding, you can actually imagine it happening. I cannot wait for the next book to come out. Great job Edward!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39U1NWCEWL5Q"}}, {"Date": "on April 6, 2013", "Text": "Ed Robertson is a great writer. Even when he rambles he's good. The story's premise was both fun and suspenseful and I eagerly followed the characters down the road of discovery as they learn the reality of the pandemic and alien invasion of earth.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2615HBELU7MG7"}}, {"Date": "on April 3, 2013", "Text": "What a great book. Well written and full of twists and turns could not put it down. Meltdown here I come.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GWA6FUUCVFFW"}}, {"Date": "on March 30, 2013", "Text": "Weirdly believable.  I found myself thinking about what I'd do if something wiped out most of the people in the world.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AENZQB2ZDY53K"}}, {"Date": "on March 30, 2013", "Text": "I almost quit reading this several times in the beginning. After all we like Heros not damaged souls right?  However the story became more and more interesting and got into a groove which kept me coming back for more. I like the ingenuity of the author mocking up the way it would go down overall and am looking forward to the second book. I'm expecting the continued excellence that is manifesting itself in the writing.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34F1G66RPEDV6"}}, {"Date": "on March 29, 2013", "Text": "Predictable, and fun view of the different aliens.  Nice read, good character development.  But predictable. Here is my five more words that are required.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36HESTO1CVAF7"}}, {"Date": "on March 29, 2013", "Text": "Wow, could not put this down. I love apocalyptic, survivalist novels, especially when they are written with interesting characters and a roller coaster ride of suspense and thrills. I like to think I could do it, survive the end of the world. Eke out an existence in the ruins of humanity. Sometimes I believe we rely far to heavily on technology, supermarkets, readily available medicines and the government to ensure our safety. Imagine if we could no longer turn a tap and get running hot water, phone a friend or buy readily packaged food at our local supermarket? How many of us would survive?  Anyway enough of my rambling, i'm off to download the next book in this series...", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AP9QXZW6ABKI7"}}, {"Date": "on March 28, 2013", "Text": "Kind of slow starting off but became very interesting a couple chapters in. I especially enjoyed the story being told from multiple peoples veiws.  Already puchased the other volumes. Definately worth purchasing the entire trilogy. :))", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PLU9UBC1UYLM"}}, {"Date": "on March 28, 2013", "Text": "a great introduction to an intriguing series.  fantastic ideas about ordinary people trying to exist after a world destroying apocolyse", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1S3KRO5FTNSCE"}}, {"Date": "on March 28, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29IOTKPPDGZD7"}}, {"Date": "on March 27, 2013", "Text": "Well written with some twists in the plot I definitely didn't see coming. Highly recommend this read if you're in the mood for a fast pace roller coaster adventure.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14YTQF74JLUSH"}}, {"Date": "on March 27, 2013", "Text": "Humorous, action packed and full of plot twiists. You'll find aliens, plague, tragedy, romance, heartbreak and entertaining characters. Loved every minute of it!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2J07S0696B9MG"}}, {"Date": "on March 26, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23O1BNAW5EPHM"}}, {"Date": "on March 25, 2013", "Text": "I thoroughly enjoyed this book. It was full of imagination, great character development, anticipation, etc. I am looking forward to reading the next one in the series.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3M2TR5UVO4NRO"}}, {"Date": "on March 23, 2013", "Text": "Surprise in what the book was actually about. Started out with one problem and morphed into another. Walt is a great character and can't wait to get to book 2", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AG24M7V81S0N3"}}, {"Date": "on March 23, 2013", "Text": "I stayed up most of the night, I couldn't put this story down.  I just purchased book two and three!  I have to know what happens. If you start this series make sure you can stay up late! I wasn't prepared for what started the sickness that was killing everyone, it was a surprise. I highly recommend this book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XBA0PXTDMRTI"}}, {"Date": "on March 22, 2013", "Text": "But when I do, they're Fin awesome. This one definitely fits the bill. I immediately bought the second book when finishing this.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CCCUXT8VSUVV"}}, {"Date": "on March 22, 2013", "Text": "I was really surprised by this book, it got me. Loved the way the characters were portrayed .good job. Would definitely read the others in the series", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39KI1SVI4Z9PO"}}, {"Date": "on March 21, 2013", "Text": "I  am not much for this type of book. I  read Outcome and  wanted more so I got this book.  couldn't put it down.  The way the author moves between scenes drove me nuts and kept me reading", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3S491KZGTVV01"}}, {"Date": "on March 21, 2013", "Text": "Like many, I've read post apoc fiction for decades, beginning with Earth Abides when I was 12 or so, early 70's. Be it vampires, viruses, zombies, EMP, or hunger because the tiny light bulbs in fridges all extinguish inexplicably, it's all good.....IF its good. Breakers is good. Love the characters, the witty banter is something I often find off putting, but it's truly well done and fits....and the humor is actually funny. Moving on to the other books, if you buy and read this you will too.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACKJ21SZ6O7V2"}}, {"Date": "on March 21, 2013", "Text": "I enjoyed getting to know Walt and Raymond, to a lesser extent Mia and the rest.  The plot was not your typical apocalyptic novel.  The \"out of the box\" plotline kept me interested.  So why not a 5 star review?  Some of the subplots were far-fetched and the solutions so completely fantastical that I was rolling my eyes at the words.  The vote is still out on whether I will continue with the series.  Maybe one more to see if it can keep me entertained.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2I0PSCYC8GLNJ"}}, {"Date": "on March 20, 2013", "Text": "This was an execllent book.  I liked how the author had two different subjects with the same theme that really kept things interesting.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26CMZQKIU58JY"}}, {"Date": "on March 20, 2013", "Text": "This is an ok book with a couple of main characters that are not to bad.  It took me a little while to finish and had a couple of slow spots but some really fast parts to.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Z44VBHO1WRGH"}}, {"Date": "on March 20, 2013", "Text": "Couldnt put this down. Every page lead you though a thriller and into a world of how and why this could happen. Great read", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TXVOE8MQ4S10"}}, {"Date": "on March 20, 2013", "Text": "What a great read.  It was hard to put it down!  Having it take place in my neighbor hood was pretty cool too.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ASUWMRWN1F3F"}}, {"Date": "on March 20, 2013", "Text": "The [your favorite type here] apocalypse has been well documented by a large number of authors with abilities ranging from great to not so much.  This series (I just finished reading the first three) does a very entertaining job of delving into this familiar subject.  It is well written, believable (well, ok, for a certain value of 'belief'), and has good characters who are well described.  The overall premise is well worked out and quite cohesive.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7CIGJ5E8T795"}}, {"Date": "on March 20, 2013", "Text": "Breakers gripped me from the beginning. I loved the pace, language and style of the first chapter, got a little worried about trite predictability when I got to the second, but fell fully into the double helix of these stories from there.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GFTBF6NNMBPF"}}, {"Date": "on March 19, 2013", "Text": "If you enjoy adventure in a sci-fi setting, you will probably like \"Breakers - Book 1\". Much of the action and especially the ending has a \"Diehard\" flavor and laughabilty to it. The author holds your interest in a way that keeps you wanting to read just one more chapter before you put it down for the night. Some profanity and sex so it's not for the prudish.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AR7F8C3B6XH6N"}}, {"Date": "on March 18, 2013", "Text": "Better than most ----- ----- ------ --- ----- ----- ---- --- ---- ---- ---- ---- ---- --- --- ---- ----- -----", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10M0BNFVR6994"}}, {"Date": "on March 17, 2013", "Text": "Very well-written with a good plot and characters that make a story about the end of the world seem real.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEEKJG0OVVRU9"}}, {"Date": "on March 16, 2013", "Text": "I enjoyed the story although it was a bit depressing.  What a horrible end to life as we know it, but also a story of hope and loss.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AG9VTB8KHI0AS"}}, {"Date": "on March 15, 2013", "Text": "I was really surprised by this story. I didn't expect to enjoy it as much as I did. Solid premise, amazing characters, and tremendous pacing. I will make every effort to read more from this author!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IBJPKKWSBH5H"}}, {"Date": "on March 13, 2013", "Text": "This story kept my attention and i couldn't put the book down.  Then i reached the end of chapter 13 and i felt like i was there with them looking at that thing in the sky.  The rest the book kept me wanting more even after the end!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38PCCIHIE4J3M"}}, {"Date": "on March 12, 2013", "Text": "The characters in this book are rich with personality and I found them ranging radically in their beliefs and separate lives. I cared about them all and turned page after page to see them get to their goals. A nice variation to the usual post apocalyptic world. Daring and funny. Everyone's a hero in their way.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A170XQBZOVJTHC"}}, {"Date": "on March 11, 2013", "Text": "Wow This book has the most surprises of any I've read in a long while. Just when you think things are slowing up,something happens that puts you on the edge of your seat.Read it you will not be disappointed.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AH2DRN21JUJ"}}, {"Date": "on March 9, 2013", "Text": "Thoroughly enjoyed this book, didn't expect the twist halfway through.  Just about to buy the sequel!  Definitely recommend.  Good plot  and characters.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FX7DVR5RI25N"}}, {"Date": "on March 9, 2013", "Text": "I am a lifelong fan of science fiction and future dystopian fiction like \"The stand\" and \"Alas,Babylon\" and others.  I much enjoyed this yarn.  As a child of the Cuban missile crisis and the Cold War, I grew up thinking something catastrophic would happen, from within or without. I liked the characters and their slippery mores, their volatility, their unpredictability and lack of stereotype.  BRAVO!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3J6NTQOJ40VOO"}}, {"Date": "on March 8, 2013", "Text": "I have already downloaded the other books in the series and plan to finish them as soon as possible. The only reason I didn't give this book 5 stars was a personal dislike that I have with books which have a couple of paragraphs of deep thoughts by the main characters. Can't stand meaning of life bs. Otherwise excellent.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14Z0ZI3UMOVD0"}}, {"Date": "on March 7, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PLD0ZCFOP2E3"}}, {"Date": "on March 6, 2013", "Text": "I loved the style and pace even if I didn't get all the US quips. I'm gonna get straight onto the sequel.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JSG0D4OJOAYE"}}, {"Date": "on March 6, 2013", "Text": "Too much background to my liking, about half the book. From there on it was very interesting and I am looking forward to the next two volumes.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3R1HWPQTHPWSY"}}, {"Date": "on March 6, 2013", "Text": "I couldn't put this one down, great story and week written. I can't wait to read the sequel. Looking forward to more from this author", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1K6LVBDT2N5ID"}}, {"Date": "on March 6, 2013", "Text": "I enjoyed this book , and will consider reading more in the series. The author obviously has a terrific sense of humor, and that comes through with just about every character in the book. I had some trouble with catching the depth of each character because of that. The story begins when a virus kills off most of the world's population. Great stuff. Then the story moves on with an alien invasion, and an understanding that the aliens most likely planted the virus so that they could kill off the planet's population without destroying the environment. The characters seem so light hearted about most of the tragic events that happen to them. I didn't see the true emotion or grief of what had befallen most of them. Overall, it wasn't a bad story.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22R6MVN90OW24"}}, {"Date": "on March 5, 2013", "Text": "Breakers was a breath of fresh air kinda read on the \"apocalypse\". I love books on the apocalypse & zombies & the whole end of the world kinds thing, & Breakers was a great spin on all that, plus more! I just feel like there coulda been more closure @ the end of the book w/ Raymond,  as he was one of the main characters through the entire book, but maybe he will be in one of the following books to follow. I just started Meltdown today & am excited to see what it has to offer.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1F7BBGM1TOJ9R"}}, {"Date": "on March 5, 2013", "Text": "This is one of the first books I've read on my ereader and I loved it.  This is a book about a disease that devastates the world and the people that survived.  You won't be able to put it down.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOLTYTVT6PFNR"}}, {"Date": "on March 5, 2013", "Text": "A lifelong sci-fi fan with a special love for alien invasions. This story was right up my alley.  Normal people surviving in a realistic way and finding strength and courage.  Good character development and lots of action.  I'm looking forward to the rest of the series!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3E7VL7F9WDQWX"}}, {"Date": "on March 3, 2013", "Text": "I really enjoyed this read. Characters were interesting and likable. I prefer \"after the catastrophe\" stories that are not zombie or alien. Even with the alien story line, I found this to be intriguing. Anxious to read the next in the series.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A138A8VNKGWL2G"}}, {"Date": "on March 2, 2013", "Text": "Well written. Excellent ideas. Author caught me by surprise numerous times in this book. Nothing boring or predictable about this. I look forward to reading the rest of this series!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYX9K5VFHQPBS"}}, {"Date": "on February 23, 2013", "Text": "Now this is the kind of writing I love and have missed. So glad to have found this book, I've ordered the rest of the trilogy and am about to begin a happy reading marathon.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UY3F3WTXLAGY"}}, {"Date": "on February 23, 2013", "Text": "A storyline and premise so well written, characters so well developed that I could not put it down until I had finished.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2USPB0UG2QINI"}}, {"Date": "on February 20, 2013", "Text": "This was an Intresting take on the \"aliens takeover the world, mankind fights back\" type novel. It started off well but got a bit philosophy at times and ended up with an \"Independence Day\" ending. Saying that it keeped you interested to continue to the end.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYILK85O4UYBU"}}, {"Date": "on February 17, 2013", "Text": "Loved it. Interesting all the way through.  Love this author. Wasn't expecting a great story told in such gripping detail!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RC5JY7FM64ZL"}}, {"Date": "on February 16, 2013", "Text": "Having never read anything by this author before, I went in with an open mind and came out wanting more.Genuinely could not put it down.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CUH0O6KTFNR1"}}, {"Date": "on February 16, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A01628721NLXK7ENDWDC9"}}, {"Date": "on February 13, 2013", "Text": "a really good read and pretty good character description a very good apocalyptic read.looking forward to the next breakers book which i have just brought and about to read mow", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AG308WIDM0JOT"}}, {"Date": "on February 12, 2013", "Text": "Entertaining writing, solid plot that kept me reading, memorable, well-motivated characters. Not the very best sf, but very good. I'll be looking for more by this author.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1G6AEZ6OAWBWF"}}, {"Date": "on February 10, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NQ65FRAVQL70"}}, {"Date": "on February 9, 2013", "Text": "1 half pandemic disaster book and 1 half alien invasion. overall i would say this is a pretty good read.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BSLNSW02EV6M"}}, {"Date": "on February 8, 2013", "Text": "not linked to the author this the only book of his i have read. well written good story worth a read", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HK1G9CMW8X5A"}}, {"Date": "on February 7, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11VSLSMILNHVR"}}, {"Date": "on February 7, 2013", "Text": "This book has got everything: plague, aliens, the end of civilisation as we know it and lots of mayhem. It's certainly a page-turner. I read it through to the end, even though that did stretch credulity a little too far. Won't spoil it for you, but did I miss the bit where the hero had a parachute? Good fun.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31EOZW46X9JG1"}}, {"Date": "on February 5, 2013", "Text": "I read a lot of apocalyptic books and picked up Breakers a while ago from a list of free Kindle books. I was skeptical, but it turned out to be a well written captivating book!  I love the big twist to the story line, and just how out and out original it is.  And not just the story line and major twist, but the characters are also original and in-depth.  I accidentally deleted Breakers from my Kindle library list when cleaning it out to load my new Kindle and recently purchased it again, so I could give it a reread before taking on Meltdown.  Fantastic read.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6PD8NL2RTDG1"}}, {"Date": "on January 31, 2013", "Text": "I think I am still trying to wrap my head around  this story. While I believe it was well written, it left me with a hollow feeling. Maybe that was the intention of the author!", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13JQ1PF5AOF14"}}, {"Date": "on January 30, 2013", "Text": "I ordered this book last May and just got around to reading it. Boy was that a mistake! This book is an excellent sci-fi novel. Don't want to say too must and give away the plot, but I really enjoyed the book and will read the other books in the series.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1A8PBZ4C4FRJ8"}}, {"Date": "on January 30, 2013", "Text": "really like the way the author build the different characters and then let's their lives cross each others paths before continuing onwards. I thought the storyline was great and the humour was spot on. A thoroughly enjoyable read! More please!!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30M2U3K5YPVKP"}}, {"Date": "on January 28, 2013", "Text": "This was a fantastic book. The characters were well written and the dialogue was crisp and real. The story was complicated and kept my interest from start to finish. Plot twists were unexpected. There was a lot of action. I highly recommend this book to those who love action or those who love dystopian fiction.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9HJRBWGDYM9Z"}}, {"Date": "on January 27, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A393KF5GEJPVFZ"}}, {"Date": "on January 25, 2013", "Text": "One of the best books i've read in ages. Loved it. I thought it was brilliant how the story started with a virus that wiped out almost all of humanity, but then switched to a story about alien invasion. Can't wait to read the next one.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1J860VUBS6R9B"}}, {"Date": "on January 24, 2013", "Text": "I could not put it down. Close enough to reality to be scary. But crazy enough to let you dream a little.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2I25US1KEZ2HL"}}, {"Date": "on January 22, 2013", "Text": "I have really enjoyed this book ,I couldn't put it down ,we'll done ,can't wait for next one to ownlod", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I2L2U5M9GBB1"}}, {"Date": "on January 22, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JYIPFQ8PVDNM"}}, {"Date": "on January 19, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33U12012SRSI5"}}, {"Date": "on January 17, 2013", "Text": "I really enjoyed breakers! a gripping read from start to Finnish! I could forgive some of the parts that seemed to prattle on', also had quite a few typo's ,but the story had so many unexpected twists and turns I was pretty much hooked from the start! and the fact that it was a free download just made it that much better!", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35DNMUGV6FCJ8"}}, {"Date": "on January 16, 2013", "Text": "Fantastic reading,great story and I could relate to the characters... Didn't want this book to end... well done and I think I would know what to pack in my rucksack now in case aliens ever invaded us.... Thank you...", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23NCJ5QIAYO1J"}}, {"Date": "on January 16, 2013", "Text": "I thoroughly enjoyed this book! I feel like it was cross between \"The Stand\" and \"Independence Day\". The style of writing is reminiscent of Stephen King with all of the tongue in cheek humor that I love so much. All in all a great read and well worth the money spent. I have just downloaded the next book in the series...can't wait to settle in with it!!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30382HQE1HNLV"}}, {"Date": "on January 15, 2013", "Text": "Read this in a day, although it was science fiction etc. loved the fact that there weren't too many different stories going on at once, just a few main characters. Funny, gory & a real page turner. Well worth a read!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FXM9XCKDYJFT"}}, {"Date": "on January 14, 2013", "Text": "Good mix of tension, good humour and end of the world as we know it. Read it and enjoy a good story.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39WD95LSSX1FX"}}, {"Date": "on January 13, 2013", "Text": "This book was really good,took a bit to get into it but once I did wow.....I thoroughly recommend this book.Can't wait to read the follow up,meltdown.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32DLSXQAX7G2F"}}, {"Date": "on January 13, 2013", "Text": "Accidently read his second book first, which I like slightly better but only slightly.  I really like the authors creative world building and interesting characters, especially Mia. Despite not liking Walt as a human being he was brave, crazy, and I wanted to know what he was up to.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A244ULRCTJ8485"}}, {"Date": "on January 12, 2013", "Text": "wow, not what i was expecting! Very fun read which is weird to say about an end of the world novel. If like scifi you'll like this book", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACPPEVENHU7T1"}}, {"Date": "on January 6, 2013", "Text": "Enjoyed this a lot. Well developed and believable characters. Only issue I had was that the ending seemed a bit rushed especially the people at the air base as it was a bit unclear what happened and why. Still a good read though.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PP4A4SW4K24Z"}}, {"Date": "on December 28, 2012", "Text": "I really enjoyed Breakers. It was interesting to see the development of  the characters as their world's were ending. Definitely a book that makes one wonder about the world and how people would react to aliens or desecration of the human race. Breakers does the sci-fi genre wonders. I look forward to reading the next book in the series and Robertson's other works!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UXMXCXHHUUSR"}}, {"Date": "on December 26, 2012", "Text": "Just like King's characters, we find out quite abit about our heroes and maybe too much. It drug out at first but when this novel hits it's stride, Hold On! It got explosive quick. I really enjoyed this book, and look forward to starting his next. Thank you.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TC5NFE5E50UA"}}, {"Date": "on December 20, 2012", "Text": "Really enjoyed this book, as well as the sequel.  An interesting premise, and imaginatively told.  If you like alien invasion novels, you won't want to miss these.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24K68VALSBDEZ"}}, {"Date": "on December 17, 2012", "Text": "This is a well written book and will keep you reading past your bedtime. It's all about the way the world could end, who knows.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BLRXEZWFIVIF"}}, {"Date": "on December 7, 2012", "Text": "Fabulous story!  Great characterization!  You feel the character's emotions and empathize with their point of view. Wonderful 'fish out of water' aliens.  It gripped me like an anaconda's coils...until the end which made me think the author just wanted a place to end.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NPBIT7AN17IH"}}, {"Date": "on December 6, 2012", "Text": "well, I didn't see the cause of the sickness coming... and then the way it was wrapped up. hmmm.. Have to have that belief in extra terrestrial to really take it all in. Well written, story moves. Did enjoy the read of it .", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3K5HU5EF4CEMI"}}, {"Date": "on December 5, 2012", "Text": "dramatic to watch and read.  Will give it to my daughter to read next.  not bad for a kindle download", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EL6RAYZZTRB4"}}, {"Date": "on December 3, 2012", "Text": "I couldn't put it down. real characters who take you on a scary, action packed journey to save themselves and each other from alien invaders.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16KRM1ZXVMC9G"}}, {"Date": "on December 1, 2012", "Text": "I really enjoyed this book. Original, well written and edited. It certainly kept my attention from beginning to end and I look forward to reading the sequel.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GHIWHLECV0RP"}}, {"Date": "on November 29, 2012", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4GXGTNJSEO1O"}}, {"Date": "on November 28, 2012", "Text": "At first, through the first couple of chapters, I was kind of thinking \"oh no, I picked a bad one\" and then it took off and I couldn't put it down. The action, characters, became amazing. The author just needed a chapter or two to warm up and amaze me with his tale. Absolute brilliance!!!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AE6CX4RT3O2YB"}}, {"Date": "on November 22, 2012", "Text": "Wasn't sure I really started rooting for the main characters until the bad guys showed up. It took off then.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31HEH0YN9N6Y8"}}, {"Date": "on November 20, 2012", "Text": "I LOVED this book! I would forget to work I was so engrossed in it. I cant wait to start the next one.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQJ5E3W613UE0"}}, {"Date": "on November 19, 2012", "Text": "I read it in just a couple of sittings. Very much enjoyed the tone of the dialogue.  Reminded me of Joss Whedon.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3C9BTD4P1HH6P"}}, {"Date": "on November 14, 2012", "Text": "This was a pleasant surprise, and I finished it in one sitting.  Wouldn't mind seeing a sequel, but the author wrapped things up pretty well, so either way I'm a happy reader.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A81295LY35QFL"}}, {"Date": "on November 13, 2012", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2J0R9LDXBS7M8"}}, {"Date": "on November 11, 2012", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CLQ575575P1L"}}, {"Date": "on November 9, 2012", "Text": "Lost two days sleep reading this book and Melt Down. Could not put it down. Can't wait for the third book in the series.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KNPER1RUWB6M"}}, {"Date": "on October 1, 2012", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Y8S951U1ZETD"}}, {"Date": "on September 24, 2012", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKHH9TP7BEMR3"}}, {"Date": "on September 14, 2012", "Text": "I almost put this down because there is a little bit of sharp language at the onset, but I am glad I stuck with it because this is a very good story.  I liked that it had east coast and west coast perspectives on the same event, and I pretty much read this book straight through.  It is very entertaining, and the characters are described in a way that really brings them to life.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18WBDCGFPL4VB"}}, {"Date": "on September 6, 2012", "Text": "I'm not going to review the book... it's been covered and it was a great read. I want to share it with a friend of mine but he has no kindle (nor will he till sometime in 2017). See he is in prison. And i can send only paperback or hardcover books to him via Amazon. What can I do? IS there a dead tree version of this book? Should I reach out to the Author? Not that I know how to do that even. HELP!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A295CH1SJYSBNO"}}, {"Date": "on August 12, 2012", "Text": "A great read. Loaded with interesting characters.  Makes you believe you are part of the story. I would recommend it to any science fiction fan.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1G8LVH2Y0H4U6"}}, {"Date": "on August 6, 2012", "Text": "I'm not a devotee of science fiction, yet I thoroughly enjoyed this book. The author created plausible characters who dealt with life-altering events with resilience and a minimum of existential maundering.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYDMAQDTANEMZ"}}, {"Date": "on August 4, 2012", "Text": "this is a good read. the author kept it i teresting. i identified with the characters. i really thought mia made it out of the car in time. right to the end i thought walt would run in to her or liberate her from the aliens . oh it the authors story not mine. ok well", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2N2IOVX2HLQD5"}}, {"Date": "on July 30, 2012", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39W9BT970SBSU"}}, {"Date": "on July 30, 2012", "Text": "I was looking for a good story to read on vacation and Breakers qualified very well.  Compared to some other independently published books I have read on the kindle, there are very few typos or grammatical errors in the book.  The plot was fleshed out well and the conclusion was more than satisfactory.  If you are a fan of classic science fiction, I would recommend this book; it is well worth the three dollar asking price.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JJNX39YVYQ4K"}}, {"Date": "on July 29, 2012", "Text": "Very good read! Couldn`t put this one down, Serious at times, hilariously laugh out loud funny in others. Lots of action! Guns and explosions abound with characters that one can`t help but love!", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MDVYQZ7P44M"}}, {"Date": "on July 13, 2012", "Text": "A fun read that has made me a fan of an author I had not heard of before. I will now read any/everything that he writes!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANU7ECJ13BU1W"}}, {"Date": "on July 9, 2012", "Text": "I enjoyed this book.  Not your regular \"save humanity\" type of work. Good characters and realistic interplay by them. I liked it.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALOHVDXNY2AOB"}}, {"Date": "on July 6, 2012", "Text": "It was a fun read. I would surely read more by this writer. Enjoyed the way he develope his charactors.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WX6RYE889XWM"}}, {"Date": "on June 19, 2012", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIFVODI2XSC43"}}, {"Date": "on June 11, 2012", "Text": "Readers will know that certain things are left unexplained.  It is refreshing and perhaps selfless for an author to allow readers to use a work to speculate on certain things and fill in the blanks themselves.  Thus the story may accompany the reader for that later idle time when answers may be pondered.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A289WDF6JL0WO3"}}, {"Date": "on May 30, 2012", "Text": "Well, let me just say that I totally got into this book more than I expected. I like end of the world books, as my other reviews indicate but this one went into new directions I wasn't expecting. The invasion after the plague was a real mix up of things and I found the story if not wholly original at least wholly entertaining. The characters are interesting and complex and you are really pulling for everyone.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LECAU59GLWDN"}}, {"Date": "on May 28, 2012", "Text": "Very enjoyable. I don't usually read this kind of book, but it really drew me in. Writing is good, pacing is good and a satisfying ending.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANR02ZSF4UNU3"}}, {"Date": "on May 28, 2012", "Text": "Wow! Is all I can say..  Ok, I'll also add that of the 30 or so ebooks I've read, this sports the best writing and editing. Yes the are a few errors to drag one back to reality, but the story drags one right back into the fray...well done indeed!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A96Y3PLH9J5XV"}}, {"Date": "on May 28, 2012", "Text": "A plague wipes out 99% of humanity.  Turns out that it is really the precursor to an alien invasion... A good bang bang shoot 'em up read.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3K9U6TT2PDQX9"}}, {"Date": "on May 25, 2012", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YISTJEBW2CZT"}}, {"Date": "on January 5, 2015", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NPLPG2SJXY8P"}}, {"Date": "on July 18, 2014", "Text": "Started out okay, then just got ridiculous!", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9960VVGCIW87"}}, {"Date": "on May 9, 2014", "Text": "I found this book to be very enjoyable.  I liked the characters and found their reactions to their circumstances very realistic.  The plot twists and suspense kept you rooting for the survivors to triumph.  It kept me interested and not wanting to put it down.  I would recommendit and will read the others in the series.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33OGW351FO0QI"}}, {"Date": "on November 28, 2014", "Text": "Robertson was able to reel me in with the post apocalyptic theme I loved, and somehow keep me there with twists that sound like a bad turnoff, but he manages to do just right. Would recommend if you are looking for something in the apocalypse genre, but a little more humorous and upbeat than something like The Road.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12HQ68AB3OOY"}}, {"Date": "on August 10, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1X6J29AMTYMRY"}}, {"Date": "on March 24, 2015", "Text": "This is one of the best Part Apocalypse books I've ever read. I'm eager to start the second which I will do in less than an hour. I don't want to give ANYTHING away, but if you're a fan of end of the world, vividly detailed, last of humanity stories then DO NOT pass this by.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DQRLTX4KIU6E"}}, {"Date": "on August 30, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1811MNWNRRJQZ"}}, {"Date": "on August 6, 2014", "Text": "Started out as a run of the mill super plague eats the world then morphed into an alien invasion and I enjoyed it very much. Character development was pretty good the plot had lots of interesting kinks and it reeled me right in. I would recommend this to anyone.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19FTKGZ03AH9T"}}, {"Date": "on March 31, 2015", "Text": "Good read, probably could have been a stand alone novel. 3 stars for the fact that the author focused on three main characters at the beginning. After bringing them together, story isn't as detailed. Feels like the book was filled with fluff to finish.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FTCN9STPIK7Z"}}, {"Date": "on February 16, 2015", "Text": "This was much better written than many of the other books of this genre.  I was a bit disappointed when aliens showed up. A natural virus would have been more believable. But all in all, an enjoyable read. I will definitely read the rest of the series.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FWS9PH2VUIYV"}}, {"Date": "on December 10, 2014", "Text": "This book completely caught me in the moment. So well written and the action is actually very honest and believable. Seriously, a great writer, and story teller. I will absolutely be reading more from Edward, keep up the great work and writing.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37214RS6YPAPB"}}, {"Date": "on April 6, 2015", "Text": "I love this young mans imagination. Edward W. Robertson has come up with an absolutely new twist in post-apocalyptic pandemic novel ideas. I really enjoyed this full length novel, and am really looking forward to reading book 2.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QLIWBF9I6MLD"}}, {"Date": "on November 2, 2014", "Text": "This was a good story. First a plauge that kills off almost everyone. Then it is found out where it came from and the most unlikely person seems to be the hero. Good from the start to the end. I would recommend this to others.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AX8DP91SH638N"}}, {"Date": "on July 18, 2014", "Text": "Excellent writing, great characterization, and smooth pacing through an action-packed post-apocalyptic tale. This is as good as most Stephen King books. I was really enjoyed this and look forward to the rest of the series.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JBVR4A6OWKOP"}}, {"Date": "on August 31, 2014", "Text": "This was an enjoyable read. It was easy to keep track of the people in the book. Best kind of read when you don't have a lot of time to devote to reading. You can pop in and out of it and still remember what has gone on.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1K0R7IBCI9KOM"}}, {"Date": "on September 24, 2014", "Text": "Reading was good.  It does have its twists and turns.  One never expects what may happen when one turns the page.  Folks come and go which lends to the reality.  Recommend the book and will start on the second sequel.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9VA6EUZNZYHL"}}, {"Date": "on May 24, 2015", "Text": "Edward W. Robertson is the real deal; a fine writer who has crafted one of the best apocalyptic  novels EVER. It's scary, makes your pulse race, and is even funny! I hope this writer's career is a long one!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZR2GC8JD6WU6"}}, {"Date": "on March 21, 2015", "Text": "This book has a great concept, good characters, and story line.  However, the ending left a bad taste in my mouth, but otherwise, a good read.  Not sure, if I'm willing to read more of this series, though.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1K2FFHIL9TP8O"}}, {"Date": "on October 20, 2014", "Text": "The book was a good read for me but not a addictive page turner.  I felt that the character development was a bit detailed but it worked out to be clear why towards the high drama part of the story.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2L41S5N0EKFXT"}}, {"Date": "on July 29, 2014", "Text": "Not-quite-original story with some interesting interpretations. Unfortunately, the character I liked least was the loan survivor. Still, well-written overall and compelling. The end sputters a bit.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2J20ROPUWMT8Y"}}, {"Date": "on March 29, 2015", "Text": "A variety of characters come together after surviving a virus that killed most of the people on Earth. Through death and attacks by aliens they win and the survivor will continue into the future.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QVMYNYB9RGHY"}}, {"Date": "on December 1, 2014", "Text": "This was a great science fiction book with a very original story line. I loved the character development and the journey they all went on. I highly recommend this book considering its free!!!!!!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1M77P7N981HA4"}}, {"Date": "on November 23, 2014", "Text": "Loved the book. Totally didn't see the whole twist at the middle of the book (I won't give it away) coming. It's like \"The Stand\" but darker, a bit more sinister. Couldn't put it down!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARUF2AV2L3K7P"}}, {"Date": "on September 17, 2014", "Text": "This is an epic armageddon story filled with great adventure, irreverent characters, excellent dialogue and interesting intersections of people and ideas.  Read it, read it all...and enjoy.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SVB2IWEPMS3T"}}, {"Date": "on September 14, 2014", "Text": "Didn't hold my interest.", "Helpfulness": 1.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1B96QUN65D2L2"}}, {"Date": "on September 10, 2014", "Text": "Good read, not too heavy but far from too light. Great topic, good theme and arc, lovable characters and enough detail about the Scrabs to keep them intriguing. Overall a fantastic read!", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10H2ZT26NFE5D"}}, {"Date": "on July 28, 2014", "Text": "I was entertained entirely.  The characters are easily met and offer great entertainment.  I also enjoyed the surprise that splits the single story into two.  Really liked the story.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIZ63729MZFB5"}}, {"Date": "on July 7, 2014", "Text": "Not my favorite at all.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AIPSJ202S37N"}}, {"Date": "on November 13, 2014", "Text": "It's alright. A little out there, Jumps around ALOT, once you figure out there are 2 - 3 stories then it begins to flow. Reminded me of the movie Independence Day a few years back.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3F2HPO6GUNAL9"}}, {"Date": "on August 5, 2014", "Text": "Really, really enjoyed your writing. Couldn't put it down. Enjoyed all the characters and all their differences. Will tell everyone about your book. Thanks for the fun adventure.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2402J8TN02USB"}}, {"Date": "on January 10, 2015", "Text": "First chapters are so boring I almost quit reading. The rest of the book was poor too. Lackluster characters who all want to kill themselves and you wouldn't care if they did.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CG2VHUAE5T6W"}}, {"Date": "on August 15, 2014", "Text": "I thoroughly enjoyed Breakers from start to finish. Interesting characters, unpredictable outcomes, a different take on the apocalypse and plenty of action. What a fun ride!", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TA3IIS26CERY"}}, {"Date": "on April 22, 2014", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2H4SKIKU0KPD6"}}, {"Date": "on November 14, 2014", "Text": "I really enjoyed reading this novel. It kept me entertained and wanting to read the whole thing thru. Great work Edward!! I look forward to reading your other novels.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18G1E16P8CTFI"}}, {"Date": "on December 9, 2014", "Text": "Aside from some spelling/grammar issues, it was a good book. I did feel it started to ramble a little bit, but it did mostly keep my attention. It is worth the read.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CYW2BJ3VFPBB"}}, {"Date": "on April 15, 2015", "Text": "This is a great start to a great series!  It pulls you in  and holds you there.  The characters make you fall in love and fall apart!  You can't help but want more!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16S0FK4FJ80X9"}}, {"Date": "on March 24, 2015", "Text": "Good and fast apocalypse read, kept me interested.  Enjoyed the way the characters plot lines blended.  Not a huge fan of the invasion species but that's just me.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TSQA0CNESLUG"}}, {"Date": "on September 17, 2014", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GU49N9HVG7AH"}}, {"Date": "on July 25, 2014", "Text": "Very good. I enjoyed this book. I liked his cliff ender chapters. Couldn't wait to find out what would happen next. Well written. I will be purchasing Breakers2.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EX2FA4XALL10"}}, {"Date": "on May 22, 2015", "Text": "I think this book was entertaining and full of adventure. My only turn off is the sporadic choice of strange wording and context. But it is a good read overall.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3P5UV64NEW1MF"}}, {"Date": "on January 7, 2015", "Text": "Great book! Science fiction alien invasion genre, but not hokey. Believable dialog and relationships. I stayed up too late for too many nights reading it!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I8LAMFY6K78T"}}, {"Date": "on April 20, 2015", "Text": "Starts slowly but builds and holds your interest. The theme is post-apocalyptic with alien menace. Part of a series but is sufficiently stand-alone.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9JWW246BW4JL"}}, {"Date": "on August 6, 2014", "Text": "Fantastic, an end of the world without Zombies.  Great read, especially since it was free.  Now going to purchase the second book.  Cannot wait!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28LXUXKXQE5TP"}}, {"Date": "on January 22, 2015", "Text": "I found this to be a very talented author, and am curious to follow his career. This was an interesting read but it felt like 2 completely different novels with an attempt to weave them into one....both of which would have held my interest; but together were a bit overwhelming. I do think that inhibited the character development somewhat as there was only a slight feeling of knowing who the players were. The writing style itself flowed and made the story (stories) enjoyable. \"5\" for his abilities, \"4\" for being a freebie., \"2\" for the attempt at attempting to bring an \"end of the world/worst case scenario\" story in with Sci-Fi for a \"3\".  I would liken it to TWD (without the zombies) and Fallen Skies (without the plague) combined into 1 novel.", "Helpfulness": 0.5, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QQUTSF9DJ207"}}, {"Date": "on March 9, 2015", "Text": "A decent world ending story with a twist.  Easy read that keeps you engaged jumping between two main sets of characters that finally meet up.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DI19ZI7JK39C"}}, {"Date": "on October 7, 2014", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WW7YC8YFXWVX"}}, {"Date": "on July 31, 2014", "Text": "GREAT story. Twist & turn through out the book. Every time I put the book down I wanted to pick it right back up and start reading again.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3R3R7ZOY8G4WN"}}, {"Date": "on August 31, 2014", "Text": "I enjoyed the storyline and the likeable and not so likeable characters. A very talented author and one I'll be following with interest.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29RLQUHWZEPDE"}}, {"Date": "on February 12, 2015", "Text": "When the end of the world happens it takes 2 unlikely folk to save it. Lots of twists and turns. Thank you Edward for writing this book", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AK4CFFKEH7K3Z"}}, {"Date": "on December 18, 2014", "Text": "Well written. Fast paced, but enough detail to make it real. Looking forward to more. Hate the word limit requirement on these reviews.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BULKGGARZDX2"}}, {"Date": "on February 21, 2015", "Text": "This was the only post-Apocalypse book I have ever felt completely absorbed in. So much so that I wanted to actually be in this story.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RP3KOJCH5SU9"}}, {"Date": "on February 27, 2015", "Text": "This is NOT a light hearted story.  But, it will most likely entertain you.  Most likely, you will care about many of the characters.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3O9BBFL4VZ7CV"}}, {"Date": "on September 15, 2014", "Text": "Very interesting and exciting storyline. I didn't want to stop reading until the very end. It's a must read if you like adventures.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFBLYN4LJ4UQH"}}, {"Date": "on July 25, 2014", "Text": "a nice enjoyable read. a tall tell story with humor and reality mixed in. could this happen, I'm sure not, but fun to read anyway", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALFJEXTN2B63"}}, {"Date": "on July 29, 2014", "Text": "An avid reader of mystery, suspense and adventure, Breakers was a fun read. Great on the train and bus, lunch hour. Enjoyable..", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKMTJZKTUWW9Z"}}, {"Date": "on December 13, 2014", "Text": "I really enjoyed this book and have already started book 2! If you are a fan of sci-fi or post apocalyptic series, read this!", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A78E3J3JIGMC0"}}, {"Date": "on August 26, 2014", "Text": "Gripping story of the beginning of the end of life as we know it.  Fast paced.  Book left me wanting more of the whole story.  It is a story about how people survive in times of extreme crisis - some of us want to help what is left of humanity and come together for support and others want to take anything and everything they can get.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARHQ1IVIDD52O"}}, {"Date": "on November 4, 2014", "Text": "I did not expect to enjoy this book as much as I did. Nice, easy read. I am really looking forward to the next installment.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AU83PE92O9AQE"}}, {"Date": "on September 19, 2014", "Text": "The ending seemed forced and not in keeping with the rest of the book. Generally I enjoyed the book and would recommend it.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADIYZ9UGFU062"}}, {"Date": "on December 29, 2014", "Text": "After many disappointing reads, this one kept me reading. Looking forward to the next book called Meltdown. That is all.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1J403PNXNVP8I"}}, {"Date": "on November 10, 2014", "Text": "Great read, very well developed characters and story (twelve more words required eight seven six five four three two one", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2STMW20X9VW4L"}}, {"Date": "on July 27, 2014", "Text": "Good read. Kinda long winded.  But on the whole a worthwhile read. Will read next in sequel to find out where Walt went.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UWKW9EDW6QXH"}}, {"Date": "on November 13, 2014", "Text": "I won't spoil the story but lost interest when something you would never expect happen so read it and see for yourself", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BFDSJJN1SP74"}}, {"Date": "on August 30, 2014", "Text": "the book was a little slow at first but then it picked up and I didn't want to put it down. glad I continued reading.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HLXUDNXNJEWJ"}}, {"Date": "on December 25, 2014", "Text": "THe plot has a few twists.  light fare for science fiction. It is an enjoyable quick read with plague and aliens.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28I78MTP8FX51"}}, {"Date": "on September 10, 2014", "Text": "I never saw the alien twist coming.  Very well disguised.  I enjoyed the escape.  I think I may read the rest.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Y5GVGSU5CKEM"}}, {"Date": "on July 30, 2014", "Text": "I liked this book, read it in a couple days. It kept me interested. I would recommend it to si-if readers.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1S69YU7549FOB"}}, {"Date": "on March 5, 2015", "Text": "It has a good plot, gives you the feeling to read what is going to happen next. Hard to follow at points.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1L8WBMJ73BIR8"}}, {"Date": "on November 23, 2014", "Text": "A little slow going at first, but once into it I couldn't stop reading.  Looking forward to the next one.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17450ZHD009MI"}}, {"Date": "on September 23, 2014", "Text": "A good read.  Maybe is a more real take on the apocalypse than others have written.  I would recommend it", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NKBTJ5M4QQEQ"}}, {"Date": "on September 9, 2014", "Text": "great book about a pandemic and a bunch in water aliens and lots of swears and just a good book in genral", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOJ2RHWPFUDV4"}}, {"Date": "on May 10, 2015", "Text": "Didn't like the ending - it was anticlimactic ... but then I don't really like books in a series, so ...", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XJCAO7HQUMCF"}}, {"Date": "on September 30, 2014", "Text": "Excellently written SciFi.  I've read every book in the series consecutively.  Please keep writing more.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18DF1H43B26JC"}}, {"Date": "on December 27, 2014", "Text": "as I wrote before on this series, I really enjoyed but listened on audible. great story and narrator", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASK9R2MIJ6XGC"}}, {"Date": "on May 23, 2012", "Text": null, "Helpfulness": 0.6, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NB9OQP4VPPWA"}}, {"Date": "on May 21, 2012", "Text": "This book was hard to put down from the very beginning. With turns and twists totally unexpected, the author keeps the reader interest at an intense level. Great character development and dual story lines makes this a must read!", "Helpfulness": 0.6, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2I3UNBNPVQFNV"}}, {"Date": "on April 18, 2012", "Text": null, "Helpfulness": 0.6, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A890MM61UWUBW"}}, {"Date": "on July 27, 2014", "Text": "Lost lots of sleep not wanting to put it down before bed lol. Kinda sad abt ending but oh well.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMQ3NKKG1HZVU"}}, {"Date": "on April 10, 2015", "Text": "Hard to get into Part 1, but after that I loved it! Ending was a little abrupt but still great", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AG6KPWZD9UYBC"}}, {"Date": "on April 22, 2015", "Text": "A lot of fun.  Try to place yourself in that situation and wonder just how well you'd do...", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KMBSLUJXN7JN"}}, {"Date": "on September 14, 2014", "Text": "Plenty  of action and some unexpected twists and turns. I thoroughly enjoyed this book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3T971O51J5ZPK"}}, {"Date": "on December 24, 2014", "Text": "arrived as described and in good condition, and ready for use. Will make a great gift.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGAN6583I4QSF"}}, {"Date": "on October 20, 2014", "Text": "book was ok but beginning was a little off.  I only read the book because it was free.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GQXSUAY8VBKG"}}, {"Date": "on October 1, 2014", "Text": "Excellent versatility!  Confluent characters!  Enthralling plot!  Good on details!", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IRS58Y8L8UKK"}}, {"Date": "on August 10, 2014", "Text": "Excellent book. Interesting and well developed characters. Great story line.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HIS0OPWD0WUD"}}, {"Date": "on March 9, 2015", "Text": "Like the authors style. Just my kind of writer I guess, enjoyed the book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30ZU7MDPRI4R8"}}, {"Date": "on July 17, 2014", "Text": "Very good story. Love those types of books. Not as eloquent as Grisham.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2A0JMJR1OMHKH"}}, {"Date": "on March 21, 2015", "Text": null, "Helpfulness": 0.5, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27VRJ03V8K1F4"}}, {"Date": "on April 26, 2014", "Text": "I have never written a review and I read 300 to 500  books a year. Anyone who likes science fiction with more than a little human reality should enjoy this book. It has a cohesive plot and is well written. I received this book through Amazon.com and bookbub as a free book, however I will follow this author, and buy his books.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36O1F9WL7L4N2"}}, {"Date": "on April 26, 2014", "Text": "I don't want to give anything away here, but not only is Robertson the kind of writer that makes you keep turning the page to find out what happens next, he does it in unexpected ways. The two stories give us very different perspectives on what the world is going through and best of all how very different people react in very different ways to this horrific change in life as we know it. Great dialogue that clues us in on how the characters are thinking.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3P4J7MI6MC9H8"}}, {"Date": "on April 26, 2014", "Text": "This genre is difficult to write because it requires by it's nature a slightly different twist each time, this author nailed it.  Character development is superb, the story line moves along very well and writing style insightful and very well done.  A excellent book.", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11EOAFZOKU4OJ"}}, {"Date": "on April 26, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37XP8MV4HT7Y9"}}, {"Date": "on April 26, 2014", "Text": "Fun creative fast paced read. You feel like you know the characters like friends. Too bad most of them die:)) nice job", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39Z22XHHU7C41"}}, {"Date": "on April 25, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10X8VMYYSFUBD"}}, {"Date": "on April 25, 2014", "Text": "Really caught my attention and held it. Suspenseful story with many twists and turns, plus characters you care about. Highly recommend.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MLMN4RHI1SVC"}}, {"Date": "on April 16, 2014", "Text": "ALTHOUGH EACH BOOK IN THE SERIES HAVE SOME SIMILARITY THEY ARE UNIQUELY DIFFERENT.  THE WRITING STYLES ALSO VARY ENOUGH THAT I AM UNCERTAIN IF A SINGLE PERSON WRITES IT ALL.  OVERALL THE SERIES IS WORTH READING.  I'M ON THE 3RD BOOK IN THE SERIES AND I AM ENJOYING IT BUT IT IS NOT A BOOK THAT I CANNOT PUT DOWN IF NEEDED.  USUALLY THERE ARE TWO STORIES GOING WITHIN EACH NOVEL SO YOU NEED TO READ CLOSELY THE INITIAL CHAPTERS OF EACH.", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZW10G02DNJI4"}}, {"Date": "on July 23, 2012", "Text": "I really liked this book.  At first I was put off when I realized they were going toward the alien theme, but I kept reading because it was interesting to me, the author brought out his characters and really described them, it was very good!!!! Hope to see more from this author.", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2S5DW25T7QDSN"}}, {"Date": "on June 15, 2012", "Text": "Many good things have been said about this tale, all true as far as I'm concerned. I could not put this book down once I stared reading it. I believe this would make a very good movie...", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKZFA72JANYIK"}}, {"Date": "on May 31, 2012", "Text": null, "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APVCF5HJ764L3"}}, {"Date": "on May 25, 2012", "Text": "I started this on a 6 hour plane ride and was almost disappointed to land.  I'm not going to critique the style, character development or any other school type grading activity (I left that realm long ago).  My typical MO is to skim over the boring parts in most novels.  I like good compelling stories, and this is one of those...no skimming here!  Not quite done reading yet (the plane landed, albeit an hour late), so this weekend I've got something to do!", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1N4UUOA8WUCS"}}, {"Date": "on March 5, 2015", "Text": "Slow start but got going. The last half was worth the slow start.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18O6AG8PO6E81"}}, {"Date": "on October 15, 2014", "Text": "Just discovered this author a couple months ago and I can't get enough of his writing. Be aware that there are aliens that on the surface seem silly but Mr. Robertson turns them into a creature you will want to know more about. The human characters are so bold you will be cheering for them as they fight to survive.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KUWX08KMCNTA"}}, {"Date": "on March 6, 2015", "Text": "A little slow starting, but we'll worth it. A great read.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26WRN0BE1ZN4B"}}, {"Date": "on December 18, 2014", "Text": "End of civilization.  Fair story line, believable action.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3G122EVXOI19E"}}, {"Date": "on March 10, 2015", "Text": "look forward to being able to read the rest of the books", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FGIN00HJU2U5"}}, {"Date": "on September 17, 2014", "Text": "Fast shipping, well packaged, great information, thanks.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16EHZKVLQBONV"}}, {"Date": "on October 1, 2014", "Text": "Very entertaining until it got weird toward the middle.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OS42GHUMLQ5"}}, {"Date": "on November 24, 2014", "Text": "A well written and engaging story.  recommended.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7QGDXRV6EQ12"}}, {"Date": "on May 22, 2015", "Text": "Light, fun read...for an apocalyptic story.😨", "Helpfulness": "", "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A672HKRZV55RF"}}, {"Date": "on October 6, 2014", "Text": "Good book on to the next hope it's as good.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HLXFS9JQC68Z"}}, {"Date": "on August 13, 2014", "Text": "Unexpectedly good. Really kept me reading", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TP1AP6Z8TPDG"}}, {"Date": "on November 11, 2014", "Text": "FANTASTIC!  A GREAT READ.  Buy it now!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SI5H12GE0WG0"}}, {"Date": "on November 15, 2014", "Text": "I love this series - give it a shot!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RTZEYUF67UBX"}}, {"Date": "on February 20, 2015", "Text": "a great attention catching read...", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KM0VGJJ9ITBW"}}, {"Date": "on March 28, 2015", "Text": "Another free book that is decent!", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37AO20OXS51QA"}}, {"Date": "on September 26, 2014", "Text": "Great book, interesting premise", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DU5MPKCQ85BZ"}}, {"Date": "on July 17, 2014", "Text": "Solid post-apocalyptic fiction.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A344K5ZTAFTZ65"}}, {"Date": "on July 16, 2014", "Text": "Pretty good story, recommend it", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33O4IY2RLZP3J"}}, {"Date": "on March 24, 2015", "Text": "Kind of hard to relate to criminal drug dealing and gangster type characters that try to elicit sympathy.  Just could not feel sorry for them.", "Helpfulness": 0.5, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJURKZ2A341IJ"}}, {"Date": "on October 16, 2014", "Text": "This was a very enjoyable book. The story begins with a flu-like plague that decimates the earth's population, and this is followed-up with an invasion by aliens who had unleashed the disease in order to destroy our ability to defend ourselves. I liked that the story concentrates on two main characters, one in L.A. and one in New York, although they eventually meet up. It's easier to get to know them, follow their adventures and develop sympathy for their losses than if the book took a wide-ranging view of the invasion. We don't know much about the aliens, which are described as giant crab-like creatures who may or may not be collecting humans to eat them. One of the few weak aspects of the story is that the aliens and their technology is too easy to resist, especially by a handful of survivors that, while smart and resourceful, aren't drawn as scientific or military experts. Despite that, over-all the book is well-written and the story moves forward without dragging through any long, descriptive passages. Although an alien invasion isn't exactly an original topic for a book, this one manages to be entertaining and leaves the reader eager to read on in the series.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TB4FNVY9X104"}}, {"Date": "on April 17, 2014", "Text": null, "Helpfulness": 0.5714285714285714, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1P27PQK85DX3E"}}, {"Date": "on June 21, 2012", "Text": "I wanted to read the book, but it had so many typos, i just gave up.Nothing is more frustrating than seeing a paragraph made of one sentence, hashed up, over, and over.Some one needs a proofreader.", "Helpfulness": 0.6216216216216216, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JLOCPTQYBQ5I"}}, {"Date": "on March 1, 2015", "Text": "Could not put it down!!!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXXCR9XQ1Y5K5"}}, {"Date": "on May 23, 2014", "Text": "The book is about a guy who lost his girlfriend in New York due to a virus and wants to die because he can't live without her over and over again blah blah blah blah blah. All the way across the country. I would recommend this book to my worst enemy !!!!!!!!!", "Helpfulness": 0.5714285714285714, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2B9QUD2IFK6O1"}}, {"Date": "on April 4, 2015", "Text": "Couldn't put it down", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WGKTWT2WC14T"}}, {"Date": "on February 20, 2015", "Text": "Great intense book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFRJBQJDJKK8C"}}, {"Date": "on November 4, 2014", "Text": "It was an ok read.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2I25PX7SD41BU"}}, {"Date": "on May 24, 2012", "Text": "Typical alien invasion plot, but had interesting characters. Nice read and thoughtful.Characters could have been more fleshed out but they where interesting enough. Liked the book.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A300JQ4W08ZU0S"}}, {"Date": "on March 11, 2012", "Text": "This was a great read.  I spent a Sat afternoon glued to my IPad.  If you like end of the world fiction give it a try.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APAH0GU0UTPXA"}}, {"Date": "on December 1, 2014", "Text": "Enjoyable read!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1C8NLWF9ZEYFZ"}}, {"Date": "on August 27, 2014", "Text": "Excellent book", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BSOGOL1YALCU"}}, {"Date": "on August 17, 2014", "Text": "amazingly good", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30TKTKU8FMX1Z"}}, {"Date": "on March 10, 2015", "Text": "Goodread. It", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWSPYJPQJXGY8"}}, {"Date": "on July 11, 2014", "Text": "Edward W. Robertson has produced a real winner in his Breakers series. He keeps the reader easily engrossed with multiple story lines involving characters that you quickly begin to identify with and root for. I have already finished and reviewed book six and am currently reading another enthralling Robertson series, \"The Cutting Room\" while I eagerly await the last two installments of the Breakers saga. I highly recommend this young author.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IFBISG6VDII"}}, {"Date": "on July 29, 2014", "Text": "A few errors here and there (not all related to spelling or grammar) ended up killing the book for me. It could have been good, but this feels like it was written off hand without any real editing. Sorry Edward.", "Helpfulness": 0.5, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2W914I39EOH99"}}, {"Date": "on July 20, 2014", "Text": "Good stuff.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2E8KYZP8DISFD"}}, {"Date": "on May 4, 2015", "Text": "Great book", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALPGIJGV5H74O"}}, {"Date": "on December 14, 2014", "Text": "Great plot", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2316VBKVB98X6"}}, {"Date": "on September 27, 2014", "Text": "Good book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GG4J9C8US8UW"}}, {"Date": "on April 26, 2014", "Text": "Khrushchev subdued j n n is basic do  Enid b j  treeder to the public sector in the public sector in the public sector in the public sector in the public sector in the public sector in the first place of birth control pills to the mystery boxes of the public sector workers at the first place of the public and a half the mystery boxes and the public sector and the", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1G9NIELYJRFMB"}}, {"Date": "on July 13, 2014", "Text": "This book was interesting though the ending was a little hard to believe. At a couple of buck for the eBook it was definitely worth it", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SXBJQ6O3O8L0"}}, {"Date": "on July 13, 2014", "Text": "Was a free download ebook.  Cant really go wrong with that.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BJ4NFKTO156T"}}, {"Date": "on July 12, 2014", "Text": "I started this series and can't quit. I'm on my third volume.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16BKN8WSMIG6V"}}, {"Date": "on July 11, 2014", "Text": "very different book it is about how people are sent somewhere because something tragic is going to happen, so they hook these people up to a virtual reality to keep them safe. Well the virtual reality goes south and you have crazy smart zombie like people that are changing in real life too. So one guy is sent in to get the creator to try to fix this issue so they don't wake up and start changing the people that haven't been changed.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EQ3SH24TYAP3"}}, {"Date": "on May 25, 2014", "Text": "this is a fast paced read.  most of the characters were likeable and missed when they were gone.  I didn't get the aliens description.  it was too convoluted.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YUDKNCCG5BT6"}}, {"Date": "on May 15, 2014", "Text": "Unlike many apocalypse stories, this one was fairly simplistic and kept the plot line somewhat believable - the author didn't overreach. Good grammar, good dialog, and I found myself eagerly turning to the next page. I think this dude has a successful writing future ahead of him -- unless the plague takes us all out first...", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2001VXMOAFECG"}}, {"Date": "on May 15, 2014", "Text": "Take a Yankee from New York. Go to California. Kill some alien bugs. Save a naked girl, actually a crowd of naked people and you have a fun read. No sequels. Just a good read.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DRSPM0J1W0V6"}}, {"Date": "on May 13, 2014", "Text": "A great twist on an apocalypse story! Likeable characters with a little humor and edge. I look forward to reading the next book in the series!", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BKHAIT3FSNC8"}}, {"Date": "on May 12, 2014", "Text": "I'd forgotten what the book was about when I started, thought it was about just a plague, and then the aliens showed up. I liked the story, it kept me occupied for a couple of days, like any good book will do. Good read, give it a shot.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9H0VACDG5LHT"}}, {"Date": "on May 12, 2014", "Text": "Well, it was good enough that I bought the 2nd one.  I have only just started it but I am looking forward to it.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13DAJBQOW2SJ3"}}, {"Date": "on May 12, 2014", "Text": "I was ready for an apocalypse, but then the twist was something else. I like to be surprised by a book and this one delivered. What I like to see in apocalyptic books is how the humans involved react to the situation and one another. This book delivered and I was happy to get the second in the series which tells the story from other perspectives and weaved into this book. I look forward to reading the third book. I recommend this series for any fan of apocalyptic and post apocalyptic fiction.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27Q4UHAVHVAOG"}}, {"Date": "on May 11, 2014", "Text": "The story is slow and disjoined at the start, and it develops into a disjointed look at a world changing event.  In this story, some people change from bad to good or visa versa.  It also includes sudden loss, and new alliances.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A261GA9E49A9ZM"}}, {"Date": "on May 10, 2014", "Text": "The dialogue, the characters, the descriptions, the storyline are all there in excellent form.  I mean, I really enjoyed it.  I read free books because I want to explore new writers.  I am fascinated how a mind uses words in a sequence to create something that goes beyond the meaning of individual words.  Some succeed and some need encouragement.  Mr. Robertson succeeds brilliantly.  I don't like 'series' because I'm cheap and it seems like a marketing ploy, so the first book is an unsatisfying teaser.  But this book is fully formed and ends without loose ends.  I won't mind paying to enter the Breakers' world again.  And, for me, that is a high compliment to a great stringer of words.  Thanks!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11E16L5QK8HFM"}}, {"Date": "on May 8, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31GTRO5J4VTBP"}}, {"Date": "on May 8, 2014", "Text": "Loved it...hated to have to put it down...had those I know he didn't moments.very good book.iloved it and bated it to end.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A71K248A6HCD7"}}, {"Date": "on May 7, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OWJSM1Y9Y8OV"}}, {"Date": "on May 6, 2014", "Text": "Could not find the alien making friends believable.  Too far fetched for me.  Not much of a sci-fi fan. Finished this on but not interested in going any further with this series.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A86GHPOEJCWKI"}}, {"Date": "on May 6, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3F8D0RUVOLUDT"}}, {"Date": "on May 5, 2014", "Text": "I generally stay away from the alien thing but was pleasantly surprised by this book. It was a worthwhile read.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XPGMKEUN9GNG"}}, {"Date": "on May 4, 2014", "Text": "A lifelong fan of science fiction and entertaining books in general...Breakers hooked me early and kept me entertained to the end- looking forward to reading more of the series!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2E3994NYRLSWQ"}}, {"Date": "on April 30, 2014", "Text": "It was entertainimg to say the least, amd a very surprising twist, to an already saturated topic. It was one of those books that you want to stay up, all night long, after you begin to read it. Kuddos!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AS8BT7DJLTR0N"}}, {"Date": "on April 30, 2014", "Text": "Tight storytelling, believable characters, and a horrific future are what await you in this novel. I got it for free but would gladly pay for it. The story moves along and is in no way predictable. Great read!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAHAEEQ7P4UTT"}}, {"Date": "on April 29, 2014", "Text": "Entertaining and had some refreshingly creative elements.  Characters were fleshed out well.  The story wasn't predictable or too unbelievable for me.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOJHP32PZ9SU1"}}, {"Date": "on April 27, 2014", "Text": "Searching for something different this apocalyptic book exceeded my expectations! Couldn't put it down till the end! Will definitely be downloading the next in the series!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3B91LBLIOYK3S"}}, {"Date": "on April 27, 2014", "Text": "A good read. There are a lot of post apocalyptic novels to be read, this is as good as any I have read.The action doesn`t stop from the opening page to the last.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12K5Y2SEANYW0"}}, {"Date": "on April 26, 2014", "Text": "Loved it, could not stop reading, but then I loved apocalyptic books...but not sure if i'll purchase the sequel...hate sequels...", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AIZG9YOGQZIN"}}, {"Date": "on April 25, 2014", "Text": "This is a great alien invasion story. The aliens themselves and the authors description of them is above average. So many times I read alien invasion story's only to find very little time is spent on how the aliens look or act. The plucky humans fight admirably against overwhelming forces.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TA5QYECZP1L1"}}, {"Date": "on April 25, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XDBCP8Z6LLFH"}}, {"Date": "on April 24, 2014", "Text": "The story pace kept moving quickly. No problem following the characters. The plot was clever and the threads throughout the book were tied up in the end. Enjoyable read.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1E2362WR15STT"}}, {"Date": "on April 23, 2014", "Text": "Sometimes you couldn't tell who was saying what as there were quotes showing conversation but now WHO said that sentence. Other than that it kept my attention.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AR4FHXWRVOHYB"}}, {"Date": "on April 23, 2014", "Text": "Liked this book because it is set in this time. Obama is in office, figures the world would end. Kept my attention, read it all day and now at 10:13 I have finished.  Would recommend if you are into sci-fi.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A06956682BO6NSSYCIR08"}}, {"Date": "on April 23, 2014", "Text": "This is my first experience with books written by Mr. Robertson. I have to say that his style of writing is very readable, and the humorous parts are so understated that they take you by surprise! It isn't blatant humor, but subtle things that make you go back and say \"did he really say that\"??  I fully intend to buy all of the books in this series. I just purchased #2, so that leaves 3 to buy and I believe he's on his sixth in this series. I WILL read them all and enjoy them just as much as I enjoyed #1!  Thank you for a super read!!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGK7NZCIPH2VS"}}, {"Date": "on April 22, 2014", "Text": "For a survivalist novel it was a surprise.  The main characters were likeable as well as well developed.  For those of you who care, no one  \"woken\" but that were awakened.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWALCLVL9FR2D"}}, {"Date": "on April 22, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15CUVJY4OHFOD"}}, {"Date": "on April 21, 2014", "Text": "Incredible plot, great characters, real dialog. Best book I've read in a long time. I'm definitely going to read the sequels.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AR3WTAOIH8TGQ"}}, {"Date": "on April 21, 2014", "Text": "Good read! Well developed characters with human flaws. Great suspense kept me guessing. I am on to the next book in the series, Meltdown!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JFNI2PMBSH6T"}}, {"Date": "on April 21, 2014", "Text": "This was a damn good book. Surprised me halfway through, because it turned into something I definitely didn't expect, but remained solid through and through.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASQAD56M6FU6W"}}, {"Date": "on April 21, 2014", "Text": "Excellent book.  Really holds your attention.  There were a number of grauitius F-bombs especially in the early chapters.  I'm old enough to know that people say naughty words.  I don't need them in my literature.  Would have been 4 or 5 stars without unnecessary language and adult situations.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YVFLE8A8HQVE"}}, {"Date": "on April 21, 2014", "Text": "Very entertaining and well written. I finished it in two days and thoroughly enjoyed it. One has to wonder why such a book never found a main stream publisher.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZJ31JMFBELV6"}}, {"Date": "on April 21, 2014", "Text": "Loved the book, great in its melding of Sci Fi and survivalism. Kept me going with some great plot twists.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AX9WGJYCJKVMO"}}, {"Date": "on April 19, 2014", "Text": "Love it! I've been reading Apocalypse sf for a long time.... Kinda like a cross between The Stand and pick your alien invasion story. Great world building and character development. Maybe not Hugo material, but a damn good read. Five books? Thank you!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JPNCKGC3ERK5"}}, {"Date": "on April 19, 2014", "Text": "It is now 1:46 am.  I started this book this afternoon and couldn't put it down.  It a great read.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LF60U80MXFUL"}}, {"Date": "on April 13, 2014", "Text": "author is a talented writer which is fairly rare for this genre. Good story line and character development. will read second in the series.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PNKWB97TL9A6"}}, {"Date": "on April 12, 2014", "Text": "I really enjoyed reading this book. The plot is interesting and entertaining.The characters are believable and I really wanted to know their fate. I am really looking forward to the next books.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AK48Y90F52UN6"}}, {"Date": "on May 16, 2013", "Text": "I enjoyed this book until the ending. At that point I feel that author was a bit short writing to end the characters' lives (it seemed to be abrupt). I would read another book by EWR.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FPTGF6TRQGA6"}}, {"Date": "on February 12, 2013", "Text": null, "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3S5AED90QH274"}}, {"Date": "on June 30, 2012", "Text": "Just finish reading \"Breaker\" on my Kindle. Good story about alien take over the world.  Like \"Independence Day\".  The good guys win out.  I liked it.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HDGC912CROHZ"}}, {"Date": "on June 9, 2012", "Text": null, "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZ2ER0KTJQBJJ"}}, {"Date": "on May 30, 2012", "Text": "I enjoyed this book it definitely was a page turner and kept me interested.  Overall I would recommend this as a fun read.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31WKQNM8KWD2M"}}, {"Date": "on August 27, 2014", "Text": "Enloyable", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VZXHAT2E5VUD"}}, {"Date": "on October 9, 2014", "Text": "Didn't know what to expect and thought I was getting a zombie book. Turns out, without giving a spoiler, that this is part action novel and part science fiction. Well written, this is the 1st book I have read by this author, but I will now look for others.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3H906VCUE4GD1"}}, {"Date": "on October 16, 2014", "Text": "Enjoyed this book!! Surprising twist towards the end, which no doubt lead into the next book...It was hard to put down and  I am looking forward to reading the sequels!!", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33W85B5OZMCX6"}}, {"Date": "on October 20, 2014", "Text": "A truly excellent read!  It's apparently the first book of a trilogy, but it's a stand-alone novel, doesn't leave you hanging at the end.  I'd highly recommend it.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WEDH9OZ6PQFR"}}, {"Date": "on December 15, 2014", "Text": "This has been the easiest screen protector that I've installed. And it looks better than any I've installed. However I have no opinion on durability yet.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KQ7NREHIEQO0"}}, {"Date": "on February 11, 2015", "Text": "waist of time", "Helpfulness": 0.5, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7BDO463VEMTG"}}, {"Date": "on October 10, 2014", "Text": "The characters grab you and pull you along with them. It's also a ripping post-apocalyptic alien story. READ THIS BOOK! :)", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4CZ2NOSVD2E3"}}, {"Date": "on October 15, 2014", "Text": "I really enjoyed this book, the story is about survival against  horrific odds. I kook forward to the rest of the series.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21C19A7DJTWL8"}}, {"Date": "on August 28, 2014", "Text": "Yes", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3H1YZREDGYKPZ"}}, {"Date": "on July 17, 2012", "Text": "Couldn't put it down. It was an easy read that engaged you in the very beginning. Only found a handful of Kindle books that I really like. This is my favorite by far.", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASO4889KIE4XA"}}, {"Date": "on June 7, 2012", "Text": "well written, good story..I do not usually read this type of book but this was a good read. I will look for this author for my future books.", "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AN6TGXTPRTKOT"}}, {"Date": "on January 29, 2015", "Text": "I found this book to be an excellent read. I enjooyed it and look forward to your next book", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MF9HMBS90TMZ"}}, {"Date": "on November 14, 2012", "Text": "I pretty much agree with the other 2-star review.  Plus, the character I most liked got killed off... bummer.  I had to skip parts, too slow, not enough action.  And hard to follow in parts, because told in 2 voices... so I also skipped parts to unify the story line.  I got to the end, but skipped a lot to get there.  I bought the 2nd book, but probably won't read it, from what I've read, it is more of the same.  Story has interesting concerpt and has potential.", "Helpfulness": 0.5, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24B1HPOUB5RVY"}}, {"Date": "on January 31, 2015", "Text": null, "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19NGORM3TY078"}}, {"Date": "on June 27, 2013", "Text": "The story seemed to wonder a lot. Hard to keep up with who was who and where they were. But a decent story if all u want is to read and not have to think.", "Helpfulness": 0.3333333333333333, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15XSNMFT7GN4P"}}, {"Date": "on July 1, 2012", "Text": null, "Helpfulness": 0.5, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UOQJ78EKTKI5"}}, {"Date": "on September 16, 2012", "Text": "Think this is a joke,  you best think again.  It might not b aleins, but there is a truth to this entire book.  Just think about flu shots.  Read Oryx & crake!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2T0YC3KKB5B1E"}}, {"Date": "on September 13, 2013", "Text": "This book was so unbelievably boring and way too long. It didn't hold my interest at all. I ended up skipping a lot of pages until I got to  the end so I could give a review. Half way through the book I did not care how it ended, which by the way did not make any sense, I just wanted it to end so I could begin a fresh book.", "Helpfulness": 0.3333333333333333, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2K9IFA2PQM4YV"}}, {"Date": "on July 11, 2014", "Text": "not what i expected", "Helpfulness": 0.2, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AALTXK50E6ZXA"}}, {"Date": "on June 4, 2013", "Text": "The stilted writing is eclipsed only by the naive liberal propaganda sprinkled throughout. This book is a steaming pile of hot garbage.", "Helpfulness": 0.34146341463414637, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13ZP1WZJRZK7J"}}, {"Date": "on August 26, 2013", "Text": "I really enjoyed this book until mia died, especially the verbal exchanges between mia and Raymond.  It was interesting seeing how a married couple handled the invasion as opposed to everyone else who lost everyone.  To me that was the best part of the story.  Probably unreasonable of me but when she died I immediately deleted the book and will never read this author again.  I felt betrayed.", "Helpfulness": 0.10344827586206896, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOJEKNK9Q1UO1"}}], "ReviewUrl": "http://www.amazon.com/Breakers-Book-Edward-W-Robertson/product-reviews/1479395226/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.2 out of 5 stars"}, "OfferPrice": "$8.85", "Salesrank": "#353,573", "ListPrice": "$11.99"}