{"Category": "in Books (", "Name": ["Escaping Home: A Novel (The Survivalist Series)"], "Timestamp": "2015-05-24 23:43:04.802131", "itemurl": "http://www.amazon.com/Escaping-Home-Novel-Survivalist-American/dp/0142181293", "Reviews": {"TotalReviewCount": "511", "ReviewList": [{"Date": "on October 31, 2013", "Text": null, "Helpfulness": 0.8955223880597015, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2X86K2EZCV0U1"}}, {"Date": "on November 4, 2013", "Text": "The first two books had so much promise....excitement, fast paced action, & suspense. \"Escaping Home\", the third book in the series, had me scanning over more than a few pages just trying to get to the action. By the time I was halfway through, I would've welcomed any kind of action: maybe a raccoon invading a garbage can or a deer running in front of one of their vehicles, anything. Seriously, I would have welcomed either of those scenarios just to break up the page after page monotony that is this book. I hate to say it after how much I enjoyed the first two books but \"Escaping Home\" is a \"snore fest\". I'll probably buy the next book in the series but if things don't speed up, that will be it for me. I gave this one 2 stars simply because I enjoyed the first two in the series, otherwise, it would've only gotten 1 star.", "Helpfulness": 0.8717948717948718, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEI3IHU1T33YT"}}, {"Date": "on November 2, 2013", "Text": null, "Helpfulness": 0.868421052631579, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LMH6XH7TR7VN"}}, {"Date": "on October 31, 2013", "Text": "Morgan and his family were smart enough to prepare for the unexpected.  They built up a good back-up food supply, solar power to run the essentials, water supply, etc. It was enough for a while, but throw in some Feds that never heard of the constitution, a few jealous ex-neighbors and a firestorm erupts.  This is the story of a bug out after the fight gets personal.  Sarge and his men are a big part of the story, along with the hardware they brought to the party.  There is a lot of action and various sub-plots to keep the pages turning.  On another level, for anyone who has done any prepping or has plans to, the book does deliver a lot or realism and food for thought.  Overall, its a good story in the larger saga of the survival of Morgan and his family and friends.  It does leave some cliffhangers, though and the bigger action and whatever payback is coming will need to wait for the author to write the next installment.", "Helpfulness": 0.8846153846153846, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I0MKOZ67K9Q8"}}, {"Date": "on November 22, 2013", "Text": "I have been reading some of the independent writers here and I expect a few type and grammar errors now and then.  Low budget by necessity.  Proofreading can be tough to get done I imagine. While the story continues here, annoyingly the grammar and type errors have multiplied.  A lot!  I found at least one every other page or so. Much shorter book than the previous 2 and much of it seemed like filler merely to expand the word count.  Honestly, I enjoyed the first 2 much better.  Is this what happens when an independent writer gets under contract? Seems like my 3rd grader proofread it.  This one also ends as a major cliff hanger without any real interim resolution to any main story lines like the other 2 books.  Read an article indicating A. American is contracted for 5 in the series.  Undecided if I will read the forthcoming last 2. I gave 4 stars each to the first 2.  Too bad.", "Helpfulness": 0.8947368421052632, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJURKZ2A341IJ"}}, {"Date": "on October 30, 2013", "Text": null, "Helpfulness": 0.8518518518518519, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2G5IFYYHFIQNB"}}, {"Date": "on November 11, 2013", "Text": "Loved the first book, second was good, this one is soso. Very little action and a lot of talk. Sad to say the author is doing a a \"milk run\" playing on the success of the first 2 books. I read only Kindle books, 1st book had 5869 \"locations\" (think pages but not) 2nd book had 6963 locations, this book has only 3687 locations and ends abruptly \"forcing\" you to buy the next book if you don't abandon the series like me! To the author, sorry but I calls em how I sees them and I feel you owe everyone a free \"next\" book.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GHTWGB70H1UX"}}, {"Date": "on November 15, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MNA5DXTNO325"}}, {"Date": "on November 27, 2013", "Text": "Unlike the first two books in this series, escaping home just makes you want to escape the book. Slow, boring, tedious and pointless. Read one and two, skip this one all together.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANB7MGUQCJNEQ"}}, {"Date": "on November 7, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20JF5Z5BQ83TY"}}, {"Date": "on November 27, 2013", "Text": null, "Helpfulness": 0.7647058823529411, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2J4GSMXTA5TAD"}}, {"Date": "on October 30, 2013", "Text": null, "Helpfulness": 0.7692307692307693, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LWI3EMSYTE50"}}, {"Date": "on December 6, 2013", "Text": "Going home is probably one of my all time favorite books, this one not so much.  Ive started to notice a trend, where these amazon authors come out with a book that they have obviously spent a lot of time and energy thinking about and writing about, have a huge hit successful book and then come out with some garbage to hurry up and cash in on (and more power to ya brother).  This one needed more time to marinate.  I wish you and your family well Mr. A, and Go Noles!!!", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASZWZBDLQKGFS"}}, {"Date": "on December 1, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NG39BTHR7ED0"}}, {"Date": "on November 24, 2013", "Text": "the first two books were a \" can't put it down type \" but this one is a sleeper.  very bad ending, it seems that someone else wrote it that had no idea of how to end a book, even for a series type  .  sorry but i can only give this one a two star.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A231O6DNNRHA2Z"}}, {"Date": "on November 14, 2013", "Text": "The first two books were pretty good.  This one wandered with no real complete storyline.  It ends with no real cliff hanger that would inspire you to buy the next book.  It just ends abruptly with no real....\"stay tuned folks\"  Very amateur planning!", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JXGI1MMPP9GB"}}, {"Date": "on November 14, 2013", "Text": "This must be the last book in the series, because he spent most of it dawdling around.  It was like a writing assignment in which he was supposed to describe things, not have any action, or promote the story line.  I won't waste my time or money on any more books by this author.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YMUYRO9QO7FT"}}, {"Date": "on November 5, 2013", "Text": "A whole lot more talking and a whole lot less action. It's just a lot more unnecessary talking in this one, but still a good book.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TUYCTNBL2GPZ"}}, {"Date": "on October 31, 2013", "Text": null, "Helpfulness": 0.8333333333333334, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2514XPSQJG61Y"}}, {"Date": "on October 31, 2013", "Text": "Love the series!  I downloaded this morning and just finished. I can see more thought by the author in each book. Also, his writing ability and story telling continue to improve.", "Helpfulness": 0.8333333333333334, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARHOMKMKWJ8CA"}}, {"Date": "on October 31, 2013", "Text": "excellent continuation of the series. Lots of good action and suspense. Was a quick read but absolutely worth it for the cost. Good work A American. Got me already waiting on edge for the next book.", "Helpfulness": 0.8333333333333334, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A153YSW1OAO540"}}, {"Date": "on March 30, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2A4QJ4CCWQ27H"}}, {"Date": "on November 15, 2013", "Text": "I enjoyed this book and see that the author is greatly improved not only in their writing, but also in the storytelling. That being said I didn't give this four stars because I feel strongly that a story should have a beginning, middle and an end (even when it is part of a trilogy or decology.) This is only middle...", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25E4FKS7RUMVZ"}}, {"Date": "on November 13, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALDK7M012CAZN"}}, {"Date": "on November 7, 2013", "Text": "I'm enjoying this series . Lots of survivalist  information . I enjoy the sarge and his boys more than Morgan and his spoiled family. I feel like people would do better than this. But it is an interesting story.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39GR9ZBHIIZIE"}}, {"Date": "on November 7, 2013", "Text": "I liked the book and glad I read it. Looking forward to the next one. Seems like the author maybe rushed this one a bit though.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KLVD7I2SHKYU"}}, {"Date": "on November 1, 2013", "Text": "I had been looking forward to this release and when I started it I ended up finishing it in one sitting. The story line is gripping and contains something for everyone. While yes the scenario described is an exaggeration of some of the attitudes and practices of certain organizations it does contain some kernels of disturbing truth. I also really like how the civilians in the book want to remain civilians and just be left to live in peace. Too many stories like this feature the theme of a normal citizen who ends up becoming a soldier by default and then their life centers around that. The guys in this series are willing to fight when pushed or when it becomes necessary, but their focus remains being able to care for their families and they try to leave the fighting to the soldiers who are on their side. Can't wait for the next installment.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1390KWJHMJNDF"}}, {"Date": "on August 6, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12L3LB1PGLQ8V"}}, {"Date": "on October 31, 2013", "Text": "Love this book series!  Can't wait to see what happens next.  Let's hope the good guys always win.  Go Army!!!", "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2X3CL7S1KPZPS"}}, {"Date": "on January 1, 2014", "Text": "I was very excite about these three books. My wife bought them for ma as a Christmas gift. I started reading and found them to be a great story, but the filth in the use of the F-word and all the other four letter words were not called for. Some reads might not mind hearing and reading vulgarity and profanity, but I would rather enjoy a truly talented writer who could use better descriptive words, than the GHETTO words found so quickly in these books, will be returning all three for a refund.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QSUVXYB2KLQ0"}}, {"Date": "on July 15, 2014", "Text": "I almost didn't buy the third book because of the reviews. Now I'm glad I did. Maybe I'm boring but I liked learning about day to day stuff. I always wonder after the action how do people make it work when the food runs out or their small amount of technology is gone. I really love this series. I gave it 4 instead of 5 because as others have said it does just stop all of a sudden. Thankfully I found this series after book four was published. I'm going to be sad when this series finally ends.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2J853ZDFPI44J"}}, {"Date": "on April 6, 2014", "Text": "I have read some of the other reviews about this series. People need to remember that these books are just fiction. Waiting on the next installment.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QIYL3KH0SHRH"}}, {"Date": "on April 5, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33165O8VPOFTE"}}, {"Date": "on April 2, 2014", "Text": "Really enjoyed reading this third book. Looking forward to the next one. Love all of the characters especially Sarge and Jess.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATYBCYD6BIXVL"}}, {"Date": "on April 2, 2014", "Text": "The first two books in the series were action packed & entertaining - good reading if you're into this genre.  Because of that experience, I bought book 3 as soon as it came out.  Unfortunately, it was a fizzle for me.  This one feels 'phoned in' - doesn't really move anything forward in character development or plot.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25UKB3LLRAMJD"}}, {"Date": "on March 29, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KE2YGEHEID7H"}}, {"Date": "on March 29, 2014", "Text": "Kept me on the edge of my seat. I couldn't stop reading it. I also found it helpful with some of my prepping needs. Can't wait for the next book to come out.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARIV10UMC33T5"}}, {"Date": "on March 27, 2014", "Text": "I have read all three of his books in this series can not put them down.  They are so real in the sense that this could really happen to all of us the way the government and economy is going so with that said read HEADLINE!!!!!!!!!!!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1H40ODM4LQ55M"}}, {"Date": "on March 24, 2014", "Text": "Really enjoyed the book, loving the series. Can't wait for the next one! Really makes you think about things differently for sure.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MFJM894N62WY"}}, {"Date": "on March 24, 2014", "Text": "Couldn't put it down! Can't wait  for next book to come out in June. I pre-ordered. Better then one second after which was very good too.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25YOVUCWK2Q6X"}}, {"Date": "on March 23, 2014", "Text": "I've been a huge fan of d.j. molles since his books first came out and the survivalist series is right next to him now :) great story and I love how the characters constantly come together", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3T5ER8ZGYFQGH"}}, {"Date": "on March 19, 2014", "Text": "The story grows. So does your need to follow how the characters working through all the problems the world is throwing at them.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1W2EGUPW8OYH4"}}, {"Date": "on March 19, 2014", "Text": "Just finished this third one in the series.  The only bad part about that, is I have to wait til the summer for the fourth one!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2M2NRX78RD8NS"}}, {"Date": "on March 18, 2014", "Text": "This is not my first post appocolyptic series and these are a home run. I read these while recovering from surgery and as I read Coming home and Surviving home and got more than half way through the book I had Escaping home within arms reach and was glad I ordered all three at the same time. Does that answer any questions ? Some series fizzle out or flake out as they go but A. American kept the story believable and interesting . If you get one, get them all and hope what your reading stays fiction, and taking a few notes wouldn't hurt. I recommend reading these sooner than later.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2S3LBH4U7O4OH"}}, {"Date": "on March 17, 2014", "Text": "Some people feel that this book left you hanging, I disagree. I feel the Author did his (or her) job and led you up to the point where society is now on its own to rebuild. Compared to his other two books yes this is different , because there is no next book. (for now I guess) But this was a great run, as my friend the surfer said, \"ride the wave as long as you can\". If you have read his other two books, then this is a no brainer, then buy it. If you are new to the series, read them in order. The Author does a great job in writing a preppy survivor series, and the main character (s) are the type of person I wish I could be in a widespread catastrophic disaster.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A117XUS2KI1M04"}}, {"Date": "on March 13, 2014", "Text": "Really have enjoyed the series, wished I waited for the last one to come out before starting the series. Defintely recommended!", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APJ9JQCLQ4AWM"}}, {"Date": "on March 11, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2S5N90GKXKZF5"}}, {"Date": "on March 11, 2014", "Text": "I really enjoy the series , easy to get into the characters mind set. I find that the story grabs you and  holds you , making it hard to put down. Can't wait ill the next one is avaiable. Great read and adventure", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LA4FSEIMMYB1"}}, {"Date": "on March 10, 2014", "Text": "This is a very \"realistic\" view of what could happen.  It's not a \"check out my gear\" book, or so miltiaristic that I get lost in Ops Speak....  A really good story of what could possibly happen.  I am not sure that chaos would enuse and escalate as quickly as the author details, however, my only experiences come with hurricanes and not complete infrastructure failure such as an EMP.  I highly reccomend this and the other \"home\" books.  Good reads and kept me interested.  Looking forward to book 4", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1P3NHXO5L47YZ"}}, {"Date": "on March 8, 2014", "Text": "Book 3 in the series is setting things up well for Book 4. The relationships and characters are given more depth in this book, which I think will make the following book(s) even more exciting than the first ones, and that's saying something. The series gives us a glimpse of what post apocalyptic America could be like, and we are given an opportunity to become educated while also reading a riveting tale. Can't wait for the next book!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A116AKCRFG72JY"}}, {"Date": "on March 7, 2014", "Text": "Great third book to the series.  My only gripe is that it is much shorter than the others and leaves a lot to be desired from the last book that comes out in July.  I hope A. American can really do a good job at closing this series.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALSCBTU8I0E6T"}}, {"Date": "on January 31, 2014", "Text": "Have enjoyed this series immensely.  The books are a fast read and find myself looking forward to bed time so I pick up reading where I left off.  Despite some grammatical errors,  would recommend for those whose like post apocalyptic reads.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1O6A5QCQTN5CO"}}, {"Date": "on January 29, 2014", "Text": "A great series and given our current state of affairs very thought provoking. Went out and bought some spam and ammo yesterday. Enough said.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NCO0AZTOTIG"}}, {"Date": "on January 25, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1O7MNAVB20UH1"}}, {"Date": "on January 25, 2014", "Text": "This entire series is remarkable. I have never been so drawn into a series of books before. The realism and accuracy is incredible. I truly hope there is more to come from this series.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KD46WGI70R1X"}}, {"Date": "on January 21, 2014", "Text": "Please look at Going Home and Surviving Home for previous comments.  Are all Americans created equal?  Not according to the Gov't Alphabet Soups agencies.  Some are more equal than others.  And who sees the big picture?  Those who prepare and those who took the Oath, for Liberty!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2R4IAXMF64DP3"}}, {"Date": "on January 21, 2014", "Text": "Everyone should read these books.  A lot of people think this cannot happen and the government will take care of everything.  The way things are going today anything can happen. Be prepared and start prepping now.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2O2LTSQB3E5AF"}}, {"Date": "on January 1, 2014", "Text": "I really enjoyed the first two books in this series, but in this one the action was much slower and there was less of it, and it seemed like it was only half a book....the ending was very anticlimactic and the author picked a poor spot to end it.  I feel sort of cheated.  Not sure I will buy the next book.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DOGOO7X9YKL3"}}, {"Date": "on December 12, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2H3U3VB7L9SUQ"}}, {"Date": "on December 3, 2013", "Text": "Slowjacking the story to stretch it into more books...if the next one does the same I'm done. Too many good books out there and its a disappointment versus the first two of the series", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A263CAU0F11XGH"}}, {"Date": "on November 29, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AY3FKP3T0FAYV"}}, {"Date": "on November 23, 2013", "Text": "Loved the first two books, but this one was leaving me wanting. Like the author ran out of ideas and needed to get something out there. The Kindle price rediculously high... It should of been $1.99 range. Sorry needs improvement.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PD48CLP1SHZB"}}, {"Date": "on November 20, 2013", "Text": "Big Fan loved the first two, some of the best in PAW books.  The third book was pretty thin for a trade paperback price Tag, it really had no climax but in fashion was well written and continued the story in a way I liked it but slams you in the face with a \"TO BE CONTINUED\".  What I am pissed at is not the story it is the fact this book is barely 200 pages if it was a Paperback with standard print not Fat margin Twilight print pages, I really feel ripped off that I will have to buy the fourth book to complete the story, not a honorable publication plan by Penguin.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LNQBUQYE2X4V"}}, {"Date": "on November 14, 2013", "Text": "It's a fantastic series; I'm hooked!  I can't wait for the fourth novel.  Preppers vs. the DHS: The Ultimate Showdown!!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZPMQA6UJ9X3R"}}, {"Date": "on November 14, 2013", "Text": "After reading \"going home and surviving home\" I was hoping to wrap it up but didn't know how the author was going to end it. Surprise, he didn't. The books have all been good though, and if next book is cheap I will definitely buy and read it. I'm glad I didn't have to buy War and Peace in 5 different books. Tolstoy may have left some money on the table, or just a good writer with end in mind.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JC73NNTMHPBX"}}, {"Date": "on November 13, 2013", "Text": "Great story that continues to get better. Proof reading has improved, so mispelled words are less than usual. You will get invested in many of the characters.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZYOQ2PQJB2HU"}}, {"Date": "on November 1, 2013", "Text": "Epic series! This one was a one day read. It quite simply could not be put down. Please write faster I want the next one!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MKDKIX9RNMOV"}}, {"Date": "on October 31, 2013", "Text": "A seamless continuation of the series, and a good read. As another reader wrote, you can see the author's growth as a writer, the stories keep getting tighter. My only complaint would be that it was too short. Way to go sir, keep up the good work.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A119ALH1KEBY8I"}}, {"Date": "on November 6, 2013", "Text": "I gave the first two books a five star rating because I loved them. This was a huge let down for me, like when a friend betrays you. I'm no longer a fan <sigh> and $5.12 poorer. Addendum: Amazon wanted me to add why I feel cheated. The first two books were like being served a 7 course meal that the host put their heart and soul into. The third one was like getting a piece of limp toast with a tad of butter smeared on it. When I got to the last page it was like, \"what the heck?\" It felt rushed and there was no solid story line.", "Helpfulness": 0.6923076923076923, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UOXYQ8IA7ERK"}}, {"Date": "on June 17, 2014", "Text": "i really like the guts and grit that it brings to the table. nothing is sugarcoated. the things that happen in these books may seemed far fetched  at first until you look at the big picture and what led up to the event. then its a hard realization of what could really happen", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A310B2H3AV5NJW"}}, {"Date": "on June 27, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NTMHD0C7J7DO"}}, {"Date": "on June 13, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABII5906FBMBP"}}, {"Date": "on November 25, 2014", "Text": "I so enjoyed getting back to these characters and this story. I had a hard time deciding between 3 or 4 stars but this one was not quite up to the level of the first two so my rating dropped to a 3 but I still enjoyed it in a different way than the others. All our regular gang are still here, though still not back together. Things switch between the guys & family, then we see what Jess is up to. This volume is not as action-happy as the previous two, there is still plenty of shoot 'em ups but there are definitely less than the norm. This left some periods where the story was all about talking about the next scheme or waiting for an episode to happen. What I can say though, is that this volume certainly improves on the character development of nearly every one of the major players. Thad had already been the most developed character and Morg too but we get to see a different side of Morg as he interacts with his family and we learn the different personalities of his three daughters. The soldier guys are all developed much further as well. I've really come to like this hodge-podge group of rough 'n' tough alpha males! The only one whose development was left out was Jeff. He's always there but I had to wrack my brain to recall how he came to be with these folks in the first place. Anyway great, fun series for those who like survivalationist themes.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACEOOCYZRPWF3"}}, {"Date": "on June 26, 2014", "Text": "I like the series. This group has a lot to deal with, but it is not to over the top as far as how they deal with it. It is a quick read, and i think for the money it is a solid choice.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A384V007LZMTH2"}}, {"Date": "on June 21, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJFGR930TV250"}}, {"Date": "on June 14, 2014", "Text": "I cant wait for the 4th book!  Very well written, good character building and exciting action!  i normally dont but i just had to buy the paperbacks after reading each on Kindle.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LKD5BAR1RZJ4"}}, {"Date": "on June 23, 2014", "Text": "Love the series and it is great to escape into a good book when you can make the time. If you are interested in the genre, make the time. This series is fun to read.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2I1A0D1N96MH2"}}, {"Date": "on July 16, 2014", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2P5WAAF0R125O"}}, {"Date": "on July 13, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3U3Q02R21NLO9"}}, {"Date": "on July 3, 2014", "Text": "I've read all three of this series and my ONLY complaint is the way they end and I have to wait months for the next installment.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22U9MA7XX7AU4"}}, {"Date": "on July 14, 2014", "Text": "Loved this next series in the lives of the characters. On Amazon now buying book 4, Forsaking Home, & can't wait to start it.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EK6L4ZO9WIMS"}}, {"Date": "on September 30, 2014", "Text": "This book is not nearly as good as the first two installments. The action was scarce and the \"how too\" aspects of surviving the end of the world do not make for riveting reading. In spite of the author's obvious attempt to add dimension to the characters,  all he did was make them even more clichéd. Things that were annoying in the first two books are now outright bothersome. Constantly calling your youngest daughter Little Bit is not cute - it's trite and distracting. When real people speak to one another they use contraction's. They do not speak as if they are dictating their dialogue. The editing is bad and also distracting. Spell check doesn't supply the write word - it only spells the word rite. Wright? Constantly having to mentally correct grammar and syntax and having to guess what word the author meant to use is also distracting. Overall this was disappointing.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Q320ZYYXPWYT"}}, {"Date": "on June 14, 2014", "Text": "One of the best books of this type I have read. Purchased the second volume and am waiting for the third to be released.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28BPAPNVFG9Q2"}}, {"Date": "on December 16, 2014", "Text": "I am enjoying the hell out of this book. A lot of folks are writing bad reviews about it. That's extremely ridiculous.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MZQQ10AFQQEX"}}, {"Date": "on June 21, 2014", "Text": "Scary interesting read and I pray this never comes to pass. Get ready for a shock when the lights go out.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19OQA1WFM33IA"}}, {"Date": "on September 4, 2014", "Text": null, "Helpfulness": "", "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AT6B6Y8L9Z3AP"}}, {"Date": "on October 24, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Q0G8EC5APJ9U"}}, {"Date": "on April 24, 2015", "Text": "I found this book more of a filler. The first two were very good and page turners, this one was more of a page skipper. So much useless details. The character Morgan become more of a side kick rather then the decision making no nonsense take action guy from the former novels.  I'm hoping this next book picks up the pace and more just to make up what this one lacked. You should still buy it because at least Jess and her part of this tale is still very dramatic and has the reader very much part of the goings on. Jesses saga got me to give this the three stars otherwise it would have been less.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3622BXPICW5HC"}}, {"Date": "on July 9, 2014", "Text": "This is just a fun read.  This was another good read in an excellent series.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1O9EHKEX4BR6J"}}, {"Date": "on November 18, 2014", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1F4DKD68PKSSB"}}, {"Date": "on October 19, 2014", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6DURS100AT9G"}}, {"Date": "on July 2, 2014", "Text": "If you are a fan of the genre than you have already read this.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DH49V7FF702S"}}, {"Date": "on September 8, 2014", "Text": "The going home series by A. American is a must read for anyone interested in the survival genre of books. I started reading his first book on an internet forum, and his skills made it evident that he was a natural talent. His first book was a tough read with all the grammatical and spelling errors, but get through as it is worth it. The next books are much improved on the errors. This series has an excellent plot, excellent characters and is a very good read!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7IQKYLRI865"}}, {"Date": "on July 15, 2014", "Text": "Best and most realalistic end of the world series out there.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NPAZEUWG1JHB"}}, {"Date": "on December 15, 2013", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4KC1U01C8IQD"}}, {"Date": "on November 27, 2013", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IF83HCHVSRW2"}}, {"Date": "on November 19, 2013", "Text": "I feel guilty for saying that this is the third of this guys books that I've read, and I can't explain why.  It's written for high school sophomores and is replete with juvenile vocabulary, misspellings, hideous grammar and repetitious phrases.  The plot, however, is very good, and it holds the readers attention like one of those old TV cliffhangers.  The characters are cartoon-like and shallow, and The dialog is unrealistic, simplistic and probably came from remnants found on the cutting room floor of Hee-Haw.  The only people in the book of decent moral character are the preppers. Everyone else is untrustworthy, dishonorable, stupid or out of touch. The author should have dictated the plot to someone with a modicum of writing talent and paid him to ghost-write the book.  I'm still trying to figure out why I read it.", "Helpfulness": 0.6666666666666666, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35JQLMP3NCY1G"}}, {"Date": "on March 1, 2015", "Text": "I read all 5 books in 8 days, couldn't put them down. One night, I was reading book 3, thought it was around 9 pm, it was actually 12:50 am. We need to convince A. American to write faster. This was one of the best series I ever read. Having so many different stories going on at once, kept me glued to the book. Now that I'm finished, maybe I can go to bed at a decent hour now.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38GF28FP2NB41"}}, {"Date": "on July 3, 2014", "Text": "A fun informative read with useful information.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKSUBBL8N33GN"}}, {"Date": "on January 26, 2015", "Text": "Not only is this guy growing better with each sequel, he's prolific.  While he is quite a billboard for a number of commercial products, he knows what he's talking about and has saved me a ton of shopping looking for the right bug out equipment.  For me , it's quickly on to book 4.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2T6JKCIPMHYLT"}}, {"Date": "on June 10, 2014", "Text": "Time for the sheep to wake up, I am from Altoona FL. so this story really hits home. great series", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NGEYK9CJ948Z"}}, {"Date": "on June 9, 2014", "Text": "This is a great series cannot wait for book 4 in 3  weeks!!  Hope everyone who likes these type of books reads this one", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EDT8U3RETR41"}}, {"Date": "on June 7, 2014", "Text": "what can i really say here…its a continuation of the first book,if you liked the first one then you will like this installment…the pase of the book is good and it has good action threw out the book……the end is a real cliff hanger", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22GMHCSP90FSQ"}}, {"Date": "on June 6, 2014", "Text": "this seres is excellent! aside from being frightenly possible , it also speaks to the  adventurer in your heart. You can't go wrong.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SSFFS1WB5LSN"}}, {"Date": "on June 4, 2014", "Text": "This is part 3 in the series and I can't wait for the 4th to come out. If your a prepper this series is for you period.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AF2PZM3MV8F0C"}}, {"Date": "on June 4, 2014", "Text": "Could not put it down.  Look forward to hearing about the next chapter of Morg, Thad, Sarge and Jesse's lives.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AY18G0C0AHJGU"}}, {"Date": "on June 2, 2014", "Text": "Great series! I only wish they were longer because I am unable to put them down once I start reading. Great plot and character development as well as useful information for us prepper!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XNSPKKZR9KUL"}}, {"Date": "on June 2, 2014", "Text": "On the edge of my chair the whole time reading it.  I could not put it down.  I cannot wait until the next one comes out.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATTXMBM8A1XYV"}}, {"Date": "on June 1, 2014", "Text": "slow, boring. I used it to put me to sleep every night. not at all like the first books. pick it up A. American", "Helpfulness": "", "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AH5NON963LQX3"}}, {"Date": "on June 1, 2014", "Text": "In this third entry of the series A. American gives the reader an insight into the larger plans of the government and the current situation. The character building continues fleshing out people introduced in the first two books. Reality is setting in as the group's supplies start running out and they are forced to change their plans. Overall the third installment keeps the story moving forward and holds the readers interest. If you enjoyed the first two this one should not disappoint. However, there seemed to be a significant increase in grammatical errors as compared to the previous books. They are easily overlooked but worth noting.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SPSG5O4LW7IS"}}, {"Date": "on June 1, 2014", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3S2Z6P6SL6B26"}}, {"Date": "on May 31, 2014", "Text": "Great story line.  Real life character's facing a changing world and finding a new normal in life. I enjoy the multiple story lines going at the same time and seeing the character's evolving.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AR1M445LRFORY"}}, {"Date": "on May 29, 2014", "Text": "Love the whole series. Can't wait for book 4 to come out. I have already pre - paid for it.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A97U9IIZOUYGT"}}, {"Date": "on May 25, 2014", "Text": "The story continues well if you like the characters.  As far as weaving survival education into the story the first book is the most thoughtful and should be read to stimulatetthought and emergency preparedness.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATDBXBZ4II0WK"}}, {"Date": "on May 25, 2014", "Text": "The first two books in this series were very very good and I guess it's difficult to maintain that level of excitement while writing.  The book was OK but definitely not up to par with the previous two.  The pages seemed to drag out and the characters just didn't seem to have the same vigor.  Had this been the first book, I probably would not have purchased the subsequent books.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WJJMTLI9CU75"}}, {"Date": "on May 25, 2014", "Text": "Prepper fiction, I received the first book in the series for free. Both books to follow did not disappoint. If your s fan of Prepper fiction. this series and this book will be very enjoyable. Morgan just keeps getting into stuff and sarge and the other guys can't help but follow him into adventures", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5XMA8P80Q5OM"}}, {"Date": "on May 24, 2014", "Text": "The author writes extremely well and develops his characters and story line to compliment each other.  You may not care for the genre, however if you like adventures, this author writes a very entertaining book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30U6CP4EXJM8D"}}, {"Date": "on May 24, 2014", "Text": "This sequel was good, but not as good as the first book.  Hopefully the third installment will match the opener.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TFSY0D1J4W8N"}}, {"Date": "on May 18, 2014", "Text": "Scary because it could be our reality soon.  I keep more food in my pantry and water stored after reading this book. Educational as far as how people could react in such a short time if the lights went off", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16CI01U24RDCJ"}}, {"Date": "on May 17, 2014", "Text": "Third in the series and it's still great. Can't wait for the next one. Love this genre more than the zombie genre", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1D9FNH640G8TH"}}, {"Date": "on May 17, 2014", "Text": "This book continues on the series of surviving an EMP event in Florida. Good description of the Central Florida area. I enjoyed these books as they take place in an area I grew up in. They are also less violent than most post-apocalypse scenarios. Well written with characters you can get to know and like. Well developed story with some interesting subplots.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A350UGQHWB2QKP"}}, {"Date": "on May 15, 2014", "Text": "The series started with Going home. It was good and my review might have been a little over done, but I liked it and wanted you to get it.  I have tempered my reviews because let's face it, not all good books should rate a 5.  The author still has some room to grow but does a fine job relating the probable outcome of a collapse and what happens next.  He gives you more than one perspective on the outcome and does a good job of keeping it real.  None of us can tell the future and what it holds, but this book gives us a chance to look at one possible scenario.  The end is not really an end and that is a common issue with this genre, but I will buy the next installment as well. I recommend it.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27UUUKYBTJTJ8"}}, {"Date": "on May 14, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CTW19CY21ZF"}}, {"Date": "on May 12, 2014", "Text": "After reading this my parents have come to realize the importance of fall back locations, means of travel, and companions you can count on and trust.  Very eye opening on all levels.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10NFG90C3TU58"}}, {"Date": "on May 11, 2014", "Text": "Home series by A.American has been a great find. Edge of your seat reading with awesome characters and wonderful storylines. Cant wait for next book to come out.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3Q2AGCNOZ8RTS"}}, {"Date": "on May 9, 2014", "Text": "My husband and I have enjoyed all of the books in this series.  We have found them to be very informative and interesting.  They have given us food for thought.  We now travel with a go bag in every vehicle we have.  We have even given my mother a go bag.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YZI9MOT7Z3M8"}}, {"Date": "on May 8, 2014", "Text": "I think if you've come this far in the series, you're in it for the long haul. I know I am!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14NWET9TDDIZC"}}, {"Date": "on May 1, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18MZSJ66764RL"}}, {"Date": "on April 30, 2014", "Text": "Absolutely awesome. Can't wait for the next book keeps you reading and coming back for more. Which I can't wait for", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33SNRHMZYKDBH"}}, {"Date": "on April 30, 2014", "Text": "I really liked the first book in the series dealing with an unknown EMP and trying to get home from a couple hundred miles away.  It was realistic (if one is a prepper) and has a ruck with him/her.  It was a pretty good teaching tool.  However, as the series progress, it becomes a morality tale of a purely evil government plotting to enslave the population.  This book also had the feel that it was rushed to the market to build on the success of the first one.  It does not have the care that I appreciated in the first of the series.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27VANNXXG2731"}}, {"Date": "on April 29, 2014", "Text": "I Love love love this series.  If you like a good story about a what if scenario this book is for you.  Some stuff is a little bit political, but if you kind of get over that agenda the story is well written and entertaining.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BXVY992263RI"}}, {"Date": "on April 29, 2014", "Text": "Another good read in the survivalist series.  Several stories going on so you won't become bored.  The only thing I didn't care for in this one was it ended so abruptly, leaving all the stories sort of dangling.  Still worth the read if you like this kind of book.  I am sure the forth book in this series (when it is available in June, 2014 or so) will tie up all the loose ends.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OD3L90DP9J36"}}, {"Date": "on April 27, 2014", "Text": "I have read all of A. American's volumes to date and loved all of them.  \"Escaping Home\" is no exception.  Exciting, believable and hard to put down!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36HNYA7YM9M4C"}}, {"Date": "on April 27, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3H558R9GUD3RK"}}, {"Date": "on April 25, 2014", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQJZKNYEJQC4B"}}, {"Date": "on April 16, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FKTWYJ8KR5E1"}}, {"Date": "on April 16, 2014", "Text": "Well worth the six bucks. Might want to look elsewhere for tactics :-), but he should keep the series going.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17I95E74MD6HC"}}, {"Date": "on April 16, 2014", "Text": "If you ever decide to get a series of books this should be it. Honest,to the point and eye opening.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UROWBCGIPCCU"}}, {"Date": "on April 15, 2014", "Text": "I am not a serious prepped but I do keep enough around to live 30 days after a disaster.  I have more ammo than food but I live in the country so ammo can get me food :) this book gets you thinking and is a very enjoyable read.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARK9J3PKK43H1"}}, {"Date": "on April 10, 2014", "Text": "Just like then previous books this is one you just can't put it down only thing wrong with that is that it's a little short.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28L2R8FZ4LPMF"}}, {"Date": "on April 8, 2014", "Text": "I really have enjoyed this series and am eagerly awaiting the next installment. Having several retired military men in our family, I particularly like the character of Sarge.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AF1OMVY87E0JI"}}, {"Date": "on March 23, 2014", "Text": "This is the first book in the series that I felt I didn't get my monies worth, and started to think that the author stretched this book out just to make more money! I expected it to have more of a conclusion even if the story continued. He took 324 pages to basically move them from the neighborhood to the cabins...yeah well I to found myself skimming through pages at times and I didn't in the first two books. There were more inconsistencies ... they are sure that Jess is in the camp at the beginning of the book and then don't seem to concerned enough to bring her up during the rest of rhe book. I felt that this was going to be the purpose of this book, reunite Jess with the rest of the book ... takun the camp down should have been the conclusion of this. The writing is really good and the story is there. I will probably hang in there for the next book but if it ends in the same manner this will be my last investment in this series!", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PCE8X1SGYNQ0"}}, {"Date": "on March 16, 2014", "Text": "Look for my review of the first book \"Going Home\" for all my review, but this is a great series!!!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27D08QOZ4X5IN"}}, {"Date": "on March 14, 2014", "Text": "I really liked the first book, it was very good. The next two books are a little redundant  and seem to drag on just a little to much.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A327Y361T2B56Z"}}, {"Date": "on March 6, 2014", "Text": "Another great book in the series I can't wait for book four. This is a fast pace series with a lot of action and human relationships mixed in. The story is totally believable except that I used to work for DHS and I have a hard time believing that they are that tactical and ruthless. I hope this series keeps on going.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMSNS8AJITEFY"}}, {"Date": "on March 3, 2014", "Text": "Counted down waiting for this books release and was NOT disappointed a bit.  Well written book that I could not put down!  I've pre ordered the next book the day I finished this one!  Thank you A. America .", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17HZ8F0R7QPN"}}, {"Date": "on March 2, 2014", "Text": "Can't put down reading! If I did put it down I would pick it back up and eat an apple!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3H1IFQU1BSM45"}}, {"Date": "on March 2, 2014", "Text": "Just a further look into where we are headed if we the people don't get our act together and start standing up", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CY1GGRFT21K2"}}, {"Date": "on March 1, 2014", "Text": "I am not a avid reader but I am hooked on this series! Can't wait for the next one to come out. I would recommend you start from the beginning if you want to read them. They give many ideas on what you should stock up on and what is likely to happen if it ever happens!! I love it!!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IS27LQ62EEHQ"}}, {"Date": "on February 28, 2014", "Text": "The series just grows on you.  Has some blank spots but third book accumulates enough characters to help it along.  I recommend all three.  But only if you buy all three.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7AAVWZ26H2WY"}}, {"Date": "on February 28, 2014", "Text": "Left you hanging which is ok but seemed short compared to first two. Still like the author and the books. Will keep reading.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1G5HKA0A58NK4"}}, {"Date": "on February 26, 2014", "Text": "Amazing book that you will not to put down until you finish it. Can't wait fir volume 4 to come out.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A286WUR0C4OBH0"}}, {"Date": "on February 25, 2014", "Text": "Not only did I love this book, in spite of several typo's, but I loaned it  and the other two books in the series to my Step-son and his wife, and they both loved the entire series also. The last book seemed a little rushed, but regardless, I cannot wait for the next one in the series to find out what happens to the characters.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33RXIES1LJ906"}}, {"Date": "on February 24, 2014", "Text": "Series starting to get slow.  Was ready for it to end.  Thought this was the last but apparently not.  Story just ended.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AY8E85SA2YIMI"}}, {"Date": "on February 24, 2014", "Text": "This was a great story of survival I even got my wife to read them and she loved them also", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ENAROV60PK7Y"}}, {"Date": "on February 24, 2014", "Text": "Man A American can write.  These books are like an addiction.  The only bad part is when you get to the ends because there isn't another page to read.  I want more!!  Of all the WTSHTF authors this one is the best that I have found.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29YIKW8DCU1BO"}}, {"Date": "on February 24, 2014", "Text": "There's nothing to dislike... except maybe the DHS and FEMA camps, which holds true in real life. Again I have to say how much I love the character of Sarge with his \"delightful\" attitude. I look forward to book four.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VDJO51HY64OL"}}, {"Date": "on February 23, 2014", "Text": "A American keeps you interested in the story and the characters.  Looking forward to his forth book.  It should be just a good.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FEBLW9YPMP7I"}}, {"Date": "on February 21, 2014", "Text": "I have enjoyed this series and will continue to read it.  This is good postapocalyptic fiction. Read these in order though.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJZ3A7PYXNM52"}}, {"Date": "on February 21, 2014", "Text": "This is a great follow up to the first one. makes you think of what can happen if you plan only on staying in your current home. But what if you have to leave? This book makes you think....", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12WXJ7ZJBBFJM"}}, {"Date": "on February 18, 2014", "Text": "I love these books by A. American as well as those by James Wesley Rawles, Glen Tate, and others. This was another enjoyable one. They are not only entertaining but they are equipment and tactic primers as well. This was another one I enjoyed.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EVLKBZ9ZWJGB"}}, {"Date": "on February 17, 2014", "Text": "waiting for fourth one to come out,have enjoyed all of the first three .Situations that are all possible with the way our country is headed", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZFSKWT4UGT7H"}}, {"Date": "on February 16, 2014", "Text": "Liked the continued development of the characters. The story is believable, Can't wait to read the next one! I love Sarge!!", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EN1LRR1284WH"}}, {"Date": "on February 13, 2014", "Text": "Really makes you think about something like this happening - well written - pretty scary though!!  Need to start prepping!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HBB47HX6WSB4"}}, {"Date": "on February 12, 2014", "Text": "Can't wait for book 4.  Good character development.  Good story. Seems totally realistic, especially regarding the nasty side of many humans lying just under the thin vaneer of civility.  People hungry enough will become desparate enough to justify the worse conduct.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KH113GT7JXU3"}}, {"Date": "on February 11, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2R8AH9EDE7H99"}}, {"Date": "on February 11, 2014", "Text": "Very well written book that is hard to put down. This was a great continuation of the series, and I can't wait for more from this author!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKAV4FCJZ0T8R"}}, {"Date": "on February 9, 2014", "Text": "Great story. Love the detail and the down to earth style. The characters and situations are Believable for a fiction.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A67MLNZTTFHVP"}}, {"Date": "on February 8, 2014", "Text": "ALL THREE IN SERIES HAVE BEEN GREAT READS.  A 'POST' SERIES THAT TIES FAMIY LIFE IN SUCH A TIME , THE GOOD AND THE TERRIBLE BAD THAT MIGHT BE IN SUCH TIMES.  GOOD PEOPLE HELPIN THEIR FRIENDS AND NEIGHB ORS  AGAINST THE BAD.  LOOKING FORWARD TO THE NEXT IN THE SERIES.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXUEXON3ABAFN"}}, {"Date": "on February 8, 2014", "Text": "I have read each book in this series and they keep getting better. So much good information and believable characters. I have a hard time putting them down. Can't wait for the next one.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WBWITXPCOJGN"}}, {"Date": "on February 8, 2014", "Text": "I LOVED THIS STORY CAN NOT WAIT FOR THE NEXT ONE. THIS IS A BURNER, GOT THROUGH IT ONE NIGHT.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIK5PO2O8VWMV"}}, {"Date": "on February 7, 2014", "Text": "I saw the reviews calling this edition of the series boring compared to the first two. I guess that's true if you want non-stop action. I thought it was a good insight into the everyday life post SHTF with issues like food, water and the basics to try to have some normalcy with your kids involved. I have really enjoyed the people from the first book being carried over through book three. Can't wait for the next one.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3M21BD7679GOV"}}, {"Date": "on February 6, 2014", "Text": "I guess starting out this book in the second of the series was not good.  For example how did these folks obtain heavy weapons, mortars,  Squad auto weapon (SAW)?.  The writing was juvenile.  Character development poor.  Not a helpful read at all.", "Helpfulness": "", "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NOMJI63J3DKG"}}, {"Date": "on February 6, 2014", "Text": "A. American has done it again. He does a great job of keeping the characters real and consistent from book to book. Cant wait for the next one.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HILLAYDSXBS8"}}, {"Date": "on February 6, 2014", "Text": "Enjoyed the series and looking forward to book four.  Not like other books of this style where these people are not awash in money and are like everyday people.  It is scary to think that such a thing could happen especially with our current administration.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17U6HLB8AQ5HZ"}}, {"Date": "on February 4, 2014", "Text": "This is the third book in a series. I read them all pretty quickly in sequence, took about a week. By this one, I could see where it was headed, and yes it ends by setting up the next book. Didn't learn as much from this one as the first two, but remained entertaining.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17IYSW3EO08BN"}}, {"Date": "on February 4, 2014", "Text": "I love this series.  I do not seem to be able to put the book down.  Great reading!  Would suggest for ALL to read!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3N41XPVM6K62O"}}, {"Date": "on February 3, 2014", "Text": "Escaping Home is a bit looser than the two previous books, but then that's not really all that uncommon.  My greatest dislike is the time involved in making the decision to leave \"home\".  The character development and situations with the wife and daughters needs to be more fully developed and more tightly edited.  I found myself wanting to smack these women for their failure to recognize the dangers lurking beyond their homes.....a little bit stupid.  My other criticism goes back to the need for good, solid editing.  There are too many typos and missing words.  It seems that I read somewhere that A. American had a new editor/proof reader for at least this third book....If that's the case, then yet another individual with a good red pen needs to be identified!  I passed the first book on to a family member who returned it saying, \"I can't read it because of all the spelling and grammar errors.\"", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARVKFTBQ8K1TR"}}, {"Date": "on February 3, 2014", "Text": "Great book. I couldn't put it down. I highly recommend this book to everyone. I just wish there was more books I just wish there were more books in the series.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADJ3Y4SCZ2NX"}}, {"Date": "on February 3, 2014", "Text": "Not a very involved story.  No real ending, it was as if the writer just stopped writing.  Worst grammar I have ever seen in a published work.", "Helpfulness": "", "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DA22MQL1PL9S"}}, {"Date": "on February 2, 2014", "Text": "I saw this series advertised in an outdoor magazine and thought I would give it a read.  Now I am hooked waiting for the next one.  I found the plot very intriguing and the ideas and gear brought out in the book new and interesting.  I would recommend this one and other books in this series.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21VEIIH4RSZYF"}}, {"Date": "on January 28, 2014", "Text": "Good stuff, worth the read and still enjoying the characters. The only thing is that it doesn't have the rawness and immediacy of the first book. That was something, wow! Plus I loved the year links. Those are missing here :( but still great story !!!", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAN9PAYYLXIGZ"}}, {"Date": "on January 25, 2014", "Text": "Well I got hooked on A. Americans writing style when I read the first one 'Goin Home'. His writing puts you inside the characters head and lets you know exactly what he's thinking . With action in every chapter and problems to solve , there's not too many dull moments in this whole series . If there's one part of this book that upset me ,because it took me from what the main characters were doing , it was the girls in the FEMA camp ! But I'm sure it will all tie in together in the next book 'Forsaking Home' ,which I'll be buying soon . I've bought about thirty 'Survival Books ' in the past year , (so many I have to re-read the start of each book to remember them!) But this series is right up there with 'One Second After'  or maybe better because that guy didn't prepare AT ALL ! Happy Reading !", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1U3ZCUXFDNQGG"}}, {"Date": "on January 25, 2014", "Text": "Unique read on what could happen. Be prepared is my motto! Gives you something to think about and ponder. Semper Fi.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A308785RUBTYTK"}}, {"Date": "on January 24, 2014", "Text": "Just got done with the third book in the \"Home\" series.  \"Escaping Home\" was a great read.  Like the others, I couldn't put it down.  I'm not a lit major, so I could care less if there were some grammatical errors in the book.  Honestly, the story had me to interested to care.  I'm at the point now that I'm truly  concerned for Morgan and his group.  To me, any book that can pull me in like that deserves 5 stars!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ONFD03CBM3QE"}}, {"Date": "on January 17, 2014", "Text": "This is an amazingly scary but informative series of survival when and IF the balloon goes up.  My hat off to A. American when is the fourth of this series coming out???  I can hardly wait to see what Morgan and gang will be facing.  I live (also) on the edge of Pisgah forest.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SWLG1PHFF8Q8"}}, {"Date": "on January 17, 2014", "Text": "This has been an awesome series. One of the best fictional survival series that I have read! Excellent character development (much like Mathew Bracken's 'Enemies' series).Gosh, there has to be a 4th book coming!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A87HB2Q2J3YS6"}}, {"Date": "on January 16, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IV74JCKDT290"}}, {"Date": "on January 15, 2014", "Text": "The Survivalist Series of the three books in Excellent.  Once you start reading it's hard to put down. Order all three you'll not be disipointed.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37OKIV6FVNX3L"}}, {"Date": "on January 15, 2014", "Text": "Another great book! I read this one in a day and couldn't put it down. I already bought the next in the series (pre-order) which should be out in June I believe.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IAK9OG2U6BRY"}}, {"Date": "on January 13, 2014", "Text": "A great story of what may happen in our country in the future unless things change in our government.  A believable story of what may come", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TKV43Y283I9S"}}, {"Date": "on January 13, 2014", "Text": "A good book with well developed characters and a good plot. I am enjoying this series though I'm missing women in the military or any positive positions of strength.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2R4O9PCDWTY7P"}}, {"Date": "on January 13, 2014", "Text": "Great continuation of the story. I am looking forward to reading the next installment. Can't wait to find out what happens next.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A46U60BA2D2UW"}}, {"Date": "on January 12, 2014", "Text": "Great book in the series on survival, during a post EMP power grab by the US government, and the actions taken to restore the nation to it's constitutional republic roots.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12ITH5Z8IIMA1"}}, {"Date": "on January 12, 2014", "Text": "I can't wait for the next book. I hope they get to JessFred and get them out. Mary in my mind can stay she should have kept her mouth shut.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DILKM02DR9SI"}}, {"Date": "on January 11, 2014", "Text": "I've read all the books in the series to date, and enjoyed all of them. The story stays entertaining, and I can't wait for the next one.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZAX2DPT8QGK1"}}, {"Date": "on January 9, 2014", "Text": "A. American's ability to keep the reader turning pages seems to have improved with this book.  My only criticism is he quit to early leaving unfinished business when it comes to dealing with the government.  Hopefully he'll decide to do a fourth.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AL2YCW7Z0BWGI"}}, {"Date": "on January 9, 2014", "Text": "This is the second book in a series. I couldn't read it fast enough. Can't wait to read the third book coming out in April!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29UNNQ1XQ0GTW"}}, {"Date": "on January 9, 2014", "Text": "I like this series.  The author is a very good writer.  The main characters are developed well enough.  Even though it is unrealistic that a person would have so many preps and have them where he needs them at exactly the right time, it is still a good read. I am learning about what kind of preps are out there and when and how they might be used.  The only problem with this 3rd book is that it just ended in the middle of the story.  The book isn't finished yet.  I hope the author will continue to write and Finnish the story", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XBIRWJJO5FN"}}, {"Date": "on January 9, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JMZOR5I1YPWS"}}, {"Date": "on January 6, 2014", "Text": "I have enjoyed the Series and Look forward to each new installment, Great Books, Good Writing, Keeps you wanting more!!!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18YYV45BJKIMW"}}, {"Date": "on January 6, 2014", "Text": "Read all the books in this series and can't put them down until I've read the last page.I'm  biting my nails waiting fir the next book.Would definitely recommend these books to anyone.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXHYBP39HFXN9"}}, {"Date": "on January 6, 2014", "Text": "Ok, A American is a pretty silly pen name, but get passed that and he writes a really great story. From book one, where Morgan Carter is just trying to get home, book two dealing with the transition into their new realities, to book three, where he must be a soldier and a father at the same time.  There is a ton of other stuff happening at the same time and some great characters as well. It's a great tale and I'm really looking forward to the next book.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3I7V6286F8F8Q"}}, {"Date": "on January 5, 2014", "Text": "Very enjoyable to read, kept my interest !! Good action and the store shows how it would effect a family.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OQ8TMOGCANUR"}}, {"Date": "on January 4, 2014", "Text": "I really enjoyed the well developed characters and story line.  Lets hope this story stays as fiction but I can't wait for a continuation to this series...", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LJ4OM80OFNKG"}}, {"Date": "on January 3, 2014", "Text": "I have been lucky enough to have read all 3 (so far) books in this story and have loved them! The author really sells and gets you to relate with a feel for the characters. The only problem is when is book 4 coming out!?!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XXJR4TOD622J"}}, {"Date": "on January 3, 2014", "Text": "We've read all three and we're hooked. Hope there will be another! Going Home and Surviving Home are the the first and second. You will be hooked after Going Home. Enjoy the books.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CJC3SAUEW56"}}, {"Date": "on January 3, 2014", "Text": "I am really hoping there is another book in this series. They just keep getting better! Recommend this series to anybody who likes an \"end of the world as we know it\" story line.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Z71OS0CHQWEP"}}, {"Date": "on January 1, 2014", "Text": "I really enjoyed the first two books in this series but Escaping Home wasn't fulfilling.  The writing wasn't as good and some chapters were watered down and just a lot of words that didn't go anywhere.  As other reviewers have written, this book just isn't as good as the previous books.  Will I buy the next book in this series? Yes, I probably will.  The overall character development and story is pretty good and hopefully the author doesn't try to string this out in a series of 15 novels.  If you've enjoyed any of these books, I also recommend reading \"Lights Out\".  That's a great book with an actual ending (after 900+ pages).", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQSKHPJQ0KOOT"}}, {"Date": "on January 1, 2014", "Text": "I really like this series,, I am hoping the next book is coming soon,, great read! very well written, check it out", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEMLEFOHFH79Y"}}, {"Date": "on December 30, 2013", "Text": "A great series fun reading and adventure filled. Never know what is  coming next. Ease reading well put together, just a good relaxing afternoon.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OE7OTRQ30G3S"}}, {"Date": "on December 29, 2013", "Text": "I've enjoyed this series, but found this book a little short compared to the rest.  Hopefully the future ones will go back to the proper length or the price gets adjusted down to more of a chapbook price.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RFGL6628Q6B5"}}, {"Date": "on December 29, 2013", "Text": "As we see the families move out of their home element the reality of the situation becomes more real. I look forward to the next chapter", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3G6ILR8XBAIW5"}}, {"Date": "on December 29, 2013", "Text": "I have bought the previous books of this trilogy. This was another great read from this author. The few problems I noticed were a lot of words missing in sentences, making the reader put their own words in the sentence. I read this book in about three days and when I came to the end I was just dumbfounded that it was so short. I looked back and found this book is almost half as long as the other two books. Thinking about it, it just seems the author rushed it and just called it done when he got to a certain point. Overall good read, but grammatical errors and length of story were real turn offs. Hopefully the next book will be longer.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHHO1ZAKHUU6A"}}, {"Date": "on December 27, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3U07MLK9YE537"}}, {"Date": "on December 27, 2013", "Text": "I really enjoyed this series. More realistic than most survival stories. Good pacing and likeable characters, hope the estrus continues!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22V2UYTL9CD0L"}}, {"Date": "on December 27, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EJMVY3YN0ZT3"}}, {"Date": "on December 24, 2013", "Text": "I received these three books on the 18th.  Today is the 24th and I've read all three.  hey, we've been housebound by an ice storm!  I don't know who this author is, but I hold him in high esteem..  His writing and story telling abilities are on a par with Lamour or McMurtry.  I don't know if I could recommend them to women because I just don't know that many women that would enjoy them. Men with-in the prepper community or prior combat arms will certainly identify with \"Sarge\" & his boys.  Also, the author lives is country I am very familiar with, where PLA rules...", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36QQWTPD07OJ9"}}, {"Date": "on December 24, 2013", "Text": "I have really enjoyed the books by Angry American. I feel like I can relate being a husband and father and being in the military with time down range. His writing immerses you into the plot and his descriptions and details really paint a vivid picture for the reader. I especially like Sarge (not sure why the author doesn't refer to him as Top or First Sergeant but that little detail can be overlooked) and his crew and reminds me of my old favorite First Sergeant and a bunch of knuckleheads I've had the pleasure to work with over the years. Anyways it was a good read and I'm anxious to read the next book in the series. To the Author- Hurry Up!! Thanks for a good book. Two thumbs up!", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KYROYLK1C4FJ"}}, {"Date": "on December 23, 2013", "Text": "Great book , I'm hooked on this series and can't wait to see what happens next. Will continue to read in the future.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KOZB40ANCTY4"}}, {"Date": "on December 23, 2013", "Text": "I really enjoy this series of books the characters are interesting and the challenges they face make you wonder if we could  be facing this ourselves in the near future.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BC5BUOYB057C"}}, {"Date": "on December 22, 2013", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3V3YWO0BDWLMV"}}, {"Date": "on December 22, 2013", "Text": "read the trilogy and found good information in them all. turned out to be a pretty good story as well.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEBSDSAMI65GC"}}, {"Date": "on December 21, 2013", "Text": "Well for me this Series has been most enjoyable, it has brought me face to face with all we preppers try to grasp from the comfort of a  warm reading chair.Someone once said we must dream the future if it is to be, and for me these first works make me dream , a dream of life with all  its  dark edges , and the power of light and right  that makes a stand. A. American will strike a cord that is in all of us who love our Freedom.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2T48AJIDSTJ2B"}}, {"Date": "on December 20, 2013", "Text": "Again the author didn't disappoint. I love these characters and I love the story line. I eagerly await the next sequel.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AO1R2DO2EEWHS"}}, {"Date": "on December 20, 2013", "Text": "Much improved editing made this a much more enjoyable read than it's predecessor.  The story line continues to be developed and the characters, well there's no doubt that Sarge is a character.  Keep up the good work.  I look forward to the next book in this series.  I read using a Kindle and that makes it easy to stay with the story and keep on reading.  Thanks!", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAZZ885CVOPMG"}}, {"Date": "on December 20, 2013", "Text": "Characters were easy to relate to and they made the story so much more enjoyable.  This is a very enjoyable series.  If you like it check out Truth's Blood.  Another good read.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AW622MS6TSD4R"}}, {"Date": "on December 20, 2013", "Text": "Good book again. Left me hanging. Waiting for the next one! Same characters that we love and know. Need number 4 soon!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20WMRYSHUEZ6Y"}}, {"Date": "on December 18, 2013", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8N3FYDA2VUYY"}}, {"Date": "on December 18, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QOHD6S47F641"}}, {"Date": "on December 17, 2013", "Text": "The first 2 books in the series were well thought out and fast paced. This book was slow and felt like the author was just filling pages to get to his next book. If it wasn't for my like of the characters Thad, Sarge and Morgan I would gave given this book one star", "Helpfulness": "", "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29MOPKQE3SYRR"}}, {"Date": "on December 16, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24HAA2SZTNX9Z"}}, {"Date": "on December 16, 2013", "Text": "Good story, a little slow , nothing real exciting happens, but it looks like the next one will have a Hugh fight.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IF899DX7EMLZ"}}, {"Date": "on December 15, 2013", "Text": "It has been the best three books I've read on the subject of SHTF.  I hope he writes another book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFK1RA8H4LR3S"}}, {"Date": "on December 15, 2013", "Text": "I've really enjoyed the \"HOME\" series.  It  has a great balance of action, drama, and humor.  The characters aren't perfect but I like that because it makes it more real.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EF5VHF1JL8UW"}}, {"Date": "on December 15, 2013", "Text": "Good addition to series. Like we are there beside Jess and Morgan. Lots of interaction between characters. Makes it more real.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3S8C9ZXRG97YM"}}, {"Date": "on December 15, 2013", "Text": "Good third book, hoped it would have gotten a little further along in the story. Good plot twist at the end to make me wait for the next book in the series", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VM9YAPM91ST4"}}, {"Date": "on December 14, 2013", "Text": "Loved the latest book, Escaping Home in the series. I used to live in Florida so it is neat to know the locations he talked about. Can't wait for next book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6PW05MP12HAA"}}, {"Date": "on December 14, 2013", "Text": "Enjoy the characters and the action. Sometimes a little too far right, but enjoyable. Read all series and they keep getting better", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1O808G20TPH65"}}, {"Date": "on December 13, 2013", "Text": "As with all of the A.American books, this makes you think,what if..... Far and along,the best series in this Genre I have ever read. I hope the series never ends!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GF1LPCZTH9SM"}}, {"Date": "on December 13, 2013", "Text": "A great series! One thing I've always liked about his writing is how he develops characters.  I hope the next one is out soon! Moar Buk Now!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2G4GSWX3GKG3L"}}, {"Date": "on December 13, 2013", "Text": "A must read for anyone who likes SHTF books. Lots of great ideas mixed into a good storyline. Finished this book and the next two in the series in a week. Couldn't put them down.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AX6HKGFKIYIQJ"}}, {"Date": "on December 11, 2013", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27R2V3WLS43LP"}}, {"Date": "on December 10, 2013", "Text": "Great Series!  Great info and insight as to how things could play out in a SHTF world.  Being open to the possibility is only the beginning.  Was left a bit hanging at the end, but the author's previous installments in this series will drive me to look forward to the next one to, hopefully, pick up and complete the last thoughts in this one.  Never the less, it is a great series.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37MRUU5FK52D9"}}, {"Date": "on December 10, 2013", "Text": "I really enjoy reading this series and I can't wait for the next one!  This Authors vision of one possible future for us is right on the money I think!  Lots of great tips as well.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36QVU856PYQLU"}}, {"Date": "on December 9, 2013", "Text": "This is another great read from a very talented author. It lets us know whats happening to Jessica and her adventures are covered alongside the inevitable things that the folks close to Morgan find themselves facing. Thankfully the story ends with the door open for another great story.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZOK7E2RKF9XD"}}, {"Date": "on December 9, 2013", "Text": "A bit weaker than previous two books (mostly cause it's shorter), but still pretty good. Reintroduction of a certain character spiced up the storyline.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39HU232CHZ8H6"}}, {"Date": "on December 7, 2013", "Text": "I was a little disappointed. I enjoyed the first one \"Going Home\" so much that I turned my coworkers and my father onto it. These are men that hardly ever read but they all agree that it was a book you couldn't put down. The second book wasn't as good but I was expecting more from this one and it let me down. But... I think the next book will be the best one yet!  Sarge is gonna open a can of ass whipping and Jess and the girls are gonna get out of that prison.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARW6IJXY3H4PU"}}, {"Date": "on December 7, 2013", "Text": "The story continues and I am hooked!  I wish there were 10 more books waiting in the wings to read.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12IR4WZXAP92A"}}, {"Date": "on December 7, 2013", "Text": "Well thought out, well written. Great threading of multiple story lines throughout the series. Can't wait for the next book. This series and the Holding Their Own series are among the best in this genre.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JAFSS9CCX186"}}, {"Date": "on December 7, 2013", "Text": "where is the next book? Ya know, this is only gonna get better!  But you knew that, didnt ya?  Sincerely... just another window licking paste eater.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3S1YQA5N7DWGD"}}, {"Date": "on December 6, 2013", "Text": "You like the genre or don't. I thoroughly enjoyed this sequel. Get it read it have fun, but start with the first book. I'm not a literary critic so grammer police and deep philosphers might disagree, but I look forward to the next one.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FA7L9H5GVXY9"}}, {"Date": "on December 6, 2013", "Text": "Love the characters in this book...at least most of them.  But I guess it wouldn't be a great book unless it showed the good and the bad that will come out in a SHTF situation.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11NX6V8K2B229"}}, {"Date": "on December 5, 2013", "Text": "Left me wanting more. Hope the next book is coming soon. This book would not stand alone as a novel due to the abrupt ending.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABGUYNITJ1LJ4"}}, {"Date": "on December 5, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VXTGXTG8RZ7M"}}, {"Date": "on December 4, 2013", "Text": "amazing story. kept me wanting more.  really wanted to read all day long an found myself mentally putting my self in the book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IJW5YAXGP4VJ"}}, {"Date": "on December 4, 2013", "Text": "Well developed characters, good writing. Would like more info on armed services reaction to political coup and DHS. What about delta?", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15IQ4H8YAT47V"}}, {"Date": "on December 4, 2013", "Text": "I've read a ton of this type of story and this series is one of the best.  A. American doesn't waste time with long descriptions of characters...no, he gets right to it.  He also has a way of telling you what's happening so well, you can instantly picture it all in your miund. I bought all three books at once and finished them way too fast.  I hope there are more to come as the story is just getting better and better.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EHX7N9I8458E"}}, {"Date": "on December 3, 2013", "Text": "Most of the time I leave the book reviews to the pros, but I got to step up here and tell the readers about this series by A. AMERICAN. This is not your normal apocalyptic novel.  I've read a library full of  those things; from Zombies, to Global Warming, to invasion, to nuclear disaster, etc. etc...but this guy does something that all the others lack: True survival situation tactics. As I've said before I am not a Prepper, or Anarchist, I just like the escapism of these types of books, but A. Americans' books really made me think; what if this kind of stuff really does happen. Just the fact that the author had me really nervous and thinking seriously about the \"Doomsday\" scenario gives credence to his writing skills.  Which is good of course, but the WAY he went about it was by being almost fanatical in the details. About how, and what it would take to truly survive such a situation. It was almost like an instruction manual with a story thrown in for good measure! As far as I know, these are the only books written by this author (unless he's using a pseudonym) and I can't wait for the next book to come out! Everyone should read these novels because of the education factor. That way if the day does come, you won't be so taken by surprise as things progress from bad, to worse, to unspeakably horrid.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3B9DHWCMYQFD"}}, {"Date": "on December 3, 2013", "Text": "Loved this book. It is well written as were the two books preceeding this one, Going Home and Surviving Home. A believable survivalist novel. Keep them coming please!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10VNWQSMQPJE5"}}, {"Date": "on December 3, 2013", "Text": "Great character developments and story line!  I truly hope there will be a fourth book!  Definitely a very fast read!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Y4UX15R5IJL2"}}, {"Date": "on December 2, 2013", "Text": "Continuing story and a good story line that just keeps you wanting more. Can't wait till the next one comes out.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7NJA2QNM2R2C"}}, {"Date": "on December 2, 2013", "Text": "Great book, it is entertaining and realistic.  It keeps the reader engaged and provides useful lessons in everyday life.  Keep up the good work!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AM1RPQKP6N821"}}, {"Date": "on December 2, 2013", "Text": "All three were page turners. Very entertaining!!! I hope there are more coming..lots of things left hanging in this one...", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1H5SGIQVJSK2L"}}, {"Date": "on November 30, 2013", "Text": "Another great read in this series.  I can't wait for the rest of the series to be published.  Keep up the great work!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMFQP3CQK06XP"}}, {"Date": "on November 30, 2013", "Text": "Good story line. Love the character development in this series. You actually feel for them. Nice change from the \"cookie cutter\" prepper/survivalist books that have flooded the market.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2N8ZVIB8WHT8N"}}, {"Date": "on November 29, 2013", "Text": "Great book. Just like the rest I the series I couldn't put it down. You will not be disappointed. Start with book one and you will be hooked.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QW5CU1RIFEBP"}}, {"Date": "on November 29, 2013", "Text": "I thought it picked up right where the second book left off. The characters were just like running into old friends. Please hurry and get the next book out.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1R23IY3ZGH5O7"}}, {"Date": "on November 29, 2013", "Text": "I really have enjoyed this series and look forward to the next installment! I have been reading quite a bit of post apocalyptic fiction and this series is in my top 5.  I have also learned a lot and have started my own bug out bag! Keep the books coming!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AKM8DR9GBBA6"}}, {"Date": "on November 29, 2013", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8H2YKW9QYEYD"}}, {"Date": "on November 29, 2013", "Text": "Decent storyline, but appears to be more of a setup for next book. My least favorite of the trilogy. Of course, looking forward to next installment.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19Y6VPOS8U714"}}, {"Date": "on November 27, 2013", "Text": "Can't wait for the next book to come out. I love the way the author makes the characters so believable. Great story.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARIE1X02SBJP"}}, {"Date": "on November 25, 2013", "Text": "I just love this series!!!! If you like this kind of genre you really have to check this series  out!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30E1HSV7T48P8"}}, {"Date": "on November 25, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EID8QJ8HBLQC"}}, {"Date": "on November 25, 2013", "Text": "Continuing the story with all the characters we find that home is not where you live but what you make it. Lots of adventures and truths reveiled about the government camps. All these winers about it not being broken into a perfect ending can eat it, because not all endings are perfect and sometimes you are left hanging.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36H8KXVG1TZME"}}, {"Date": "on November 25, 2013", "Text": "A. American can't publish books fast enough for me and my father.  Excellent series that I hope never ends!!! Keep up the amazing writing!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18D1NEPROV0S0"}}, {"Date": "on November 25, 2013", "Text": "Really enjoy the writing style of the author and the story has kept me interested. Looking forward to the next book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AM7XXRNS4WLH"}}, {"Date": "on November 24, 2013", "Text": "I have enjoyed the 1st two books and couldn't wait for this installment to come out.  I'm invested in the characters.  The author knows how to weave a believable, engaging story.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Y9ICNZ3CJ7I3"}}, {"Date": "on November 24, 2013", "Text": "I absolutely recommend this book's two predecessor installments, \"Going\" and \"Surviving.\"  I downgrade this to 4 stars for one simple reason:  It ends in a way that leaves a lot of things dangling, with no visible evidence that other installments are in the works.  Kinda like coitus interruptus... Perhaps A. American has more in mind...", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IK687WQSG7YU"}}, {"Date": "on November 24, 2013", "Text": "As with the last two novels, the characters and storyline are compelling, leaving me wanting more at the end.  A. American is quickly becoming one the the best writers of the post-apocalypse genre.  I can't wait for the forth novel to arrive.  I will pre-order it as soon as it is available.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30V8R8XDLTRRE"}}, {"Date": "on November 23, 2013", "Text": "This book had me wanting more.  I'm always intrigued by how people respond in life and death situations, and this book had plenty of \"real\" characters.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NE6E0R3KILLD"}}, {"Date": "on November 23, 2013", "Text": "I have read all three books and thoroughly enjoyed all of them. I eagerly await number four. I live in Florida very near where the story takes place and really liked the accuracy of the locations.  My only grips are the typo's . And the length of this book.  It's a good thing the author hooked me with his first two books so I didn't mind spending my hard earned cash for this one.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TXAEODBOYJE7"}}, {"Date": "on November 23, 2013", "Text": "Author does a fantastic job of putting the reader right into the action.  Could not put it down and now waiting for the forth segment of the series.  Please hurry.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DFYP5TF5NURY"}}, {"Date": "on November 22, 2013", "Text": "A. American has a great way of telling a story and keeping the reader interested throughout the novel. This series has been great all through the series.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJ8HF96QDOXLN"}}, {"Date": "on November 22, 2013", "Text": "Keep them coming, I don't care what anyone says these books are some of the very best. It's like a movie you don't want to end, or maybe it's like life itself the people and situations just keep on evolving.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AN21JQL72EAAL"}}, {"Date": "on November 22, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39HA4ROC858OW"}}, {"Date": "on November 21, 2013", "Text": "'Escaping Home' wasn't quite as engaging as the first two books of the series but still a very good read.  In book three we catch up with a few characters from book one and discover that all is not going well for everyone.  In 'Escaping Home' we meet the enemy face to face and the pressure builds to set the stage for some real explosive excitement in the next episode.  I can't wait to find out what happens next.  A. American is a gifted storyteller and The Survivalist Series is one of my favorite series.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TSWOMC7GHDQJ"}}, {"Date": "on November 21, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29P9VJO54IAHP"}}, {"Date": "on November 20, 2013", "Text": "Great fast prepper read and very realistic as to what may occur in the near future of america.  Hope your are ready :)", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A258EWNILBTRG1"}}, {"Date": "on November 20, 2013", "Text": "Good book and very engaging, hard to put down.  Each book leaves a bit of a cliff hanger  and makes you want to read next one in series.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CHQEE16WJLEB"}}, {"Date": "on November 20, 2013", "Text": "You've written another great episode and now we have to wait for your next book - not fair! I don't know if I can worry about Jess through the Christmas season. All kidding aside - but you know I'm not kidding. Excellent book - great action again and the storyline continues to twist and turn. I'm glad the Sarge is there to take care of everyone . Sarges next mission needs  to be to Jess ASAP.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHRZ36WLWZDAS"}}, {"Date": "on November 19, 2013", "Text": "I am invested in the characters and it is an interesting series.  I am anxious for the next book to arrive.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QXD52CXVMJKQ"}}, {"Date": "on November 19, 2013", "Text": "I've really enjoyed reading all three of the books in this series and look forward to reading the next book when it comes out.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19COUGKGEBSW7"}}, {"Date": "on November 18, 2013", "Text": "Great continuance of the journey of Jess, Sarge, Thad, and Morgan as they adjust to their new environment. I highly recommend this sequel.  Escaping Home doesn't focus too much on the less-than-likely premise that the government was out to control all civilians -- well, everyone! and focus more on the problems that individuals must solve to make their lives worth living. Jesse, for all intents and purposes, is incarcerated in a camp run by the bad guys, while the rest of the group tries to avoid the same crowd. I am anxious to find out what happens next, and hope that the answers won't be that long in coming!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1S6SQODGEJY2S"}}, {"Date": "on November 18, 2013", "Text": "Morgan and friends continue to survive in a world where D H S  is the bad guy and trying to move the country into a communist type society.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A341HUHZIP3LVH"}}, {"Date": "on November 17, 2013", "Text": "When is the next installment? I need it! Keep them coming. I only fear not if, but when this will happen.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27LPAQHCS5ADH"}}, {"Date": "on November 16, 2013", "Text": "Awesome series! By far, the best survival series I have yet to read. I can't wait for the next book!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AO4GAFUD2EQPB"}}, {"Date": "on November 16, 2013", "Text": "This book is the third in this series. The editing was better than the first two. I believe that a new reader for this series might rate it higher as the story won't be broken up due to waiting for the next book. There were some lags (flat line) at places within this book as the author appeared to try to expand the volume of the content. But still, I enjoyed the book although I don't think I'll do the next in the series if it appears.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PUBVXDO3QEH4"}}, {"Date": "on November 16, 2013", "Text": "Great book big cliff hanger. Great characters. Great series. Hard to find books like this anymore. Thank you A American", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JRQKPPCX5FZ1"}}, {"Date": "on November 16, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XUIVNPE3FI5Y"}}, {"Date": "on November 13, 2013", "Text": "A little slower paced then the previous books, a little more focus on other characters but it seems to be building to more to come in the story. I am looking forward to reading the next one a lot.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3O58GTFRLM41W"}}, {"Date": "on November 13, 2013", "Text": "I have read all three books in this series. This one is good but it seems to end in the middle of the story.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DQSE4GFWVPZG"}}, {"Date": "on November 13, 2013", "Text": "Having read the first two books in the series I was anxious for the sequel to arrive as I wasn't sure what would become of Thad and Morgan. This book spent a lot of time with the FEMA camp \"inhabitants\" (prisoners) which was very scary as you could truly envision this happening. The writing is much more advanced, flowing smoother than ever before. The details in this were much more graphic, which made the reader feel the anguish, the fear, the anger, etc. with the various characters. It left us holding our breath, and unfortunately, we'll have to wait on A. American to exhale when the next book comes out so we find out what happens to the girls at FEMA. Thank you for continuing this story to its completion. I Love it. I'll also be reading books one through three again as I'm waiting on four!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARGV6Q8VZW3SY"}}, {"Date": "on November 12, 2013", "Text": "This entire series has been impressive. Great characters, strong story line, and a thought-provoking plot make this a must read. Survival in a post-apocalyptic world is a popular theme at the moment, but this series is better written than most. The relationships between characters define what \"home\" really is.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1J7MBW2SR98HP"}}, {"Date": "on November 12, 2013", "Text": "Great 3rd book to the series.  Enjoy following the characters and story...and the fact that the story makes you think and plan", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RY7UH8VOH53B"}}, {"Date": "on November 9, 2013", "Text": "While still action-packed, this third book in the series is more philosophical and tends to examine the morality of the characters' actions closely.  Frankly, I enjoyed the first two more.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A580X4BYLNETZ"}}, {"Date": "on November 8, 2013", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20UISGZ776F26"}}, {"Date": "on November 7, 2013", "Text": "I really enjoyed this segment of the home series. The ending was a little sudden but it is a series, what do you expect.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BKO5FERW3O45"}}, {"Date": "on November 7, 2013", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1STSIBS59744U"}}, {"Date": "on November 7, 2013", "Text": "Just purchased this and I'm about as pumped as I can be to start reading a book.  I read the first portion and saw the Hellcat Jess was back, stopped and bought it.  Now, nearly 3 a.m. and about to kick off the third adventure - AA, YOU OWE ME SOME SLEEP!!!!!!!!!!!!!!!!!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30DD15WS5PEYP"}}, {"Date": "on November 7, 2013", "Text": "I've almost become used to A. Americans writing style to the point that I can see what's going on as if I'm watching a film..looking forward as rd to the next installment. Very entertaining, highly recommended.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2G9I0E9PGABHJ"}}, {"Date": "on November 6, 2013", "Text": "I've read all three books in the series now. The author certainly likes to leave you waiting to see what is going to happen in the next book. I'm now looking forward to the fourth in the series.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADLT4I2JUZV5K"}}, {"Date": "on November 6, 2013", "Text": "Can't wait for the next installment.  The characters are believable and relatable.  I have really enjoyed the series so far.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CJDUFCFH6HTM"}}, {"Date": "on November 6, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MRVM7RO1ZJC8"}}, {"Date": "on November 6, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A175E24ZPCSJ9K"}}, {"Date": "on November 6, 2013", "Text": "I have to say that this author is one of my favorite writers regarding surviving the end of the world as we know it. Highly recommended. I could not put this down and sadly it ended too soon. Can't wait for the next installment.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BGGDEGMJ7LSH"}}, {"Date": "on November 5, 2013", "Text": "Love the characters and feel like I really know them personally.  Can't wait to read the next one! This one took me less than a day😊", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VW4FNRXHCUYE"}}, {"Date": "on November 5, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LO743GMD8523"}}, {"Date": "on November 5, 2013", "Text": "It becomes more difficult to escape than stay, losing it all to stay safe keeping the family out of harms way, this one goes back and forth between those within the Government Camps - LOL - and those trying to stay out of harms way - The leave us alone crowd...", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IYRJGQ5SN70B"}}, {"Date": "on November 5, 2013", "Text": "I have read all three books and was hooked after the first chapter of Going Home.  Can't wait for the next book!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RLN5EAVDECUH"}}, {"Date": "on November 5, 2013", "Text": "A. American matures with each chapter. My only regret is starting this series and having to wait months for each edition. Oh, and my name didn't appear in this version (ha ha ha). We'll done. When is the next one out?", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38OQTOCARQ21S"}}, {"Date": "on November 5, 2013", "Text": "Very good, I only wish the camp with girls had been wrapped up in this one as well. To be continues...", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1S60JTX7965X4"}}, {"Date": "on November 5, 2013", "Text": "Another great book from A American! I couldn't put it down. I hope more like this will be out! I don't know if I can take the wait!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ETQX5A43Q6YN"}}, {"Date": "on November 5, 2013", "Text": "This is a great book. The story is compelling, the characters are realistic, and the action is exciting. I can't wait until the next installment!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VAI7KH45LDTW"}}, {"Date": "on November 4, 2013", "Text": "Best of the series, although I would have preferred to separate the two story lines in separate books and read more about life in the FEMA camp. I agree with another reader that said that the author's writing continues to improve.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SA0UMB1V65WX"}}, {"Date": "on November 4, 2013", "Text": "I am having a really good time reading this series and I look forward to the next chapter. It looks like times are getting tough for our stalwart band as the fight comes closer to them and the plan of the pupppet government slowly comes into focus. Hopefully we won't have to wait long for part 4!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NLLKC2Y4UYU2"}}, {"Date": "on November 4, 2013", "Text": "Another great read in this series. I can't wait for the 4th book. I would love to see this turned into a movie.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3C2UP78FRWUAR"}}, {"Date": "on November 3, 2013", "Text": "When is the next one coming out?  I enjoy the plots, characters and action.  I also love the way you put practical survival tips in your books for all of to know.  Keep up the great work!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37JJGZMUE4OA1"}}, {"Date": "on November 3, 2013", "Text": "Like the other two books, this one is great. I hate that I have to wait for the next one!!!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1C9WDPF32RI44"}}, {"Date": "on November 3, 2013", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1908KG3K93R68"}}, {"Date": "on November 2, 2013", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EWO13C3WD63W"}}, {"Date": "on November 2, 2013", "Text": "With the way the world is looking today you have to wonder if A American has a time machine to see in to the future! Book 3 keeps up the pace and leaves you craving more.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SJHCD7X8WC7N"}}, {"Date": "on November 2, 2013", "Text": "I have read a lot of survival books. This series I really enjoy, it's not filled with ridiculous scenarios but with real life action!", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MKU9N0TIFS9V"}}, {"Date": "on February 3, 2015", "Text": "This book was FANTASTIC! The tactical and survival information was spot on, and the action kept me on the edge of my seat. The book covers the reality of violence and defending your self and your family, as well as natural human reactions to such things. I think it could have done without the cursing, but I can live with it. Outstanding job.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALZXYP8WUX2H0"}}, {"Date": "on April 13, 2015", "Text": "From the get go, I felt like I was part of the group, trying to survive and thrive. I'm a Army Vet and miss the brotherhood that Sarge, Mike, Ted and Doc show towards each other. The constant picking on each other is our way of caring. Thanks for a great book. Keep up the amazing work and God bless. There wasn't ANY dislike in this book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1K4MQOS3VBOUB"}}, {"Date": "on January 12, 2015", "Text": null, "Helpfulness": "", "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVBDBC0IHKQSL"}}, {"Date": "on January 5, 2015", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21O67BKY7Y9RN"}}, {"Date": "on March 30, 2015", "Text": "Couldn't put this book down. Read it in one day and need more! I am not a literary critic so no notes on writing styles or typographical errors, I just enjoy these books and can relate with the main character in the story. It also helps that I agree with much of the authors thoughts on the human condition.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYBOTV458ZQM5"}}, {"Date": "on September 16, 2014", "Text": "As I mentioned in my other reviews, I think the story line is very informative.  I believe the story is more factual than fiction.  I believe this can happen anytime to us.  Definitely gives insight as to how things might be in the future!  We should all take note & definitely prepare for the worst!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RM0I2W45JOS5"}}, {"Date": "on September 4, 2014", "Text": "This is the third in the Series and I can't wait to start #4. I feel like I'm walking in their shoes and wondering what is around the next bend. I read 5 to 6 books at a time, but I just seem to fall back to this series because I want to see how each character reacts to all the different situations.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQIFXA9JA27XU"}}, {"Date": "on January 17, 2015", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Q0U1FSJ6RY3J"}}, {"Date": "on December 16, 2014", "Text": "Some stated that this wasn't as exciting as the first two installments. I disagree with their assessment. A American knows how to ebb and flow the narrative. If you want continuous, disjointed, over-the-top action, Dolph Lungren has some dvds for sale at your local flea market.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUN2LH8NORT8H"}}, {"Date": "on August 13, 2014", "Text": "Just finished the last of the four novels.  Highly enjoyable throughout all four books.  I definitely recommend the series.  You quickly become attached to the characters and the story holds your interest as you follow them through the beginning of a collapse of society event.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADSURN8LVE8S"}}, {"Date": "on March 23, 2015", "Text": "I really enjoyed this novel. I have come to enjoy all the later books in the series much more than the first. The main character isn't some hero who can do anything. He's a regular guy who has some useful knowledge and supportive and helpful friends and family. Great read.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Y5HXWTWU6T2P"}}, {"Date": "on October 20, 2014", "Text": "Read it in one day! I could not put it down! Looking forward to the next one! What is going to happen next to Morgan and Mel and the girls! Love Thad and now that Jess is back in the picture how is she going to get reunited with Morgan and Thad and Sarge of course!!!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A269LULJXWO7MV"}}, {"Date": "on July 20, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABVHJKYJF1J0V"}}, {"Date": "on January 5, 2015", "Text": "Some of the most enjoyable survivalist/prepper fiction I've read.  Not as much political commentary as most which is a nice break.  Also great for me as it's set in Central Florida(where I live) and accurately portrays the locations and local details.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SUNFY3LELBNK"}}, {"Date": "on September 9, 2014", "Text": "I like the characters. Good story. The only thing that bothers me is all prepper novels end with type of big battle as the climax. Not sure it would play out like that in the real world but I can't really think of a better way to end a book or series.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PPRHWCP96GP6"}}, {"Date": "on September 25, 2014", "Text": "Zipped through it on vacation, and im gonna start \"foresaken Home\" on the plane ride back. Love this series what a great read! I have them all on my kindle app and i feel like a hypocrite, im gonna need to order them on paper back.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A258A0L40CATT2"}}, {"Date": "on September 10, 2014", "Text": "Have this whole series and even though no post apocalyptic sequel is as good as the first one this series has kept my interest. One before this one was not up to par but author has gotten back to his original style and this was good read.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RURJFXN33VNK"}}, {"Date": "on December 6, 2014", "Text": "This book. The series in fact is just utterly amazing. I can't bring myself to put it down. I read this book in one sitting and completely forgot about the real world. A.American is just a captivating author and I never want it to end.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QHIG2PIY4R7U"}}, {"Date": "on February 20, 2015", "Text": "This third installment in the story line was a total waste of time. Nothing of note takes place, no furthering of the story line.  Action is very minimal. Found myself skipping through multiple pages looking for something of interest.", "Helpfulness": "", "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADUBIG722A28M"}}, {"Date": "on November 16, 2014", "Text": "As far as survival series go, this one is awesome. Fictional situations are paired with real life survival skills and equipment suggestions. The characters by this book are well formed and I look forward to reading what happens next.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A76ZFX68UIWPY"}}, {"Date": "on November 19, 2014", "Text": "I started this series by reading \"Going Home\", I am still reading the entire series. Usually I only read a couple in a series but got caught up with this group of people and want to know how they manage during the disaster.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3Q5UAIXN06NJ8"}}, {"Date": "on August 4, 2014", "Text": "This series is great.I've been a fan of A. American for a long time. I started reading him a year ago on  survivalist board.com. and followed him on my kindle the series is worth every penny.keep up the good work A American.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21ZHL9RGYNPA5"}}, {"Date": "on July 26, 2014", "Text": "Very enjoyable read. Not quite as good as the first book in the series or  but very entertaining and readable. As one of a series of book it is a must read to keep up with the characters of the first book.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26CCG8A3KB7J8"}}, {"Date": "on August 25, 2014", "Text": "This is a great book. The series started off a little slow for me, but quickly picked up and I couldn't wait to get the others. The books do need to be read in order to follow the storyline though.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AN8VW2F5OLX87"}}, {"Date": "on July 25, 2014", "Text": "A friend recommended this series to me and once I started reading I could not stop. Great characters. I live in the area the book takes you through and all of the places are spot on. Great books!!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HMA3FS9D75ZE"}}, {"Date": "on August 18, 2014", "Text": "This series started as interesting, then things started getting twisted and now I am hooked.  I really want to know how the characters are going to get out of this mess.  On to the next one....", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QBWM22GN9C1U"}}, {"Date": "on March 8, 2015", "Text": "I am a 30 year old city girl who accidentally discovered these books and I can't put them down. I even got my brother, dad and boyfriend into them. If they can entice me, they are great reads! The characters are fulfilling and the plot line is definitely not boring.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QR0X3HRFWNBL"}}, {"Date": "on April 23, 2015", "Text": "This is a good story, good characters, good sequel to the past two stores. It just has the same editing problem, poor grammar, missing & misused words, all little things but very distracting.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24T1O71KKKCHE"}}, {"Date": "on January 12, 2015", "Text": "I am not sure that this is the way things will happen with Obamas administration but it sure is possible..  It was a good read. Some grammar problems and some errors but kept my interest.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQ3QN8T3LUUXU"}}, {"Date": "on October 17, 2014", "Text": "Excellent read, based on what could happen in the future, a must read series for many Americans!! Especially for those who are asleep at the wheel and think things are just hunky dory.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A393GSR16CQ9IA"}}, {"Date": "on April 27, 2015", "Text": "Reading these makes you realize a little prepping can go along way. It has been in my lifetime watching Mt. St Helens erupt that it may be a good idea to have some goods put away.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ESGAKD4NXU32"}}, {"Date": "on December 30, 2014", "Text": "Could not put this book and the others in the series down ! I can relate to the main character, Morgan very well ! If you like this type of story, you will not be dissapointed !", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IVGNBJJWI87X"}}, {"Date": "on December 20, 2014", "Text": "Very fun read, I'm enjoying the whole series. With the exception of some foul language these are great. Good thought provoking read for opening the eyes of friends or family.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A178E5UYE73LYM"}}, {"Date": "on October 27, 2014", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACRJT1NEQMKDH"}}, {"Date": "on October 1, 2014", "Text": "Number 3 in the series, great story line and cast of characters. Perhaps a more realistic approach to the fix the more common causal prepper would find themselves in.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17TXFQ65M8SR9"}}, {"Date": "on March 9, 2015", "Text": "Sometimes it's hard to leave your home. But when the wolf is at the door, the decision is easy. The saga continues for the group and will keep you turning the pages.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IIUN6Y5OV9KW"}}, {"Date": "on September 21, 2014", "Text": "Very fast read but a very good read. Made me look at how well prepared I am for a catastrophic even like the very real and very plausible one depicted in this book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AU26Q4H1RIIVR"}}, {"Date": "on July 5, 2014", "Text": "One of best in genre", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASPVQC61QD7OY"}}, {"Date": "on June 28, 2014", "Text": "Important issue.EMP.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A213S5MIFGLLJA"}}, {"Date": "on September 28, 2014", "Text": "Once again this series delivers.  It continues to hold my attention and captivate me.  It kept me reading until the end snuck up on me.  Give me more!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A80EVXD1IBF92"}}, {"Date": "on September 22, 2014", "Text": "Really enjoyed the book.  I like following the characters from book to book.  Great story line and very believable.  It could happen on our watch.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A111OIGJ6QSFD7"}}, {"Date": "on November 24, 2014", "Text": "waiting for the next one...................I don't like the fact that I have to write x number of words!!!!!.......I'm pissed!about it too!!!!!!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I6200PSQ0UZK"}}, {"Date": "on July 17, 2014", "Text": "None of us know how it will be if SHTF, but these books are very close to what I would  expect in reality.  Totally enjoyable. Highly recommend!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADWEWKACH31M5"}}, {"Date": "on September 4, 2014", "Text": "Absolutely excellent series by A American.  This is the third book in the series, and I'm going to order the 4th/most recent this evening.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13PY8WY3FBURV"}}, {"Date": "on September 6, 2014", "Text": "I enjoyed the who series -  IMO worth the time to read them all in order. Sadly some day could be more truth than we want to experience.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAMWBE84TN0K7"}}, {"Date": "on May 4, 2015", "Text": "Great book! Enjoyable read! Characters are very easy to get attached to. If you're into the apocalypse genre then give this a chance :)", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14FBJB01J9E9"}}, {"Date": "on September 16, 2014", "Text": "Like others have said definitely needs a proof reader. But that aside it is a good story easy read and an interesting take of SHTF.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MXQBBD4X0ZFV"}}, {"Date": "on March 8, 2015", "Text": "I love this series of books their GREAT GREAT ! I have already bought the rest of the series getting ready to start the next one.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4Y2FT95019J6"}}, {"Date": "on February 16, 2015", "Text": "The book is as good if not better than the first. I am pleased with the series so far. I have moved on to the next book as well.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YAJTE4MWH67R"}}, {"Date": "on October 19, 2014", "Text": "Amazingly told!!!! Story line is easy to follow and plots is solid. Throughly enjoy how the separate stories are woven together.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1M8LXX7Q2BJS9"}}, {"Date": "on November 6, 2014", "Text": "I love these books!  Really makes you think about being \"ready\".  I know I'm not and would be one of the sheeples! LOL", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28CTMU6DOCOYJ"}}, {"Date": "on May 8, 2015", "Text": "I LIKE THE BOOK AND STORYLINE. ALSO, LIKE THE FACT THAT IT MAKES ME THINK ABOUT,  WHAT IF SCENARIOS AND HOW WOULD I PROCEED .", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HF605YUUQ6DK"}}, {"Date": "on December 13, 2014", "Text": "This series has some awesome practical ideas for peepers and a realistic view of the possibilities that could come into play.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RE3SMS6IASWT"}}, {"Date": "on September 10, 2014", "Text": "Man do these guys keep having problems. I hope I never have to make the decisions that people in this series go through with.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IE07YWGXHD2A"}}, {"Date": "on September 24, 2014", "Text": "I really enjoyed this book and all the books in the Home series. The writer is very knowledgeable about survival techniques.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A754U1YFYX0US"}}, {"Date": "on April 23, 2015", "Text": "This third book kept me on the edge of my seat...didn't want it to end but I couldn't put it down and can't wait for No.4.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3K19JM4OS7RLF"}}, {"Date": "on December 11, 2014", "Text": "Realistic, thought-provoking book regarding possible scenarios with government actions against armed law abiding citizens.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A267PD3K4QAX81"}}, {"Date": "on October 6, 2014", "Text": "Excellent series, has kept me glued from the beginning. Can get a little military, but only helps to make the storey real.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1E42L7E4YOK8N"}}, {"Date": "on January 5, 2015", "Text": "makes you think", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXZS43N7GIJV8"}}, {"Date": "on September 14, 2014", "Text": "Great book, there are some grammatical errors but the story is worth it.  I'm sad to see the story line draw to an end.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2L1RCWQXZJM3C"}}, {"Date": "on September 11, 2014", "Text": "A realistic story of what could happen in a SHTF situation. Fast paced, written beautifully! I could not put it down!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20RRGXNNPNCXP"}}, {"Date": "on April 20, 2015", "Text": "Some editing mistakes, but I am able to look past that.  Well written, interesting, informtive, thought provoking.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A122Q9D5BZ3XF9"}}, {"Date": "on February 11, 2015", "Text": "I liked the realism. Didn't like all the bad language. (Unnecessary) If not for bad language It'd be a 5 star!!!", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYXBWQZNH3MVG"}}, {"Date": "on January 2, 2015", "Text": "One of the apocalyptic books in great book in the series. Will be reading the next one soon as I have  the time.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3O2PX41SRQ4G7"}}, {"Date": "on July 26, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D1ZTKYDCP5D0"}}, {"Date": "on February 3, 2015", "Text": "Still needs editing but is a good read with lots of action. Story holds your interest and has good characters.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALKPA7CZEQAVS"}}, {"Date": "on October 8, 2014", "Text": "Grammar and proofing a little deficient. Wish these authors would get someone to edit their very good stories", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AA7P0X926W960"}}, {"Date": "on January 17, 2015", "Text": "Just as exciting as the books (in this series) I've read before this one! Book 4, should be excellent also!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZI7I6UTDCAFC"}}, {"Date": "on May 23, 2015", "Text": "This is a great read and is full of great information that will help in putting together a plan of action", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BUNU6Y6XJAV7"}}, {"Date": "on January 18, 2015", "Text": "decent, entertainig book...i've read the whole series and they are entertaining...the 1st was the best!", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ENA8OWXDIT70"}}, {"Date": "on February 19, 2015", "Text": "The storyline is excellent and makes me think about what might I need to do in this kind of situation", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IJ06CNQ880R0"}}, {"Date": "on April 9, 2015", "Text": "Excellent story line, easy to follow. I am reading all of the series that is available for purchase.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UIDR7UTX4S59"}}, {"Date": "on May 8, 2015", "Text": "Great book It flows so well from book to book. Do yourself a favor and read all five ..", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1J4F2HGHUBF9E"}}, {"Date": "on September 21, 2014", "Text": "Can't say enough about this book.  Exceptional read...fantastic 4 book series! LOVE IT!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VN3NTXHON2N"}}, {"Date": "on January 19, 2015", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZH7NPQIBMOBP"}}, {"Date": "on November 16, 2014", "Text": "I love the characters, the story, and the them of independence and self sustenance.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RJ1K8QAPF3FT"}}, {"Date": "on April 3, 2015", "Text": "Another excellent book in the series! I highly recommended the entire series.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3C0CS86AH7JSZ"}}, {"Date": "on September 26, 2014", "Text": "Great series! Lots of practical info wrapped around a rollicking thrill ride!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HHY3EYQTW1SR"}}, {"Date": "on October 18, 2014", "Text": "Good read..this author never disappoints...check out his older books....", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AINDCQ2XSE20B"}}, {"Date": "on February 14, 2015", "Text": "I'm in the middle of this one. It just keeps getting better and better.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1T8XV8CD5B3XV"}}, {"Date": "on January 10, 2015", "Text": "Can't wait to see what happens next with the gang, love this series !", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35ZW587S7C8GU"}}, {"Date": "on April 7, 2014", "Text": "I found this series to be very well written, very entertaining and chock full of information that keeps the mind working.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WHQW0RPIEF1Q"}}, {"Date": "on April 7, 2014", "Text": "It's official. I'm hooked. I don't usually write reviews, but with this series I felt compelled. After reading Going Home and Surviving Home I was eager to get my hands on this little gem Escaping Home. I have been raving about these books since I finished the first book in the series late last year. I have thoroughly enjoyed all of them. Rich character development throughout. A story that progresses in a manner that is as engaging as it is exciting. I only wish the next book in this series was in my hands NOW. I rarely keep books after I've read them. I donate them or give them to friends. I will be keeping these. There is no doubt I will re read them. I highly recommend the entire Survivalist Series by A. American.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MQANTHBZDSVI"}}, {"Date": "on April 5, 2014", "Text": "Enjoyable and thought-provoking read.  Can't wait for fourth book to be out in June!  Times are changin' and this series offers easily believable scenarios of what may well be in store for us.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FF3HPDDRRO1F"}}, {"Date": "on April 4, 2014", "Text": "We really enjoyed this book. It makes you think with lots of good information. Some of the characters got a little hard to follow (more were added), but overall it is worth the read. It picked right up from volume 2 \"Surviving Home.\" We've since ordered volume 4 and are waiting for it to arrive.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AACK6ZVZYYTZI"}}, {"Date": "on April 1, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A383I0FLD0D2K7"}}, {"Date": "on February 6, 2014", "Text": "Piss-poor ending to the book.  A. American get tired, dead, or lost his imagination?  There a number of inconsistencies also.  Only way I read anything of his is if he writes under an alias that I won't know about.  Almost everything in the entire story was obviously going to happen.  A. AMERICAN SHOULD KEEP HIS DAY JOB.", "Helpfulness": 0.5, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJM60BA87Y4VZ"}}, {"Date": "on November 15, 2013", "Text": "The 2 books were great as was this one. When will the 4th book be coming out? I like this Author.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3G0XY8S44LGST"}}, {"Date": "on November 14, 2013", "Text": null, "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1K2S05P954VQ"}}, {"Date": "on November 10, 2013", "Text": "I have enjoyed this series - so far.  I was a little disappointed in the ending - thought it could have been wrapped up better.  I will read the next installment, but if it continues this downward trend it will be the last one for me.", "Helpfulness": 0.5, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANNLNWTHZ7TI1"}}, {"Date": "on February 20, 2015", "Text": "Excellent series. Too bad you can read it easily in an afternoon.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A202NS7WTEZUSZ"}}, {"Date": "on September 17, 2014", "Text": "Well done.  Minor questionable details, but overall a good read.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2D31NOZ9RGVTO"}}, {"Date": "on August 11, 2014", "Text": "Interesting but wish the bad language was reduced by about 90%.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OQWKN07ZWK2Q"}}, {"Date": "on December 23, 2014", "Text": "Great read. Great survivalist series. This is book 3 of 5.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMMQP8HOCYP9J"}}, {"Date": "on September 20, 2014", "Text": "One of the best series of books I've read in a long while.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANZO7QISPYLFI"}}, {"Date": "on February 26, 2015", "Text": "This series of books from Angry American are eye opening.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14O4SS8GGCM63"}}, {"Date": "on August 31, 2014", "Text": "A fun read.  I enjoyed the interplay with the characters.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XH20KAHS4KKN"}}, {"Date": "on November 24, 2014", "Text": "It's a $5.00 book.  Enjoyed the story for a light read.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ICL0IK1049PB"}}, {"Date": "on October 18, 2014", "Text": "Very well written, holds your attention on every page.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3921Z4NX7DWT3"}}, {"Date": "on July 22, 2014", "Text": "hard to put down , gets you to thinking WHAT IF !!!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32RIRQ49HAULH"}}, {"Date": "on January 3, 2015", "Text": "Whats going to happen to them now. Great read.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HE2CP7V4CMSO"}}, {"Date": "on October 24, 2014", "Text": "Great Book! Very good reading and informative!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TU9IS3PIMCUD"}}, {"Date": "on October 12, 2014", "Text": "Still worth the read, but starting to get old.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AE51XV5BWQVH9"}}, {"Date": "on March 13, 2015", "Text": "Yes. My guilty pleasure. I liked this series.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22ADWQGMMWRSH"}}, {"Date": "on May 3, 2015", "Text": "Great read..already started  on the 4th one.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22DM6XATGPZA2"}}, {"Date": "on March 10, 2015", "Text": "This series keeps getting better and better.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10T9TN8YRO85J"}}, {"Date": "on October 22, 2014", "Text": "Another great read for the series, riveting.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABTBOD679KEMX"}}, {"Date": "on September 23, 2014", "Text": "Just loved it. cant wait for the next one...", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KWN1BHD3WYFB"}}, {"Date": "on July 16, 2014", "Text": "Great series...be sure to read them in order", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMZVKRL0AURQA"}}, {"Date": "on September 12, 2014", "Text": "Can't wait for book 5 coming in December.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37TWRRM88FK4T"}}, {"Date": "on October 15, 2014", "Text": "foul language ruined the story for me:(", "Helpfulness": "", "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HCQZOLKYENG0"}}, {"Date": "on November 14, 2014", "Text": "Just what I wanted, thanks so much. :)", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3L0PCJPOWAHLI"}}, {"Date": "on April 29, 2015", "Text": "I have enjoyed this author's writing.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JWSIX0NCWLZN"}}, {"Date": "on April 18, 2015", "Text": "Great book, everyone should read this", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Q2WUSFD8D8LJ"}}, {"Date": "on November 14, 2014", "Text": "Great book... read the whole series.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LICGW8E52RDV"}}, {"Date": "on August 30, 2014", "Text": "Great series of books. Buy them all!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33UE3LAICQJ7S"}}, {"Date": "on January 3, 2015", "Text": "Excellent series. Highly recommend.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A0985833140Q33H0QW6AJ"}}, {"Date": "on September 23, 2014", "Text": "Loved this next book in the series.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36663YN4W39TN"}}, {"Date": "on October 29, 2014", "Text": "A. American hits a home run again.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PN4CJQO3MB9Q"}}, {"Date": "on October 16, 2014", "Text": "Great series.  I highly recommend.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BJ5DK2C07BK1"}}, {"Date": "on October 11, 2014", "Text": "Read the entire series in 2 weeks.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LLCXIHAV9BRG"}}, {"Date": "on September 26, 2014", "Text": "Great book can't wait for the next", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WVOW28BSJUSD"}}, {"Date": "on April 11, 2015", "Text": "More great writing by A. American", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SO062R5BABAZ"}}, {"Date": "on October 13, 2014", "Text": "this is a great series of books", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HMJ4IUPF61TA"}}, {"Date": "on July 19, 2014", "Text": "excellent, believable, accurate", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AB2U1O1SRDLN5"}}, {"Date": "on May 2, 2015", "Text": "The whole series is fantastic,", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QLIWBF9I6MLD"}}, {"Date": "on December 29, 2014", "Text": "My husband loves these books.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11MLMS35W1LW7"}}, {"Date": "on November 30, 2014", "Text": "Ok read.  Part of the series", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GO5V4RT0FL7E"}}, {"Date": "on July 30, 2014", "Text": "Loved the book action packed", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMQ77MASRFKX"}}, {"Date": "on January 1, 2015", "Text": "Like these others : perfect", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CXD8MQ8O4DY5"}}, {"Date": "on March 21, 2015", "Text": "Great book! Great series!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KK5Y2FZILF7"}}, {"Date": "on April 29, 2015", "Text": "A very interesting book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GL05IWAVFB05"}}, {"Date": "on November 29, 2014", "Text": "Language was a bit rough", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GI8NH2UJUTUM"}}, {"Date": "on August 14, 2014", "Text": "Fast moving good reading", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31IGUEMCS2F08"}}, {"Date": "on April 27, 2015", "Text": "good book in the series", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APLY3U4448GZF"}}, {"Date": "on December 18, 2014", "Text": "Couldn't put it down!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XO1U93T3XFBP"}}, {"Date": "on December 17, 2014", "Text": "Outstanding series", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Z59T7I75H6XT"}}, {"Date": "on December 28, 2014", "Text": "Worth the read !!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RO54AXWHZYD"}}, {"Date": "on February 26, 2015", "Text": "Excellent series", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIRXAZHU38H2T"}}, {"Date": "on February 17, 2015", "Text": "wonderful series", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15LDYHVYWRN9Z"}}, {"Date": "on February 2, 2015", "Text": "Love the series", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21F8XWXBJ39YE"}}, {"Date": "on August 25, 2014", "Text": "excellent read", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGCZAJXZQXCU8"}}, {"Date": "on April 20, 2015", "Text": "Great book!!!", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VC0XR14MLID2"}}, {"Date": "on April 3, 2015", "Text": "Awesome book!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IKJG7VZ6NYF3"}}, {"Date": "on September 13, 2014", "Text": "Great series.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2188MH3NS4H4E"}}, {"Date": "on March 28, 2015", "Text": "Great series", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARO2WIFGQ01L7"}}, {"Date": "on March 18, 2015", "Text": "Good reading", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FVT2046UB7EX"}}, {"Date": "on March 15, 2015", "Text": "Great series", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31DZP9QD8U6H2"}}, {"Date": "on January 1, 2015", "Text": "great series", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30NQ70RAEVMIL"}}, {"Date": "on December 29, 2014", "Text": "A Must Read!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJN24XT3OYM4D"}}, {"Date": "on July 24, 2014", "Text": "Great story!", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFJY42WMXG9CF"}}, {"Date": "on April 26, 2015", "Text": "Good series", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PJYCOBGA0FD6"}}, {"Date": "on August 6, 2014", "Text": "Great read!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HV3JZQCLJI78"}}, {"Date": "on November 1, 2013", "Text": "Read all of the books in this series up to and including Escaping Home.  I was very disappointed and will not finish the series (I'm assuming there is more) because Escaping Home was so ridiculous in so many ways!  It reads like a YA book except for the language which did not bother me, but the silliness and stupidity of the adults in this book certainly did.  Parents intentionally taking their children into incredibly dangerous situations when they could have easily left them out of it! WHAT???  No parents that I know would even dream of this!  Not to mention the abusive and disrespectful ways animals and fish were treated unnecessarily by adults and children!  Enough already, no more thank you not very much A American.  This could have been a good book, but apparently the author didn't take into consideration the intellect of the reader.", "Helpfulness": 0.5714285714285714, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EZIWMHNFJIHW"}}, {"Date": "on November 17, 2014", "Text": "Loved it!!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AQE7DJZGH7HZ"}}, {"Date": "on October 16, 2014", "Text": "Good book!", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQKNME4I7D8AM"}}, {"Date": "on August 21, 2014", "Text": "Good read.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZZY70VK8X7N"}}, {"Date": "on May 9, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OE0SDZR7OQW5"}}, {"Date": "on January 1, 2014", "Text": "I have read other reviews about the bad grammar but this is on purpose to put you in character. This book is like the others in series where it gets better and better!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AV6MW8M4ETDB8"}}, {"Date": "on December 29, 2013", "Text": "I would have given this book four stars, but for the language.  This is the second book in the series and is very good reading if you can look past the language.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Y45U80H22YKB"}}, {"Date": "on November 27, 2013", "Text": "Though not quite as good as the first two books, still a great and fun read. Also not as many \"prepping\" tips as the last two, but enough to make it worth the price of the book. The great story is a bonus! If you like shtf books, then I highly recommend this series.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXSH9ZIMBY51J"}}, {"Date": "on November 24, 2013", "Text": "Way better than the first book...way worse than the second one. Things will clearly pick up again in book 4.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1L4YJKQYBKMXZ"}}, {"Date": "on November 23, 2013", "Text": "if you enjoy reading reading prepper style novels - there is no finer author and storyteller than \"A.American.\"  Well written and grounded in the potential realities of society today.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TH02J603YKS3"}}, {"Date": "on November 23, 2013", "Text": "I enjoyed this book as much as the first two. Some of the same editting errors, but no big deal.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1C9VHLQJPR4KU"}}, {"Date": "on November 22, 2013", "Text": "Excellent read! I am excited for when the fourth book comes out. I could not put this book down until I was finished.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QUAD07NAFKBN"}}, {"Date": "on November 10, 2013", "Text": "a very good story enjoyed it much thanks a American looking forward to future books keep up the good work", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZA735MQ01XIW"}}, {"Date": "on November 9, 2013", "Text": "The same good story line as the first two.  My only complaint is that book 3 is only haft as long as the first two.  I'm still waiting for book 4.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27ZZAPLQJI4A0"}}, {"Date": "on November 8, 2013", "Text": "Good read by A. American as usual, another frightening scenario of what if, and what are some of the possibilities.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EGIH22HRYH91"}}, {"Date": "on January 13, 2015", "Text": "It was ok", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZRQYVOQMEJK1"}}, {"Date": "on September 25, 2014", "Text": "Addicting", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EW1TN74191HF"}}, {"Date": "on March 19, 2015", "Text": "Love it.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3T7OPM61D4SNX"}}, {"Date": "on February 3, 2015", "Text": "thanks!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGKHN3RDI795R"}}, {"Date": "on August 6, 2014", "Text": "Great!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VB5X1PDQ81CP"}}, {"Date": "on April 20, 2015", "Text": "Good", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DHI8GQW0WLU6"}}, {"Date": "on November 9, 2013", "Text": "The book and the story are great and deserve 5 stars.  I can't wait to READ the rest of the series. HOWEVER, the narrator ruins it.  I'm just in the second half of the book and so far, I've counted SEVEN mispronunciations of places in Florida.  For example, the narrator pronounces Ocala as if it sounds like Ocola.  Wait until you hear him pronounce Alachua or Steinhatchee. There is no excuse for this.  All this lazy buffoon had to do was look up the pronunciation on the internet.  Duke Fontaine's rank incompetence ruins the experience of listening to a book with an underlying theme the self reliant rugged individualist vs. the unproductive needy collectivist with Fontaine clearly demonstrating his membership in the latter category.  If this guy worked for me, he would have been fired on the first day of the job.  Perhaps he should read Atlas Shrugged before he narrates another book.", "Helpfulness": 0.5, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1X7UP79NJE5LH"}}, {"Date": "on November 10, 2013", "Text": null, "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ITO8446FWM40"}}, {"Date": "on November 10, 2013", "Text": "This was a very good sequel to the previous 2 books.  I have very much enjoyed them, and this book tells the story of what might happen to a family who thought that everything would now be fine, after surviving to get home after a world changing event. But even after being reunited, and with the family stocked up as much as possible, the family must deal with the aftermath. Can't wait for the next one.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWNX6VX96NBH3"}}, {"Date": "on November 10, 2013", "Text": null, "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BYFRFB1475O4"}}], "ReviewUrl": "http://www.amazon.com/Escaping-Home-Novel-Survivalist-American/product-reviews/0142181293/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.5 out of 5 stars"}, "OfferPrice": "$11.99", "Salesrank": "#5,141", "ListPrice": "$15.99"}