{"Category": "in Books (", "Name": ["How to Write Science Fiction & Fantasy"], "Timestamp": "2015-05-24 23:17:21.033082", "itemurl": "http://www.amazon.com/How-Write-Science-Fiction-Fantasy/dp/158297103X", "Reviews": {"TotalReviewCount": "158", "ReviewList": [{"Date": "on March 6, 2003", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IBC9XP2LICQL"}}, {"Date": "on December 9, 1999", "Text": null, "Helpfulness": 0.9375, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9998RE3AEA95"}}, {"Date": "on March 13, 2003", "Text": null, "Helpfulness": 0.9574468085106383, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23VGBG17K5NJ3"}}, {"Date": "on September 14, 2001", "Text": "If you are familiar with Orson Scott Card's Hatrack River site, you know that there is nobody in the field of science fiction and fantasy who is more committed to helping new writers. If that is news to you then certainly his resume as a writer is well known to any one interested in writing in this field. This is one of the thinner books on writing you are going to fine and that is because Uncle Orson is extremely focused in explaining his craft. Consequently, there are but five sections to this volume in The Writer's Digest Genre Writing Series. (1) The Infinite Boundary looks at the spectrum covered by science fiction and fantasy with some attention to the distictions between the two as well. (2) World Creation details how to build, populate and dramatize your new world, including working out all the necessary elements such as history, language, geography and customs. (3) Story Construction deals with finding the right character for an idea or the right idea for a character (and do not forget about \"the MICE quotient\"). (4) Writing Well is a collection of fundamental tips, otherwise known as the \"don't do this at home\" section. (5) The Life and Business of Writing deals both generally with the business but also the specifics of science fiction and fantasy. I find his use of examples, especially when he lays out a series of variations on a theme, to be helpful because they demonstrate in practice what his theoretical points and show how many additional ideas each idea generates. Perhaps most importantly, Uncle Orson is having a conversation with you; he is neither lecturing nor pontificating. His non-fiction is as readily as his award-winning fiction, and that should come as a surprise to no one. There are other books better suited to getting into the nuts and bolts of constructing brave new worlds, but I have yet to find a better book at covering the basics than this one.", "Helpfulness": 0.8947368421052632, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NJO6YE954DBH"}}, {"Date": "on October 4, 2001", "Text": null, "Helpfulness": 0.8863636363636364, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QGRSZ7VTV0SY"}}, {"Date": "on January 18, 2006", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13DZQ0NPX855S"}}, {"Date": "on July 21, 2009", "Text": null, "Helpfulness": 0.8888888888888888, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28HO8AE8GPUIY"}}, {"Date": "on August 22, 2000", "Text": "A wonderful book!  In it, Card adresses some of the key issues addressing  writers in the speculative fiction field. In the first few pages of this  book, Card explains he does not intend this to be a book about writing, in  general.  Rather, it is a book about writing Science Fiction and Fantasy,  in particular.  Things like viewpoint, theme, etc. that writers of every  genre need to cover are not addressed.  So if the book seems lacking  in  that area, that's the reason. That said, there are some wonderful tips for  SF writers, both technical and practical, both for writing and being a  writer.  For instance, should a SF writer get an agent first, or send books  to a publisher first?  Card gives his answer, and it's different than other  genres.  Also, he explains how to use a Wise Reader to handle problems with  exposition.  Full of interesting anecdotes, useful tips, and valuable  guidelines, this has remained one of the textbooks of the field.", "Helpfulness": 0.9375, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AWYGRR0TSOEQ"}}, {"Date": "on February 28, 2005", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CZEXBX54HYWN"}}, {"Date": "on June 5, 1997", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": ""}}, {"Date": "on June 28, 2002", "Text": null, "Helpfulness": 0.7673469387755102, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A237ZAVKIOJFWX"}}, {"Date": "on February 24, 1997", "Text": "With clarity, humor, and the insight that marks him as one of the most powerful voices in contemporary science fiction and fantasy, Card provides the aspiring writer of speculative fiction an excellent framework to build upon, as he explores issues specific to this \"literature of the strange\", illustrated through clear examples taken from the works of establishes sf and fantasy authors.  HOW TO WRITE SCIENCE FICTION AND FANTASY is a well-ordered and practical guide with a personal touch, an informed and intelligent discussion of the writing process beginning with the first stages of world creation and culminating with manuscript submission procedure. Highly recommended to writers in the speculative fiction genres.  -- Hannah K. Power", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on March 11, 2000", "Text": "When I advise people on how to get published in the SF/Fantasy genre, I always recommend this book.  Generally I object to \"how-to-write\" books for a variety of reasons, but this is a book that breaks my general rule.  Card gives general sound advice with examples, lists the biggest  \"do nots\" that he's run into, sets some straight-forward methods  of submissions -- and most importantly gives some honest encouragement for  new writers.  If your book is good enough, it will get published.  The  proof is in the pudding -- I sold my very first book after reading this  one, which is, after all, the true test of books on writing.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3I8RPC1JQQ0PK"}}, {"Date": "on October 22, 2006", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NSEKQ4YHGTF3"}}, {"Date": "on April 5, 2004", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A317HSOEJ2R09V"}}, {"Date": "on July 14, 2001", "Text": "This is a great book for both beginning and experienced sf&f writers. Orson Scott Card focuses on Science fiction mostly, but showes distinct differences between the TWO genres. I would have liked a separate book for fantasy, instead of both tegether, but Card does not add Fantasy as an afterthought. He explains both in detail, and shows how to write well for both audiences. He uses a small assortment of books as examples, including J.R.R. Tolkein's \"The Lord of the Rings\", and Octavia Butler's \"Wild Seed.\" Over all I would definitely recommend this book to writers of either genre.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MG5O7P019FLT"}}, {"Date": "on July 19, 2005", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12DP14GPRZF7E"}}, {"Date": "on June 3, 2004", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27IT5ISRTCJEC"}}, {"Date": "on July 30, 2004", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33IRCG12HK9QT"}}, {"Date": "on February 9, 2005", "Text": "...you must read this. This short book was actually a pleasant surprise to me. While reading it I felt as if I was talking to Card one on one. The book provides very valuable advice on writing, ideas, and tips on how to break into the field. This book was more than I expected, because it offers more than tips on how to write...it gives you an insight to Card's mind and his creative process. Which hopefully will provide you with assurance that you are on the right path, and the motivation to pursue it.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGL0OGC78PYB0"}}, {"Date": "on December 27, 2008", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13SG9ACZ9O5IM"}}, {"Date": "on June 13, 2005", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LVYWIBSWO9KN"}}, {"Date": "on August 6, 2005", "Text": null, "Helpfulness": 0.8571428571428571, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26BWRBPP4V2WF"}}, {"Date": "on September 14, 2007", "Text": "I liked much that this book had to offer for the beginning writer of speculative fiction.  I appreciated the sections on building worlds and on writing well.  I also gained a lot of practical advice in the last section, about the \"nuts and bolts\" of being a writer.  However, there were times that my mind drifted while reading.  The book also leaned towards science fiction and, since I prefer writing fantasy, I found myself longing for more specific info in that arena.  All in all, this was a very solid choice in beginning my journey as a fiction writer.  I gleaned nuggets that I can use right now in preparations.  However, the book was not earth-shattering or life-changing.  A good but not great resource.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARS6CC3LW7ZHX"}}, {"Date": "on April 2, 1998", "Text": "Orson Scott Card is an amazing individual; he taught me to judge writing, develop storylines, make characters more real than reality and gave more information than any writing course ever could. His simple descriptions and instructions on how to develop ideas, characters and plots are as insightful as any writer can hope to find. This book is probably all anyone will ever need; it is complete, thorough and easily understood. I never put the book down while I was reading, and afterward never had to refer to any more instructional material. For any writer of any genre, even beyond science fiction or fantasy, this book is a must.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24AVGOZMAGSK2"}}, {"Date": "on August 12, 2004", "Text": "This is a good book for a high school level or above who want to get into the \"mainstream\" sci-fi writing scene.  Card doesn't delve much into the fantasy genre because, as he states clearly in the first few pages, he's mainly a sci-fi writer.  It contains a few tips and tricks that will be useful.  However, it's a bit outdated in some of the views (it was written almost 15 years ago) and the genres have changed a bit, especially with the advent of Harry Potter.  But again, it's allright IF your just starting to get interested in writing.", "Helpfulness": 0.8181818181818182, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1H1RFMNLKT3GO"}}, {"Date": "on November 6, 1997", "Text": "If you've ever read any of Orson Scott Card's fiction, you'll understand why he's the perfect author to teach others how to write.  Card is a writer's writer, a master at what he does, a person you know without a doubt is giving you good advice.  Toss out anything else you've got on your bookshelf about writing and replace it with this one.  It's all you'll need, besides maybe his \"Characters and Viewpoint\"", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A138J8GXMSJ152"}}, {"Date": "on December 16, 2001", "Text": "This book is simply wonderful.  I teach writing everyday and I was able to take advice from this book and use it immediately in my classroom.  Not only does Card do a masterful job of explaining how to construct a story, but he also discusses some of the harder aspects of writing such as character development, writing exposition, and determining where a story should begin and end.  Card also emphasizes the importance of creating the rules of Time, Space, and Magic for your world and following them, a rule that many writes often forget.  Most importantly though, Card reveals all this useful information in a way that makes it easy to understand, so that you can start using it immediatly.", "Helpfulness": 0.8, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22YQ4W1MFXQCS"}}, {"Date": "on May 7, 2012", "Text": null, "Helpfulness": 0.8333333333333334, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VDI1GQKNVA7U"}}, {"Date": "on June 1, 1999", "Text": null, "Helpfulness": 0.8333333333333334, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on May 1, 2002", "Text": null, "Helpfulness": 0.8333333333333334, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A171DD54AY8N0Z"}}, {"Date": "on January 15, 2008", "Text": null, "Helpfulness": 0.7368421052631579, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26ZJ2KJP8FNL6"}}, {"Date": "on November 19, 1999", "Text": "Great book!  Card really shows how to go about it.  He shows some rules for space travel that I never thought of, but really make sense.  He really is easy to understand, and the book was just what I was looking for.  Plus,  he tells about how to go around seeking to be published as a sci-fi or  fantasy author! Great book! I think everyone aspiring to be a sci-fi or  fantasy writer read this book.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on August 20, 2001", "Text": "The principles that \"Uncle Orson\" covers in this smart little book will benefit fiction writers of any genre. I recommend it to students in my writer's workshops. I found the book helpful in writing my first novel, \"Ember From the Sun\" (which ended up a big success). Naturally, I'm grateful for Orson Scott Card's good advice. I'll be teaching a Science Fiction Writing class at Florida State University in January 2002, and I will require this book, plus another excellent book by OSC, \"Characters and Viewpoint.\"", "Helpfulness": 0.8333333333333334, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UR6NQQ38HZ2H"}}, {"Date": "on January 20, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32YDTH8HJ7UW2"}}, {"Date": "on February 15, 2005", "Text": "The power of this book lies, not in the actual facts listed, but in the way Card connects and organizes those facts.  Card sticks to the basics, as well he should: they are the fundemental building block of good speculative fiction, and I suspect even professionals constantly strive to improve in these areas.  Card's talent lies in his ability to cast these basic concepts in a new light, showing how they connect to each other and to the story as a whole.  This book has brought my writing to a new level.", "Helpfulness": 0.8333333333333334, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A115QIN2RXDOME"}}, {"Date": "on December 26, 2002", "Text": "If you are trying to write about science fiction, this is an average book. I am an aspiring fantasy writer and was duped by the title. The meager fantasy entries do not constitute adding the word \"Fantasy\" to the cover. I also got a bit annoyed with the flow of ideas; every line is based on how the author came up with ideas and each suggestion stemmed directly from something he had wrote. The book read more like a promotional book than a How-To. I was left more stifled than inspired. To this date, the best book on writing I have ever read is \"If You Can Talk, You Can Write\" (Joel Saltzman) and I recommend it for all genres of aspiring writers.", "Helpfulness": 0.7368421052631579, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VBT4LZP1MYFN"}}, {"Date": "on February 7, 2006", "Text": "I was amazed when I first started reading this book. As a relatively novice writer, I felt the book helped me understand a lot more about writing certain kinds of fantasy novels, and taught me a general overview on how to make a living doing so. Card is a worthwhile author and this book is an indispensible guide for ANY fantasy writer.", "Helpfulness": 0.8333333333333334, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GVKYR8W5FQNH"}}, {"Date": "on August 16, 2003", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A377XX0HOFJ7NV"}}, {"Date": "on June 30, 1999", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on November 12, 2009", "Text": "There are people whose absolute goal in life is to produce a great story that is unlike anything ever seen before. They devote their lives to the pursuit of writing knowledge and memorize anything that could help them improve the quality of their work. For those of you who have recently set this goal, Orson Scott Card answers some of the questions that you will have. I can only say that this book was, at least for me, completely worth the 137 pages and I urge aspiring writers to read this along with his other useful book, Character and Viewpoint.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32UOU6DA2LKRS"}}, {"Date": "on June 23, 2006", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AWB3WBOCP2EL"}}, {"Date": "on June 16, 2000", "Text": "Even if you are not planning on writing science fiction or fantasy today, this book is worth your time if you are 1) interested in Orson Scott Card and how he gets and develops his ideas, and what he likes to read, or 2)  you are interested in writing of any kind, even non-fiction. If you have  even a fleeting interest in any of these subjects, Card will tell you more  in a little book than almost anyone else in a very big book.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CDUZR8QHT7IG"}}, {"Date": "on August 9, 2001", "Text": "This book allowed me to write some of the best books I had ever hoped for. It gives (in detail) how to write an Ender's Game quality book. I had trouble getting of the first page of my writitng. Now thanks to Orson Scott Card I can write excellent stories and give me a basis for setting and feeling. If you want to have good writing that is intelligent and powerful I urge you to buy this book!!", "Helpfulness": 0.8, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TGH4C1J0LTNV"}}, {"Date": "on April 1, 2006", "Text": null, "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PWT1Q78CSAY5"}}, {"Date": "on January 13, 2011", "Text": "This book is a great complement to Stephen King's On Writing book for any aspiring writer, especially sci fi and fantasy writers. Both books are upbeat, useful, and entertaining reads with lots of gems from two great writers. Card's book is more straightforward about the steps to take when writing any book and covers more ground on the topic of how to write, whereas King's book is half autobiography (about becoming a writer, himself), funnier, and more specific to King's personal experience (Card, probably because he teaches, does a better job of synthesizing and drawing upon many references to other authors/books). Both authors agree that it is important to let ideas evolve, let the story tell itself through the characters, be as honest as possible, and to not hold on too tight to the original idea at the expense of ignoring a more interesting story that reveals itself as you follow the characters around in the world you created. There's not much overlap between the two books (making their common themes all the more powerful), so I think together they are a great package for the aspiring writer. I also do not see much reason to spend time reading more than a couple \"how to write\" books when every successful author says the two most important things are 1) Write a lot and 2) Read a lot (not \"how to\" books, but in your genre of interest, the Classics, and whatever lights your fire beyond that). Read these two books, be highly entertained and motivated, and get out there and make the magic happen!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OBSOQGE7CPMB"}}, {"Date": "on June 10, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3R9HPQUZOPEH1"}}, {"Date": "on June 1, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HRSFGAIBOVZ7"}}, {"Date": "on January 6, 2002", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Y2QC1SW1YBOI"}}, {"Date": "on June 28, 2011", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AF8TCT48DZNQU"}}, {"Date": "on April 6, 1999", "Text": "I have no desire to ever write science fiction or fantasy, but this book is still a great read.  Very entertaining and informative.  It definitely made me a better reader of all types of fiction.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22Y48B30FNDFL"}}, {"Date": "on November 2, 2009", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22DOEJOO0RAAC"}}, {"Date": "on May 10, 2008", "Text": null, "Helpfulness": 0.7, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BBNGX63YG7PE"}}, {"Date": "on August 11, 2002", "Text": null, "Helpfulness": 0.7142857142857143, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PXUPVH1NJ06Q"}}, {"Date": "on December 1, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AK9E1RK1ID5X5"}}, {"Date": "on October 30, 2010", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A472RYQU4DG0C"}}, {"Date": "on November 24, 2003", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DV7WIFKVBX7S"}}, {"Date": "on February 19, 2009", "Text": "The author is engaging, funny, and thoughtful.  I get the impression that he truly wants you to write well and gives us a good foothold to get there in the crazy world(s) of science fiction.  His humor is spread out over the book and keeps the text lively.  I didn't think I was going to read the end of the book on the nuts and bolts of publishing but he had me in his grips and I read on.  It was good information or so I hope and at least it gives me some idea of what is ahead.  I recommend this book to you.  It was published in 1990, but it is still wonderfully relevant and I hope you find it so too.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZGZEHGSFDX2F"}}, {"Date": "on June 26, 2003", "Text": null, "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3F3B6HY9RJI04"}}, {"Date": "on June 26, 2009", "Text": "This was a great book written by a very respected author from within the science fiction community.  Most of the writing techniques could be gathered from other instructional books, but Card does an excellent job demonstrating and applying them in the realms of science fiction and fantasy.  This book is a must read for any aspiring science fiction or fantasy author.  The last chapter is a very practical guide to up and coming authors about the realities of the business.  I highly recommend.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A91ACGW028V7L"}}, {"Date": "on February 20, 2001", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QTD8TWZVA66Q"}}, {"Date": "on July 25, 2007", "Text": "Having taken a number of fiction-writing classes, I thought that the most valuable part of this book was that it discusses the ways in which writing a good fantasy novel or sci-fi novel is not the same as writing non-genre fiction.  Past workshops have given me plenty of information on character-building and similar standard elements of fiction, but it was really helpful to have someone articulate the special concerns needing attention in the realm of fantasy.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3M0S3W6TBSO4X"}}, {"Date": "on February 4, 2003", "Text": "Card is a master.  This book will not make you a master of SF like he is, but it will make you a SF writer.  Every time I get discouraged (rejections, writers block, etc,) I read a bit of this book to remind me what I should be doing and inspire my drive again.  It is not the greatest resource in the world for people wanting to be published; it is a resource for those who want to tell a story and tell it well enough to be published (even if it never is).", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WNJAXO4H2NYB"}}, {"Date": "on May 19, 2000", "Text": null, "Helpfulness": 0.75, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39CNREDARERNY"}}, {"Date": "on July 3, 1999", "Text": "I picked this book up by chance, as I have been a long time fan of Mr. Card's work. This book has been exceptionally helpful in my own work. It covers concepts writers from all genres can appreciate, and was  entertaining to boot. I strongly recommend this title.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on July 17, 2010", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26R76G39JCHGN"}}, {"Date": "on October 7, 2007", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35X2JJI49OBZP"}}, {"Date": "on December 22, 2012", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UBJK9NLP14OI"}}, {"Date": "on October 1, 1999", "Text": "Orson Scott Card is a master story teller, quite possibly the best in his field.  In this book he imparts expert wisdom and advise.  It's a bit lacking concrete \"how to\" info, but that's the best part.  A must  read.", "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on December 19, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I8YXG2FOE90K"}}, {"Date": "on December 28, 2001", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AL4WDW6ZVT2KA"}}, {"Date": "on August 10, 2006", "Text": "Orson S. Card provides a great over view of the writing process while keeping it specifically to speculative fiction. Easy to understand, easy to follow.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3B5O87E15PVLK"}}, {"Date": "on March 3, 2008", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUAJWQBGCYUYQ"}}, {"Date": "on January 22, 2015", "Text": null, "Helpfulness": "", "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HUXWG41AOY0A"}}, {"Date": "on February 18, 2012", "Text": "I've dealt with a lot of would be writers, mostly young people. They all love F&SF; and dive right in, as have I myself. Wish I'd bought this book sooner. Mr. Card does an excellent job explaining the differences between the genres. He also presents what needs to be done and/or decided before ever putting pen to paper (finger to key). That part was the most enlightening part of the book. As they say, the devil is in the details. Mr. Card is convincing in his reasons and examples. Everyone who thinks they might like to write F&SF; absolutely needs to read this book. Although the world of publishing is changing and therefore the last chapter may be dated in some aspects, its advice to the new writer will always be pertinent. I also must say that reading this non-fiction book was in no way difficult or boring. Mr. Card used many examples throughout that helped bring the concepts he was \"teaching\" into focus and they were all entertaining.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UDLXDR9U9G36"}}, {"Date": "on May 3, 2015", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21DB2Q5KBOTM7"}}, {"Date": "on January 23, 2008", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Z7QBQ88KT0F3"}}, {"Date": "on June 16, 2005", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KBTN1S1DWS2R"}}, {"Date": "on January 11, 2009", "Text": "I have always been a big fan of Orson Scott Card. When I saw this book in the store, I knew that it would be useful. Mr. Card is a wonderful writer and definitely has enough experience to write a book telling others how to write. This book gives many useful tips on how to create worlds and define characters. In addition to this, it gives many unique pieces of advice that specifically involve the Science Fiction and Fantasy genres. While some of the information on how to be published may be out of date by now (and Orson mentions in that chapter that it will become out of date) the bulk of this book is still very useful. So, if you are interested in learning how to write Science Fiction and Fantasy, this is an excellent reference for you to use. You will certainly learn many useful things from this book and your writing will improve.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WJ6Y2KOXJ6FD"}}, {"Date": "on December 24, 2014", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BF4O2152KL8R"}}, {"Date": "on August 17, 2000", "Text": "This is an excellent book for someone just getting started in the genre. His do's and dont's are indespensible (even as a refresher course for the  advanced) though his examples are opinionated and dry. But because this is  a book about HOW to write and not why we write, the most valuable  information he shares is the art of conveying the most in as few words as  possible. The masters of fantasy/Sci-Fi know how to accomplish this with  dynamisim and grace. If this is what you want to learn, or you just want a  refresher, then by all means buy the book but do not rely on it as your  sole source of information.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": ""}}, {"Date": "on January 4, 2015", "Text": "Orson Scott Card delivers in this close up look on how Science Fiction and Fantasy stories work. He also gives an in-depth look at the publishing industry, how to get published, and when you need an agent. His insights are valuable to both new writers and experienced ones. However, keep in mind this book steers more towards Science Fiction then Fantasy ( probably because the market is bigger for Science Fiction). Also there are many aspects (such as writing a multiple Point of View novel) which he doesn't cover. Nonetheless, this is a good introduction for anyone seeking to write in either of these genres.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QIK5U8WI99CD"}}, {"Date": "on January 2, 2014", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WJ29CGRXL3ZP"}}, {"Date": "on October 19, 2011", "Text": "This is a nice book that didn't tell me anything I wasn't already aware of. I had gotten it for ideas and suggestions of markets and he spends about 10 pages on that and even then I didn't find out anything I couldn't have (and already hadn't found out) on the internet. The rest of the 140 is on his perspective of what the elements of good storycraft are within the confines of speculative fiction. If you have little or no experience with the speculative fiction genres (science fiction and fantasy and their associated sub-genres) then this is probably good reading, if not required reading.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YAIZGPLGFYCM"}}, {"Date": "on July 9, 2011", "Text": "The small font of text makes the book difficult to read, a kindle version would be nice, especially for those of us who have had a few life experiences.  Yet, the book itself is an invaluable resource, countless tips on how to write fantasy and fiction.  For example, the author provides the audience with tools to create a world, rules that will allow you to create your art.  As a result, you will be able to construct your story-main character, protagonist, and view point.  Finally, the author give an overview of a writer's life, he gives you a dose of reality too.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYB19RB36GLZL"}}, {"Date": "on October 28, 2012", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MJX7RUQQRT03"}}, {"Date": "on December 2, 2012", "Text": "I purchased this book as a Christmas present for my son who is a college freshman and an aspiring writer. Since I had time I thought I would go ahead and read it myself. My son is quite a Olsen Scott Card fan, as am I. I found the book very easy to read and rather than the feeling of a college professor lecturing a student on the fundamentals of writing SF, it felt much more like a close friend was giving friendly advise on how to succeed in being an author. I am very pleased with the book as I am sure that my son will be.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DWGL0EEUX6IH"}}, {"Date": "on October 12, 2005", "Text": "Though it won a Hugo, a lot of the information that Orson Scott Card provides offered in even the smallest of writing courses. The one stand-out in this book is Chapter 2: World Creation, as it details great ways of creating that fictional world for your characters roam. Not the best, though. Worlds of Wonder by David Gerrold is much better.", "Helpfulness": 0.6666666666666666, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29Y34ALWJUGB5"}}, {"Date": "on April 6, 2015", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28560CICZW9IY"}}, {"Date": "on August 11, 2012", "Text": "Card has some good advice here. I especially appreciate the section on structuring the story, and finishing the story you begin. I've been able to look at a lot of book that left me with a \"meh\" feeling now, and I understand completely where the feeling came from. The author finished something other than the story I was promised in the beginning. I need time to reflect on the \"MICE\" breakdown, but it seems right offhand.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29R1BCP6EC90M"}}, {"Date": "on September 27, 1999", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17YG60BK1FKGC"}}, {"Date": "on July 7, 1998", "Text": "Orson Scott Card tackles many sides of writing, and not just of Science Fiction or Fantasy. He is an admirable writer, both of fiction and writing books. You can read this book with half a mind, and get ideas which will soon devellop into stories, or you can read it with all your attention, and learn more of the craft of writing. A very good buy. I really enjoyed reading it several times.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LDQMLEWWC8VI"}}, {"Date": "on March 21, 2015", "Text": "I thought I had good ideas for my stories, but after reading this book, I am challenged to make my ideas even better.  The style is conversational and motivating.  I learned things about the world of writers that I didn't know I needed to know!  The Kindle version of this book has quite a few typographical errors, which I'm guessing are not found in print editions.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6JC8N1DGCA62"}}, {"Date": "on April 13, 2012", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LVVTL4XBSZRT"}}, {"Date": "on December 18, 2011", "Text": "This is the first book I have read on how to write. I bought it because I like Card's books and I want to write someday. I really, really enjoyed the book because you get a view into a writer's mind and tips from his extensive experience. He also talks about writers that have influenced him and some I had never heard of before.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AL0PUFZBBTHR1"}}, {"Date": "on September 13, 2009", "Text": "I haven't writen a science fiction fantasy book, but I have read a lot.  I liked this book because it aloud me to see into the writing process of the books I read.  I can at least pretend that I know what my favorite authors went through to come up with thier ideas and pen a good story.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AU1LQ4UGFTNAW"}}, {"Date": "on March 25, 2015", "Text": "I really enjoyed this book since I'm writing my first Sci-Fi novel. I've written several books already but they'll either teach you a lot or put you to sleep. Unfortunately, they belong to Universities and companies so this would be my first. If you want to write Sci-Fi read this book!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BNKQLRTR0K0G"}}, {"Date": "on April 27, 1999", "Text": "I found this book helpful in writing fantasy.  I did sense that the book focused more on science fiction and the various ways to write sci-fi.  Card has a concise and direct way of writing.  The reader has a clear picture of  what Card is conveying.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FMKJJZOZU6N2"}}, {"Date": "on May 2, 2001", "Text": "I'm trying to turn myself into a writer.  I have eight 'how to write' books on my desk.  This is the one I refer to most often for practical advice and information.  Card's other 'How to' book on characters and viewpoint is also excellent.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LY49PRX4MNL1"}}, {"Date": "on December 12, 2012", "Text": "Who else could teach about the elements needed to create realistic sci-fi and fantasy but  Card? The master of the genres reveals his tips and tricks to writing believable worlds, technology, and storylines in this amazing book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HHRL2NEC1NZ2"}}, {"Date": "on December 5, 2012", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37U8VBMBJIET9"}}, {"Date": "on March 7, 2015", "Text": "The title is not accurate. Pretty much the whole book is on writing sci fi...fantasy? It has a very dim view of fantasy. Do not buy if you want to get tips on writing fantasy!", "Helpfulness": "", "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AM51C5F3H6KC6"}}, {"Date": "on April 11, 2007", "Text": null, "Helpfulness": 0.6, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGVX5YTSZY9DB"}}, {"Date": "on September 20, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YIZRKBISY22P"}}, {"Date": "on August 4, 2005", "Text": null, "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33F67OBXJVBTT"}}, {"Date": "on January 20, 2013", "Text": "A helpful book for writing Science Fiction. Good ideas and suggestions. Clearly outlined and written.  A must if you are starting to write.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MPV60NCT8ZI3"}}, {"Date": "on December 27, 2001", "Text": null, "Helpfulness": 0.625, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2H518HZR6LURU"}}, {"Date": "on March 30, 2015", "Text": "Great points. Easy ready and mostly inspiring :D  I had to go back and reread Ender's Game for the third time :D", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A77UNZW1PCBGR"}}, {"Date": "on July 28, 2004", "Text": "I have read this book several times, and it offers excellent advice to science fiction and fantasy writers.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on May 15, 2004", "Text": "This is a great book by Orson Scott Card, one of the masters of the genre of science fiction and fantasy.  My only complaint is that the 2001 addition, which I do not own is not listed as a revised edition.  Many New authors and books, have appeared since and this book could appear to be dated information, since it was first published in 1990. and a lot has happened in science fiction and fantasy in 14 years!  He does not even mention the internet as a resource to writers in this book, that makes it seem ancient info.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1G892J7BSX2UO"}}, {"Date": "on March 30, 2013", "Text": "still applicable and a read worth every page!! Perfect for the aspiring scifi/fantasy author (amateur and professional). I learned so much from this book. It's a perfect length for it's purpose. You shouldn't expect to be able to write the perfect novel after reading just this guide, but you can expect to be pointed in the right direction.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AP0CRCOOBUNJ"}}, {"Date": "on March 18, 2014", "Text": "Very useful, even just for understanding the structure of stories and how to begin and end them, etc. It wound up being helpful even in analysing other books in my classes at the time that I read it. I've wound up teaching the MICE structure to my own students.", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NACX7AK29SF6"}}, {"Date": "on February 10, 2010", "Text": null, "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36FK0RBM117HX"}}, {"Date": "on August 25, 2000", "Text": null, "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZJV6BZ0MOQLS"}}, {"Date": "on June 25, 2007", "Text": "If you've never written Sci-fi and DON'T know the market it's 5 star, even though its print date is a little old. It's a start. I'm not all the way through the book and so far most of what's discussed I already knew--through my own research.", "Helpfulness": 0.5, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MZSGDMBD5YR9"}}, {"Date": "on January 19, 2010", "Text": null, "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HNFI34RIL4RS"}}, {"Date": "on June 14, 2004", "Text": "I just finished reading the old hardback edition published in 1990.  I'm sure the new edition is as good or even better.  Much of Card's advice applies to any fiction writing - not just SF/F.  Read and learn.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8W7LYX12H3LZ"}}, {"Date": "on May 13, 2015", "Text": "Now I understand why I love SF & Fantasy!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AODZ3KKJR8PH3"}}, {"Date": "on February 20, 2015", "Text": "Very informative. Helped me a lot.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKQ7WWHP6Z2P2"}}, {"Date": "on July 1, 2010", "Text": null, "Helpfulness": 0.5833333333333334, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LC9RX8T4Z8RJ"}}, {"Date": "on November 22, 2004", "Text": "My friends commented after reading this book that the quality of my writing significantly improved. I highly recomend it.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BJZZMJE4L3I8"}}, {"Date": "on June 8, 2011", "Text": "I love this book!  He is an excellent author and he includes great examples.  It is very helpful and a pleasure to read!", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39CQ87LO2FZJF"}}, {"Date": "on October 22, 2014", "Text": "Overall, I didn't find this book extremely helpful. I don't know if it was because I have been writing fantasy for about 6 or 7 years, but I think you can learn more from writing a book in your specified genre than reading about writing one. Everything Card said in this book I already knew (or was so outdated, that it almost didn't matter anymore). The only thing that I found helpful was the final chapter on the publishing industry. That was the only reason I gave this book 3 stars. It was so helpful that it was worth reading all the other slightly unhelpful ramblings in order to get to the last chapter.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SQCZRY59MM8U"}}, {"Date": "on December 29, 2004", "Text": "Mr. Card has focused on writing science fiction well.  However, the book is as much about writing well as it is about writing science fiction.  I don't write science fiction, but I enjoyed and learned from this book.  Thank you Mr. Card.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CKMAI6TGUJGP"}}, {"Date": "on March 16, 2014", "Text": "An okay book but it did not give me anything new that I had not already learned in creative science fiction and fantasy writing class. This book has nothing wrong with it and would be a good addition to anyone wanting to write the kind of novel it talks about. But you still have to take the university/college class to learn how to do it. But that was just the case for me. Someone else might be different.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3E7VFQZCTXMEH"}}, {"Date": "on May 6, 2013", "Text": "As has already been said in many other reviews this is a great book to get you started. There were quite a few things that I hadn't really considered or had thought out to the  degree that I should. Overall a great book but some of it is out of date, Card even admits that because the business side of writing changes.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GVFNK9W948D2"}}, {"Date": "on October 7, 2013", "Text": "My only gripe has nothing to do with the book---it was written some twenty years ago, so obviously Card's advice about the writing industry is really outdated.  However, this is an absolute must-read for anyone who wants to write sifi or fantasy.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQRMVH30GPMUF"}}, {"Date": "on February 28, 2013", "Text": "It's not often that a famous and successful author takes the time to share such wonderful tips with aspiring authors.  Finding success in this field (or fields) is no easy task, but I have to believe that Card's book increases the odds.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AL0K653B6DKB8"}}, {"Date": "on March 3, 2014", "Text": "I'm working on my first fiction (YA novel) and Card packed this little book full of good stuff for the beginning sci fi writer. Read it with a pen, highlighter and page markers at hand, you'll want to refer back to this as you go.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A339944LNIZ0CC"}}, {"Date": "on December 21, 2013", "Text": "This book was priced very reasonably and delivery was prompt. I really enjoyed this book as it was very useful in my research and will be sitting in the reference section for years to come", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEETC8X7UU12R"}}, {"Date": "on September 2, 2013", "Text": "This was a great help to me in breaking down the different sections of science fiction and fantasy and how to use these ideas to come up with your own. Its a great foundation to work from.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PWE6VVQBNZHM"}}, {"Date": "on November 6, 2013", "Text": "Orson Scott Card makes you want to write great Science Fiction stories.  His blueprint for plot, culture developement and character depth make this book one of my top 5.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IJEY1QXZ295G"}}, {"Date": "on July 15, 2013", "Text": "This book was really helpful.  It brought up a lot of really important issues and I felt like I learned a lot.  It's my go-to manual for scifi writing.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APD7B37EZHPXY"}}, {"Date": "on September 28, 2014", "Text": "Great reference and gave me lots to think about.  More importantly I was inspired to write more (and better) after reading this relatively short book.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LD2G05AJWFID"}}, {"Date": "on November 23, 2013", "Text": "I needed information on writing a science fiction novel.  This book contained that information. I recommend Mr. Card's book for beginners like myself.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A137MGFBFN9NUR"}}, {"Date": "on December 13, 2013", "Text": "This book was bought for a class and gives some useful information on how to write sci/fi and fantasy which I would expect nothing less considering.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NJBFCXMHY674"}}, {"Date": "on June 5, 2013", "Text": "It was good to read about the business from that side. Offers insight and clarity while giving some direction for your own project.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18BYT7DXI4VHT"}}, {"Date": "on October 8, 2013", "Text": "This guy can really write.  He's a magician showing you his tricks.  Read this and then read Ender's Game.  Makes a nice epiphany.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOJXNTNPSPB2T"}}, {"Date": "on January 31, 2014", "Text": "great gift for someone who has been thinking to put pen to paper and can't quite get started...basic and simple guidelines!!", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7B82RUMJ3U3"}}, {"Date": "on January 11, 2007", "Text": "This is a great book.  It is simple enough that anyone can understand it, but it doesn't talk down to you.  I've been writing for awhile, and there were some things in there I just hadn't thought I needed to sit down and do before starting the story.  The advice works - and your stories will be stronger for it.  Anyone interested in writing Science Fiction or Fantasy should have this book in their library.", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YFGWOCI0N18V"}}, {"Date": "on March 22, 1999", "Text": "All writers of Speculative Fiction must read this book", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KZV2Z14P7TSU"}}, {"Date": "on September 26, 2014", "Text": "Good book delivered quickly.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JA8IZFTDBELE"}}, {"Date": "on September 9, 2014", "Text": "Good world building tool", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TT2BJF7U080L"}}, {"Date": "on March 11, 2004", "Text": "Though, it had some good advice for beginning writers, I felt that it didn't delve deep enough into writing science fiction & fanasty.  It didn't contain any advice that I couldn't find online for free.", "Helpfulness": 0.5, "StarRating": "2", "Author": {"ProfileUrl": ""}}, {"Date": "on July 30, 2011", "Text": "What this book has showed me is i have a lot to go if i want to be a sussessful writer. its hepled to know how to organize my writing better than i was. it also helped with knowing how differnt writing SF&F; really is than any other novel writing.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JX9E5W914I1O"}}, {"Date": "on June 6, 2011", "Text": "The title of this book should omit the \"& Fantasy\" part. It seems to me that the book was originally aimed at science fiction writers, but the writer thought the audience can be broadened by adding fantasy writers. I like fantasy and I want to write fantasy, but I am not particularly interested in science fiction. The reason I bought the book is because I thought it was going to have a reasonable treatment of how to write FANTASY, and in what I have read so far (and what I have browsed in advance) that topic is covered so little that the book should not be directed at aspiring fantasy writers at all. If you are an aspiring science fiction writer you may like the book, otherwise probably you will feel cheated.", "Helpfulness": 0.3333333333333333, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AB5VKPZ5GQJKA"}}, {"Date": "on June 26, 2004", "Text": "I can only presume that Card sees a lot of really terrible stories at writing workshops. While the advice in this book is great, it's also all very basic, and most of it should be obvious to people who have read a significant amount of fiction. I would recommend this book only for extremely inexperienced authors who haven't yet learned the basics of good writing.", "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CFFK6MC7RHAQ"}}, {"Date": "on December 17, 2002", "Text": "This book is no different than most of the other \"How to\" books dealing with SF&F.  Most of what is written is dealing with SF than Fantasy.  If your trying to write Fantasy, you would be better off looking somewhere else.", "Helpfulness": 0.46153846153846156, "StarRating": "2", "Author": {"ProfileUrl": ""}}, {"Date": "on November 11, 2013", "Text": null, "Helpfulness": 0.2, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1F5B1UQFE8QE0"}}, {"Date": "on August 31, 2009", "Text": "If you have the intention of becoming a serious writer in the sciene fiction genre, this is a must have, must read book from one of the masters of science fiction.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EY462X8RFS5P"}}, {"Date": "on June 29, 1999", "Text": "I found the book fun to read, but I must say that in retrospect it is not helpful. Most of it  consists of anecdotes about his personal  experiences and his personal life... interesting for fans, but not really helpful for  the aspiring writer.", "Helpfulness": 0.2857142857142857, "StarRating": "2", "Author": {"ProfileUrl": ""}}, {"Date": "on February 7, 2005", "Text": null, "Helpfulness": 0.25, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PXXCE7MDBDI4"}}, {"Date": "on August 14, 2005", "Text": null, "Helpfulness": 0.2727272727272727, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38N7SFDOB3MR3"}}, {"Date": "on May 12, 2012", "Text": "The cover of the book I got is different. It has no image on it - just plain text of the title and author. Don't really care about that though since the actual contents of the book looks fine.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OGJU0BR1HEPP"}}, {"Date": "on November 29, 1999", "Text": "The book is informative.  I like most of it.  However, it does seem to knock a few science fiction genres such as Star Trek.  It seems that the author is biased against this.  I can understand it.  It does not seem that  he keeps up with science.  He does not like the \"ansible\" when  there is some proof that it may be possible.  A little closed minded.  His  books are okay.  He seems to be inspired by the book of Mormon in his  writing.  But a compettemt writer.", "Helpfulness": 0.21052631578947367, "StarRating": "3", "Author": {"ProfileUrl": ""}}, {"Date": "on April 27, 1999", "Text": "Books like this are almost self-parodying. 'How to Paint a Mona Lisa', 'How to Play Like Yo-Yo Ma', etc. All this book did is show that sci-fi writers are going thru such lean times that they can make more money  selling how-to books than doing their 'thing'. Seriously, would a real pro  in a crowded market sell his secrets for success for a few bucks, hoping to  create his own competition? Not likely. Writing great lit. takes a  dedication to art that makes this slim how-to volume seem like an insult,  sorry. If he had titled it 'How I Write Sci-Fi/Fantasy\", it might have  been more honest; but not really, precisely because he's hiding his 'best  secrets' to keep you from topping him.  Think for yourself.", "Helpfulness": 0.17647058823529413, "StarRating": "2", "Author": {"ProfileUrl": ""}}, {"Date": "on May 13, 2007", "Text": "I began reading \"How to Write SF & F\" with high hopes, which were ultimately dashed.  This man has no business writing a how-to guide.  In fact, he gives the worst advice on agents and publishers I have ever heard.  If you are seriously interested in writing sf or fantasy (i.e. you write sf/f whether or not you are paid), please save yourself the few hours it will take you to read this and spend it writing instead.  There is more useful information on the many websites on this topic than Card gives in this book; most of it is regurgitated in watered-down form from the many excellent writing guides on the market.  Though I think the idea in his style is to portray himself as wise and all-knowing, he just comes off as arrogant and pompous.  There are probably only a few chapters of actual meat in this book and the rest is filled with stories about the struggles of the unrecognized writer to support his family, his long-suffering wife (who he mentions as a side note had a miscarriage and he carted her off to her mother's so he could write in peace), and of course shameless name-dropping-- including constantly mentioning other books he's written.  It took me a whopping two-and-a-half hours to read this \"guide\", at the end of which I was left feeling empty and annoyed.  Card is a hack that has somehow been allowed to continue to write through some strange miracle of publishing.  My granny has more talent in her bunion.", "Helpfulness": 0.34285714285714286, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2H5R2NN27SIGY"}}, {"Date": "on March 7, 2013", "Text": null, "Helpfulness": 0.023809523809523808, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15YIYB4YTBAUU"}}], "ReviewUrl": "http://www.amazon.com/How-Write-Science-Fiction-Fantasy/product-reviews/158297103X/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.2 out of 5 stars"}, "OfferPrice": "$11.96", "Salesrank": "#87,490", "ListPrice": "$14.99"}