{"Category": "in Books (", "Name": ["The Death: A Post Apocalyptic Novel"], "Timestamp": "2015-05-24 23:15:53.907142", "itemurl": "http://www.amazon.com/Death-Post-Apocalyptic-Novel/dp/1500717320", "Reviews": {"TotalReviewCount": "118", "ReviewList": [{"Date": "on October 2, 2014", "Text": "Riveting!  A real page turner, particularly with today's world events and potential global pandemic.  Vance nails it with a thrilling, heart pounding ride that will keep you up at night turning pages and wondering if this is more truth than fiction.  Tremendously promising start for this new author!", "Helpfulness": 0.7857142857142857, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CCWBZU88B3IO"}}, {"Date": "on October 2, 2014", "Text": null, "Helpfulness": 0.8333333333333334, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2G5IFYYHFIQNB"}}, {"Date": "on February 28, 2015", "Text": "Fast paced, exciting, could not put book down.  From the moment Cassidy is on the plane, the author takes us through numerous lives who are connected with her but still trying to put all the pieces together.  Devin appears weak at first but when he needs to step up he takes charge trying to help get free a boy from horrible people who then sell him into slavery.  Tess is a strong woman but also shows her feminine side when talking about her marine boyfriend and they plan on marrying someday.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQDV58NZJ8JKA"}}, {"Date": "on January 15, 2015", "Text": "I enjoyed most of the book. Lori acted like a spoiled 13yo child, running late, showing up disheveled, a cheater, and yelling to demand answers. That always works. Lol. This Chancellor wants to breed with Lori since she's just so damn perfect, but my question is how old is she? If she was 26 when finishing her architecture degree, then meet, married and began having children, a 9yo, and a 17yo. So how many years breeding does she have left? So she's around 43yo and already 2 months pregnant with her husband child. They better get busy because that's the late side of getting pregnant.  Maybe use math in the next book.  Look out IVF treatments, cause looks like Lori will be getting treatments often.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABZMKR1NLLE87"}}, {"Date": "on January 29, 2015", "Text": "I have read scores of PA books and one common denominator is stereo typical characters. The hero is always stoic tough guy and the women are agreeable. You can totally tell the story is written by a guy. Mr. VANCE, I want to thank you for inventing characters that are more like real people, complex and unpredictable. It is also noteworthy that you are taking on a difficult style of telling several stories at once.  Finally, I couldn't help but notice you prose improving as the story unfolds. Keep it up, great start.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AW214I4R1PG7B"}}, {"Date": "on April 27, 2015", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XJZCJTQFEU8D"}}, {"Date": "on May 14, 2015", "Text": "I was so enraptured that I lost track . Of time. This is a great book full of mystery, murder, intrigue, love, and emotion. Thank you for a great read. I can barely wait for the next book to find out where the story goes.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVAHB2TGOAYVF"}}, {"Date": "on December 11, 2014", "Text": "The Death: Quarantine was a very good book.  The story line kept you engaged and you could easily empathize with the main characters.  I'm definitely looking forward to book 2 which will be released on December 26th.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LPHT6IXQXA61"}}, {"Date": "on May 7, 2015", "Text": "plauseable -yes our gov.still hides much from its people! could this happen yes! how? as described is 1 way if checks & balances are not followed etc! intresting yes started slow & became more intresting ! wake up !", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VQT9LKIQSC3U"}}, {"Date": "on May 21, 2015", "Text": "I raced through this book. I loved the character growing as the book progressed. I found the story very plausible. In fact I'm already reading number 2. Thank you Mr. Vance.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9IZQ2EN8GLIQ"}}, {"Date": "on January 14, 2015", "Text": "This book is great!!! I cant wait for the 3rd one to come out. I am hooked. I will also be reading his other books. Please keep them coming", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QLGZW5Y5SO46"}}, {"Date": "on February 28, 2015", "Text": "I believe Mr Vance has established a great base for an excellent series.  Lots of good characters and multiple layers to the plot!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIZ63729MZFB5"}}, {"Date": "on March 10, 2015", "Text": "Good characters and plot lines. Makes you wonder what if. Vance is a good writer that brings you into the story.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATXJ9PLB7JJII"}}, {"Date": "on March 5, 2015", "Text": "I had high hopes for this book. It was beyond disappointing. It's off chronologically, and the character development is poor. I could go on and on but I won't. I got hooked initially, but before I was halfway done I really wanted to stop reading it. But, I forced myself to read it till the end, and I wish I hadn't. The chronology I think is what made me the most angry. A character is on her deathbed due to a severely infected wound, and two hours later after 1 antibiotic pill she's 100% better. C'mon. And, the dog plays a huge role in the beginning, and three quarters in you're wondering if he's even part of the crew anymore. Ugh. Don't waste your time. I wish I hadn't.", "Helpfulness": 0.6666666666666666, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A533ZX5EL4VG6"}}, {"Date": "on December 5, 2014", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AK3BOJU1OHV0H"}}, {"Date": "on October 2, 2014", "Text": "On the edge of your seat reading and so relevant right now.  Never thought I'd be a reader of this genre of novels but I'm hooked and can't put it down.  Vance has scary timing with everything going on right now in the news.  Great writing and incredible plot, from the mind of this first timer.  He nailed it.  Can't recommend this book enough!  Already told three or four other friends about it.  Can't wait for his next book!", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30ILNM50GL9JX"}}, {"Date": "on September 30, 2014", "Text": "I don't read fiction all that much but I was recommend this book. I picked it up and couldn't put it down. I was pulled in from the first chapter and it kept me riveted through to the end. John Vance does an excellent job creating characters you care about and some you despise. His imagery was excellent and I found myself seeing the places clearly. I am now a fan of John W. Vance and will definitely pick up his next book.", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14ST5OA7LM06T"}}, {"Date": "on October 8, 2014", "Text": "A very good first attempt at storytelling. The storyline does not take too many forks in the road, but the characters in the book are very likable and the pace is good. I am looking forward to the sequel and am looking forward to Mr.. Vance developing even further sophisticated plot lines and dialogue. It will satisfy anyone who enjoys this genre of apocalyptic action.", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38OQTOCARQ21S"}}, {"Date": "on December 1, 2014", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30E1HSV7T48P8"}}, {"Date": "on November 15, 2014", "Text": "The Death by John W. Vance is a thrilling post-apocalyptic story about a pandemic that sweeps away 90% of the living. What the few survivors have left to deal with makes them wish they too were that lucky. This is a fast-paced thriller with real plausible characters and a plot line that holds you riveted. I can't wait for the next one. John Vance is an author to watch. I highly recommend this series.", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1S60JTX7965X4"}}, {"Date": "on October 20, 2014", "Text": "WOW!! I was not expecting to LOVE this book but I do!! Many twists and turns and a real page turner. The characters as well as the plot are very well developed.  I read this straight through....could NOT put it down!  I read tons of books in this genre & can say I will definitely be rereading this one for sure! Cannot wait for book 2!!", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NP60M6VQ4G0L"}}, {"Date": "on October 12, 2014", "Text": "A VERY Good book. The subject, a virus that wipes out 90%of the population, is very timely. The good characters are extremely likable and easy to care about. The bad guys are easy to hate and you'll want to witness their demise. The plot is interesting and the action is fast paced. It's one of the best books I've read all year.", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32B6JOPJVS66M"}}, {"Date": "on January 15, 2015", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VR31MYGWQ0L7"}}, {"Date": "on December 25, 2014", "Text": "Read it in one wet, stormy day. Just couldn't put it down.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WBWITXPCOJGN"}}, {"Date": "on December 10, 2014", "Text": "I've been hooked on this genre for a couple of years now, so I jumped at the opportunity to download this book and give it a read. I was not disappointed. This book has excellent character development and story telling. Amazon has some great indie authors, and Mr. Vance is definitely one of them. I'm really looking forward to the next installment!", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15J1MSLSB38SX"}}, {"Date": "on January 23, 2015", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QVMYNYB9RGHY"}}, {"Date": "on April 8, 2015", "Text": "One heck of a read, twist and turns and all the right stuff. I loved that there was strong women in this series. Hard to put down and in fact after starting the first one came back on Amazon and got the rest so that they would be ready right there on my kindle as soon as I got done with one! Keep up the good work. Will be reading more by this author!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13VENZC543MTF"}}, {"Date": "on December 18, 2014", "Text": "This book was a very nice read, only thing I don't like is when books are series, kind of a tease. I avidly read Imajica from start to finish, hoping for a sequel whereas I know there are at least 2 more books till I get the full story. That being said the groundwork has been done and they players cast, can't wait to find out what happens next.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GCLA5GLDTXPS"}}, {"Date": "on March 16, 2015", "Text": "Well it looks like I found a new author! I found John Vance after being recommended by another author!  The Death was a great audiobook! I enjoyed the way it was written, Mr. Vance builds his characters well and the story flowed very well!  I have already downloaded the next book plus have Defiant on order!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34O5MB7RK0MWD"}}, {"Date": "on January 19, 2015", "Text": "In spite of my dislike for book 1 of any thing this caught my interest.  Fast paced with interesting characters and very easy to read.  A little bit of terminus for walking dead fans and a lot of Denver airport for conspiracy buffs.  I am starting book 2.  Damn you trilogys, but thank you kindle unlimited.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A116B8VV6DLZMX"}}, {"Date": "on February 6, 2015", "Text": null, "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IM5J121SY0I9"}}, {"Date": "on December 9, 2014", "Text": "I enjoyed reading this book, which I assume is pt. 1. The character development is good and it really draws you in. Loved the way it switched back and forth between protagonists which immersed me into reading on. Looking forward to reading the rest of this series.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25U24KY03D4KZ"}}, {"Date": "on April 9, 2015", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABDMECDAEP3T3"}}, {"Date": "on October 7, 2014", "Text": "I would say this is one of the best thriller books I have read. This book is so captivating and engaging from the start. I enjoyed the book, would recommend to those that like thriller", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A305NULMWRK3W6"}}, {"Date": "on March 23, 2015", "Text": "Awesome read ! Loved the storyline and character development . Grabbed the reader right from the beginning . I've already started the second book on the series . If you are a fan of the apocalyptic genre this book is a very satisfying read .", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APF2YS6JA0LRO"}}, {"Date": "on October 5, 2014", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YDTW1KN8XBWH"}}, {"Date": "on November 13, 2014", "Text": "This is a very good book.  It was well laid out and the character development was excellent.  The one thing I didn't like was the second and third books aren't out yet!", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13K8LRX5LAP3H"}}, {"Date": "on March 13, 2015", "Text": "An easy read.  I read a lot of dystopia books and this was a quick almost short story if all 3 books were together it would feel like a complete book instead of short stories.  Easy to figure out where the plot is headed.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ALE81YKJATIZ"}}, {"Date": "on March 11, 2015", "Text": "Watch out!  Reading this book will bring you closer to death--from confusion and ennui.  There are too many little bizarre factoids in this story to make it fun or plausible.  Guess I'll go back to the classics.  Too bad.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YMUYRO9QO7FT"}}, {"Date": "on October 2, 2014", "Text": "i was hoping for a book that would keep me interested all the way through, found it with his book. cant wait for next book.", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29KT9T1SE5R2L"}}, {"Date": "on January 14, 2015", "Text": null, "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYGMFB6M0EK7Z"}}, {"Date": "on January 7, 2015", "Text": "Great series, easy to read.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A88LJ4GHT16R9"}}, {"Date": "on October 3, 2014", "Text": "Wow, what a great book! Enjoyed it from start to finish. A must read. Looking for more from this author.", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A370C8C4FFE3WH"}}, {"Date": "on April 15, 2015", "Text": "Another book with plenty of action.loved it.now all I have to say is read read read read a book people just read put down the video game and read something anything let your imagination soar.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31U4ZR6LH6JCE"}}, {"Date": "on March 11, 2015", "Text": "Started ok. Then turned into a soap opera. Millions of people dead but make sure you bury your family. I liked Tess  at least she didn't cry all the time. Cannibalism would probably happen.", "Helpfulness": "", "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I0ALMEJ46U4L"}}, {"Date": "on March 16, 2015", "Text": "I really liked the book it kept me full of questions and suspense which led directly to the next book which I HAD to get, which I am sure will lead to the 3rd one.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D66H51NQCX1U"}}, {"Date": "on March 8, 2015", "Text": null, "Helpfulness": 0.6, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2M8ZZ2H6YPWXB"}}, {"Date": "on October 2, 2014", "Text": "From the first page you will immediately feel engaged with the world the author has created.  By the second chapter you really should plan to stay up all night or start it on a Friday after work with a game plan to sleep in the next day.  It just simply is one of those kinds of reads.", "Helpfulness": 0.6363636363636364, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BIHJFMPGJ13K"}}, {"Date": "on March 23, 2015", "Text": "I found this to be a read well worth the time...silly as it sounds I kinda wanted to be there...fast read full of everything to hold interest....", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XQI35B626VB"}}, {"Date": "on March 31, 2015", "Text": "I liked the steady, risky pace of the story. There was always something around every turn of the page! It has completely believable characters.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CIA5OZHH80U8"}}, {"Date": "on January 18, 2015", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NOCVOP0D1V4W"}}, {"Date": "on December 28, 2014", "Text": "I enjoyed this for the most part. The author did a nice job of keeping the reader entertained and going from one scenario to the next.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Q7HSBI71O53K"}}, {"Date": "on January 4, 2015", "Text": "Was so happy to come across this book! Made having the Kindle Unlimited totally worth it!", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A155BHMQCT50HN"}}, {"Date": "on March 24, 2015", "Text": "This was an interesting story. I liked the characters and story line. If you enjoy post apocalypse series this is a good one.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NEKN8MTYR3X8"}}, {"Date": "on January 22, 2015", "Text": "Very few errors. Good story line. Will read the rest in the series. Highly recommend read!!! You will not be disappointed.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CP9MFXT63O3V"}}, {"Date": "on January 2, 2015", "Text": "I quite literally could not put it down. It is as exciting as it is dark and scary to think about. Eye opener!", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D9CDWC63BL02"}}, {"Date": "on January 23, 2015", "Text": "Love the style of writing gets the audience engaged.  Love how tension begins to build right off.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A65XFWL16AX9A"}}, {"Date": "on November 4, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3I1XV858HO6CT"}}, {"Date": "on November 12, 2014", "Text": "I love this genre, and this author looks very promising. I'm looking forward to the next one!!!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2V3TGRSKZ9X0A"}}, {"Date": "on March 8, 2015", "Text": "I purchased book 1 and 2.  Book 1 started out nicely, but the writing style did not appeal to me.  As I was searching for this page to write my review, I saw that this book is a best seller in the category of \"teen, young adult\" , and that is probably why the writing became increasingly irritating.  The premise of the book is interesting, though, but prospective purchasers should be aware that this series is most definitely written for the younger set.", "Helpfulness": 0.5, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NP5ME3V9M6IC"}}, {"Date": "on November 5, 2014", "Text": "Then took another so I could read the sequel! This book was so much better than I expected. Some \"Doomsday\" books load the characters with unbelievable skills and/or resources and for me, totally ruins the story. I liked this because you had people from all walks of life come together and either adapt or die trying. As a wife of a 35M I enjoyed the conspiracy theory and the realistic reactions of the common US soldier. The continuity alone deserves 5 stars!", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IX2DQ213OJ4W"}}, {"Date": "on November 10, 2014", "Text": "I'm a pretty big fan of apocalypse scenario novels - zombie, virus, massive nuclear destruction - whatever the premise, I tend to enjoy reading them. I can't say that about this one. I found the plot confusing, the characters not fleshed out enough and the story sort of boring. I didn't empathize with any of the characters. I'm typically a person who, even if I am not convinced on the first book of a trilogy, I will continue to read the next books anyway, because I need to see what conclusion it comes to. That will not be the case with this series. I'm just glad I didn't pay for this book, and instead borrowed it through Kindle Unlimited.", "Helpfulness": 0.6153846153846154, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZOJSYGQ0LCT"}}, {"Date": "on October 2, 2014", "Text": "My son recommended this book to me and I wasn't too sure because it's not usually my genre...but I have to say it captured me from the very beginning.  It's very relevant to today's events.  I loved this book and couldn't put it down till I finished it!  Highly recommend!", "Helpfulness": 0.6, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALLRYB56JR68S"}}, {"Date": "on October 30, 2014", "Text": "This book has it all - great plot, superb characters, and action galore.  If you're a fan of post-apocalyptic fiction such as I, you will love this book.  Vance is a very talented author, and I can't wait until his next book comes out.  Hurry and grab your copy now while it's still 99 cents - as awesome as this book is, I doubt the price will stay this low for long!", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APULPI2QH5AS4"}}, {"Date": "on April 13, 2015", "Text": "Enjoyed the characters plight during this post-apocalyptic adventure.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WRO97A7X3BBJ"}}, {"Date": "on April 20, 2015", "Text": "Plodding", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOWDDUFAAXEE5"}}, {"Date": "on December 2, 2014", "Text": "Reallly enjoyed this story. Patiently waiting on the next one. For anybody out there, kindle unlimited is awesome. This book is a great example of what you get. I read a lot and John Vance tells a good yarn. If it wasn't  for kindle unlimited it probably would have been a bit longer before i stumbled upon this great read.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39VO5I4NR7A5E"}}, {"Date": "on December 28, 2014", "Text": "90% of the population gone in a disaster engineered by those who believe they know best with a handful of survivors navigating through the new reality, striving to survive, and uncovering truth in the process. This is a very well crafted novel with characters that have depth and dimension, and a spell binding plot.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11561VQOFX2EE"}}, {"Date": "on April 16, 2015", "Text": "I just really couldn't finish this book. Simplistic, unoriginal, characters and plot unformed and truly one-dimensional. I've read other work by John Vance and found him to be a good author, his series The Defiant, is everything this book is not. So not sure what's going on with this book, but I don't get it.", "Helpfulness": 0.5, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VA27OF5CHFM2"}}, {"Date": "on December 21, 2014", "Text": "I gave  this a 5 star rating because the storyline was extremely interesting, the characters were well developed, and I couldn't put the book down...It was nice to read something so different and yet still captivating! I recommend this book to anyone that enjoys an interesting read.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYQDVXFG2XMGG"}}, {"Date": "on December 3, 2014", "Text": "This book was scary. Not in the Nightmare on Elm Street way, but just experiencing all of the craziness of losing loved ones and having to kill because your life is in danger kind of way. It was an awesome story and if you like dystopian books then don't pass this one up.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GNHNRRBA9C7Y"}}, {"Date": "on October 2, 2014", "Text": "This is not the average Post-Apocalyptic Novel. It's really well written and keeps you wondering and thinking with a unique perspective on a thrilling genre.", "Helpfulness": 0.6, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GM01DM52CYZ6"}}, {"Date": "on December 2, 2014", "Text": "The Death sucked me right in from the very beginning, the most intriguing part of the book is realizing that the story could very well happen in this day and age. It opens your eyes to a lot that's going on, and it's very entertaining! I highly recommend it.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35ZW587S7C8GU"}}, {"Date": "on November 7, 2014", "Text": "IThis story was well written and I thourougly enjoyed it. This Authors special attention to detail and fully developed characters is nore than enough to keep you turning into the wee hours of the morning. Highly recommended", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVRNCTSPQ3IJ8"}}, {"Date": "on October 31, 2014", "Text": "This was a well written book that kept me wondering what will be revealed next. I am looking forward to reading the next one. I can definitely recommend this book to friends and family.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36663YN4W39TN"}}, {"Date": "on March 19, 2015", "Text": "kept me on the edge of my seat,awesome", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARPNTOMQ7Y6DL"}}, {"Date": "on November 17, 2014", "Text": "This story is very good. The characters are well developed. I am looking forward to reading the next story. This is one of the better written end of the world stories.", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3A07WN86M9B6W"}}, {"Date": "on October 7, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2K3BS3DDSK0HC"}}, {"Date": "on October 17, 2014", "Text": "Easy read.  Characters were for the most part believable.  Would read more work by this author.  Only character I really could have slapped was the wife.", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VFJQJ9405TGT"}}, {"Date": "on October 23, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A287KLWDUOMJLX"}}, {"Date": "on October 12, 2014", "Text": "I choose 4 stars because it was entertaining, but not in a way that I couldn't put it down. I liked the plot and how the story comes together.", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEDHICMANJ6OR"}}, {"Date": "on February 12, 2015", "Text": "Not much into this government destroying the world and people becoming cannibals theory but this is a good book and I will read trilogy.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A777E66MVQEE"}}, {"Date": "on November 1, 2014", "Text": "Good book. Confusing at times jumping from one location to the other but entertaining read. Definite read for conspiracy theorists.", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GL4Y3HYN01LE"}}, {"Date": "on October 8, 2014", "Text": "Very good, a cut above most in this genre. The characters were well developed and interesting. Can't wait for future installments.", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1H7MDNYQCGN4S"}}, {"Date": "on November 1, 2014", "Text": "I really enjoyed this story and can't wait to see what happens next with these characters and find out what happens with Cassidy!", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39Y2U2RGX9041"}}, {"Date": "on December 11, 2014", "Text": "I really enjoyed this book. The author makes the story so realistic, it is hard to put down.  Looking forward to the 2nd book.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JQDG4WCKUO6C"}}, {"Date": "on October 10, 2014", "Text": "This is fast paced thriller that will keep you turning the pages cause you can't stop reading. I look forward to a sequel.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DBZ9FTM34Y26"}}, {"Date": "on February 9, 2015", "Text": "Finally a well written post apocalyptic novel. Believable characters and an intriguing storyline.  I highly recommend it", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HEDVG9TP0W0O"}}, {"Date": "on February 12, 2015", "Text": "Definitely worth reading.  Kept me on the edge of my seat.  I can imagine life after a pandemic and  need to prepare.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XP5Z94M38GM8"}}, {"Date": "on October 8, 2014", "Text": "Good story.  I look forward to the next installment.  I recommend this book to anyone who enjoys this genre.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KJH07705F7HH"}}, {"Date": "on October 14, 2014", "Text": "Enjoyed the read. Kept me interested. I would recommend it if these are your type of story. Onto the next!", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Y0K8B0TZK7BH"}}, {"Date": "on October 7, 2014", "Text": "It will keep you wanting to read more and after you put it up for the night you want it again in the AM.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22MAX9QGLEBJU"}}, {"Date": "on October 10, 2014", "Text": "Good read, but lacking the suspense and details of author J. Michael Hopf, whom recommended this book.", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2078V2K6C0LAP"}}, {"Date": "on October 8, 2014", "Text": "Fun read, fast paced and hits like a sledgehammer. Fantastic! I can't wait to read more", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33YMTIYQWTZNX"}}, {"Date": "on November 3, 2014", "Text": "I could not put my kindle down.  I read the story all night to find out what happened.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CQQ8LTOVHM83"}}, {"Date": "on December 7, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22ELCZ3XZQWOL"}}, {"Date": "on October 7, 2014", "Text": "Good book! Really makes you think about how you would react if this were to happen..", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JSQOY4E48M4U"}}, {"Date": "on February 18, 2015", "Text": "I really enjoyed this book. I am looking forward to reading the next book.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WIBDEJZJB8YR"}}, {"Date": "on November 7, 2014", "Text": "Absolutely loved it. Can't wait for Book 2 to be released in December.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HP5R8D7MYWGP"}}, {"Date": "on April 8, 2015", "Text": "Very good book", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37PXQBP51OLBF"}}, {"Date": "on February 4, 2015", "Text": "I liked it.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVRUD2DGK7Q8V"}}, {"Date": "on November 15, 2014", "Text": "Don't bother, the story is boring and the characters are two-dimensional. As much as I like the post-apocalyptic genre, most of the books written on the subject read like they were penned by 12 year-olds, and not the brightest ones, either. If you want a good series, try American Apocalypse (by Nova, aka Steven Campbell, sadly dead now).", "Helpfulness": 0.5555555555555556, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LJ8JH5TPBZ9M"}}, {"Date": "on February 5, 2015", "Text": "I have to agree with some of the others this book was distracting me at best. The part with Laurie and it after three or four times of detouring to follow her and her family's life I quit doing that. I just would thumb go through the pages and get back to the chase. That should've been written as two books, period.", "Helpfulness": 0.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PIU116Q9MYRL"}}, {"Date": "on October 19, 2014", "Text": "Looking forward to the next part", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12GII8IV6LYEO"}}, {"Date": "on December 28, 2014", "Text": "This book was entertaining but I didn't think it was put together good. It didn't make a lot of sense and the ending sucked.I didn't even realize it was ended until I went for the next page and there wasn't one. It was ok though.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A441LCODBI0Z0"}}, {"Date": "on November 5, 2014", "Text": "looking  forward to # 2", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VK4SJAZL95G8"}}, {"Date": "on November 2, 2014", "Text": "This is a very interesting idea for a story with a somewhat realistic end-of-the-world scenario.  My only complaints are the lack of character development and the too frequent shifts between the two plot lines.  It feels like the characters do have more depth, but for some reason Vance didn't flesh them out enough.  I also felt like right when things got interesting, the story would switch to the other plot line.  This is a good tactic for building suspense, but it doesn't really work when the characters haven't been fleshed out enough for the reader to care about them.  I am interested enough in the resolution to buy the next book, but not so much that I don't feel like I can read something else first.", "Helpfulness": 0.3333333333333333, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A260G70ZN7KP9P"}}, {"Date": "on October 2, 2014", "Text": null, "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BIHJFMPGJ13K"}}, {"Date": "on October 19, 2014", "Text": "Good read", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30VFKHING67H0"}}, {"Date": "on November 13, 2014", "Text": "Loved it", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1H4HA4VVLSNBT"}}, {"Date": "on October 24, 2014", "Text": "Fast paced, good character development and quite a bit of action. The story actually seems plausible since there are plenty of crazy left wing nut jobs in this world that would love to wipe out civilization  and start over.", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EOK4R22FEEHR"}}, {"Date": "on November 4, 2014", "Text": "A twist on the apocalypse and new world order idea. It was a quick read, I will probably read the rest.", "Helpfulness": 0.3333333333333333, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UVHCK8VGVPXN"}}, {"Date": "on November 1, 2014", "Text": "There were so many times in this book where I felt like smacking my forehead and saying \"are you kidding me?\" when it came to decisions made by the characters. Just really DUMB moves! The story is predictable and so will be the sequel. The author had to throw in cannibalism or it would of been a one star rating. Boring....", "Helpfulness": 0.4, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14LG657BU0URK"}}, {"Date": "on October 7, 2014", "Text": "Sorry but I found the writing too simplistic, no character development and very predictable.  I wanted to like it, and love apocalyptic stories, but was very disappointed.", "Helpfulness": 0.5, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CGHKXJ2YQAMK"}}, {"Date": "on December 14, 2014", "Text": "Didn't love the writing style and it just drops you at the end, with nothing but open loose ends in the story line.... assuming you'll go pick up the second book in the series I guess.", "Helpfulness": 0.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Z230K690J0W5"}}, {"Date": "on December 28, 2014", "Text": "This really is a terribly written book.  I think my quest for engaging apocalyptic fiction has been taking me in the wrong direction.  I can suspend disbelief but I still require a thoughtful story line!  This was not it - unlikeable character doing unlikely things.", "Helpfulness": 0.4444444444444444, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6B27II8EMSLF"}}, {"Date": "on October 12, 2014", "Text": "I was very disappointed in this book.  I do not recommend it to anyone. There are so many other post-apocalyptic books that tower over this one.", "Helpfulness": 0.4, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1N5YLZBAWOY17"}}, {"Date": "on November 6, 2014", "Text": "This is just terrible literature.  Clearly no understanding of how viruses work yet its a major plot point.  Paragraphs that begin with conjunctions!! The final straw though was the authors use of till instead of until; not in dialogue but in plot development!  Very sorry that I wasted time with this junk.", "Helpfulness": 0.3333333333333333, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QBS3ZV849YWV"}}], "ReviewUrl": "http://www.amazon.com/Death-Post-Apocalyptic-Novel/product-reviews/1500717320/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.2 out of 5 stars"}, "OfferPrice": "$11.58", "Salesrank": "#77,009", "ListPrice": "$13.99"}