{"Category": "in Books (", "Name": ["SURVIVING ABE - A Climate-Fiction Novel"], "Timestamp": "2015-05-24 23:29:51.406896", "itemurl": "http://www.amazon.com/SURVIVING-ABE-Climate-Fiction-J-Z-OBrien/dp/1499640927", "Reviews": {"TotalReviewCount": "195", "ReviewList": [{"Date": "on February 27, 2014", "Text": null, "Helpfulness": 0.9705882352941176, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23UQMKRZNYHDX"}}, {"Date": "on April 25, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JT8W9ILBZ8EC"}}, {"Date": "on March 8, 2014", "Text": "J.Z. O'Brien had me heading for the bulk food aisle in the grocery store and looking critically at the crawl space under my house.  I decided against selling a coin collection and my heartbeat accelerated when the temperature dropped and it started to snow outside halfway through his book.  Did I mention that I live in Grand Junction?  I don't know if he plans any sequels, but I would certainly enjoy further trips into his imagination, whether built onto this or an entirely new one.", "Helpfulness": 0.9166666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30PBUK98H7RR3"}}, {"Date": "on June 1, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATVKS1Z0NW69C"}}, {"Date": "on May 14, 2014", "Text": null, "Helpfulness": 0.875, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GGOSK473LLCM"}}, {"Date": "on March 11, 2014", "Text": null, "Helpfulness": 0.875, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A180OVX7JWJXPL"}}, {"Date": "on November 6, 2014", "Text": "I loved the premise of a Super Sandy premise on a much larger scale:- practically the whole US in the throes of climatic challenges from heat, to flooding rains and Artic cold while a secret group of environmental terrorist  systematically cuts off any attempt to get help to people in need, causing, anarchy and mayhem. . .I liked the way he weaved each story of individual groups and how they confronted adversity, and interacted with each other.  I really enjoyed the Texas peeps, and the young man, who intends to bike his way from Seattle to Key West, Florida, and makes a pit stop in an Eastern Texas convenience store,  subsequently becomes smitten with a beautiful young Texas woman and her \"clan\". Then there is a mother / daughter from Colorado, and there story of how they fare through this dangerous new world and the people they meet along the way. The sailor, Tess, and her sailboat, Robin, whom I think is the most interesting character, and the mysterious man who becomes her \"crew\", purely by chance . . Get comfy and enjoy.  I await the sequel with bated breath.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ER8JM9YS9RT6"}}, {"Date": "on November 5, 2014", "Text": "Reading about these characters gave one a feeling of how a climate change might affect mankind, which is far more probable then a virus-induced zombie horde.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3W1O3HZJCWP6S"}}, {"Date": "on November 7, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TCQ5HBAEMUPJ"}}, {"Date": "on December 6, 2014", "Text": "This book was well-written and I found that the author developed the characters well, too.  The story had a few rough spots but, overall, the premise of terrorist attacks happening during a climate event provided a solid foundation to create a thrilling and captivating adventure.  It drew me in.  I also think that this scenario is a fresh take in the SHTF genre.  So many variants of EMPs or CMEs in this genre that go from very good (e.g., 77 Days by Ray Gorham) to the so-insipidly-bad-free-is-too-expensive (i.g., EMP Los Angeles by Frank LaFlamme).", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASF15FZRF06TX"}}, {"Date": "on May 19, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22MXZX4ZL42B4"}}, {"Date": "on October 27, 2014", "Text": "If you are interested in all the climate change information in the news today, this is a very good book to read. Although it is fiction, this book has many different scenarios of what could happen with a huge storm system like Abe. I liked the way the author showed how the storm affected the characters in the different places in the country and how they dealt with the storm. A very good book with very good characters.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EL4FPFT0ZS26"}}, {"Date": "on December 28, 2014", "Text": "Well developed characters and a plot that keeps your attention. The good guys aren't invincible and the bad guys in some cases have understandable motives beyond sheer thuggery.  It does seem to end rather abruptly but Im looking forward to the rest of the story. Well worth the money for quality writing as well as length, this isn't a short story calling itself a novel. Good read.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AN97L0D8U31MS"}}, {"Date": "on June 19, 2014", "Text": null, "Helpfulness": 0.8, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A234XEJ6FQY3Q9"}}, {"Date": "on July 20, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WU5KTWKOQ1TB"}}, {"Date": "on September 14, 2014", "Text": "I really loved this book and what a way to end your book.  I think you did a great job describing each character without becoming too wordy.  You got the reader hooked on the stories and individuals very quickly.  I'm anxiously awaiting the sequel.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21IF94X32NSQ8"}}, {"Date": "on September 19, 2014", "Text": "The story has a few holes, namely the actual workings of th\"eco terrorists\". That said I gave it 5 stars because of the characters. I found myself engrossed in their personal struggles. Very rarely does this type of story elicit an emotional attachment to the characters, but this one did for me. The fact that the author isn't aversive to killing one off, lends a tension to the story that is needed. I found myself caring what happens to them, most books of this genre overwhelm with action or bore you with hammering home obvious political points to tedium. The action in this story is paced perfectly IMO. This book is about the people not the story. That our current civilization hangs by a tenuous thread is obvious and the many books now in print that chronicle its unraveling all really follow a rather similar course, so while he certainly breaks no new ground in the genre(other than its activating event) the author has created a rich cast of characters that intrigue and entertain. In many ways the story reminds me of Kings, \"The Stand\" which appealed to me for the same reasons this one does. I eagerly await the much needed sequel. It is a fact of modern life that authors seem compelled to write trilogies( or more) instead of just writing the damn story in one book. This story is obviously not over, I wish the author had written it in one setting, I for one would have gladly paid extra not to have to read it to its conclusion in pieces,but such is life in the world of Kindle fiction", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2L5LIFRJSJF8D"}}, {"Date": "on March 3, 2014", "Text": null, "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATNSPWS5YVKTM"}}, {"Date": "on December 19, 2014", "Text": "Well thought out timeline. Personally I think the story would have been better to focus on the Texas and Colorado story and saved the other story for a follow on book.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AY16TEMXZXVEU"}}, {"Date": "on September 29, 2014", "Text": "the book kept me involved and I enjoyed how the author weaved all the different characters stories through out the book. Would love to read a sequel to the story.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AK2UWWO3ATJYK"}}, {"Date": "on November 22, 2014", "Text": "I could hardly put this down...wanted to see what happens next.  I liked every character and was cheering for their survival.  Thanks for a really good read!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LWQ6MTLL0MPO"}}, {"Date": "on December 23, 2014", "Text": "I would definitely recommend this book to any dystopian fan! Don't miss out, this was a great one. Looking for the sequel.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CA4TQ50H8VOQ"}}, {"Date": "on November 10, 2014", "Text": "I enjoyed the book a lot and would love to read a sequel. Great detail with each geo. location, thank you.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26YJN3SOB6I3"}}, {"Date": "on February 24, 2015", "Text": "A complete story following three separate groups coping with the effects of a huge winter storm that ends up affecting most of the continental US. Exacerbated by an amazingly well-positioned group of Eco-terrorists who amp up the misery via both cyber and physical attacks.  The terrorists' ultimate goal to reduce the world's human population by almost 70% is balanced against the three groups' daily efforts to survive.  Story line is well thought out, characters draw you in and have routing for the heroes and hoping the bad guys get tripped up. Hope you enjoy it as much as I did.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SDE2BOUJAH7C"}}, {"Date": "on March 1, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25QJD45P956IO"}}, {"Date": "on August 25, 2014", "Text": "What a bargain!  If you love books about the world as we know it coming to an end and you don't mind the story revolving around several different groups of people then you will love this book. The author did a great job of making each person come alive!  I was always drawn in and the book never seemed to drag as so many books tend to do when so many different situations are involved. Even on the last page, I wanted more. I do hope there is a sequel!!", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A80LTFMZNREY7"}}, {"Date": "on January 14, 2015", "Text": "Great story! This could be the beginning of a wonderful series. Appalling that the series of events could truly happen and wouldn't be that difficult. Characters are well drawn without being overdone and we even get pulled into the life of one of the, well, bad guys and see his side of things and while not really approving, I kinda like him. I hate that! :) I'll be watching this author for more, whether in continuation or more stories period.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37SYPCW0SW9S9"}}, {"Date": "on October 28, 2014", "Text": "Enjoyed the ideas presented  very believable! however the characters seem a little one dimensional. I wished for them to have more depth. The author is very knowledgable in MANY areas that is obvious. The scenario is presented in a very believable if not scary way.  I was disappointed in how the stories ended. I was waiting for the next big dilemma when wham the book ended. I will read the next book hope it's ready soon!!", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AF6GVUPS8ZSX"}}, {"Date": "on October 14, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AP01KLXZLGS4"}}, {"Date": "on May 11, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IZTW0G3YMUR3"}}, {"Date": "on June 26, 2014", "Text": "I enjoyed this as a change from the EMP hits and changes the way the world runs genre. After Katrina, Rita, Sandy, we all know Mother Nature will win against us puny humans. This story, told from several perspectives, was very interesting. I loved the parts on the sailboat. What a thought, don't like your neighborhood, just move. Anyway I look forward to the next installment. Enjoy", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10MVE2MEOU6XT"}}, {"Date": "on August 29, 2014", "Text": "The story is entertaining, engrossing, and believable. The author is clearly knowledgeable about the subjects discussed in the book, this book contains very few obvious grammatical errors (a pleasant change from most self-published books I have encountered), and at 99 cents the book is a very good value compared to shorter books with much higher prices.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Z8D5QK9MU1GW"}}, {"Date": "on July 29, 2014", "Text": "Great book, looking forward to second book, hope author is a fast writer.  Know a lot of reviewers almost write a book report, not my style but what I can say is I can't sing but know when someone is a good singer just as I can't write a book but know a good writer when I find one...this guy can write and his writing is entertaining and informative.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQ6TLUVH2LZ5E"}}, {"Date": "on June 26, 2014", "Text": "A different take on the apocalypse genre - climate change plus eco-terrorists.  The characters were well drawn, the subplots pulled together in an interesting manner, but I can't say that I loved the ending(s).  Then again, the end of the world won't have a happy ending for everyone.  I'd read a follow-up on the characters if the author wrote one.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A105G0U2S73Z3E"}}, {"Date": "on June 17, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FMPKMEDT2CH5"}}, {"Date": "on June 16, 2014", "Text": "Great story line, good character development and detail. Not crazy about the end, but a good lead-in for another book.  Nice job!", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJ6D5SE9Y9M2W"}}, {"Date": "on June 14, 2014", "Text": "Overall good characterization and focus. My only quibble. There is a difference between a serial and a multi volume story.  This is not a self contained novel and sequel, it just ends with no partial resolution.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWU006Y5MPY89"}}, {"Date": "on June 13, 2014", "Text": "An engaging story of natural and unnatural disasters, the multiple story lines keep it moving along. I'll want to read the sequel.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EFCXSLLZYIFA"}}, {"Date": "on June 10, 2014", "Text": "Enjoyed this book very much.Thought the characters were quite comfortable with each other big problem I have  is with the ending it was very abrubt and and it left you hanging with to many unanswered questions...", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1S3LB326M5WQF"}}, {"Date": "on June 6, 2014", "Text": "Here is a book with a nice twist on survival. Frighteningly accurate on how quickly society will deteriorate under duress. I would recommend this book to folks interested in extreme conditions and the reactions that are produced.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FS0HBRIW87OI"}}, {"Date": "on June 5, 2014", "Text": "Climate disaster. At first it tells about the scenario of each person-where they are & what they are like. All characters come together in this book & make a great story. Heavy snow, rain and unrelenting cold make this a force of nature that would be difficult to endure. The characters are great & clearly defined. Not a waste of money to get this book. If my review has helped you decide, please click \"yes\". Thank You", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEUTI2RA86YVV"}}, {"Date": "on May 22, 2014", "Text": "I thought this book was well written. It was easy to follow the different characters as the story progressed. I was sorry when it ended. I can't wait for the sequel! I hope it will be as good as the initial book!", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JFSTC7WKBWCX"}}, {"Date": "on May 21, 2014", "Text": "The price is right, the story line is original and entertaining! I wish we didnt have to write a novel just to review it- the stars say it all!", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AH2X1X8CYOHMC"}}, {"Date": "on May 14, 2014", "Text": "Firstly - no zombies - which is worth 2 stars on it's own! This novel is written from the view of a solo female sailor, intertwined with a storyline of a super storm bearing down on the US, while domestic terrorism commences hits critical infrastructure at the same time. No more spoilers - a good post apoc novel and well worth the kindle price.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28BKEQRIWN4TB"}}, {"Date": "on May 12, 2014", "Text": "I like the presentation of current concepts - climate change, militia and cyber threats. Nice to see a nerd transformed into a hero figure.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UZYADN7PTU3M"}}, {"Date": "on May 11, 2014", "Text": "This was an enjoyable book.  The pacing was brisk, the characters enjoyable, and the plot engaging.  I was so absorbed in the book that I did not realize I was at the end until I hit \"Thank you for reading Surviving Abe!\"  If you are looking for an enjoyable book that is informative, but highly readable, this is a good choice.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QO02F73AKV1H"}}, {"Date": "on May 9, 2014", "Text": "Recommend this well written engaging story. I enjoy extreme weather survival tales in general but this combines it with global weather change and a disturbing possible future. Look forward to the next book in this series.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASGMZB5W86J30"}}, {"Date": "on May 7, 2014", "Text": "Looking forward to the next book in the series (?).  I want to see what happens next to our friends.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CCL1PX4C654G"}}, {"Date": "on April 29, 2014", "Text": "I have thoroughly enjoyed this book, and look forward to its sequel.  The characters are like able and the plot not too far fetched.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TY8CCEFR9Y8C"}}, {"Date": "on April 26, 2014", "Text": "This book help my interest and had a decent story line and character development. Timely too with the winter storms we had this year. I look forward to the next installment.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CDLV2O932TVF"}}, {"Date": "on April 26, 2014", "Text": "Loved this book. It's rare that I find prepper fiction that isn't just more of the same. I loved all the characters, some more than others. Loved the changing POV. I cannot wait for book 2.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UM0IHDKRGHXS"}}, {"Date": "on April 26, 2014", "Text": "Very plausible story, good character development, easy flow and story development. Looking forward to reading the next book in the series.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8JOIXCQ8M0UV"}}, {"Date": "on April 24, 2014", "Text": "After the horrific winter in the Midwest I found this book right on the mark. Loved the different characters and following them through all their perils. It was easy reading and keeping straight the storylines of Gus, Andy and Robin all trying to survive Super Storm Abe. I am looking forward to the sequel and the exciting adventures to follow. Highly recommend to any type reader.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29KK0D1B7D5S8"}}, {"Date": "on April 24, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A916942XFUJLU"}}, {"Date": "on April 23, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEWLI30FBJNIV"}}, {"Date": "on April 22, 2014", "Text": "The book really held my interest and I enjoyed it. My only quibble is it ended too abruptly. Maybe there will be a sequel. There is certainly room for it.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1T55PLHA11VXU"}}, {"Date": "on April 22, 2014", "Text": "Thoroughly enjoyed this read.  A different twist on what can happen in our world as we know it today.  Very realistic scenario of what might happen.  I certainly hope there is another as I think the next will be as good as this one.  Truthfully, I was sorry to near the end as it seemed all the characters should somehow connect later in the story as they all experienced the ordeal the same but decidedly different.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GI3PT75A9E5Z"}}, {"Date": "on April 21, 2014", "Text": "I started it and didn't stop till I was done.  Very interesting story line. I look forward to the next book.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14JCBPXDLD4OR"}}, {"Date": "on April 20, 2014", "Text": "Very interesting book with a decent story line and good character development.  Hard to believe that this is the author's first book.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AR92OC8D677PO"}}, {"Date": "on April 18, 2014", "Text": "''Surviving Abe'' is part of a growing new genre called \"cli fi' and has important message for readers. And with recent news stories about cli fi in both the New York Times and Claude Nougat's site in Italy, cli fi seems to be catching on. Reading ''Surviving Abe'' gave me the feeling I was right inside the cli fi meme. A must-read for anyone concerned about our climate future 100 to 500 years down the road, if there is a road then.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AV3W9XCN226XO"}}, {"Date": "on April 2, 2014", "Text": "Very good. Good character development. Almost too many sub-plots although they did provide a variety of consequences to Abe. Knowledgeable detail.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZQA58URWTWE"}}, {"Date": "on October 15, 2014", "Text": "Vary nicely done.  I especially liked the realistic nature of the stories.  I disliked the switching from one story line to another.  I realize that this is a writing style it is just not one that I liked.  Well worth the price and even more.  I am now going to look up the authors and see if they have any others available.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JAQ6H360RV0G"}}, {"Date": "on March 4, 2014", "Text": null, "Helpfulness": 0.7142857142857143, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1O5V120U65CDJ"}}, {"Date": "on March 24, 2015", "Text": "Interesting characters, accuracy in the details, and a great plot: these elements are just a few brought out for readers of Surviving Abe.  O'Brien's first book is out of the stratosphere, at least to this reader. I am grateful that I don't have to wait for the second book to come out.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EW11L8S1CV6A"}}, {"Date": "on August 11, 2014", "Text": "I liked how the story was based on people in different areas.  It was like getting three books in one.  The characters were well developed and you felt like you really knew them.  I really enjoyed this book and it makes me think more about self sufficiency that's for sure!!", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DW4RQF8J06QO"}}, {"Date": "on July 26, 2014", "Text": "Fun read and interesting plot. Worth the time for entertainment and a stimulating plot. Nice character development and twists to the s storyline. The author has a nice touch and developed this book well enough that I'll look forward to the next installment. I recommend it.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VM6Z82PK2BLD"}}, {"Date": "on February 26, 2015", "Text": "I am a BIG fan of disaster stories. This one was really well thought out. I liked most of the  characters, even the one I'm not really supposed to like.  I sat up all night reading to the end. and now BOOM- no sequel yet.  I'm dying to read what happens!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I33RA2ZIX6TQ"}}, {"Date": "on February 9, 2015", "Text": "I enjoy reading survival/doomsday fiction and this was better than most. The story is believable and the characters well defined. It Was not totally murder and mayhem like some apocalyptic novels. Left you believing there is a future for survivors.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3959CCG2KXK1H"}}, {"Date": "on August 1, 2014", "Text": "Don.t like to think that one storm could take out all of the infrastructure and how much violence would immediately happen  I read a lot of end stories and find them all pretty much the same so this did stand out with some original moments,", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATYJRTI1ONNMP"}}, {"Date": "on June 1, 2014", "Text": "Huge fan of a good weather disaster. Very good meaty story. For the most part I enjoyed it. I feel like I would like a little more to finish it off but if there is a sequel that would be fantastic.  If not, still a stand alone great read.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JOI3M1HBXQD0"}}, {"Date": "on November 28, 2014", "Text": "A very well written book. I found myself so wrapped up in the characters I didn't want the book to end. I really hope there is a second one. The descriptions the author used really put you there. Kudos to the author. I loved it!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9IZQ2EN8GLIQ"}}, {"Date": "on September 28, 2014", "Text": "Well I enjoyed your first book .Surprised me that it was but had a small inkling you were reliving a few moments. I'm sure the next chapter will be as intriguing as the first .Write on my friend ......David Kosec", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27C3MHA8K5TP7"}}, {"Date": "on September 21, 2014", "Text": "The book is entertaining. The end really leaves you hanging though. The book did not wrap up well. It reeks of sequel which is fine, but each book of a sequel should stand some what on it's own.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Z90O9XNA00BS"}}, {"Date": "on May 1, 2014", "Text": "I'm looking forward to the next book. The multiple story lines kept the book interesting and I appreciated that the action was logical and not overdone.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YRT6F0F9347G"}}, {"Date": "on February 25, 2015", "Text": "Really kept my attention, also makes you think, what if? I myself am beginning to think about prepping for that inevitable disaster", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34BPT5D42UZMC"}}, {"Date": "on December 26, 2014", "Text": "A real page turner, excellent writing, and presentation.  It was hard to put down , and I regretted coming to the end of the tale.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QSN86JKTULWQ"}}, {"Date": "on October 30, 2014", "Text": "This was a great read. I love to read and this book was great. A page turner with a great story line.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LRAVOHYJBUZ6"}}, {"Date": "on August 12, 2014", "Text": "Loved this book.... But there's going to be another one, right?  I need to know what happens next!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38JMQTWLZUMWC"}}, {"Date": "on March 18, 2015", "Text": "I really liked the premise of the book. It was one of those stories you keep hoping will get better as the book goes along, but it remained fairly static throughout. The story was entertaining though, especially if you like climate related things, or survival books. It got a little preachy sounding at times in the dialogue. Not necessarily a bad thing, it just didn't feel natural. There were some grammatical errors, but the main issue why it doesn't get more stars is that it never felt like it fully developed. As it is a debut novel though, I think that it was a good first effort. I'll read his next book. The best way I can describe the overall premise of it, is that I was really hoping to like it more.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CR8BT4SQ6KNQ"}}, {"Date": "on December 4, 2014", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21AVTN53D4HZX"}}, {"Date": "on December 8, 2014", "Text": "The weather and terrorist situations are all too real and possible to actually happen at some time in the future. That is what kept me reading. I really enjoyed this book and became attached to all the characters. The problem came at the end of the book...it just ended! I was left hanging and don't know what happened to everyone. Did the main characters really survive the whole thing? What about the rest of the world? I don't like being left wanting more story unless I know there will be more coming. Please write a sequel to this and let us all know what the new world is like. I would have given it 5 stars if there was a part 2 to finish the story.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2J2HMTHG8QWXP"}}, {"Date": "on March 2, 2015", "Text": "I really enjoyed this book it was from first hand account and it had a mystery too it to.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KGHTMLTLD75S"}}, {"Date": "on September 16, 2014", "Text": "Not a bad tale.  It is well-written and interesting.  The facts, as far as I know, are accurate and play an important part of the story.  The book is more than a bargain for you Kindle readers and makes a good read.  I don't like novels that are written with a sequel in mind and this one leaves some untied ends but, nevertheless, it was enjoyable, entertaining, and somewhat enlightening.  Another thing, those of you who will be surprised that jar heads can write and spell will be pleasantly disabused of these somewhat justified notions.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXGKGRXOIDBOK"}}, {"Date": "on March 4, 2015", "Text": "The story lines captured my interest from the beginning, and I read this book straight through because I wanted to know how things went for these characters. The only quibble I had was with some of the characters' inner monologues - some were too long and often they felt like a bit of a cop-out way to cover necessary background, details, or motivations that the author was too lazy to work into the story in another way. They just didn't feel 'real'. That said, I was left wanting more and I look forward to the sequel.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NIYHUUBKIZZ6"}}, {"Date": "on May 9, 2015", "Text": "An excellent tale. Please finish the next part as soon as possible", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2J2YKK9I12EPF"}}, {"Date": "on October 27, 2014", "Text": "Very good, quick read!  I would like to see more from this author!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IMG6MX3R9W0A"}}, {"Date": "on April 30, 2014", "Text": "I think this is a great start for a new author.  Unfortunately I found myself getting a little bored during the long periods of character interactions.  Story did not suck me in like I hoped.  Suggestions....bone up on the science and give more of the background and scientific issues.....maybe a character in a central weather site that could come in and explain what was happening and why......what is likely to happen next....needed more about what was happening elsewhere....just getting America in trouble is not going to reduce the population to 2 billion.....how are the populations that don't have guns in everyone's hands making out.....how are the countries ruled by strongmen making out.  Material here for many more novels.  I hope you write them because I, for one, can not wait.", "Helpfulness": 0.6666666666666666, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A257MCM03ILBC"}}, {"Date": "on April 25, 2014", "Text": "I really enjoyed this story. I cared about the characters and the plot line seemed real, so real that I was feeling scared. I highly recommend this book.", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9HJRBWGDYM9Z"}}, {"Date": "on April 25, 2014", "Text": "Couldn't put the book down.  Well written and convincing and I wonder what might happen next.  I look forward to the next one.", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FTDI1E20GJMG"}}, {"Date": "on July 15, 2014", "Text": "I appreciate the fact that extensive research was done on this book.  I find it to be rare that an author takes the effort to get it right.  The characters were not the super hero stereotype that are often used, but instead regular people thrown together because of the situation.  I look forward to reading more from this author.  Thank you", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMLY3FNKO06PO"}}, {"Date": "on December 11, 2014", "Text": "Enjoyed this; looking forward to next installment.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10X33O65NMTQI"}}, {"Date": "on July 16, 2014", "Text": "Great book! impatiently waiting for the next one.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11SOJ52961ZGC"}}, {"Date": "on January 5, 2015", "Text": "Would have been nice to know that this is Book One in a possible series. The characters in the book were enjoyable except for Tess. Got tired of her real quick. The book ends abruptly and you're left wondering what happens to not only the main characters but also the rest of the country. If there is a sequel, please tell us if there's a book three.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8PDUVY0U6MFM"}}, {"Date": "on July 10, 2014", "Text": "I enjoyed this book a lot. I would highly recommend it for adult reading.  I can hardly wait for the sequel.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NB8IVOPQP78X"}}, {"Date": "on June 9, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JY0ZQS79OF9P"}}, {"Date": "on May 27, 2014", "Text": "While we all worry about climate change,world over population and the violence in our country,this book really brought it home how quickly civilization implodes when man's fear over rides his humanity", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADDA277L0KITK"}}, {"Date": "on May 26, 2014", "Text": "The author has written a trilogy about how to survive in a world that has gone a bit haywire. There are some slow areas but in general the storyline moves along.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2I4SOW1G41CSJ"}}, {"Date": "on May 24, 2014", "Text": "I'm not a hard critic. This book was well written and interesting. I enjoyed it. As with most story's in this genre,there is always a possibility of a sequel, and i would read it. Good job J.Z.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3R5HKORHGRI80"}}, {"Date": "on May 24, 2014", "Text": "interesting, reasonably well edited. good prepper story from multiple points of view. its a good quick read with an interesting weather twist", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AC1GTP98FJ9BX"}}, {"Date": "on May 23, 2014", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARCJD9R5Z2VFX"}}, {"Date": "on May 19, 2014", "Text": "I really liked this book.  It was original and mostly well written.  The writer clearly did his research which made it more believable.  It was rather long, which I like, and held my attention.  Towards the end, it became more of a play by play, day to day, diary, which I did not like.  It was almost like the writer ran out of direction.  I also did not like the way it ended.  Which plays in with the way the book sort of drifted on, almost like the plot was not wrapped up by the writer.  Worth the read.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6PD8NL2RTDG1"}}, {"Date": "on May 18, 2014", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12L4UCJOL8453"}}, {"Date": "on May 5, 2014", "Text": "Abe, as a deadly weather system, is well presented and realistic. The individual stories are also well done. The means by which the cyber terrorists bring about the chaos and what governments are doing is a total fog that one has to accept for the stories to work.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JKSEWFO8N7YH"}}, {"Date": "on April 29, 2014", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A320Y7T1VJE1Y"}}, {"Date": "on April 21, 2014", "Text": "as a debut writer,this author has been writing well.I have been enjoying the story thus far.I do hope the next book won't be too long coming.it's frustrating knowing there should be more and you have to wait to read it.my biggest complaint is the love stories written into the book.they are weak at best but I'm not into romance novels.so on to waiting for book 2.....", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3T6F077YDA9ZL"}}, {"Date": "on April 17, 2014", "Text": "A good story told from several scattered viewpoints. I look forward to the next book to see where the characters come together.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADO4HW5RUYGFT"}}, {"Date": "on April 11, 2014", "Text": "good story line and easy to follow but ended abruptly unless as another has stated there is a sequel in the works...ric harrison", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGN9KSNG3JUZM"}}, {"Date": "on March 31, 2014", "Text": "Enjoyed it, it was a good book. Good character development.  Can't wit to see if there is a scond book to continue the story.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Q0ZWP7W6G87R"}}, {"Date": "on December 10, 2014", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JNPCJVKSTRB0"}}, {"Date": "on March 6, 2015", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QW4V0W37EKHN"}}, {"Date": "on July 29, 2014", "Text": "To much like a Soap Opera as in human daily activities.  I kept thinking/waiting for something to happen and FINALLY something would and it was sensible but the drowning on and on in between almost made me stop reading and lay the book to rest.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3R1ESOMPTTOFK"}}, {"Date": "on April 21, 2014", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33VHP5J6POFI9"}}, {"Date": "on October 1, 2014", "Text": "I really enjoyed it until the end. There was no ending. It just stopped. I hated that!  I have no idea what happened to all the characters and if the United States survived. I certainly hope there is a second book so I can find out.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AURTZJT0XI7UI"}}, {"Date": "on February 28, 2015", "Text": "The premise of the story was good.  The writing was just OK.  The characters in the Texas storyline were the least interesting.  Would have given another star if they were either more believable or left out altogether.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APW4RK94YKIZH"}}, {"Date": "on September 24, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2O1O8KREOT1Y5"}}, {"Date": "on March 8, 2015", "Text": "Easy & fun quick read. Look forward to the sequel. Books like this make me realize I live in the perfect area should disaster strike. Have like minded people nearby is always a great part of a preppers plan.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14KL754UDMG0F"}}, {"Date": "on June 14, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QPMT2CTOPT8S"}}, {"Date": "on November 10, 2014", "Text": "good BUT needs a part two", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17BK1YI3JHBW8"}}, {"Date": "on September 8, 2014", "Text": "Interesting premise, keeps you reading, drops you like a ton of bricks at the ending, so abrupt that I wondered if I was missing a chapter.  Writing is not that great, but the story line was.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3P25B1P1PWYX1"}}, {"Date": "on November 18, 2014", "Text": "It kept me in suspense but I really wanted to know the whole outcome. I was hoping to see the calvary ride in to the rescue---but this was  real life and you must draw your own conclusions.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36AEX12H618ZP"}}, {"Date": "on March 12, 2015", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3A07WN86M9B6W"}}, {"Date": "on March 26, 2015", "Text": "Good story telling method. Kept my interest for each character. Would like to have seen more detail as to why these storms would be forming in the south west.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A89FPQHULZAWJ"}}, {"Date": "on March 16, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOFS9WJE55RYO"}}, {"Date": "on April 3, 2015", "Text": "Pretty decent book.  I'm a huge fan of post-apocalyptic and prepper fiction. This book was right up my alley. It was fairly well-written and enjoyable.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7H6MN7OV5AL8"}}, {"Date": "on January 19, 2015", "Text": "A real easy read. I like the way the chapters flowed. The story line is more believable than you think. It wouldn't take much for this to happen. Bruce", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZM10K036162P"}}, {"Date": "on September 5, 2014", "Text": "Fascinating characters, interesting story lines, in great places. Now I must impatiently wait for the expected sequel, hope it is soon in coming.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VV9717XA6CKX"}}, {"Date": "on June 9, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RGL4AHPGTV0N"}}, {"Date": "on September 3, 2014", "Text": "Very good read. Excellent characters and a very good story. Although the end is understandable, there is plenty of room for a sequel.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2R34U68H6GJSA"}}, {"Date": "on March 2, 2015", "Text": "This book, though fictional, helps you become more aware of being prepared for anything.  Enjoyed reading  this book  very much", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MCS17C7LKBJ8"}}, {"Date": "on March 11, 2015", "Text": "I am a post apocalypse junky. This was a quite believable story.I thoroughly enjoyed it. Looking for the next in the series.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WPUP8CQODCNA"}}, {"Date": "on March 20, 2015", "Text": "I good book and unusual story but no real ending.  Its like they are planning  a sequel and want to save the final story.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BG295WCIZBXN"}}, {"Date": "on March 8, 2015", "Text": "Good story , enjoyable read, held my interest  but ended when I was not expecting it.  Felt as though I was left hanging.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2D3RYXTPZW431"}}, {"Date": "on December 31, 2014", "Text": "I loved this book. It kept me up not wanting to stop reading. I really can't wait for the sequel. I want more and more!!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UD1OHA1L5E74"}}, {"Date": "on November 12, 2014", "Text": "I liked the book for the most part but I feel you just stopped the book instead of finishing it.  Needs a better ending.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VBB3JO8IT53D"}}, {"Date": "on June 27, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8O37V6L36VLR"}}, {"Date": "on February 27, 2015", "Text": "Very entertaining. This book held my interest throughout and was hard to put down. I am looking forward to the sequel.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AN7Z06I3P1LQ1"}}, {"Date": "on September 19, 2014", "Text": "A storm of the century that really is a storm of the century. Interesting characters. Hoping for that sequel soon.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MFN319YOZLPM"}}, {"Date": "on June 23, 2014", "Text": "Using a disaster as an excuse to use cyber crime to reduce the population and rule of big government may sound too wacky an idea, but unfortunately is plausible.  Three groups of people do what they can to come out on top.  Heroes help each other. This was a great page-Turner of an adventure that I found quite polished and well thought out, especially a good first effort. Bring able to self publish is presenting thirsty readers with many new authors to choose to read.  This is a good one. I am now a fan of disaster fiction, a new genre. Get busy on the aftermath, please.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15D5QQBSMUZBV"}}, {"Date": "on May 18, 2014", "Text": "Surviving Abe held me in such a grip that I couldn't put it down.  Tess respects that traveling over water can be treacherous but, when the grid goes down with a dangerous storm coming, it suddenly becomes deadly.  Andy's bicycling trip across the country is halted in Texas when it begins to rain and doesn't stop.  Gus is just beginning a much anticipated week of elk hunting when an early blizzard strikes.  He quickly realizes that no one is coming to rescue him and his chance of survival is slim.  Their stories will quicken your breath as you pray for their survival.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TSWOMC7GHDQJ"}}, {"Date": "on March 15, 2015", "Text": "What happens next?  It's seat of the pants time and I can't wait to find out! Honest-Abe was a great read!", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DCMYFEO0VRKO"}}, {"Date": "on October 13, 2014", "Text": "Great but left me hanging. Need to finish or another book.  Please do more of this style in the future.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIIEJE2O3FZ54"}}, {"Date": "on August 14, 2014", "Text": "Well written", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TMO78CLKND6"}}, {"Date": "on October 3, 2014", "Text": "Great Story. Lived that something besides zombies heralded the apocalypse. The ending was abrupt.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3A11HNWMG62YJ"}}, {"Date": "on May 7, 2014", "Text": "I have always enjoyed post apocalyptic fiction (minus zombies), and this story was almost too believable. It was also very well written (which can be a challenge particularly in this genre) with only one obvious and glaring error that sometimes distracted me from the Tess portions of the book. Otherwise, a really well written, thought provoking, entertaining read. I hope that there really is a continuation in the works because it would be a shame to leave this one hanging out there alone.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AF1OMVY87E0JI"}}, {"Date": "on April 14, 2014", "Text": "I read a lot of the survivalist/prepper fiction and this was well worth the read. They hit the climate change exacerbation of extreme weather events on the head. I didn't necessarily buy the radical environmentalist character but that is a minor gripe. All the characters were well developed and the multiple story lines were all interesting and entertaining. I can't wait for a sequel (hope there is one). It was a thoroughly enjoyable read.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FAYT5DLHVQTO"}}, {"Date": "on October 18, 2014", "Text": "I really enjoyed this book. A somewhat realistic view of what \"could\" happen, but not too happy when I discovered there would be a book 2. I wish I would have known about it upfront. I'm a little tired of \"series\" novels. Can anyone just write a good post apocalyptic one read novel? I have read some pretty good ones in the past. I suppose it's a money thing. Ones needs the reader to keep buying....", "Helpfulness": 0.5, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A271S2L1S2KOY6"}}, {"Date": "on January 27, 2015", "Text": "I can't believe I was enjoying this book and all of a sudden, again, my legs were kicked out from me!  Can't any one FINISH a book?  Or at the least give notice that the book is another `buy me' but you will have to wait a year or more for the next installment. Darn shame that I was really fascinated by the story but I WILL NOT PURCHASE the 2nd or 3rd  sequel(s).  Good fortune in your writings.", "Helpfulness": 0.5, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OFXVQX8LP59W"}}, {"Date": "on August 8, 2014", "Text": "I recall that the first page or two was hard to read but it didn't take long before I wanted to know what would happen next. At the very end I wanted more resolution to one of the story lines, but the book was entertaining throughout.  This was my first experience with the Prime book-a-month lending library (now I'm on my second) and I'm very pleased that there are entertaining books available.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATLZS974XTOEA"}}, {"Date": "on May 3, 2014", "Text": "This author has done an excellent job of creating and fleshing out quite a number of characters , creating a very interesting scenario , giving each person interesting and different characters, individual situations and storylines while maintaining the story's overall flow. I am left hanging, wanting to know what happens to everyone, so I hope the sequel is along soon.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FK6MVYAC786E"}}, {"Date": "on June 14, 2014", "Text": "Really enjoyed the take of something like this really happening. Just seemed like to much time was spent on the players.would have liked more on how they took care of themselves ,but maybe that will be in next book .Will be looking foe it .", "Helpfulness": 0.5, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GPA8SFH09WIY"}}, {"Date": "on June 22, 2014", "Text": "I had never read a \"climate fiction\" book before and the concept intrigued me. I'm so glad I decided to try it! This was such an awesome read! I literally did not want to stop reading  and couldn't wait to see what the next page had in store. The story line was exciting and the characters were terrific. I heartily recommend this!", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZH4TWCPLLNZZ"}}, {"Date": "on July 4, 2014", "Text": "Such a great story!!! I couldn't put it down....JZ O'brien is a storyteller, wordsmith, and humorist all rolled into one! Combine those qualities with a fascinating topic - very timely and food for thought on the consequences and how to cope with the reality of severe weather - and you have a \"must read\"!!", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VVSRD3J4KKDZ"}}, {"Date": "on August 3, 2014", "Text": "Wow, cannot believe I finished reading this book. I feel like I was just dropped put of a plane . My first thought was it cannot be over. So glad to see that there is a sequel. Certainly enjoyed every page, can't wait to read sequel. Oh, it is a very scary book. It is one we could have nightmares about.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATUM6CU3GKPKT"}}, {"Date": "on May 2, 2014", "Text": "This novel seemed very realistic to me, given the extreme weather lately.  It is well written, with humor and good conversation mixed in to balance the desperate survival action passages.  There are very few grammatical problems, and the words flow smoothly.  I also learned a few new survival tips.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18F11Y2DNNU8V"}}, {"Date": "on October 8, 2014", "Text": "Well written and I am looking forward to the next book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13COST1HGT1VW"}}, {"Date": "on July 7, 2014", "Text": "Surviving Abe was a great read. It's somewhat confusing at the beginning because of all the story lines…but the characters are great, lots of information and believable scenarios. Just wish there was another book so I could continue following the story!!!!", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KGI9THM5DOUI"}}, {"Date": "on March 25, 2014", "Text": "I read a lot of books but don't write many reviews. I wanted to give due credit to this author for a wonderfully written first novel. I really hope there is a sequel, because my only complaint was the abrupt ending. There is so much left to tell!", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AS8BFBE3R82T"}}, {"Date": "on July 23, 2014", "Text": "I really enjoyed this book. I had a hard time putting it down to get something done or sleep. It lost me with the boating terminology but didn't detract from the story. Looking forward to the sequel. Very well written, no spelling errors.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GXD3XD373BIA"}}, {"Date": "on July 28, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RG9EWP7C6G0W"}}, {"Date": "on May 27, 2014", "Text": "This was a fabulous book! I do hate waiting for the sequel, but I guess I'll have to be patient. It is very well written! I could hardly put it down. He said the sequel will be out this summer. I can't wait!", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASHLHE80DUYD7"}}, {"Date": "on July 30, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKP14Y2PZK5IL"}}, {"Date": "on May 7, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASJ3BCFJSCOKY"}}, {"Date": "on July 13, 2014", "Text": "I really enjoyed \"Surviving Abe\" characters and are interesting and diverse. Well written and the plot makes sense throughout the entire book. Can't wait to read the sequel.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TUJ5FRZNI6Z1"}}, {"Date": "on June 2, 2014", "Text": "i read a lot of books of this genre and have to say i really enjoyed this book,great character development & storylines that kept me wanting more.hope there'll be a sequel", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYVFYJKS7KR0G"}}, {"Date": "on April 16, 2014", "Text": "Have read my share on this subject and have to honestly say it was extremely hard to set this book down. Clean,  suspenseful and in-depth. Will definitely get the sequel.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AOG6GM0EFEPB"}}, {"Date": "on May 16, 2014", "Text": "Thoroughly enjoyed reading this author.  Immediately looked for a sequel!  Happened upon this author thru amazon recommendations..glad that happened..Fun ride!", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABNUXOXS39XVE"}}, {"Date": "on March 20, 2014", "Text": "This turned out to be an excellent piece of writing. I plan on watching this author and his works. Hopefully this story line will continue soon! A great read!", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2I3UNBNPVQFNV"}}, {"Date": "on May 3, 2014", "Text": "Extremely we'll written and thought out. Interesting plots, locations and characters. Fantastic first book. Thanks, will read more as it becomes available.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MTOQ5P6OAC5S"}}, {"Date": "on August 16, 2014", "Text": "Good read, left me wanting more.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UZQ11XCD4MQR"}}, {"Date": "on July 12, 2014", "Text": "This is a very good book.  I was so engrossed that it totally caught me by surprise when it ended.  I'm really looking forward to reading the sequel!", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XMUIB476DMPC"}}, {"Date": "on March 18, 2014", "Text": "I would hope that a second book would continue the story.  The detailed story of the boat journey was excellent along with the other story concepts.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A129C1HW214558"}}, {"Date": "on June 25, 2014", "Text": "I really enjoyed the pace of this book.  The characters were plausible, the story line reasonable.  I recommend this book for good entertainment.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAZZ885CVOPMG"}}, {"Date": "on December 31, 2014", "Text": "Enjoyed book hope to see more", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RHRVOR3ME7PU"}}, {"Date": "on June 8, 2014", "Text": "Very well written and engaging. Can't wait for sequel as story is only half told. Be interesting to see what happens with characters.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32PPSPYNE8156"}}, {"Date": "on January 21, 2015", "Text": "Very interesting story plot", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKR4RKRPAZ3WT"}}, {"Date": "on July 14, 2014", "Text": "This was a very good book!  I can't believe it was O'Brien's first novel!  I am already looking forward to his next books.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1F42SJUZJWR9A"}}, {"Date": "on May 4, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24U61OTML78KY"}}, {"Date": "on June 11, 2014", "Text": "Excellent read .. I really enjoyed The book .. and am ready for Book 2 in this series ...!!!!!  Hurry up comes to mind !", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23865UCM7KTFO"}}, {"Date": "on March 6, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27U4SHLWJMRFR"}}, {"Date": "on September 6, 2014", "Text": "The story is good and there are very few grammatical errors (unusual for a Kindle book!) but the book suffers from a couple of serious flaws. First, the characters all seem to speak with the same \"voice\" - no variation in dialect or differences in vocabulary for example, and that makes most of the dialog boring. Second, and what I consider a fatal flaw, character development is practically non-existent. The book ends in the middle of the story and requires a sequel, already in the works according to the author. There is no indication of this until the book ends. Authors or publishers who don't make known in the title that the book is the first in a series anger me. I will not be wasting my time or money buying or reading the sequel(s).", "Helpfulness": 0.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1J9Y8E6DP936E"}}, {"Date": "on December 8, 2014", "Text": "Excellent read!", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AALFY1CQ81ZZ2"}}, {"Date": "on February 28, 2015", "Text": "A light read", "Helpfulness": "", "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38LU02KPNO47H"}}, {"Date": "on June 18, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LAR9NLD4ZRGE"}}, {"Date": "on June 9, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APWS0F0J0RJ4R"}}, {"Date": "on February 3, 2015", "Text": "A whole lot of slow moving plot to tell not much of a story with no ending. A sequal should be able to stand on its own story wise and the reader should be informed that the book is 1, 2 or 10 in a series. i feel like I wasted my time reading a story with no ending. I probably wont look forward to the next book. Cant authors finish a story?!", "Helpfulness": 0.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2T831KK8IYTNX"}}, {"Date": "on March 13, 2014", "Text": "I am a weather nerd! So this book was right up my ally! You first get the perspective of seven people all set in different sceneros. Then they meet several more or some of the characters meet one another and the story just evolves!I can't describe how well this was written ! In the beginning I thought wow how Am I going to keep up with everyone? But it's not a problem at all! It just works really well! Then you got the Storm Abe! Which expands most of the nation. This book is fiction but I can see how this can become reality. Just this week it was 60 degrees here in Ohio then the next day we have below 15 degree wind chills! Weather is crazy and you add in climate change which I full heartily believe in then it just gets crazier ! Anyway I wouldn't pass this up! It's a very good read and very well written! And just a side note...I can NOT believe what happens to Con ! I loved that lady! And then you have Eric who is the mastermind in the cyber attacks ! Poor Tess has no idea what she is getting into! And he states two times \"I need to learn how to sail incase Tess doesn't make it\" wtf does that mean?! He's an evil man! Then you have the ending! It simply just ends..abruptly! There's so much more that needs to be told!", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TQSPI296Q8AM"}}, {"Date": "on July 7, 2014", "Text": "have not finished Greek Island", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AI58EPSWT5145"}}, {"Date": "on July 27, 2014", "Text": "Can't wait to find out what happens in the next book.  This was a fun book to read and very hard to put down.  I enjoyed all of the characters I met on this journey.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2O3XM4AXQLCM3"}}, {"Date": "on April 18, 2014", "Text": null, "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AU1CZ4HCHYSA0"}}, {"Date": "on July 27, 2014", "Text": "Predictable and feels unfinished on many topics. I was really waiting to hear the condition of the country after Abe.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATIZVNGBRI8ZW"}}, {"Date": "on July 17, 2014", "Text": "Intriguing and terrifying premise that had great potential.  However, dialogue was way too cute, too flip and too long.  The cutesy bantering when people are in a life and death situation,  in all settings and all characters in this book is simply incongruous and silly. I actually found myself rolling my eyes at it.  In addition-TWO love stories?  Yawn -like a cliched B movie. I kept reading hoping it would at least give some answers but no - it suddenly ended. This is much too long for what it gives the reader.  Silly cliche-filled dialogue, unlikely, unnecessary and really inappropriate  love interests, convenient \"I know somebody\" situations and ingenious emotions - how quickly Ela got over her mother's death - makes me glad this was a free book.", "Helpfulness": 0.4, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SC3DI95OKVXV"}}, {"Date": "on June 6, 2014", "Text": "Interesting concept, boring characters, little action for the volume of writing.  If you're going to move the story this slowly, actual character development is definitely crucial.", "Helpfulness": 0.3333333333333333, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24T1VGWC8TJFK"}}, {"Date": "on March 29, 2015", "Text": "Nice climate fun book good dialogue", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7FCP9AFR0L5J"}}, {"Date": "on May 12, 2014", "Text": "I read 25% of the book and simply found it boring.  The only story I cared about (somewhat) was Andy.  Mother/Daughter stuff was uninteresting and I grew weary of the constant \"witty\" banter. Girl in the boat - no. If after reading 1/4 of a book and this is all its got - I don't waste anymore of my time.  Seems like a lot of you liked it and I'm sure I looked at reviews before purchasing, but I really cannot agree with any of them.  Next . . .", "Helpfulness": 0.3333333333333333, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DZW52HH8FIFQ"}}, {"Date": "on May 15, 2014", "Text": "I read approximately one fourth of the book but then gave up. The characters and the plot were few and far between the long lecture-style passages on man-made global warming.", "Helpfulness": 0.36363636363636365, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JB2N07QOERJ1"}}], "ReviewUrl": "http://www.amazon.com/SURVIVING-ABE-Climate-Fiction-J-Z-OBrien/product-reviews/1499640927/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.3 out of 5 stars"}, "OfferPrice": "$12.32", "Salesrank": "#1,161,717", "ListPrice": "$13.69"}