{"Category": "in Books (", "Name": ["The Griff: A Graphic Novel"], "Timestamp": "2015-05-24 23:43:54.780095", "itemurl": "http://www.amazon.com/Griff-Graphic-Novel-Christopher-Moore/dp/0061977527", "Reviews": {"TotalReviewCount": "59", "ReviewList": [{"Date": "on August 14, 2011", "Text": null, "Helpfulness": 0.9090909090909091, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RQ4YHHG9TQ3Y"}}, {"Date": "on August 7, 2011", "Text": "I have to agree with S. Penrose. The script was probably at least slightly above average, but the artist's execution of it (pun intended) left a lot to be desired. The illustrations were beautiful, but that means nothing when so much is lost in translation and readers are scratching their heads trying to figure out what's going on. The publisher should've had the brains to bring in someone conversant in the comics medium to facilitate this process, especially for an author of Moore's stature.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SEHFBIFVF773"}}, {"Date": "on January 31, 2012", "Text": "I love Chris Moore's books and own them all...The Griff is a sad substitute for his usual work. The story is disjointed, badly paced, predictable and just plain boring. I'm glad I didn't pay full price for this book. It doesn't work as a story, a novel or a graphic novel. My advice to fans of Moore is to just pretend The Griff never happened.", "Helpfulness": 1.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AURV0OU4ACASF"}}, {"Date": "on May 13, 2012", "Text": "I picked up a copy of The Griff at the library two days before this writing, (boy am I glad I didn't shell out cash for it) and without finishing it, I'm taking it back today. The Griff is a lame attempt at a graphic novel. It's almost as if the creators have contempt for the medium. Maybe they should talk to Scott McCloud or read Akira or do some kind of homework before belching up such cliche ridden schlock. The only survivors of earth's pogrom are white people (is this the 1950's or what?). There's the usual cartoon cut-out characters lacking dimension. The artwork has no sense of place even in the rare panels that actually have a background drawn behind the characters. The colors look like an accidental spill over the art. The pictures don't work well with the text. I actually got a headache trying to read it. My advice is to wait until they figure out how things should be done in this medium before plunking down cash that could go to more fulfilling work like 100 Bullets or something. I rated it one star for having the gumption to get it finished even though it looks like a supreme rush job, done between what the creative team must consider more important work.", "Helpfulness": 1.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9XNBUFCK3F1B"}}, {"Date": "on August 1, 2011", "Text": "This graphic novel seemed like a home run to me.  I'm a huge Christopher Moore fan, having read all but two of his novels and list him as my favorite writer.  Add to that the fact that I have been an avid comic book reader for sixteen years.  I have often said that many of Moore's works would be perfect for an animated show on the likes of Comedy Central or HBO.  That isn't a far stretch from a graphic novel.  Here however what I read was lacking so much.  Overall, the plot is interesting and a small fraction of the dialogue is Moore-like.  The rest is really bad though.  There are enormous problems with the timeline as things happen at different times but the reader can't tell that.  I kept turning pages and felt pages or panels were missing.  Part of that comes from the artist, Jennyson Rosero, who might be a good artist but here proves not a very good story teller.  Many of the panels prove hard to decipher what is happening because many of the characters never change facial expressions.  Overall, as sad as it is for me to say this, this book looks like it was made by people who don't usually work in this form, which is true but unfortunate.  I expected a lot more especially for the price.  I can't to read Moore's next novel which will hopefully be in his wheelhouse!", "Helpfulness": 0.8333333333333334, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CS4U2S7C6XW6"}}, {"Date": "on August 1, 2011", "Text": null, "Helpfulness": 0.7727272727272727, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11K70GWSB7A5Z"}}, {"Date": "on August 26, 2011", "Text": "I am a huge Christopher Moore fan and had looked forward to this book after seeing it on his Face Book page.  It has a fun story line, but it is not well developed.  It skips along in a way that makes you think that the authors were up against a time line that they couldn't meet.  The characters have a lot of promise, but are not developed to their potential.  The ending suggests that there could be more Griff graphic novels coming, I hope that they take more time writing them.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQI6MJMKM1OVS"}}, {"Date": "on February 10, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIO247KHD2O40"}}, {"Date": "on September 3, 2011", "Text": null, "Helpfulness": 0.8333333333333334, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KXP3L6OE8WWL"}}, {"Date": "on October 7, 2011", "Text": "When I saw that the Griff was finally going to see the light of day in one form or another, I was pretty excited.  I had read the screenplay some time ago, when Mr. Moore posted it online and it seemed to have possibilities.  Before finally purchasing the graphic novel, I read numerous reviews and some folks loved it and others felt let down.  Therefore, I decided that I would like it for my collection and I would accept it for what it is.  I am glad that this project happened, but I found very little entertainment in the story.  Slick design, excellent coloring, and a few clever bits sums it up.  Should I mention that the middle third of the edition I was sent was bound upside down and backwards??  I fully support Mr. Moore for doing a graphic novel of a story that he has wanted to tell for a long time.  I look forward to his upcoming novel, and I re-read his books frequently.  Truly though, I can not reccomend this book, even for the die-hard fans.  All artists should be allowed to break their mode of stroy-telling and do something which they really want to do.  Something for themselves, and not so much for the fans.  I don't hate Dylan just for his album Self Portrait, so.....", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37MBXUV08WUMC"}}, {"Date": "on May 12, 2012", "Text": "I picked up a copy of The Griff at the library two days before this writing, (boy am I glad I didn't shell out cash for it) and without finishing it, I'm taking it back today. The Griff is a lame attempt at a graphic novel. It's almost as if the creators have contempt for the medium. Maybe they should talk to Scott McCloud or read Akira or do some kind of homework before belching up such cliche ridden schlock. The only survivors of earth's pogrom are white people (is this the 1950's or what?). There's the usual cartoon cut-out characters lacking dimension. The artwork has no sense of place even in the rare panels that actually have a background drawn behind the characters. The colors look like an accidental spill over the art. The pictures don't work well with the text. I actually got a headache trying to read it. My advice is to wait until they figure out how things should be done in this medium before plunking down cash that could go to more fulfilling work like 100 Bullets or something. I rated it one star for having the gumption to get it finished even though it looks like a supreme rush job, done between what the creative team must consider more important work.", "Helpfulness": 1.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9XNBUFCK3F1B"}}, {"Date": "on July 25, 2011", "Text": null, "Helpfulness": 0.7142857142857143, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33O2D8P92ZAWY"}}, {"Date": "on July 3, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACEOOCYZRPWF3"}}, {"Date": "on April 14, 2012", "Text": "While I am a devoted Christopher Moore junkie, I am not really a graphic novel reader.  I decided, however, to step out of the black and white story format with The Griff and felt confident this was a cannot miss endeavor.  How could I possibly go wrong, when Mr. Moore is one of my favorite authors of all time?  I have read and re-read every one of his novels, follow him on Facebook, and recommend him to all of my reader friends.  I was not impressed in the least.  I finished the \"story\" in about 2 hours.  The storyline was boring, the illustrations were average, and there was no hint of the Christopher Moore style that I love so much.  I think I understand why the author chose this format and I appreciate his willingness to try new things, but the plot could have been more involved and the graphic novel format skipped completely.  I am sorry, Mr. Moore!  It pains me to say I did not like something you have created.  If you have never read a Christopher Moore novel, please do not introduce yourself to him via this graphic novel.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RZU671U30LI2"}}, {"Date": "on August 16, 2011", "Text": "I bought this before any reviews were available. What a mistake. While the artwork is amazing, the story is WAY too small to read on kindle. If it was a 99 cent book it probably wouldn't be a problem, but it is not, it is $9.99. It seems like kindle buyers should be warned about the size. It cannot be enlarged. Bummer. It just doesn't seem fair.", "Helpfulness": 0.7142857142857143, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZK05L2NQ9RNP"}}, {"Date": "on August 22, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10VOEBL5S337W"}}, {"Date": "on December 5, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A145BOGCDSJ152"}}, {"Date": "on October 14, 2014", "Text": "I love Christopher Moore's novels so no matter what I thought as a fan of his writing I really have nothing to loose on this purchase. I'm not a particular fan of the style but Moore's sarcastic and humorous style is all over this. I enjoyed it, a nice break from novels and heavy reading. Not particularly something I would recommend to others on the fly, but it's a nice light read with an acceptable story line.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LL3DENN9NKHN"}}, {"Date": "on August 15, 2011", "Text": "I am an avid reader of the Author Guy but was very disappointed in this. I knew before I bought it that it was a graphic novel but still story, for what there is, was very week and not a patch on his previous stuff. Very overpriced for a 20 minute read. Stick to what you are good at Chris. Bought this pre release from US site and cannot fault service, 8 days to UK.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DR2HZBPWOROZ"}}, {"Date": "on October 2, 2011", "Text": "Having been a long term fan of Christopher Moore, I of course ordered this book/comic. Maybe I'm just not into comics but I just didn't get it. Wish there was a money back guarentee if you are not satisfied. Seems like a lot of his newer writtings are not up to the creative standards he set earlier.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A222W06VTO53II"}}, {"Date": "on July 3, 2013", "Text": null, "Helpfulness": "", "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DZ2XDEJEESKA"}}, {"Date": "on July 24, 2011", "Text": "What a waste of money.  This is a standard old comic book.  It could have been done in the 1950s.  Nothing new, nothing inovative, nothing like what I have come to expect from Christopher Moore.  What a disappointment.", "Helpfulness": 0.7142857142857143, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6MR52Q5AIA5R"}}, {"Date": "on December 21, 2014", "Text": "A Christopher Moore graphic novel! Of course I had to read it. Interesting idea but such a short read, only took me about 20 to 30 min. They should of went into more details but still I'd give it a read of I were you.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AK0VN8QOM5M2L"}}, {"Date": "on October 17, 2014", "Text": null, "Helpfulness": "", "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AVEICP4GMYR3"}}, {"Date": "on February 29, 2012", "Text": null, "Helpfulness": "", "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YZHSX3TQA4S4"}}, {"Date": "on October 24, 2014", "Text": "Chris was right, this was nothing like his other work. But it entertained for a few moments. Can't wait for his next novel!", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QNR2MOUIUQAU"}}, {"Date": "on September 11, 2011", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2THBPVDEOF81B"}}, {"Date": "on April 3, 2014", "Text": "The characters never came alive, they were superficial like 2D caricatures without well defined personalities. So few characters that only one known character could be afforded to die and nobody cared much for him.", "Helpfulness": "", "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJRJ4GXANYBDZ"}}, {"Date": "on February 21, 2014", "Text": "I am a big Moore fan.  He never disappoints.  I have read all his books and passed them on to several friends.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CKXACTD5M3C9"}}, {"Date": "on October 13, 2013", "Text": "As usual Christopher Moore is the best of the best. I think I can make it any clearer than that.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LQM8Z5MGXMD7"}}, {"Date": "on June 29, 2013", "Text": "Some graphic ebooks will be easy to read on an ebook...for now get the hard copy.  It's too short for a Christopher Moore book, but then I never want them to end so soon. In this case the artwork is as god as the writing so, no, that's not quite right. The writing Includes the best response I've ever heard to the question, \"Are you thinking what I'm thinking?\"", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A295CU0WDJM0D1"}}, {"Date": "on January 21, 2013", "Text": "He asked for this book and was excited to receive it as a gift. We would recommend to others who like comics and survival stories", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13EAV10EC1URY"}}, {"Date": "on January 15, 2013", "Text": "But it was an enjoyable read. The GN's preface filled in the back story of how the piece came to be, and it was an adequate explanation. A collaborative work, it felt a bit disjointed at times, and the story seemed to resolve itself with out much explanation or conflict.I liked the story, I just felt it could be... fuller..", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQAK79CHDTLFS"}}, {"Date": "on May 20, 2014", "Text": "I have read all of CM's books including the Serpent of Venice so naturally I got The Griff when it came out.  Enjoyed reading it and looking at the pictures and probably got what was expected out of it.  I would buy anything that CM would put on the market but I prefer his novels to comic book.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XH5AUPBJJLW6"}}, {"Date": "on November 29, 2012", "Text": "I have read all of his work and decided to finally try this. I am glad it was not that expensive because after a few pages I found myself just wanting to finish it to justify paying for it. Some of the witty dialogue is obviously Moore, but the rest is just garbage that is barely funny.", "Helpfulness": "", "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39Z4OU2C7ENWH"}}, {"Date": "on February 4, 2014", "Text": "I love Christopher Moore. He is a very  talented author and The Griff is no exception. This is the first graphic novel that I've ever read and I really enjoyed it. Laughed on every page and I loved the artwork. Very clever book. Highly recommended.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANF8J2RNB1NJC"}}, {"Date": "on January 16, 2013", "Text": "I bought this as a gift for my hubby who is a huge Christopher Moore fan. Although he enjoyed it, it really wasn't what he was expecting from Christopher Moore.  Would love to see graphic novels come out for his more popular books. :)", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17R19GEZY4QXG"}}, {"Date": "on April 18, 2013", "Text": "I'm a huge Christopher Moore fan.  I've read almost everyone of his books.  This is pretty good too, though NOT in the same league as Lamb, or his vampire series.  Nevertheless, if you're a fan too, you'll enjoy this graphic novel.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OMESXSUKWSPZ"}}, {"Date": "on November 8, 2013", "Text": "I bought this for my son and he liked it just fine. This is his favorite author, and when I saw that he had done a graphic novel, I figured he would like to read it. I was right.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2M2VWF68XLPP5"}}, {"Date": "on January 10, 2013", "Text": "Slightly different from Christopher Moore's usual style, but it definitely has his sense of humor, so I enjoyed the book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VABK95C2QN97"}}, {"Date": "on December 4, 2014", "Text": "A great graphic novel by my favorite author!  Wish movies would be made from his books!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PAJAY566PX7Y"}}, {"Date": "on January 1, 2012", "Text": null, "Helpfulness": 0.5, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31O1Z955Q2Q0N"}}, {"Date": "on December 20, 2011", "Text": null, "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NBL1TI2M3CW1"}}, {"Date": "on August 29, 2014", "Text": "I loved it! I wish there were more!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3T9E4VBZZ6F49"}}, {"Date": "on February 17, 2012", "Text": "This was a great graphic novel that had Thrills and Chills, and a bit of comedy.  If it had one weak point, it was not long enough.  I am hoping for a sequel.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HMCIX6AS2Z4Y"}}, {"Date": "on May 26, 2012", "Text": null, "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMVC9WTXYKNJ1"}}, {"Date": "on March 2, 2015", "Text": "Always fun! Always great!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31FV55AB3DQYI"}}, {"Date": "on January 2, 2012", "Text": "One of the things I have to stress most is that it's a comic book, if you don't normally read comic books you're going to get holes or you just might not get it.  There are some places where the story might seems rushed, it's hard to transition cleanly in a graphic novel as compared to a movie.  If you have imagination and you use it as you read the graphic novel you'll get it.  The story is great, if you actually read the part that doesn't have pictures you'll get a fair warning from the Authorguy.  It's not his normal stuff, I wouldn't compare it to any of his novels because it doesn't compare because the complete difference in genre.  If you like comics, you'll like this.  If not, you probably won't.  The art is great and pretty consistent throughout the book, which isn't always the case with graphic novels, and the story is good.  He's focusing on the action and not the characters, so the characters aren't as evolved as you'll find in his books.  For a graphic novel, it works and it's good.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18WM66GBSSPAH"}}, {"Date": "on July 20, 2011", "Text": "this was a good book. but it moved really fast. Moore's books tend to move quick but it is ok because they are full length books. but the graphic novel seem to short to me. the story was good but it wouldn't hurt if the story was stretched over 4-5 graphic novels. it would have been nice to get a little more character development but for his first graphic novel i am very impressed.", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APW97LVMKW10K"}}, {"Date": "on July 21, 2011", "Text": null, "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TB9ZSQ2DRU5Y"}}, {"Date": "on August 22, 2011", "Text": "This was a gift for my husband. It arrived the week after I ordered it on Amazon.(I didn't opt for speedy delivery) I was happy with the shipping packaging because I was taking it to get signed by the author as well. If you don't know much about Christopher Moore, I recommend all his work, including his new graphic novel, The Griff. You'll find all his writings are unique in their own way but connected by characters from various works. Enjoy ;)", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3REGV5AT6ZCYT"}}, {"Date": "on September 10, 2014", "Text": "Love it !!!", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32PUHL1DEF9FA"}}, {"Date": "on August 23, 2011", "Text": "I was an uninformed buyer simply because I'm such a christopher moore fan.  Knee-jerk purchase - and I didn't realize it was truely a graphic novel.  I was expecting graphic - in a literary word sense - not in a comic book sense.  Yet - it is entertaining and would make a great movie.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WM23PR36BMOY"}}, {"Date": "on October 22, 2011", "Text": "Just like all of Christoper Moore's books The Griff was a lot of fun to read! So different from any of his other books but then again this is a graphic novel and he is writing with another author, amazing as well. If you're a fan of either do yourself a favor and read this book!", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XSMSOL8O8M2N"}}, {"Date": "on September 13, 2011", "Text": "I realized that this is not the typical Christopher Moore book, but I was expecting more. I was never really drawn into the story. There weren't too many funny parts. From Christopher Moore you always expect a better product than this.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UYHR0ECR5M8A"}}, {"Date": "on August 9, 2011", "Text": "If you're a Christopher Moore fan, you'll love it.  Excellent graphics and presentation by Ian Corson, and Christopher Moore's trademark humor.  What \"moore\" could you ask for?", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXMQAPY25LE7D"}}, {"Date": "on October 12, 2011", "Text": "As per Mr. Moore's usual, The Griff is funny and irrelevant. Pairing up with Ian Corson was a great idea. This is probably the best graphic novel ever created.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RX53LO2LGWC"}}, {"Date": "on February 8, 2012", "Text": "Fantastic graphics and it actually had a really good plot.. I can't wait for the next installment.  This is Highly recommended.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZH4TNNWGQ90Z"}}, {"Date": "on August 1, 2011", "Text": null, "Helpfulness": 0.14285714285714285, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVS1LCMEWUBGA"}}], "ReviewUrl": "http://www.amazon.com/Griff-Graphic-Novel-Christopher-Moore/product-reviews/0061977527/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "3.2 out of 5 stars"}, "OfferPrice": "$16.06", "Salesrank": "#88,749", "ListPrice": "$22.99"}