{"Category": "in Books (", "Name": ["Galapagos: A Novel (Delta Fiction)"], "Timestamp": "2015-05-24 23:35:44.602372", "itemurl": "http://www.amazon.com/Galapagos-Novel-Fiction-Kurt-Vonnegut/dp/0385333870", "Reviews": {"TotalReviewCount": "248", "ReviewList": [{"Date": "on May 25, 2001", "Text": "I'm really surprised to see so many people who consider Galapagos to be one of Vonnegut's worst novels.  I love his work and I've read many others... I have to say Galapagos is one of my favorites.  On the surface, the unconventional style is great.  It's told from a million years in the future, with events revealed in non-cronological order.  This nonlinear storytelling really drives home Vonnegut's philosophies about the meaninglessness of time (as in Slaughterhouse Five and Sirens of Titan, for example).  Also, the grandiose nature of his plot is great.  The end of the world and the human race as we know it... typical Vonnegut, but still good stuff.  Above all, this book is very funny.  As in his other books, he treats such serious matters as war and death lightly.  This underlying irony is very present in Galapagos.  However, Galapagos is by no means a \"light\" book.  The subtlest twinge of sadness peeks through all of the humor -- just enough sadness to leave an impact.  On another level, Galapagos is great for its concept.  The human race is only screwing itself over, and it's about time it starts going backwards again.  The pessimism of it all is delightful, yet rings true.  My one gripe with Galapagos is its weak character development.  In a way this is OK, as it reinforces the message of the human race as a lost cause.  However, it would have been nice to have someone, anyone, to sympathize with.  But in the end Galapagos is interesting, funny, unconventional, and just a great read.", "Helpfulness": 0.9565217391304348, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PB67T9V6WXDI"}}, {"Date": "on July 7, 2006", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VJQG3OELAQ4E"}}, {"Date": "on February 20, 2007", "Text": null, "Helpfulness": 0.8723404255319149, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AL9HZLZT4X1KL"}}, {"Date": "on April 8, 2002", "Text": null, "Helpfulness": 0.875, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CYRTQ04LYI55"}}, {"Date": "on August 10, 2004", "Text": "GALAPAGOS is a profoundly moving and funny novel set in the reckless times of Ronald Reagan, when America itself seemed to be deevolving. Vonnegut also gives us one of his most succint and hilarious observations on humanity: that no matter how many ages we pass, we will still think farts are hilarious. Highly recommended.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RDBEQOWKE7WO"}}, {"Date": "on February 8, 2006", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10TIXSIN0HVNF"}}, {"Date": "on September 22, 2004", "Text": null, "Helpfulness": 0.9090909090909091, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5JW473XUGHGF"}}, {"Date": "on August 14, 2002", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22U2Y0TGH4SN3"}}, {"Date": "on October 24, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AODKUG6FAKD2Z"}}, {"Date": "on February 2, 2007", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6XUM19PF237U"}}, {"Date": "on April 12, 2005", "Text": null, "Helpfulness": 0.7837837837837838, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVYFXRMRNIUD8"}}, {"Date": "on February 11, 2000", "Text": "Having read Slaughterhouse 5, Slapstick, Breakfast of Champions, Player Piano, Mother Night and \"Wampeters, Foma and Granfalloons\" (hope I got the last title right), I was itching to get stuck into this one.  Unfortunately,  I found it repetitive, slow and lacking the depth of  character, plot and imagination demonstrated in many of his other works.  I'm not saying it wasn't a good(ish) book, but I found it far from being  his best.  I'm surprised to see the variance in ratings given by other KV  fans - I simply can't imagine giving this book five stars, let alone  suggesting it's the best book I've ever read.", "Helpfulness": 0.7777777777777778, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QD2JIGJ8TSCE"}}, {"Date": "on October 6, 2000", "Text": null, "Helpfulness": 0.8, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XY6NRIVJ2PIE"}}, {"Date": "on December 15, 2006", "Text": "For many reasons this is not one of the more popular works of Vonnegut.  I cannot say I disagree with many of the negative reviews in every respect but  still favor this as one of my personal favorites from this incredibly prolific writer.  The new characters have a depth and natural/evolutionary humor to them that makes you consider the human condition.  The satire is not so harsh as in many of Vonnegut's other works and that makes it for more pleasant reading if nothign else.  Not to say I dislike his biting satire at times, it is just that this lighter version of that cutting wit makes for a more enjoyable read.  Perhaps that is why the hardcore Vonnegut fans have not liked this book.  But, the hardcore fans will enjoy the surprise appearances of favorite Vonnegut characters of the past in this novel.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AF3X7J0XC391L"}}, {"Date": "on August 30, 2000", "Text": "Galapagos is an interesting book delving into the genre of utopia  prediction as only the cynical Kurt Vonegut can. His view of the future of  the world is bleak and poignant, but this book, written in 1985, is no  where near as funny as some of his previous works. Galapagos seems a bit  drawn out and laborious, rehashing old themes that even in the 80's were  probably not as pertinent as they could have been. It kept my interest  because of the frequent references to the wildlife of the Galapagos  islands, and not becuase of the supberb writing I have come to expect from  Vonegut. If this is your first Vonegut book to read, then I pity you.  Perhaps you would do better to read Slaughter House Five or Breakfast of  Champions.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CGQ80MXD29J3"}}, {"Date": "on March 18, 2006", "Text": null, "Helpfulness": 0.8571428571428571, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36JMZ3F7A56Y5"}}, {"Date": "on December 10, 2002", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AL2EWQ3MTMK6P"}}, {"Date": "on May 12, 2010", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12ZPIDVB4YSOD"}}, {"Date": "on August 5, 2007", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1G6BUI70X8IIC"}}, {"Date": "on December 7, 2005", "Text": "Vonnegut explains the mechanism of evolution in a simple yet profound manner that will bring a smile to your face.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2C9JTFW6KNB4I"}}, {"Date": "on August 22, 2004", "Text": null, "Helpfulness": 0.8333333333333334, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GARI2JT6EAWA"}}, {"Date": "on November 1, 1999", "Text": "I am surprised at the great swings of opinion from Vonnegut fans on this one.  There is really one profound observation explored here - evolutionary  divergence from a stable state of existence - is it good or bad - or just  human?  Few artists have this clear a vision of the human condition - even  though it is wrapped in a rather confusing array of (apparently?)  extraneous information.  One of my favorite books.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1S6PVAPK3APHE"}}, {"Date": "on January 3, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A95YQMJHULQ6P"}}, {"Date": "on March 16, 2002", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3M77GPST0EICR"}}, {"Date": "on April 14, 2012", "Text": "I don't understand how people are slamming this book.  I guess everyone's standards for Vonnegut are so high they can't just read one of his lighter novels and enjoy it.  Merited many of his books are light but riddled with unbelievable and beautiful ideas, this book has value.  Spoiler*:  By the way, the narrator is Vonnegut's son, if people didn't catch that.  Also, he leaves characters undeveloped in this novel for a reason.  They are unimportant to the overall idea of the story.  Many books lack character development to help highlight other aspects of the work.  Other novels are strictly character driven for a reason.  Hemingway, Faulkner, Nabokov; their stories are driven by their characters experiences.  In Galapagos the characters are to be viewed on the smallest of scales since he is discussing evolution of a society and the mind.  This doesn't mean the book is not worth reading, Tom Robbins \"Villa Incognito\" is written in similar fashion.  It may not have the depth of meaning that his other books have or his beautiful rants that come right back around to the story.  It is short and sweet and to the point, the story is what drives the characters.  This makes Villa one of Robbins most enjoyable novels, where some of his others are bogged down in the development of characters.  They are tiny devices to convey a much larger message, and this is how Galapagos is written.  It is far more personal and reflects where Vonnegut was in his life.  Talking about the evolution of his writing, his \"big brain\" getting in the way.  It discusses his nature and his desires.  In Cat's Cradle he poured his soul on the page, but how can a person do that more than once?  No single individual has that much to offer.  Read Galapagos and just enjoy the storytelling and the ideas (and the *).  I gave four stars because I do agree this is one of his worst foreshadowing efforts.  It still beats 98% of authors at the time though.  I have read all of Vonnegut's work, and am also an English major.  Just saying I enjoy literature and I don't read garbage.  If you are just starting to read Vonnegut read Cat's Cradle, Siren's of Titan, or Slaughter-House 5.  Those are his most praised, but Mother Night is just as good.  Vonnegut had a style all his own, just enjoy reading an original and creative author, because there aren't a lot of them left.  He was one of the last great modern authors, R.I.P. Kurt.", "Helpfulness": 0.8, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VHNSSWKHDX6E"}}, {"Date": "on July 31, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A297ZUJWXTWVHE"}}, {"Date": "on April 30, 2002", "Text": "This was an excellent look at evolutionary bottlenecks. Though the million-year-old ghost as observer is a bit of a deus ex machina, the rest of the work shows very clearly the adaptation to a changing environment by a particular animal, namely Homo sapiens. Is an advanced brain truly an evolutionary advantage?  It causes the extinction of an entire species- us.  The initial cause of mass infertility through parasitism also raises interesting questions on the nature of parasitism itself, as the parasite destroys it's host. This short work was recommended by my Marine Invert prof in undergrad for a fictional and accurate understanding of the inward nature of evolution. Vonnegut truly captures the philosophy behind the theory and not only the facts. A new kind of science fiction- fiction which helps us understand science better.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OP1HD9RGX5OW"}}, {"Date": "on June 30, 1998", "Text": "I am a newcomer to Vonnegut, and this is the first of his books I had the pleasure to read.  Vonnegut takes a satirical look at modern day humanity as he places a handful of (un?)lucky castaways in the role of the future of humanity.  They alone turn out to be responsible for repopulating the entire planet as the rest of humanity has fallen victim to an infertility plague in the midst of economic turmoil.  Who would have guessed that future generations would speak only a single language - let alone that of a little-known cannibal tribe.  This and a variety of other strange quirks of the few survivors is all that future generations will inherit and have to look back at their past.  Not that they would be interested anyways, that sort of thing only intrigues the big-brains of the past.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on May 11, 2000", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": ""}}, {"Date": "on February 17, 2004", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YLJG0TWVI5JR"}}, {"Date": "on June 10, 2003", "Text": "This book is one of the best books I have read in my entire life, not only is Vonneguts dark satire extremely funny in this book, but the points brought up about humans, as a race, are amazingly thought provoking. As the back of the book states \"Vonnegut looks at our world and shows us all that is sadly, madly awry - and all that is worth saving.\" If you have not read this book, but are somewhat intrigued, I reccomend that you read it because it is something different, yet refreshing through its out of the world thoughts.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on January 17, 2007", "Text": null, "Helpfulness": 0.7272727272727273, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AU6DIIDZK2OQM"}}, {"Date": "on December 14, 2004", "Text": null, "Helpfulness": 0.8, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A185HGLJQOH1K7"}}, {"Date": "on November 7, 2006", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2U4SFNO55B64O"}}, {"Date": "on July 3, 1998", "Text": "The witty, entertaining, satirical, and hilarious porttrayal of the future of mankind and the people who made it happen captures your atention at once. The way Vonnegut captures your immagination has never stopped ammazing me.  This book deffinatelly turned me into a major fan.  I would recomend this book to readers of any level because it's just unforgetable.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on April 29, 2008", "Text": "It was a challenge to stay interested. the first two thirds of the book were all over the place. one chapter he would build on characters/plot and the next he would talk about something completely irrelevant to the story. i've read many of his other books and they all were amazing. this one didn't feel like a story to me.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YFS6P7RWBA9F"}}, {"Date": "on September 13, 2006", "Text": "As I read some reviews about this work, I do have to concede that this work is not perfect.  Yes.  You can see a lot of stylistic problems.  Yes.  Some of his characters are caricatures.  However, his ideas are so creative that I am willing to forgive him all his faults and give him 5 stars!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFDPGG7QUONIZ"}}, {"Date": "on November 19, 2003", "Text": "As always, this book by Vonnegut is pure gold.  Kurt is a literary genius with his signature writing style and dizzing intellect.  Similar to an English Farce, everything happens at the wrong place and the wrong time for the 7 aboard the Nature Cruise of the Century.  Brilliantly written.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2X9SDM0OWVNQZ"}}, {"Date": "on December 24, 2002", "Text": "This, as stated in my title, is my first experience with a Kurt Vonnegut book. I found myself deeply engrossed by his wit and wisdom, as well as his inate ability to pull a reader into his prose. I am looking forward to reading more books by the author.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28NRDGGIHZLSV"}}, {"Date": "on December 26, 1999", "Text": "This is one of those books that really makes you think.  It asks the question of what it really means to be human.  Is it better to accept the bad with the good, or to do away with both and live in contented ignorance?  In his own twisted fashion, Vonnegut makes you realize all that is worth  saving in this world.", "Helpfulness": 0.8, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A317CUPDD6NKJN"}}, {"Date": "on August 19, 2010", "Text": null, "Helpfulness": 0.75, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PEKEZTSDJAVH"}}, {"Date": "on January 28, 2004", "Text": "Having read some of the reviews to this Vonnegut novel, I am of the opinion that some of these reviewers are missing the point.  Admittedly, I am but a tenth of the way through this book, but already I see the genius in it.  Forget for a moment that there even is a plot (which is wholly interesting unto itself); rather, one should concentrate on Vonnegut's mastery of literary style.  I love the tone he adopted for this work.  Additionally, his running commentary is a highly satiric social commentary of the state of the human race: satire that hits its mark (and not all does).  That said, this is one of the finest, funniest, and most interesting books I have ever read.  If you have not read this book, I suggest you give it a try, and if you have and disagree with me, that's fine, but I urge you to give it another shot.  Of course, as I said, I am still in the early stages of the book, so my opinion of it could change.  But if the rest is anything like the beginning, this book will make me a believer of Mr. Vonnegut.  Hope you enjoy it as much as I have.  I, for one, am looking forward toward the rest.  Pleasant reading!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on August 18, 2008", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATN1SSKTJD8Z8"}}, {"Date": "on August 7, 2001", "Text": null, "Helpfulness": 0.75, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A134LHYB54WUPM"}}, {"Date": "on July 2, 2001", "Text": "Galapagos strikes me as one of Kurt Vonnegut's funniest and most well-written novels. The writing is, of course, quit witty, but even moreso here than usual. This book also contains what is a semi-rarity for Vonnegut: a coherent plot. True, it's still not told in linear fashion (this is Vonnegut, after all), and few Vonnegut fans would want it that way, anyhow. The book is a page turner because of the way it is written... like in several of his other books, Kurt mentions events that happen later in the narrarative early on, and uses this as a fairly enticing suspense maneuver. The story and theme elements themselves are interesting: de-evolution (plus such related things as genetics, and all things Darwin), the environment, and more. Although this is not his best book (I still refer to Cat's Cradle as that), this book is well-written, coherent, funny, witty, and less fly-by-the-seat-of-the-pants than most of Vonnegut's oeuvre, and thus, in fact a pretty good place for newbies to the author to start.", "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EKTLUL24HDG8"}}, {"Date": "on July 14, 2002", "Text": "This is my second reading of Vonnegut, my first being his play \"Happy Birthday, Wanda June\"  Anyway, I picked up Galapagos at the book store because the back looked interesting, and I finished it in three days (I only paused because the day in the middle was my birthday)  Anyway, I really liked the book, it made me laugh and go out and get more Vonnegut books to read.  Basically, it's about the end of the world, and how people survive it and how they adapt.  I didn't find anything dark or depressing about it, and the lead character is Mary Hepburn (I guess Mary is symbolic.  Maybe not, I don't know)  Anyway, it's a good book.  There were a few parts where I got bored, but at the very least it's a book I read over the summer, so if anything, it's something to do to pass your time.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": ""}}, {"Date": "on July 31, 2008", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Q3ZXKZC42HL7"}}, {"Date": "on August 8, 1996", "Text": "\"Galapagos\" deals with how the world comes to be virtually destroyed, with only a few survivors. Written in Vonnegut's gripping style, this book is hard to put down.  If you've read other books of Vonneguts, such as \"Cat's Cradle\", you'll enjoy this one.  Vonnegut's cynical view of what we, as a race, have done to this world, and how we've been affected in turn make this a wonderful novel.  I recommend it to anyone who sees fault in our world, and those who wonder about the future, and the end of t", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on January 10, 2004", "Text": "This is, hands down, one of my two favorite Vonnegut books (Player Piano being the other).  I also believe that it is the most unabridged window into Vonnegut's own gut reaction to the human condition.  His constant referals to the trouble caused by \"...our great big brains...\" is infinitely simple yet deeply philosophical and very much akin to Daoist thought.  The way in which the story is told seems, at first, to be pointless, but serves to better express the philosophical undercurents of the book.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on January 23, 1998", "Text": "This is the best Vonnegut book out there.  The subtle humor and bizzare situations that Vonnegut is known for come to gether perfectly.  Here Vonnegut takes his scientific knowledge and, once again, applies it to a wonderful novel.  The satirical comments about the evolution of man are wonderful.  The attacks that Vonnegut makes on technology and incompotant people in leadership possitions is subtle and sweet.  A wonderful tale, especially if you understand evolution.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36KGOL4THXK30"}}, {"Date": "on April 4, 1997", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on November 29, 2009", "Text": "Written with typical Vonnegut esprit, Galapagos is an entertaining read. The pages fly by and, although a little laboured and repetitive at times, the hallmark humour is present. What it lacks, however, is the depth of some of his other work. Compared to Player Piano and Slaughterhouse 5 this is a slight work that doesn't resonate for long in the mind once finished. It's fun but it's not Vonnegut at his best.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13UAIE3K517CQ"}}, {"Date": "on October 8, 2009", "Text": "This is my favorite Kurt Vonnegut book. It is truly thought provoking in a Darwinian style. He ties the future evolved human race to today in an exceptional story so appropriately occurring on the Galapagos Islands. The demise of human kind due to a global economic crisis and the survival and evolution of those shipwrecked in the Galapagos make this book a fantastic read.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEDUO3XXGUVN9"}}, {"Date": "on December 12, 2013", "Text": "Another great story from Kurt. Fun, witty and cynical.  An intelligent view on Darwin's natural selection theory and  criticism on mankind.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26SRWX4075MCO"}}, {"Date": "on September 14, 2013", "Text": "It bored me to tears at some points.. I only bought this book because I needed it for my Advanced English class.. it was funny during some parts but other than that I found it utterly dull and unappealing.. And I read books of every genre all the time", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SXJBFE99LNWI"}}, {"Date": "on February 4, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CSFSHW0PNCCN"}}, {"Date": "on November 19, 2014", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADW4CBB8L1VGS"}}, {"Date": "on April 6, 2013", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Q42ON9CEHR4O"}}, {"Date": "on August 8, 2008", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21X0EO0R0T6FT"}}, {"Date": "on November 2, 2011", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A195PCNYWRB75"}}, {"Date": "on July 5, 2001", "Text": "This is one of the best Vonnegut novels, so shut up.  A great look at how intelligent Vonnegut is.  Much like Cat's Cradle and the whole Ice-9 dilly.  A ghost pirate watching a million years of evoution, brilliant.  Creationists need not apply.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQQ4RIL8F6LEJ"}}, {"Date": "on October 17, 2002", "Text": "Galapagos is probably my 2nd least favorite Vonnegut book, which is not to say that is a bad book.  Kurt Vonnegut, however, has done much better.  It's tough to tell exactly where Galapagos is going from the beginning of the book, and the majority of the story after that is a gradual process of building up to a climax that never appears.  Galapagos works well as a caustic satire of civilization and all the supposedly beneficial products of our ridiculously large brains.  But I couldn't help feeling that there should have been something more here.  The characters themselves are interesting and Vonnegut's gleeful dissection of their destinies (death, for most) and the evolutionary consequences of them presents a picture of the personal aspects of Darwinism.  The ending was extremely unsatisfying and it just left me utterly depressed.  Vonnegut's future for the human race saddened me more than I had expected, even when I viewed the book as a satire.  Make no mistake, this book is extremely pessimistic.  Even from the detached viewpoint of the narrator, one can't help but sympathize with the characters, merely pawns in the evolutionary game.  And very few of the characters have any redeeming qualities at all.  Perhaps this was Vonnegut's aim with this book, but I couldn't help but a feel a sense of terrible loss, and I didn't at all find his new human race brave or admirable.  Galapagos, I suppose, will mean vastly different things for different people.  For me, it was a reminder that civilization does have many benefits, and that if it would perish, I would mourn it.  For this realization at least, I have Vonnegut to thank.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2F6XF1KY77T5K"}}, {"Date": "on August 8, 2013", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22FD8OPTAMBWP"}}, {"Date": "on February 9, 2014", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IPM23IJ8Q3L4"}}, {"Date": "on July 19, 1998", "Text": "Nothing more to say. After reading quite a few Vonneguts, I have to say most of them are great, but this one's the best.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A115VTDOOFUVG4"}}, {"Date": "on August 15, 2014", "Text": "Vonnegut seems to have lost some of the subtlety that made his earlier books so charming, but this is still a fun read.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QGXZILQ4WCH7"}}, {"Date": "on May 20, 2014", "Text": "I'm a huge fan of Vonnegut and he is in my top 3 but I am lukewarm about this novel. Premise:1986 a near empty luxury cruise liner will carry the remainder of humanity after a world war or some kind of dystopian catastrophe occurs. The ship is near Galapagos and we meet the few people who are either soon to die or soon to journey from Galapagos to a nearby island where they will make a home for the future of mankind (but they don't know that). The narrator is a ghost related to Kilgore Trout (recurring character in Vonnegut's works) and we get a bit of each person's backstory. Theirs quite a bit of Classic Vonnegut type commentary on the state if current society, how our current \"big brains\" function (human thinking) and how it differs in the future. Overall it's quite enjoyable but it doesn't resonate with me as other works of his.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2I6727D2O1OUY"}}, {"Date": "on October 18, 1999", "Text": "Galapagos is an O.K. book, but perhaps the worst of Vonnegut's books I've read.  For beginners, I found it a bit difficult to get into the book due to its non-linear storyline.  Sometimes this method works, like in  Slaughterhouse 5, but sometimes it doesn't, which I feel applies to Hocus  Pocus as well as this book. While the idea behind this book is interesting  (showing the humoristic elements of evolution, and, I suppose, analogously  showing the absurdity of other forms of progression such as tradition), the  novel just seemed to be too long for such a single idea.  While I liked the  humorous elements typical of every Vonnegut novel, their comedic impact was  increasingly outweighed by the monotony of the novel's exposition.", "Helpfulness": 0.6666666666666666, "StarRating": "2", "Author": {"ProfileUrl": ""}}, {"Date": "on October 1, 2013", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IS5RFG6IDKYV"}}, {"Date": "on March 1, 1997", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on August 28, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AX288FJCPJTKC"}}, {"Date": "on December 28, 2006", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AS6SH2JM2YY3H"}}, {"Date": "on December 4, 2014", "Text": "This is a book whose subject matter defies categorizing. Sci-Fi? Humor? Tragedy? All I know is it stayed with me for a long time and not necessarily in a good way. It had moments of humor threaded throughout the story which is told from two time perspectives some one million years apart. It also has pathos as the reality of what is about to happen dawns on the various characters. It hits the folly of human nature squarely on the head and thereby hits a little too close to home. If Vonnegut had axes to grind or points to make with this book it was to point out how humanity is self destructive without holding out a whole lot of hope except for a few accidentally exceptional individuals.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11RCGZGVXFPPV"}}, {"Date": "on April 1, 2008", "Text": "Sometime in the late Eighties I read this book, started it anyway, and remember not being very impressed and putting it aside without finishing it. I had cause recently to buy the book again, for someone else, and found myself rereading it with great enjoyment. Maybe it's because it's been more than a few years since I've read a Vonnegut book, maybe it's because he's dead and we'll have no more from him, but I suspect it's because the subject matter is a hundred times more relevant now than it was when written. It reads like it was written yesterday. It's not his best, but even on an off day, ol' Kurt is a whole lot better than most of the rest. We could all learn from him.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15P0E7IYRBXAX"}}, {"Date": "on July 20, 1998", "Text": "Vonnegut simply amazes me.  Although this is not my favorite of his books, it is a great example of his work.  He has consistently been among my favorite and most-read authors for eight years, and he never stops entertaining me and making me think.  He has a great skill for presenting fascinating ideas in the most simplistic writing style one could imagine (so much so that many people find it rather annoying.)  Still, his ideas alone merit the reading of his work.  He has an amazing sense of humor and of the absurd, and, while much of his writing is dark and cynical, it paradoxically encourages hope.  Vonnegut is a favorite of every member of the family.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": ""}}, {"Date": "on November 4, 1997", "Text": "Vonnegut brings us a wonderful tale about the evolution of the human race back to it's origins according to the theory of evolution.  A fascnicating, thought provoking book.  However, Vonnegut's writing style is quite annoying at times.  He doesn't simply make a point and then expound upon it.  He beats it into the ground with a figurative hammer.  In particular, I found the numerous references to \"big brains\" quite annoying.  Also, the fact that everything happens by chance.  While these ideas are thought provoking and worthy, couldn't someone as prolific as Vonnegut have found another way of demonstrating these concepts?", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": ""}}, {"Date": "on July 3, 1997", "Text": "Celebrated by some, \"Galapagos\" is in fact one of the most annoying books Vonnegut ever published.  Outside of an interesting time with the ghost of Kilgore Trout, Vonnegut bores us with more island revolution, (ala \"Cat's Cradle\") and a conceited de-evolution theme about humans digressing over a million years into seals.  A tremendous letdown which suggests that Vonnegut needs to look for something, ANYTHING that doesn't have to do with \"man is bad, andhe'll suffer for it, by God.\"  He's said it all before, and a whole lot better than this", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": ""}}, {"Date": "on July 28, 2010", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RAP0MH197N39"}}, {"Date": "on October 30, 2014", "Text": "Vonnegut referred to this as his greatest novel in Fates Worse Than Death. I don't know about that, but if you like Vonnegut, you'll thoroughly enjoy this one. I'd say more, but it just has everything you expect and, presumably love, from Kurt. Likewise, if you're new to his work, this isn't a bad jumping off point, but the usual favorites of Slaughter House Five and Breakfast With Champions might be better. You won't be lost without reading them, they'll just enhance the book once you're familiar with his style--guess that could be true for any of his books.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30EBR6THODGWI"}}, {"Date": "on January 6, 2015", "Text": "I read most of Kurt Vonnegut's novels quite a while ago, so I decided to add this one to my list.  It's vintage Vonnegut, written with his usual vivid imagination and addressing issues that are still important.  This one focuses on the big human brain and how it has managed to really mess up the world.  How Mr. Vonnegut came up with such characters, locations, and actions is beyond most of us mortals.  If you have enjoyed some of his other stories, you'll probably enjoy this one, but if you find his books too full of problems and despair you probably won't.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AENNTTD5FP8OF"}}, {"Date": "on December 19, 2003", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FN1E32ENP19R"}}, {"Date": "on September 22, 2014", "Text": "A different, darkly humorous, but spell binding look into the future, a million years after 1996. Vonnegut tells this imaginary tale through the eyes of a ghost; a tale of how the human race was destroyed, except for a handful of unlikely strangers due to a fluke of circumstances, after humans had turned their 'big brains' to trying to solve every singe problem on earth by developing ever more horrendous and destructive weapons. Sound familiar? I thought it fascinating, but it might not appeal to everyone.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A336A05JYJXPCG"}}, {"Date": "on October 25, 2001", "Text": "Prepare yourself for the nature cruise of the century. This was the first Vonnegut book I read, and I thought it was great. Interesting characters and dialogue, easy going plot and movement, and very amusing.  I enjoyed the philosophy of the story as well, which questions the evolution of the human race, and possibly the precarious nature of Darwinism.  Will our \"big brains\" lead us to the brink of ecstacy, or the brink of disaster? Maybe neither. Read and find out! But beware of sharks.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IY8U0N6P87S"}}, {"Date": "on March 28, 2015", "Text": "Galapagos will not be to everyone's taste but I found it a meaningful meditation on human existence. Unfortunately the doomsday scenario is an all too likely component of humanity's future and Vonnegut does not flinch, he does not hesitate at exploring this even though many readers might prefer to put this out of their minds.  His plot progression is sure and true, his vernacular is classic Vonnegut. If you've read Vonnegut before and liked him, I would definitely recommend this book.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FT42RFXNQFSF"}}, {"Date": "on October 29, 2013", "Text": "This book was suggested by a friend. I am so glad she did! I started reading it and could not put it down, it is so different from everything else I have ever read. It's funny, smart, sarcastic, and sometimes very dark. It makes interesting commentaries on society today and how it could turn out in a million years (altough unlikely!). If you appreciate fiction, science, anthropology, sociology, and some dark humor, you will probably like it.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LQYNBD63DFG1"}}, {"Date": "on August 10, 2000", "Text": "I don't think that I can say I have ever come across an author as creative  as Kurt Vonnegut, Jr. His stories are great fun to read. This story has to  do with the human race as we know it being wiped out and replaced by some  sort of swimming humans through years of evolution. It is funny and has a  deeper meaning imbedded within the text as most of his novels do. Overall,  I would say that it is a great book and I really enjoyed it.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RSLH6NHJ56LV"}}, {"Date": "on September 17, 1998", "Text": "This isn't exactly primer Vonnegut, but for fans, it's one of his best  (best meaning ALL of them). At first glance, it makes no sense that humans  would evolve into what is depicted, but by the time you finish it, you'll  be throughly convinced. This somehow manages to be a optimistic portrayl of  the future, while at the same time, being tragic in what has to be lost for  a true human Utopia. Worth the money to read and re-read.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on August 6, 2014", "Text": "Here i thought I had read all of Vonnegut's books, but no - this one had escaped me.  Other reviewers have summarized the plot; suffice it to say that I loved it, and if you loved/enjoyed prior Kurt Vonnegut novels you will love/enjoy Galapagos, as well.  Typical Vonnegut pointed and wry farce, with Huntington's disease, human evolution, and the ghost of Kilgore Trout's son thrown in for very good measure.  Read this book!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JRSR9KWOWVYZ"}}, {"Date": "on November 11, 2006", "Text": "Galapagos is Vonnegut near top form. As always he is the quintessential interdisciplinarian. For the historian we have contingency, for the scientist  a hilarious and sophisticated explanation of natural selection that is a wonderful counterpoint to all forms of social darwinism, and for the political scientist we have another Vonnegut-puncturing of all forms of political posturing. A quick read, lampooning all the way.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1C9JK4GAZP9ZE"}}, {"Date": "on August 6, 2000", "Text": "This book was very funny.  It has a lot of very interesting points of view  that make me feel not quite so bad when I lack a little depth of opinion at  times on things that just aren't that important.  It was however, very  repetitive.  The basic one liner of the book is that Big Brains are  useless... if you must read the whole book to get that through your head,  go for it.  You won't regret it I'm sure.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14O123QHDPOBG"}}, {"Date": "on March 27, 1998", "Text": "Once again, I am captivated by Kurt Vonnegut's witty and creative ways to delve into the minds and thoughts of both the reader and the character. In only the way Vonnegut can, the characters stranded on Santa Rosalia have a flair for survival, combining to become the future of the human race.  You do not find out till near the end just who the writer of the tale is.  It is definitely a surprise!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOGBXIJ3JW2OS"}}, {"Date": "on December 30, 2014", "Text": "Let yourself go into this semi-fantasy world which Vonnegut neatly creates. Some of the characters are stick figures, but they still do things that amaze and amuse (it is Vonnegut, after all.) Ultimately, humanity as we know it is transformed into fish-like creatures living near an island in the distant future. How they come to that end is the story. As with most Vonnegut, an easy read.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AD5LMQ71YJEN9"}}, {"Date": "on May 7, 1999", "Text": "I did not expect to like this book because I thought it was going to be another part of the downhill slide from Breakfast of Champions.  But it is one of the three classics from the third trimester of Vonnegut's work  (along with Slapstick and Timequake).  It has an ineffable poignancy.  The  interested should also read Wonderful Life by Stephen Jay Gould.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": ""}}, {"Date": "on October 14, 1997", "Text": "\"Galapagos\" has to be one of the most brilliant books of the modern era. It is philosophical and at the same time hilarious, as well as touching and sad. I found myself thinking about this novel long after I had finished it. I recommend it to all who appreciate modern literature, because this is a perfect example of how to write a modern novel.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on June 29, 2014", "Text": "DESPITE BEING A BIT DATED WRT CERTAIN DETAILS, I FOUND \"GALÁPAGOS TO BE THOUGHT PROVOKING, VERY READABLE AND ENJOYABLE.  WHAT MORE COULD A READER ASK FOR?", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQV1BQG7CS5AC"}}, {"Date": "on June 27, 2014", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AR1KEOM4VS82K"}}, {"Date": "on June 19, 2014", "Text": "Nothing wonderful...a bit intriguing  at times...but overall a bit boring. There's no suspense as the writing is out of chronological order", "Helpfulness": "", "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JZITCE63M1YX"}}, {"Date": "on May 30, 2014", "Text": "The book is very well written. Kurt vonnegut is a great author! Not crazy about the ending though it couldn't have ended differently", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AW5SOIYKQ53"}}, {"Date": "on May 16, 2014", "Text": "Read the book many, many years ago. It is a fun story for one who is interested in evolution, etc. I'm not one for science-fiction; I prefer real science, but this was a fun read.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JUTH98TFTWVD"}}, {"Date": "on May 12, 2014", "Text": "Vonnegut's take on how humans could evolve in the future is very interesting. The story line is not in order, but everything is pretty much laid out. I truly enjoyed this book in particular, not only because I enjoy apocalyptic novels, but I also enjoyed the unique point of view. Through satire, Vonnegut raises many questions about humanity's fate.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14HOGP9QF8BKB"}}, {"Date": "on April 21, 2014", "Text": "My first by Vonnegut. Amazing.  Really interesting. Thought provoking. A lot of biology. Evolution specifically. I thought this was going to be science fiction. But it is not really. Definitely should be read by everyone.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3J23GW8FNISGJ"}}, {"Date": "on April 20, 2014", "Text": "Nearly twenty years after the first printing of this book, it remains fresh and pertinent.  Vonnegut's wry comments on the tendency of the human race to destroy itself have continued to be born out by events here on Earth.  The narrator, a million year old ghost of Vonnegut's visiting character, Kilgore Trout, has much to say about the folly of grasping humanities race to make its home toxic.  The castaways who include the last fertile women on Earth, have inadvertently begun the new race on the fabled Galapogos Islands, bear the future of our species within them.  The only drawback to me is some of the extended wanderings on topic.  Still a wandering Vonnegut is better than. Ost finely tuned authors.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8710RWTFG3IY"}}, {"Date": "on March 17, 2014", "Text": "This Vonnegut novel struck a chord with me. Some of his stuff is hard to get but I think Vonnegut likes to make you think and see things that we don't have to just accept. We still do though. I like his way of revealing how absurd humanity is. Great book", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GCUNBCG7FE7M"}}, {"Date": "on March 4, 2014", "Text": "Pure Vonnegut.  A strange story about the last people on earth.  Fun to read when I was actually in the Galapagos.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15414TPBPX1WW"}}, {"Date": "on February 16, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2563HPOWQ6KR"}}, {"Date": "on February 8, 2014", "Text": "Vonnegut is always brilliant, and Amazon's service is excellent. (You always want more words in these comments- may Amazon, and all there go from strength to strength and have a super 2014).", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A383JAA3KVDKYB"}}, {"Date": "on December 22, 2013", "Text": "Nowhere near his usual standard of comedy or storytelling.  It seemed very contrived, Even the basis for the story was uninteresting.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6HNNQRGL3YJ9"}}, {"Date": "on December 17, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BIE11HBOLKC6"}}, {"Date": "on December 11, 2013", "Text": "Strange, but clever unique story telling mechanics. I don't think I've read another story where the narrative tells you so casually all the big plot points as this book does. Strange...", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A158JWNC66M23H"}}, {"Date": "on November 24, 2013", "Text": "There were lots of \"spoilers\" which did not spoil the story. We are heading to the Galapagos soon, so it was a timely read.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BIAWS7X8X59K"}}, {"Date": "on October 18, 2013", "Text": "Fleeting charachters, half-baked ideas and undercooked plot. Still, it's a shaky experience to view your world via a eulogy to you and it. It uses innovative ways of developing the plot, and immerses you in thick, relentless anger, frustration and compassion, which sticks beyond the final page. To me it was unputdownable.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21QJ7FPU26E70"}}, {"Date": "on August 25, 2013", "Text": null, "Helpfulness": "", "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OBXBXP1NJ5UX"}}, {"Date": "on August 6, 2013", "Text": "An odd duck of a book.  Interesting premise but less than satisfying execution, although the writng was above average..  For diehard Vonnegut fans.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CPN7C4X3WW45"}}, {"Date": "on August 3, 2013", "Text": "What would happen if a handful of people were marooned on one of the Galápagos Islands? Vonnegut explores human nature - at it's best and its worst.  Recommended for people who enjoy quirky humor", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PNEPBJY9EVLT"}}, {"Date": "on July 25, 2013", "Text": "Colorful characters who interact in non-predictable ways. Writers style is to tell you ahead of time what will soon happen, and then you are reading to see just how it will all turn out.  Not great, but a good read.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35VTHZD74OBKU"}}, {"Date": "on July 18, 2013", "Text": "Interesting, but not to the standard of his best works.  Typical of his (appropriately) cynical view of the human race.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2M32AVN66PSBN"}}, {"Date": "on July 16, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ED1V15W9TLVO"}}, {"Date": "on July 14, 2013", "Text": "When I first started reading this book I though why on earth did I buy it. Everything written seemed a bit absurd. However I had to keep reading it as it was so unusual. In the end I realize that Kurt was giving us a warning about humanity today. It just took a long time to get the message over.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2H6TDI0BRJMTI"}}, {"Date": "on July 11, 2013", "Text": "Futuristic concept was interesting, characters realistic,  but I didn't care for the ending. Who knows what lies ahead for humans and the idea of a million years from now is difficult to visualize.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28U1KPCNUQ1JP"}}, {"Date": "on July 9, 2013", "Text": "Vonnegut wrote much better works than this such as Slaughterhouse Five and Dead Eye Dick, this seems to have been a filler to pay the bills.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3807IJWARS2MI"}}, {"Date": "on July 4, 2013", "Text": "an excellent and imaginative story. I found the story progressed well and the ending was appropriate.I recommend it as a good read.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3T9Z3DSGUY1FL"}}, {"Date": "on June 29, 2013", "Text": "One has to admire the fertile mind of Vonnegut, who always manages to surprise and delight readers around the world.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EVLAP8BK0JZE"}}, {"Date": "on June 29, 2013", "Text": "Probably 40 years have passed since I've read anything by Kurt Vonnegut, but after thoroughly enjoying this delightful, still amazingly relevant novel, I fully intend to revisit his books.  What a superb talent he displayed!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A221ZC6NQMV9J5"}}, {"Date": "on June 20, 2013", "Text": "If you have ever been to Galpagos, this book is especially interesting.  If not, it is still a very interesting commentary on the politics and a satirical look at the future of mankind.  Quite humorous.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2B60UR3GCDC9U"}}, {"Date": "on June 17, 2013", "Text": "I've beena Vonnegut fan eversince I was first introduced to Slaughter House Five in one of my college Literature classes.  I graduated from college in 1974. After Slaughter House Five  I couldn't get enough of Vonnegut and I have read all of his novels and I must admit that Galapagos was somewhat disappointing.  I still enjoyed it due to my love for Kurt's satirical wit and don't have the heart to give it less than 3 stars.  Kurt was way ahead of his time and if you get a chance to read his Kilgore Trout books, by all means do. Venus on the Half Shell is a must read!!! I am grateful for having a chance to hear Kurt speak at my campus.  God Speed Kurt!", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1M1VOPNQ72CBY"}}, {"Date": "on November 5, 1997", "Text": "My first experience with Vonnegut didn't provide an \"A ha!\" moment. However, he did confirm my occasional, fearful thought that life is impossible to predict and is influenced by all sorts of meaningless, random, seemingly unrelated  events that can take us two steps backward for every step forward.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": ""}}, {"Date": "on February 15, 1998", "Text": "I found the book in a pile of trash.  I'm not a degenerate, just happened to be a kizmit(?) type of thing.  The book struck a nerve.  It is both hilarious and thought provoking.  But they say there is truth in humor.  And I'm sure Mr. Vonnegut would question who they is.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on September 6, 2014", "Text": "I've been on a Vonnegut binge lately, and Galapagos is my second favorite after Slaughterhouse 5. Like other Vonnegut stories, Galapagos takes the reader on an unpredictable, funny, fascinating, and disturbing journey, exploring novel varieties of tragic human vanity.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AG9J8JXTEWI9Y"}}, {"Date": "on February 28, 2000", "Text": "Vonnegut has created a thinking masterpiece that involves some of lifes great mysteries.  While being short and easy to read the book covers a lot of interesting issues about humans and evolution.  Once again Vonnegut  makes peole think about why we do what we do.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A139QXH8RXGLLX"}}, {"Date": "on May 20, 2015", "Text": "I have read most of Kurt Vonnegut's novels, and this one was one of the poorest in my opinion.  The usual irony, humor and plot twists have gotten worn out and hackneyed.  I stuck with the novel and finished it, but I was tempted more than once to give up on it.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FW72FCQHM56J"}}, {"Date": "on October 30, 2014", "Text": "I can't believe I never read this when I was younger.  So thought provoking.  Interestingly enough, I teach high school biology, so it was wonderful to see the biology teacher and her curriculum represented so accurately.  Definitely worth your time.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2A9KPPHZH2WW0"}}, {"Date": "on December 31, 2014", "Text": "My opinion - After reading about a third of it I quit torturing myself by thinking I should finish it.  His writing was all over the place - time wise and subject matter wise.  It didn't make enough sense for me to care - about anything or any one.", "Helpfulness": "", "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ONLNRMDNFAO6"}}, {"Date": "on May 18, 1998", "Text": "One of the brilliant ideas of Vonnegut. The book is humorous but I felt ashamed while I was laughing. It is an anti-utopia, a dark vision of so called evolved man. I really wonder how it would be a million years later after I read this book.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": ""}}, {"Date": "on August 22, 2014", "Text": "I read this book more for getting my Vonnegut fix than for interest in the subject.  That said, his inimitable rambling yet repetitive jargon hypnotized me once more.  It's certainly not the story but the immersion in the author's aura.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A361NUCX6IH58A"}}, {"Date": "on August 29, 2014", "Text": "I think I might have outgrown Vonnegut his rambling style got tedious. Or maybe it is just this book written from the prospective of a ghost with a time span of a million years. If the book was been half as long and been a better read.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABCHP9X0OOI6V"}}, {"Date": "on July 7, 1997", "Text": "'Tis possible to be told a story's end,(in the beginning), and yet not have the story be told, 'til almost the end; thus the story's end is not the end, but the beginning, and the story's story is  told at almost the end.  The En", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on August 21, 2014", "Text": "Disappointed in the wandering of the plot and descriptions of events, geography etc, References to poetry and phrases from old authors were the saving graces of this book, composed in his later and more philosophical years.", "Helpfulness": "", "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A181Y0QLBO4EX1"}}, {"Date": "on October 8, 2014", "Text": "KVJ was a great philosopher and this book takes a good look at humanity and how our big brains keep causing trouble. It is of course all linked together and punctuated with quotes from Great Authors. Very Vonnegutian.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASWMAG4LL1D09"}}, {"Date": "on March 18, 1999", "Text": "This book affected me the way not many others have. I couldn't help but thing that humans' big brains are the source of all our problems. An all to realistic portrayal of the possible de-evolution of humanity.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on December 26, 2014", "Text": "Great mix of history, science and quirky characters. This time I could follow Vonnegut. The message that there are consequences for our destructive behaviors comes through loud and clear.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3V22577Y4IQ3Z"}}, {"Date": "on September 8, 2014", "Text": "Definitely NOT Kurt's best effort. I highly recommend HOCUS POCUS. GALAPAGOS is slow slow slow to start...I guess the shrooms Kurt took when writing this one were a little too MELLOW.", "Helpfulness": "", "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZW1VJXIM50YT"}}, {"Date": "on January 16, 2013", "Text": "Very typical of Kurt Vonnegut, this book goes back and forth between time and people. Somehow he manages to tie it kind of together in the end. Out of the box version of evolution.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3P2HOEYABWJDW"}}, {"Date": "on March 25, 2013", "Text": null, "Helpfulness": 0.625, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FCLVBY9O5DOS"}}, {"Date": "on October 17, 2010", "Text": "Another delicious bite from Kurt Vonnegut's imagination which I am delighted to at last own, instead of having to return it to the library.  Received in good condition.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24E6GAR8LFRNI"}}, {"Date": "on February 9, 2015", "Text": "I love Vonnegut, but this isn't his best. A good idea, poorly executed. I didn't enjoy the story or the writing, until the very end where the narrator finally speaks.", "Helpfulness": "", "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZTQRU5NWDM3M"}}, {"Date": "on March 19, 2007", "Text": "Big brains are our problem!  Given the mess the world is in today, Vonnegut's message is more on target than when he wrote the book.  Excellent reading.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FP1Q3E1R4ABS"}}, {"Date": "on August 4, 2014", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Y1YXJE186H9J"}}, {"Date": "on June 13, 2013", "Text": "Kurt Vonnegut is one of my favorite authors, and I have read this book many times before. Cynical and witty. Delivered promptly in good condition as promised.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31O90IJ7WLMS1"}}, {"Date": "on May 3, 2015", "Text": "His writing style and storytelling are timeless and beautiful. His wit and charm scream off the page as well as his insights into the complexity of humanity.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ISIWIM85BQKS"}}, {"Date": "on July 29, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWLKAH7B5ARBY"}}, {"Date": "on August 12, 2013", "Text": "I thought Galapagos should be considered one of Vonnegut classic stories, excellent example of Vonnegut's humor and perspective on the human condition.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALSBYY0L8MBRH"}}, {"Date": "on August 3, 2013", "Text": "My boyfriend purchased this book being a very avid Vonnegut reader and was not disappointed. By far one of Vonnegut's best stories. Highly recommended.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34GXUSH3HQAWM"}}, {"Date": "on July 15, 2013", "Text": "I was happy to read this book because I will be visiting the island next month and this was the perfect way to get into the mood of the islands.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14EY85HLCGW2P"}}, {"Date": "on February 18, 1998", "Text": "Although I enjoy Vonnegut, I usually find him difficult to read. This story, however, is wonderfully written and easy to follow.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on February 23, 2015", "Text": "Vonnegut is witty and ironic and biting, and seems to have given up hope for our species, but I think he still has hope.  Rad.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AU9N153CPDKX"}}, {"Date": "on November 18, 1998", "Text": "The problem with Vonnegut is that he peaked in the 60's.  Sirens of Titan, Cat's Cradle, Mother Night, Slaughterhouse V, and God Bless You, Mr. Rosewater are his best efforts.  That is not to say, however, that  subsequent books have been bad.  Quite the contrary!  Standing alone, later  books such as Jailbird, Slapstick, or Breakfast of Champions are excellent;  they simply don't compare to Vonnegut's earlier works. I read Galapagos  with this opinion, expecting to read good Vonnegut, but not great Vonnegut.  But Galapagos surprised me, and though it still isn't quite as good as  vintage Vonnegut, it was a lot closer than his recent books.", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": ""}}, {"Date": "on June 19, 2014", "Text": "Anti climactic with a few funny parts.  It wasn't my kind of book. It seemed the author just gave up half way through.", "Helpfulness": "", "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3F6HS3L21SYC5"}}, {"Date": "on December 17, 2000", "Text": null, "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAO1CPGIF6R8"}}, {"Date": "on March 17, 2014", "Text": "Kurt Vonnegut rocks. This book is one of my top favorites by him already and I'm not done yet. Worth the read", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25JY0CDYG5KVM"}}, {"Date": "on August 11, 2013", "Text": "Kurt Vonnegut books are wonderful. This is not  one of his best, but it is still a great pleasure to read.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A216US6NZAJRDI"}}, {"Date": "on November 3, 2014", "Text": "This is Kurt Vonnegut in a wierd state. Cynical as usual, but not all that much redeeming social value.", "Helpfulness": "", "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1H5RK2IBIGVNB"}}, {"Date": "on November 19, 2014", "Text": "Loved it, if that's appropriate for something so dark. Very apropos for problems facing us currently.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A397XRUU6YWWCL"}}, {"Date": "on January 3, 2015", "Text": "Vonnegut's usual, weird, stuff... de-evolution in the post-apocalyptic isolation of the Galapagos!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A802IF0LZLWY9"}}, {"Date": "on July 3, 1997", "Text": "Next to Slaughterhouse-five this is Vonnegut's best.  It perfectly blends immense humor with an element of seriousness that only vonnegut could create.  The character of Leon Trout is easily one of the best he has created in any of his other novels.  This book seems to be a bridge that ties all of vonnegut's books together; from \"Player Piano\" to \"Hocus Pocus.\" The message that this book leaves you with will not be one soon forgotten.  This is also a great one for someone new to Vonnegut", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on December 19, 1997", "Text": "Kurt Vonnegut wrote the book Galapagos in the year1986 as a satire of the human race, making many contentions about what is wrong with it and showing some of these effects.  He presents a new society of humans which will result from a million years of evolutionary change due to an isolation of our species in the Galapagos islands and a near extinction of all humans.  Vonnegut's work is a satire in which he shows what he thinks is wrong with the human race.  He is trying to show how many of the actions humans take are unneccesarily created by what he considers our oversized brains.  Among Vonnegut's focuses are love, war, murder, death in general, and insanity.  He believes that everything about our society has become sick and over-complicated.  He tells the reader that \"This was a very innocent planet, except for those great big brains.\" (pp. 9) Throughout the book, he shows how each of the above problems in our world are things that happen to humans only because of ideas that their big brains give them.  For instance, he presents a man who has made a career out of making women think they are in love with him, and then running off with their money.  If it weren't for love, these women would have never had this problem.  Vonnegut contends that love is an illusion created by our big brains, which may be true.  However, in Vonnegut's new and improved human race which has much smaller brains, love does not exist, and mating is only for reproductive purposes.  He is very wrong in saying that people would be better for this, because although love brings problems, it also brings a lot of good things.  Vonnegut's new human race spends all its time fishing for food and basking in the sun.  He rids of every problem humans have today through evolution, which makes people almost like fish.  They are able to stay underwater for extended periods of time before coming up.  He also creates humans who have sense of individuality.  All people look alike, and since people have small brains and no need for relationships of any kind, it doesn't matter that people can't even tell each other apart.  They have no sense of history, or of who they are.  Vonnegut does not seem to think that these are things that humans need.  Vonnegut's story is believable, and could very well happen.  It involves ten people who are stranded on the island of Santa Rosalia and never found.  At the same time, a bacteria on the mainland begins eating human ovaries, so that no more humans are born, and the race as we know it becomes extinct.  The ten people on the island begin to reproduce, and evolve through time to eventually become what Vonnegut believes is the ideal society one million years from now.  Humans are isolated to islands forever, because their small brains restrict them from building any type of boats, and even if they were able to swim to South America, they would get the bacteria and be unable to reproduce.  This book definately helped me to understand man's origins.  In a way, it was the opposite of learning history which is supposed to help us understand human nature and to learn from that and not make the same mistakes again.  It is taking a story from the future and using it to understand the past.  Vonnegut's tales from Santa Rosalia, which are mixed in cleverly throughout his buildup towards the ship's departure, make me wonder if human life began the same way.  His story centers around an older man and woman who are on the island along with six young girls.  It could be that such a situation happened with Adam and Eve, who could have had six daughters before Eve became unable to reproduce, then when the girls became old enough, Adam inseminated them.  I don't know the real history since I've never read the bible, not that I think that would have anything to do with how it really began.  Another reason it could be similar to the beginning of humankind is that communication was strained because the older people, who spoke English, could not understand the Kanka-Bono language spoken by the young girls.  The first humans on our planet presumably did not yet have a language to speak, and had to develop their own methods of communication.  Also, I learned a lot from Vonnegut's narratives about how people's brains shrunk over time so that their heads could be more streamlined and they could swim better.  It involved Darwin's Law of Natural Selection, to which Vonnegut often referred.  It was interesting to put that law into modern-day terms.  It's interesting to hear to what humans may evolve rather than from what we have evolved.  The evolutionary ideas put forth by Vonnegut throughout the book are very interesting and informative.  However, what I don't agree with is Vonnegut's assertions that these evolutionary changes should happen.  It may be that the future human race which Vonnegut puts forth is merely an exaggeration of what he envisions, and that he uses evolution simply as a tool for change so that he does not have to spend too much time talking about how social changes will occur.  The point is that Vonnegut seems fed up with every part of human life and yearns for something much simpler.  I can agree with him only to the point that war, crime, deceit, and murder are behaviors which humans don't need to have.  However, I disagree with everything else.  I think that life needs to be complicated, because it gives people options.  We are allowed to live our life however we choose, and every person chooses differently.  People need to be able to think, to communicate, and to understand different things about themselves, others, and life.  We all need to be individuals.  Although I did not agree with many of Vonnegut's opinions, I must say that I enjoyed the book.  It is an interesting idea to think about, and Vonnegut presents the events in a very creative way.  Vonnegut's style of presenting ideas more than one time did get irritating at times.  For instance, he told the reader three or four times that in the future, humans will have short life spans due to killer sharks and whales.  Also, every time he refers to an action a person performs, he says it is due to their big brains, and states matter-of-factly that people in the future have no need for such a behavior because they are not capable of thinking and therefore performing the action.  Despite such annoyances, Vonnegut's style was funny and entertaining.  This book should be read as an introduction to any course on Sociology that is taken, and by anyone who is interested in people, society, and psychology.  Vonnegut has such intense ideas of what is wrong with humans and society, and these ideas should be given consideration.  They may not always be accurate, but they give quite a commentary on what is wrong with humans and what needs to change.", "Helpfulness": 0.5714285714285714, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2T145209TK6CH"}}, {"Date": "on April 5, 2015", "Text": "Read it cover to cover, it keeps you laughing and you can't put it down.  Very well written.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FUTBUYWNFDCY"}}, {"Date": "on September 12, 2014", "Text": "Interesting novel.  Vonnegut fans of course will love it.  Others probably won't get it.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MYEIWCP6KC0H"}}, {"Date": "on May 15, 2015", "Text": "Very enjoyable.  Some brilliant statements that created warm fuzzies.  Good read.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWVD7RUK2WK63"}}, {"Date": "on August 16, 2005", "Text": null, "Helpfulness": 0.6, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32N69TSTYYNGJ"}}, {"Date": "on September 14, 2014", "Text": "A great read to take along on any trip, especially one to the Galapagos!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36R7ZKXONUVGD"}}, {"Date": "on August 24, 2014", "Text": "Not one of Vonnie's best. You won't be missing anything with this one.", "Helpfulness": "", "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NGXA189MW1YX"}}, {"Date": "on October 25, 2014", "Text": "Like all Kurt Vonnegut's books very funny and thought provoking.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UY6IW82N3ZBG"}}, {"Date": "on October 21, 2014", "Text": "Kind of confusing, but I had to finish it.  Enjoyed the humor.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3U2Z0HY29MQHN"}}, {"Date": "on April 30, 2015", "Text": "Though not his best it is pure Vonnegut.  Well worth reading.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZSXZ819KSNDM"}}, {"Date": "on May 31, 2001", "Text": "This is my favorite of the ten or so Vonnegut books that I've read. It is one of his funniest books and probably one of the best beginning-to-end story lines. I recommend this book to anyone who wants to get their first taste of Kurt Vonnegut's writing style at its best.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12APJ5I2MO3V"}}, {"Date": "on February 28, 2015", "Text": "What else could you want in a Vonnegut novel?", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2L5R53ULZJFNA"}}, {"Date": "on December 15, 2014", "Text": "Great book. Recommended for any Vonnegut fan.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39R31HD2IPSJN"}}, {"Date": "on April 6, 2013", "Text": null, "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Q42ON9CEHR4O"}}, {"Date": "on March 22, 2013", "Text": null, "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A99XZEGZTEVXS"}}, {"Date": "on April 25, 2015", "Text": "Got it. Never read it. Sorry, I'm no help/", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VAXOUR1K2Z2J"}}, {"Date": "on March 17, 2015", "Text": "Vonnegut will always be current and wise.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TIBD7B63TDOT"}}, {"Date": "on February 23, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KX9HQ91LFDKT"}}, {"Date": "on March 10, 2000", "Text": "this is a vonnegut best.  most of his books sum up a post apocalyptical world leaving something to be desired, but this hits the nail on the head. a good read", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GKB85R7HA0HV"}}, {"Date": "on January 24, 2006", "Text": "From the very first page, I was hooked. Starting out a story with something like \"A million years ago...\" would make anyone want to read on. I liked Vonnegut's comical description of the evolution of humans a million years in the future to that of dolphin-like creatures with fins. Just like Cat's Cradle, this book is about the end of the world, so I didn't find another story about that same kind of thing being very original. While I can't recall the ending at the moment, I remember finishing the book and being disappointed. Something was missing. Somehow I had expected more, but Vonnegut deprived me of it. While I applaud his creative humor found in much of the book, I must say that his ending was quite unsatisfying.", "Helpfulness": 0.5, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGGD15S0QO5L5"}}, {"Date": "on November 19, 2014", "Text": "another great v-gut novel", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MF5C2MCIL5ZQ"}}, {"Date": "on July 8, 2008", "Text": null, "Helpfulness": 0.5, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A316EWNBO5YA5T"}}, {"Date": "on June 18, 2014", "Text": "In 1985 I wouldn't have touched Vonnegut with a 10 foot pole.  All the \"good ones\" had already been written.  30 years later, everyone was wrong!  The Advanced Genius Theory states that when a truly brilliant mind seems to be in the senescence of a career, it [the big brain] could be producing its greatest works.  That may be the case here.  I don't think this is as good as his best novels.  I think this one stands out as far and away a great work.  I don't even want to call it just literature, because its really a kind of scientific paper, or one of those books by Stephen Jay Gould that throws in some data, anecdotes, talks with others, and tries to make a grand conclusion about something in nature.  Vonnegut does that in his least cloying, least clever and most truly natural and funny way here.  I am glad that I waited 30 years to read this book.  I wouldn't have understood it then...but it is \"of the time\", this time, right now!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15SJAPFLPBL42"}}, {"Date": "on August 19, 2010", "Text": "And unless you absolutely hate Vonnegut for some reason, it's a must for you as well.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACR41W8M5MCCJ"}}, {"Date": "on November 11, 2011", "Text": null, "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUEK1JOY0NQT8"}}, {"Date": "on May 1, 2015", "Text": "Terrific book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25RGD7V8ACPBG"}}, {"Date": "on October 23, 1999", "Text": "When my Biology teacher told our class we had to read this book, I was really mad.  The book stars out kind of slow but it is very fast reading  from then on.  The longest chapter is about 5 pages which makes it very  quick to read.  The story line is very interesting because it doesn't  really follow the concept of time.  It sort of switches off between the  future the present and the past without any warning.  I really enjoyed it!  It also has alot of symbolism.  It's a great book!  Vonnegut is speaking at  our school next month!!", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20Z92AVMVPB6J"}}, {"Date": "on June 17, 2013", "Text": "I've read most of Vonnegut's works and this is the worst by far.  He rattles on and on page after page about finches and human ailments and students in biology class.  None of these discussions go anywhere.  Maybe he was getting paid by the word.  It was tedium to get to midway in the story.  I couldn't take anymore and had to find something else to read.  Very disappointing.  After Sirens of Titan and Breakfast of Champions I expected much more than this.", "Helpfulness": 0.5555555555555556, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFD1NKDPU8NZN"}}, {"Date": "on January 16, 2001", "Text": "Vonnegut journeys back 1 million years to the year 1986 to give us some insight to the danger of our large brains.  Being my fifth or sixth Vonnegut book, this one was not a let down.  It weaves a very interesting tale on a nonlinear trail to reveal what human kind has become, one million years later.  It is a very quick read, I read it over the span of a few hours.  Don't count this one out on the list of Vonnegut greats.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ELD3TH1IV652"}}, {"Date": "on July 5, 2011", "Text": null, "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MV5RJTPCUAEO"}}, {"Date": "on February 13, 2011", "Text": null, "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MQ92M9OJJBU1"}}, {"Date": "on September 20, 2011", "Text": null, "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1V3G80AOTFKOF"}}, {"Date": "on June 16, 2014", "Text": "This book is well-written and very funny at times.  I love Kurt Vonnegut's style, and would recommend any of his books.  He's definitely a master author.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DKP8MGNLFVYC"}}, {"Date": "on September 26, 2013", "Text": "Vonnegut's specialty was always the ability to look at humans from a different angle.  In this book, he was particularly acute.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TKFUJYRRRF9J"}}, {"Date": "on September 9, 2013", "Text": null, "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3M84ZGA7GLSKF"}}, {"Date": "on December 10, 2011", "Text": "This book to some may seem repetitive or not have a point. I know some have told me they feel that way when finishing it. I disagree on those points. I found this book to be amazing. Vonnegut really speaks of human dependency on material rather than simple survival. It is a great commentary on society and an idea you will not see again soon. The writing itself is not fluffy or amazingly well versed perhaps, but the simplicity almost makes the points stand out more and allows the reader to focus on Vonnegut's point rather than fluffy writing.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CXABNSAEXLG2"}}, {"Date": "on March 15, 2015", "Text": "I went on a spree where I was reading like one Vonnegut book after another and this book was one of them. I honestly have NO IDEA WHAT THIS BOOK WAS ABOUT. I think I read it like 6 months ago, it hasn't even been that long. Read on Vonnegut and you have read them all, amirght?", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LHCHTQWJEWR1"}}, {"Date": "on October 19, 2008", "Text": "Whew, way out there!  But what do you expect from Vonnegut? Traveling there early next year ('09); and thought I could get a few tips about the terrain.  Fugetaboutit!  Just amusing crazy humanity futurisms that happen to take place there...a real page turner and most amusing.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37ZF2O3ZJUMVS"}}, {"Date": "on March 3, 2013", "Text": "There is no way around saying that Kurt Vonnegut is probably a total madman, yet completely brilliant. The way he can weave an almost inconceivable ridiculous story into magic is truly something special that you dont see these days.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BINC0TOODHZ5"}}, {"Date": "on April 18, 2001", "Text": "I don't mean that in a bad way.  This book is very typical of Kurt and his craft.  It is very similar to the 12 other books by him that I have read in pace and patterns.  But like Slapstick, his look at the future did not enthrall me.  Also I am not an environmentalist so the overall theme of the book \"Humans will destroy the Earth if we don't do something\" didn't touch me.  The only character in the book who is compelling is the headless son of Kilgore Trout.  His roll is the events is so passive that you can't \"root\" for him. And there was no one else in the book to grab my attention.  All in all it was written well and read quick, like all his previous books, but there was nothing in it that jumped out and begged for attention.  Thanx for your time: T", "Helpfulness": 0.3333333333333333, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13T9FCU0J1GO5"}}, {"Date": "on December 14, 2012", "Text": "I read this book many years ago.  Now with children in high school I think this is a must read to counter the rush toward dystopian society works that have become so popular.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2N103C35X6RJA"}}, {"Date": "on November 8, 2011", "Text": "The item is perfect. My boyfriend is a collector of first edition books, especially those from Vonnegut, so I bought this for him for his birthday. He LOVES IT!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AR0YW8OPIDUK0"}}, {"Date": "on May 20, 2013", "Text": "As someone who has studied anthropology and a great interest in survival stories this book was absolutely perfect. Kurt Vonnegut is truly unique", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3R9RZJA3PUY69"}}, {"Date": "on April 26, 2011", "Text": null, "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AI3375ZZ1DLDK"}}, {"Date": "on February 26, 2014", "Text": "This was purchased for my daughters AP Lit class. The book was new in great condition and it arrived within 2 days thanks to Prime-", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHHXMWZAGH55I"}}, {"Date": "on July 23, 2014", "Text": "The book is in great condition, happy to add it to my collection.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AORV7GPY9D96Z"}}, {"Date": "on September 1, 2000", "Text": null, "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1T2E1SY35D6ML"}}, {"Date": "on July 28, 2001", "Text": "Compared to the other 10 Vonnegut novels I've read, I found this one to be rather slow-moving.  To further make it uninteresting, he repeatedly tells you what's going to happen looong before it does, which leaves you with \"well it's about time that happened.  no big surprise.\"  The characters never get fully developed either, which leaves you not really caring what happens to them.  This is the lowest rating I've ever given Vonnegut.", "Helpfulness": 0.42857142857142855, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANTGGAQYPSWHF"}}, {"Date": "on March 22, 2006", "Text": "The book Galapagos is unlike any other book I have ever read before it takes you back to one million years ago then to the year 1986. The book is about a group of unwitting passengers who go on a cruise where they end up crashing into the Galapagos Islands where they have to survive. However the book to practically the beginning of time when humans are evolving then to the passengers of the ship and what they are like. The author also talks about what will eventually happen to them as well. The book seems to jump back and forth a lot from one million years ago to the year 1986 so personally I got a little confused and lost. Yet I did gain some knowledge of what the author was really trying to say but for the purpose of the review I won't go into detail about that. I can tell you that the story is told from what I understood as a ghost that died aboard the ship. The \"ghost\" guides you through the voyage of the Bahia de Darwin and sort of shows you that evolution isn't just a game of survival but of risks as well, which I found to be pretty cool about the book. Personally as a high school student I wouldn't exactly recommend it to other high school students because its not really fast paced the author seemed to take to much time trying to get the point across which bored me a little and got me off track. However don't get me wrong the book was very well written and interesting to read.", "Helpfulness": 0.25, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JJAKOPAZK14F"}}, {"Date": "on August 21, 2011", "Text": "I am a huge Vonnegut fan, and have been on a Vonnegut reading binge all summer. In doing so, however, and despite the fact than I'm a fairly fast reader, I've onlycovered about 2/3 of his published works. Galapagos is the latest title I've completed, and it is as wonderful as the rest.  Full of surprises, despite all of the clues/hints/foreshadowing the author provides.  A really fun, really sardonic, truly Vonnegut experience!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39MTH2IQ38O8T"}}, {"Date": "on March 21, 2011", "Text": null, "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21618SLAEN3FF"}}, {"Date": "on November 21, 2002", "Text": "What a great concept...our big brains are our downfall, the one problem that evolution will ultimately alleviate.  I agree that this is not Vonnegut's most rewarding book, but it is certainly the most thought provoking and the most fun to talk about.  The idea of human beings, millions of years into the future, as having evolved into otter-like mamals who eat seaweed and lay in the sun to cook it within their stomachs strikes me as very funny.  I've always loved Vonnegut.  I read all the books at 13, when they were cool just for the cynicism and swear words and later in my twenties when I found them provacative and oddly touching.  For later period Vonnegut, this is definitely a highlight though, a lot of plot, rather than just a forum for him to be a wise-(guy).", "Helpfulness": 0.25, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TYRZ2DX3VDV1"}}, {"Date": "on May 6, 1999", "Text": "Having read all of Vonnegut's novels, I can say without a doubt this is the worst.  The characters were boring and the premise was absurd.  Give this novel a few billion years, and maybe, just maybe, it will evolve into  something readable.", "Helpfulness": 0.5263157894736842, "StarRating": "1", "Author": {"ProfileUrl": ""}}, {"Date": "on March 28, 2015", "Text": null, "Helpfulness": 0.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LC75WEOQFGFT"}}, {"Date": "on May 23, 2003", "Text": null, "Helpfulness": 0.375, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VW2LV682NEY3"}}, {"Date": "on February 28, 2011", "Text": "Book was in very good shape, as promised and the price was very reasonable.  In addition, I received it quickly.  Thank you to an A+++++ seller.", "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OMX5XZNPGA4X"}}, {"Date": "on September 4, 2014", "Text": "This is the first Kurt Vonnegut book I have read and thus I was not prepared for his style of writing.  It was not to my taste.", "Helpfulness": 0.25, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3N614VL3S3ISN"}}, {"Date": "on March 12, 2001", "Text": null, "Helpfulness": 0.4, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16A216K70M9P3"}}, {"Date": "on March 13, 2003", "Text": "As to this story by Vonnegut, titled GALAPAGOS,  one is naturally inclined toward charity when reading an author who has spent sixty years of his life to entertain readers.  That said, having the ghost as a narrator was neither scary nor funny.  The interrupting quotations belched from the black box, Mandarax, were pretentious and of course interrupted the flow of the story.  This story shows the his inclination to use gimmicks to establish a new genre which might be called science satire.  One must be fully prepared to suspend disbelief when being told of a blue tunnel to the afterlife that is pursuing the narrator ghost, son of the now tiresome Kilgore Trout.  To pen a narrator who has no part in the action and no motive for telling the story beyond curiosity is a continuous distraction to the story -- and not at all what the author intended.  The ghost was really composed of Vonnegut's haunting memories of Vietnam, another distraction.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1U20CUTG6I28X"}}, {"Date": "on July 23, 2013", "Text": "Having been to Galapagos this book has been used very badly to advertise the written product. Galapagos is worth much more than a bunch of deviates being stranded on one of its islands. I am more than pleased that a strict tourist code now controls the visits of  humanity to this amazing volcanic remnant.Nature at its best! I fell for the book's title. The mystique presented by Vonnegut never took me willingly on the cruise arranged.", "Helpfulness": 0.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATGW5A4M4KHCX"}}, {"Date": "on October 19, 2001", "Text": "With Vonnegut, it's always hard to tell what he is truly trying to convey to the reader. It seems, at times, that even he loses track of the plot and that may be the true brilliance of his style. Galapagos, on the other hand, did not contain much of Kurt's usual cynicism and wit. It stumbled forward at times never fully fulfilling the reader's hopes....at least for me it didn't. If this was his outlandish attempt at being like Michener, I truly hope it was his only attempt. I must reiterate I do enjoy Kurt Vonnegut but there are some things better left unsaid and some stories better left unwritten.", "Helpfulness": 0.2, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32UNNAPCVO1ZG"}}, {"Date": "on December 9, 2002", "Text": "Galapagos! What a disaster that was. To tell the truth this is my least favorite Kurt Vonecut book. It just isn't like his normal witty self. The book is almost serious. Although the story is gripping and addictive, the story drags too much on simple things. It is as far from \"The Sirens of Titan\" or \"Breakfast of Champions\" as possible. Definately not one of his best. My advice is: Put down Galapogos and go but \"The Sirens of Titan\".", "Helpfulness": 0.2, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BS95UQXTWFXR"}}, {"Date": "on May 13, 2014", "Text": "the was first Vonnegut book I didn't like. Just seemed to go nowhere. Will cont to read Vonnegut.  I was very disappointed", "Helpfulness": 0.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A326I4Z62VC9ZR"}}, {"Date": "on April 12, 2002", "Text": "I didn't find this book insightful, interesting, or very entertaining.  It moves very slowly and doesn't really go anywhere which probably inhibits Vonnegut from really conveying his messages.  I recently read Cat's Cradle, Jailbird, and Bluebeard and all were much better.  Maybe I've overdosed on Vonnegut over the past few weeks, but I really shouldn't have to try hard to enjoy a book.", "Helpfulness": 0.2857142857142857, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1T2AEF4I7M0NM"}}, {"Date": "on July 14, 2014", "Text": "Just could not get into the book..I tried!", "Helpfulness": 0.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FHGTK0C87V0W"}}, {"Date": "on August 11, 2014", "Text": "See the humor but the book is ridiculous.", "Helpfulness": 0.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJXB22QEJ81GJ"}}, {"Date": "on June 3, 2004", "Text": null, "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NIQK6ZLYEP1L"}}, {"Date": "on May 1, 2006", "Text": "A bit on the dull side.  Not up to speed with his other books.", "Helpfulness": 0.36363636363636365, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1X9UFMZGNRDSY"}}, {"Date": "on January 26, 2003", "Text": "The only fiction that we read on the islands, this strange little novel by Vonnegut (hmm, that's probably an oxymoronic statement) contains quite a bit about the natural history and make-up of the place than one might expect. A science fiction story about 1986 and the events that caused the end of the human race, except for an accidental experimental colony on Santa Rosalie (not an actual island in the chain, as far as I could tell), the story is part tragedy, part comedy--a post-modern expose on humans and human nature, with special emphasis on the benefits of natural selection. Vonnegut is not for everyone, but if you can stand his laconic wit, this is the most unique book that you can find about the Galapagos.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17IW44FV0HUTY"}}, {"Date": "on November 29, 2007", "Text": null, "Helpfulness": 0.2222222222222222, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A40PQ5AV4UT9U"}}, {"Date": "on March 7, 2005", "Text": null, "Helpfulness": 0.4, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A383746LFAIRWM"}}, {"Date": "on January 30, 2001", "Text": null, "Helpfulness": 0.25, "StarRating": "4", "Author": {"ProfileUrl": ""}}, {"Date": "on April 10, 2014", "Text": "This book, without a doubt, rates among the ten worst books I have ever read!  It is very difficult to read because it seems as though someone took a finished manuscript, threw all the pages in the air, then gathered them at random to bind together.", "Helpfulness": 0.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A254YAQWRJRJ58"}}, {"Date": "on January 4, 2007", "Text": "This book was purchased as a book we had to have for our kid, high school. Turned out I read it also. Was a great book. Thought it would have been boring 'cause of the ap-english class. Know for classics, not great reading material.. Surprislingly good.", "Helpfulness": 0.2, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A361N4NAQ0QHX6"}}, {"Date": "on September 6, 1999", "Text": "This is the only Vonnegut book I did not finish reading. I have read Slaughter house 5, cat's cradle, player piano, sirens of titan, and breakfast of champions and I thought they were all  excellent books.", "Helpfulness": 0.3125, "StarRating": "1", "Author": {"ProfileUrl": ""}}, {"Date": "on July 11, 2013", "Text": "Dont waste your time or money. I could not even finish this book although I read it about halfway through just hoping that it would start making sense.", "Helpfulness": 0.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2K63G8R4BLF4N"}}, {"Date": "on December 18, 2013", "Text": "NOT what I expected.  Okay for reading on a lazy winter day.  I would not recommend wasting your time, unless you have nothing else to do.", "Helpfulness": 0.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BJWQ9N6ZWJKI"}}, {"Date": "on September 19, 2011", "Text": "This was certainly a book that took longer to read than it should have.  I got about as much out of it as reading the Jabberwocky.  Other than Vonnegut's obsession with brain size, it seemed to be a rehash over and over of something that was neither interesting nor relevant to anyting in this world.  I am certainly not going to get any more of this series", "Helpfulness": 0.26666666666666666, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LI7K1BZ0CF5C"}}, {"Date": "on June 30, 2002", "Text": null, "Helpfulness": 0.36666666666666664, "StarRating": "1", "Author": {"ProfileUrl": ""}}, {"Date": "on October 26, 1999", "Text": "This book was just plain bad.  Vonnegut spent two thirds of the book wandering about aimlessly.  In the final third it's like he got sick of the  book and just wanted to finish it, so it suddenly feels rushed.  He makes a  few minor points along the way, but I never quite caught what he was  getting at. Also, while the lack of respect for time is an interesting  concept, do not foreshadow when you already tell me what happens.  It is  ineffective.  Style does not a good book make.  What a waste of time!", "Helpfulness": 0.32, "StarRating": "1", "Author": {"ProfileUrl": ""}}, {"Date": "on May 4, 2005", "Text": null, "Helpfulness": 0.2222222222222222, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARYWK89BAV3T3"}}, {"Date": "on March 6, 2011", "Text": null, "Helpfulness": 0.16666666666666666, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RGMMQ52EI2N2"}}, {"Date": "on October 18, 2005", "Text": "Half-baked and shallow, at points even repugnant, work of fiction.", "Helpfulness": 0.2, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ISIVPJLLRGXF"}}, {"Date": "on February 7, 2005", "Text": "I was forced to read this book recently for a humanities honors level course in high school.  I found Vonnegut's work to be an incredibly difficult read.  He pays little attention to speed and character development, and his metaphors (I will bring up the \"when the rocket that french kissed the radar dish\" one) did not provide a clear image in my head as to what he had intended.  I did think that his ideas were largely valid and that he had interesting points, yet he seemed so antagonistic toward humans and made all of his characters unlikeable, with features that became exaggerated to the point of being unreal.  If you like abstract work of an unorthodox writing style, this book may not bother you, but otherwise I would not recommend it.  I ended the book feeling like I had wasted a great deal of time and learned nothing, on top of being frustrated with Vonnegut's writing style and characters.", "Helpfulness": 0.14285714285714285, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7U1MS3PS175X"}}], "ReviewUrl": "http://www.amazon.com/Galapagos-Novel-Fiction-Kurt-Vonnegut/product-reviews/0385333870/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "3.8 out of 5 stars"}, "OfferPrice": "$12.43", "Salesrank": "#17,464", "ListPrice": "$16.00"}