{"Category": "in Books (", "Name": ["Land, A Stranded Novel"], "Timestamp": "2015-05-24 23:41:23.270660", "itemurl": "http://www.amazon.com/Land-Stranded-Novel-Theresa-Shaver/dp/1475199325", "Reviews": {"TotalReviewCount": "422", "ReviewList": [{"Date": "on February 5, 2013", "Text": null, "Helpfulness": 0.9459459459459459, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A354YKPKIPALX4"}}, {"Date": "on August 6, 2013", "Text": "This is a young adult fantasy book with a electro-magnetic pulse as the McGuffin.  Don't read this book looking for any level of realism, you won't find much.  Where do I begin?  First off these are the smartest and most level headed 16 year olds on the planet and they are also the luckiest.  They have the smartest teacher ever who educates them all about EMP, gives them hundreds of dollars in cash, and then conveniently goes with the main group of students so these several teens can be super teens without adult supervision.  The teacher going with the main group was at least realistic. This small group of teens soon get lucky breaks one after the other including finding two murdered cops.  Do the teens stay 50 yards away from the dead officers like real life teens would do?, No, they strip the cops of weapons and extra mags.  Please!  This happens only hours after the EMP attack.  They conveniently find bikes to buy with their worthless paper money and manage to load a shitpot load of stuff into bike trailers and bike saddle bags.  They find food, supplies, and pre-electronic ignition vehicles including an RV the boys are able to drive like long haul truckers.  Please, again!  One of the boys gets shot and one of the 16 year old girls operates on him at a (again) conveniently located kitty and doggy hospital and the place hasn't been looted.  Do I even have to mention they conveniently find a \"how to operate\" manual and save the kid by digging out the bullet. OMFG that was the topper.  This is a very short novel for $4.99 and wait for it, it has a cliff hanger non-ending.  Funny the book description didn't say anything about this being part 1 of a multi-part story.  Even so part 1 should have had an actual ending and it doesn't.  I don't recommend this novel to anyone especially teenagers.  If anyone did half the dumb crap these super teens did in a real emergency they would quickly die horrible painful deaths.", "Helpfulness": 0.9375, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4H1JLB13YVGA"}}, {"Date": "on November 30, 2012", "Text": null, "Helpfulness": 0.8769230769230769, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APY8AT9199FVY"}}, {"Date": "on August 13, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEAWEN79FLP71"}}, {"Date": "on June 26, 2014", "Text": null, "Helpfulness": 0.9, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PY3QWKZC8TPH"}}, {"Date": "on May 24, 2012", "Text": "This has all the best attributes of post-apocalyptic genre. It is well written, has interesting characters, and attacks the collapse situation from quite a different angle than the usual PA stories.  The main characters are kids that rise to the occasion rather than some of the other novels where the leading characters (adults) keep doing incredibly stupid stuff.  This tale is a pleasant respite from those sorts of novels. Also, the book is properly edited in contrast to many of these types of books.", "Helpfulness": 0.8529411764705882, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LH3P0WLFCBCE"}}, {"Date": "on March 25, 2014", "Text": "This book is the most emotionless minutiae filled sleeping aid ever to be published on Amazon. The title should have been a give away. Canadian students must leave Disneyland to head back to Canada due to an EMP attack. One group goes by land, so the title is \"Land\". This is their story. Three pages are used to describe how a child was extracted from a car seat. The entire book is like this.", "Helpfulness": 1.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ADEYCB13R413"}}, {"Date": "on August 20, 2014", "Text": null, "Helpfulness": 0.9166666666666666, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A352K5TINC9YA2"}}, {"Date": "on May 12, 2014", "Text": "I really wanted to like this book. But seriously, five 16 year old kids fight and kill a rabid gang of bikers, give support and aide to strangers, befriend a dying man - (NO ONE questioned a bunch of kids who stripped his house and drove away in his camper)-, a 16 year old gymnast performs surgery on her friend and then they butcher a cow and have a bar-b-que? All in 21days? Really??", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26Y7NTAQ9VSJX"}}, {"Date": "on May 24, 2012", "Text": "I have read many EMP/pandemic etc. books and this ranks high amongst them. Well written for young adult and complex enough for every one else. The character development was well done and the story line kept you turning the pages and was believable. I throughly enjoyed this book and am waiting for the next. Bravo to the author.", "Helpfulness": 0.85, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UKNHZHG4687D"}}, {"Date": "on September 2, 2014", "Text": "This book has taught me to be very wary of free kindle books. Did those who gave it 5 stars really get the same book? It is simplistic, poorly written and ends with a \"cliff hanger\" that does not tempt me to buy the next book in the series.  Save your time and skip this one.", "Helpfulness": 1.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37AFG1ZJOWI2"}}, {"Date": "on August 28, 2014", "Text": "Please, please would all you wanna-be authors stop bypassing professional editors?  The premise behind this book is good and will appeal to many.  The execution needs work.  At least have an English teacher review your work before publication to avoid appearing as the amateur author you clearly are.", "Helpfulness": 1.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AA1P098D9PGDL"}}, {"Date": "on October 17, 2014", "Text": "Really not well done. I read the whole book because I hate to give up on a book but this one almost got me. While the premise is awesome, the characters are unrealistic, the situations they get into (and out of) are preposterous. The dialogue between the characters is banal and also unrealistic. Teens simply don't talk this way and don't act this way. The author also seems to feel (judging by the book) that an EMP attack on North America is a piece of cake. The characters just skate through situations with no problem. People aren't panicking, the characters (teens mind you) are not getting robbed or molested even though they have all the supplies they need right out in the open with them as they're traveling through a desperate countryside in a desperate situation. They just sort of breeze through it. They find not one but three vehicles that are still working, plenty of supplies and weapons and even manage to fight evil along the way. The author (who I believe is a teenager or a very young adult) simply didn't put much thought into the actual effects on technology or society of an EMP attack. This story is impossible to believe. If you want a good story on the effects of EMP on the US, read \"One Second After\" by William R. Forstchten. It's an excellent read and very realistic.", "Helpfulness": 1.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APUB51AKDVK8S"}}, {"Date": "on September 6, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALVAFI51NRXZS"}}, {"Date": "on December 21, 2012", "Text": "Predictable.  Not real challenges and the good guys always effortlessly win even tho they are teens.  Amateurish writing. Plus there is a sequel to find out what happened to her friend.  I passed on that", "Helpfulness": 0.8125, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TKTREYMU8A8X"}}, {"Date": "on May 25, 2012", "Text": "I just finished this book and really enjoyed it!  Right from the start the plot had me hooked.  It was so well written there were several times I had shivers down my spine!  There were parts that made me laugh out loud and even parts that made me cry!  Ms. Shaver has a writing style that leaves you unable to predict what will happen next.  She hovers near horrific storylines not unlike Stephen King or Dean Koontz but stops short to spare the reader from vivid nightmares.  I kept expecting the unexpected and my guess is as her series progresses we will discover more intricate characters and surpising outcomes.  Bravo on a first publication and I will definitely continue to read books by this author!", "Helpfulness": 0.8, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SETI92PHI8V9"}}, {"Date": "on July 30, 2013", "Text": "Lost my attention early, and could not finish. One star is best I can do. Might be good for teenagers.", "Helpfulness": 1.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TO6UT1K0YQ6Y"}}, {"Date": "on May 26, 2013", "Text": "I find it hard to believe all the great raves on this book. Is there a 'Rave Store' somewhere, where authors buy raves? As I was reading this book, I kept thinking it had been written by a kid. I kept reading, until about halfway through when I got to the totally ridiculous part about the bikers ambushing them. Sorry I bought it. I'm done with it, and certainly won't buy the rest...", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KNA5642XCECB"}}, {"Date": "on September 21, 2014", "Text": "Honesty, I don't know if the five star ratings are from people that read the same book as I did.  Judging off the high standing ratings, I thought this post-apocalyptic novel was topnotch, with dark, gritty realistic events that'll make you want to begin becoming a Prepper yourself.  Sadly, I came to discover that this story lacked each of the notices I listed.  This novel has to be the most unbelievable survival setting I have ever read.  The kids have to be the luckiest humans who have ever walked the Earth.  Luck just hops into their laps when they need it the most.  Hauling overabundant supplies across state lines on bikes???  It just got to unrealistic and ridiculous to the point that I was waiting for the MacGyver to show up and help them on their journey from Disneyland.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VQ9MXO29KW9H"}}, {"Date": "on December 28, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A341REQXONXFFV"}}, {"Date": "on October 20, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVZ583ZXY6TFS"}}, {"Date": "on June 11, 2012", "Text": "I don't normally review books but this story captivated me from page one..I sat on the couch and stayed there until i had read every word. I must have read every TEOTWAEKI/zombie/pandemic book published and this one ranks as one of the better ones. You will like these kids and you will be anxious to turn the page to see what or how they get out of each sticky situation that happens as they try to make their way home.", "Helpfulness": 0.8333333333333334, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IHOQAI60E8GX"}}, {"Date": "on May 17, 2012", "Text": "I have read a lot of EMP/Prepper type novels, and I think this was one of the best.  It was just different enough from all the others to keep me interested.  I should also mention that this is the first review I've ever written (I liked it that much).  Can't wait for the next one.", "Helpfulness": 0.8333333333333334, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Z77QAB8P0QUK"}}, {"Date": "on September 5, 2013", "Text": "Not much substance to this book. And why make it into another (Sea) without cleaning up the ending???? Sorry not recommended reading.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I00VYLZEBPN7"}}, {"Date": "on September 18, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13BFLDJ3JSCTQ"}}, {"Date": "on December 18, 2012", "Text": "Basic EMP premise, with teenaged protagonists. Not all adults are evil or stupid. The teenagers' capabilities are a bit unrealistic. Some dips into a libertarian sense of justice that are too long for the character they're attributed to. A strange mix of gun love then prideful declarations of Canada not having the US gun culture seemed oddly put. Only a handful of typos, typical plural s with an apostrophe, affected vs effected, etc.  Overall a decent fast read, and I'll follow the series.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QE14KZRCD4D9"}}, {"Date": "on December 16, 2012", "Text": "It was a good read that kept my interest all the way through.  It is a little unbelievable at certain points.  I would recommend this book to others.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CRZO9ZCM6J3B"}}, {"Date": "on May 21, 2012", "Text": "This is a very good book, it keep me interested all the way through.  Things that happened could happen and the people were very beliveable.  I am waiting for the next book.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38KBNCJPBMPF8"}}, {"Date": "on July 7, 2012", "Text": "I enjoyed reading this so much I had to write a review as soon as I finished.  This was a great book. The story was believable and fun to read.  Someone else wrote about the kids being too \"goody\".  That reviewer needs to understand that there are still people like that in this world and we need more of them.  Also being former law enforcement, I would have loved having these kids on my side.  Great job on your first book, Theresa.  I look forward to the rest of the series.", "Helpfulness": 0.8, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IDDWIQMD7D5R"}}, {"Date": "on September 25, 2014", "Text": "I found this story interesting and I could empathise with the characters however I found the writing a bit repetitive and big chunks of time a bit glossed over. I would still recommend it to Young Adult readers but probably not a book I would recommend as a YA that adults would also like (hunger games etc)", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WJDI47TSHMAV"}}, {"Date": "on January 15, 2013", "Text": "I'm on a big post apocalyptic kick right now, so I was looking forward to a good story. I'm reading a lot of kindle lit and I'm pretty forgiving of the fact that some of these titles haven't head professional editing etc. The story started out like a decent bit of YA lit, but by about half way through it really started to fall apart. The people the characters started to encounter began to fall into the 'good guys and the bad guys'. The good guys were folksy, gosh darn nice folks... honest speaking and forthright. The bad guys were stupid, brutish, clumsy and mean.  The heroes were hailed as good kids, but they just knew more, were more lucky, had better morals than anyone else. They didn't feel bad about killing others because they knew they were morally justified. The collapse of law and order was described as a return to 'real justice' where bad people got their due. The moral structure of the novel turned out to be as cardboard and the characters and the plot just as thin. I finally had to put it down... and I've finished a lot of so so books.", "Helpfulness": 0.7142857142857143, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24P8K4FG7VQVJ"}}, {"Date": "on May 11, 2012", "Text": "I definitely enjoyed Land, A Stranded Novel! The characters were believable and the predicaments interesting...I wondered a number of times how they were going to get out of situations (without giving anything away) and was pleasantly surprised at how the author brought the story along. Entertaining for adults and certainly familiar territory for teens. Great book, can't wait for the next one!!", "Helpfulness": 0.8, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NMFKMFEONKGF"}}, {"Date": "on September 9, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGIIL2BM9J4OM"}}, {"Date": "on October 7, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27Q4UHAVHVAOG"}}, {"Date": "on May 15, 2012", "Text": "this novel kept me on the edge of my chair!! the characters were believable and the way they went thru the long journey of getting back home made me think of my own three children and have I taught them all that they need to know to do the same! Great job on the first book and hurry up with the second...I can't wait!!", "Helpfulness": 0.8, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13HWWJHDN85D3"}}, {"Date": "on June 14, 2014", "Text": null, "Helpfulness": 0.8, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16DAMI233ZDXW"}}, {"Date": "on September 8, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2L2G60MSP34C3"}}, {"Date": "on September 22, 2014", "Text": null, "Helpfulness": 0.75, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10T6RK1NR5NQR"}}, {"Date": "on December 18, 2012", "Text": "The book had a good start, but went downhill quickly.  The author tries to appeal to teens and adults, but fails, maybe falling somewhere in between, without appealing to either group.  All of the characters were undeveloped.  The book read more like a timeline of events than a story being told.  I will not purchase anymore books from this author.", "Helpfulness": 0.75, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2K2FEVXL5FOP9"}}, {"Date": "on June 9, 2012", "Text": null, "Helpfulness": 0.75, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EFE5Q0396FZJ"}}, {"Date": "on April 4, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21VGNU5959O85"}}, {"Date": "on May 5, 2012", "Text": "Wow!!! LAND, A Stranded Novel . . . WOW!! This book has everything!! I laughed out loud, and then was chewing my fingernails and was on the edge of my chair.... Couldn't put the book down!! I can't wait for the next book... Great Job, Theresa!!!", "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23J64PFIO0CGS"}}, {"Date": "on September 18, 2012", "Text": "This book was amazing and I have sinced passed it along to many friends and family. I liked that it was different than so many of the apocalyptic \"zombie/vampire\" type stories, and instead focused on existing humanity, and how people react in a bad situation. I fell in love with each of the characters, and especially liked how the author gave details about what has formed each of these main characters. Quinn was the best, from that perspective, and I hope we will learn more about what makes Alex such a strong leader, Dara capable of inner strength and loyalty, Josh a supporter and encourager who hides so much with humor, etc. I am a grown woman with children, and this book had me crying on a plane ride!  The only thing I can truly complain about is 1) I can do without foul language and still get the anger/stress issues, and 2) why isnt the next book available yet?!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KTAF4WA1D5G4"}}, {"Date": "on February 13, 2015", "Text": "I downloaded this Wednesday night bc it was free and thought I would try out the series.  I was hooked right away.  I finished it Thursday morning.  I loved all the kids-  I relate with Alex a lot.  She's a take charge kind of gal and will do anything to protect her friends who are like her family.  I loved how smart they were, getting supplies and weapons and using them when they needed too yet helping out people when they can.  It seemed very real- like if something like this happened in real life, they would run into similar situations.  I just bought the 2nd book.  I hope this group makes it and that they can get their town back.  Great book!!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJ914WI50QK10"}}, {"Date": "on June 16, 2012", "Text": "I was intrigued by the plot of an EMP going off leaving a bunch of teenagers stranded far from home.  It is very well written and has some interesting ideas that have great possibilities.  What I found hard to grasp was how well off the teens became so quickly.  There are a couple of issues that the author took a writer's privilege about, such as the teen's short learning curve using an AK-47 and becoming natural leaders.  I was disappointed that they left the dog as it would have been a great burglar alarm or sentry.  Although there is room to critique the plot and the characters, I liked this story very much and enjoyed it.  I am looking forward to the next book in this series.", "Helpfulness": 0.75, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UYCX6QXK8GFF"}}, {"Date": "on May 22, 2012", "Text": "just finished reading the book \"Land\" by Theresa Shaver and it was amazing!!  Had a very hard time putting it down to do anything else!!  Kept me on edge and trying to anticipate what was going to happen next.  The only thing that disappointed me was that there was time that was not accounted for so it left me wondering what happened in that time frame??  All in all it was a very good book that I would recommend to everyone and I can't wait for the next one to come out!!", "Helpfulness": 0.75, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XANG1LISMZT2"}}, {"Date": "on June 20, 2012", "Text": "This was a very fun read.  After reading so many technical books dealing with emp situations it was to relax and just go for a ride.  Definitely a young adult or teenage book but still entertaining enough for an older gal.  Some informative information without going to deep and taking away from the enjoyment of a mental escape.  Looking forward to the next books and was disappointed when it ended as I was left wanting more!", "Helpfulness": 0.75, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DRU025G6GXGP"}}, {"Date": "on June 13, 2012", "Text": "Just finished....loved the plot and characters.  Ticked off because I didn't realize it was just the beginning of a series!!  Got to the finish to find out I'll probably have to wait at least another year to get the next episode!!  Couldn't put the book down....just had to keep reading to find out what would happen next.  Definitely looking forward to more books in this series!!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1N952YOCMQD11"}}, {"Date": "on May 10, 2012", "Text": "My nefew's wife wrote this book while at home with two kids who lead a very active life.  We are all very proud of her.  The book itself was a very engaging.  It stops and makes you think about the \"What-If's\" in the world.  It is a great book for all ages.  What would you do?? How would you react.  What could you do differently.  Can't wait to finish it and get onto the next ones...", "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FKRDCZA529J8"}}, {"Date": "on June 24, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EDWAYHHJCFL4"}}, {"Date": "on May 7, 2014", "Text": "I really enjoyed reading this series. I first bought them for my Kindle, but then recently bought them in paperback. I recommend this series to all who enjoy reading about apocalypse stories. They may be geared for teenagers, but this adult enjoyed them also! Best to this author! Keep them coming.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1K3F17YG0OM2Q"}}, {"Date": "on September 4, 2013", "Text": "I enjoyed the read but it did lack detail. The only thing I know about each character is the color of their hair. The buildings had no definition and the landscape lacked environment. Please give something for the imagination to chew on.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SNASELBRPZRA"}}, {"Date": "on June 27, 2013", "Text": "As much as the end of the world can be, anyway. I have read a lot of post-apocalyptic fiction lately, specifically post-emp and I was really beginning to feel as paranoid as some of the authors of these novels obviously are. I found this one refreshing in that it wasn't as dark as the others I've read. Being a young  adult novel I think it presented a more hopeful future and people willing to help out as much as they can on their adventure home. Not that these kids didn't run into serious situations--- they just managed them well! Like all good novels, you have to suspend disbelief a little, but it really was a lot of fun to read.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15J1MSLSB38SX"}}, {"Date": "on June 27, 2013", "Text": "This is the first book I have read of Theresa Shavers and I am impressed. Can`t wait to start on the next one.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHRU57JFZ1S6F"}}, {"Date": "on June 20, 2013", "Text": "one of the best books i have read on this subject. the book captured my attention on the first page and never lost it through the whole book. please hurry and write more.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PCHUGOAONHVZ"}}, {"Date": "on May 30, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NDYD4JKKY9LE"}}, {"Date": "on January 9, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MLY9TJ6TFB66"}}, {"Date": "on January 3, 2013", "Text": "This book was an easy read and a real page turner.  I would recommend this to anyone interested in the end of the world books which there are a ton out there.  It is a series so I am now reading Sea and hope it is as good as the first one.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UDCQLT0X857T"}}, {"Date": "on December 8, 2012", "Text": "The book started out promising. I bought it expecting it to really be a great read. I can only give three stars because at times its cheesy as hell", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2B0RNCAQ7S8H5"}}, {"Date": "on December 7, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11G1LS7X72AF"}}, {"Date": "on November 9, 2012", "Text": "This was a great book. I really enjoyed reading it. Both my daughter and I read it at the same time and it was fun to discuss the different things the teens went through. I really enjoyed the characters and getting to know them in the book. I also thought this book had some good information about an EMP bomb. It prompted my daughter to ask questions as she read it.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22F5F5T2HB2W1"}}, {"Date": "on September 21, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1STSIBS59744U"}}, {"Date": "on September 10, 2012", "Text": "Overall, I found this book to be a good read. I do, however, have a few areas of disagreement/concern. 1. How quickly the teenagers got over killing, not one, but a number of people. I'm not a psycholgist, but I think it would have hit much harder than it did. 2. I can't see any competent teacher sending off two groups of kids with five minutes of advice and some money. 3. This may be a small point, but do people die immediately after their pace-maker stops? Now, I know this sounds like I hated the story, but I didn't. It is (I think) pretty good and I plan to read the sequel. The story moves and does a good job of developing the main characters. I grew to like them, which is why I think this a pretty good read.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11B5LN37X5SX9"}}, {"Date": "on September 9, 2012", "Text": "Truly enjoyed this story.  Shows the determination of our younger generation and makes me proud.  Hope our kids are reallly like this.  Cannot wait until the next book.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KIADGU9VU82W"}}, {"Date": "on August 31, 2012", "Text": "I really enjoyed this book. It was very well written (a few typos - Jake/Jack?) The characters were well developed and the story flowed very well. And like other reviews, I too can't wait to read the next installment. I would recommend this as a good read.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAFWHHX5XB7W8"}}, {"Date": "on August 26, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NO4V06SRQKRW"}}, {"Date": "on August 17, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JY0ZQS79OF9P"}}, {"Date": "on July 17, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21AVTN53D4HZX"}}, {"Date": "on July 9, 2012", "Text": "I have read many books of this genre, and found this to be one of the best.  It is written from a different perspective than any other I have read, which was refreshing.  The characters were real and the storyline well thought out.  I look forward to the rest in the series.", "Helpfulness": 0.75, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AF4U5XOLYVFPX"}}, {"Date": "on July 5, 2012", "Text": "Loved the book, easy read!  Gives you things to think about!  Gives a good background on the charecters. Leaves you hanging in the end LOL Can't wait for what I'm assuming are the next two books \"Sea\" and one where they take back the town any chance of getting an update on when they will be released?", "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29O6TGQT7JCX"}}, {"Date": "on June 28, 2012", "Text": "I didnt want to put it down. Everytime one problem was resolved a new exciting dilema popped up. Excelent charactor development and the authors ability to describe people and thier situations made it easy to picture in my mind. I cant wait to read the rest of the series.", "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VTV7KUENYBC5"}}, {"Date": "on June 22, 2012", "Text": "This was a really good read, I buzzed through it very quickly. The storyline is fresh and interesting while being informative as well. And of course you're left wanting more.!!! Very good reading.", "Helpfulness": 0.75, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1O9FVA9MQVQ7P"}}, {"Date": "on June 4, 2012", "Text": "This first installment in the stranded series was very written and edited. This was a truly enjoyable read with interesting characters and situations that hold the readers attention. The whole book read with a sense of hope and determination. Some scenes had me laughing and a few brought a tear to my eyes. The reader is easily able to empathize with the characters. I cannot wait for the second book in the series.", "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIHKTI6MZC09F"}}, {"Date": "on June 4, 2012", "Text": null, "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QBF8G6EGDK8A"}}, {"Date": "on May 26, 2012", "Text": null, "Helpfulness": 0.75, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2I3Z9X7Z03X7U"}}, {"Date": "on November 11, 2012", "Text": "Enjoyed this book so much. I have read so many PAW books both free & pay. The difference for me is do I like the characters. The Chars were just great. You can only do paw stories so many ways, then the people in the books are what really makes it stand out. Very excited to see the new one out. Just bought it!!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JUIR28N40DK8"}}, {"Date": "on July 18, 2014", "Text": "I got this one for free and must say I am very pleasantly surprised with this book. It has nice reference to plausible possibilities even though some of the scenario was a little too perfect. However, I was hooked by the end and really want to see what happened to the group traveling by sea.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YHWKNN2LQ903"}}, {"Date": "on May 2, 2012", "Text": "This book was recommended to me, and now I can NOT wait for the next one. It makes you tink not only of what you would do in a time of need but those around you. Never thinking until now what if all those I loved were not near? Would they know what to do? Great writting and kept me engaged the whole time!!!!!!", "Helpfulness": 0.7142857142857143, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19IC9WBFYWJCJ"}}, {"Date": "on July 10, 2012", "Text": "I really enjoyed this book.  I have read a lot of books on this topic and have never taken the time to review but this was just to good not to tell others.  I will be watching for the next volume as the cliff hanger ending was so unexpected and I went online to buy volume 2 but it isn't out yet.", "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXIGR99M09VPF"}}, {"Date": "on June 21, 2012", "Text": "I really enjoyed reading this book.  The story line was great and kept you wanting to read on to see what would happen next.  I also liked the fact that there was little profanity in this book.  Was refreshing. Am looking forward to reading the next one.  Good work Theresa...keep it up.", "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20FR123MG5JLM"}}, {"Date": "on July 19, 2014", "Text": "I find it hard to understand why in your free time people would want to gripe about being entertained. Yes it was unbelievable in some spots but dang it was entertainingly well done. I will probably purchase SEA now. Good entertaining young adult read.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UGH2GQHWS0LN"}}, {"Date": "on May 13, 2015", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RBLZC3MJ5FNM"}}, {"Date": "on August 29, 2014", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SFEYYXPFQ5H"}}, {"Date": "on May 31, 2012", "Text": "I really enjoyed this book and am looking foward to the next in the series. Nice to see that the kids learn as they go, and on't start out armed to the teeth, with everyone a military expert, as happen is so many apocalyptic books. Very well done", "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28ZWIX59L8B10"}}, {"Date": "on July 11, 2014", "Text": "I read the first book in one sitting, immediately bought the second one and read it through, and then bought the third one and completed it - all in one night.  I was captivated.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OH5745D0FKB4"}}, {"Date": "on March 19, 2013", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D585MAT8HWR6"}}, {"Date": "on August 14, 2012", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZZB5UWA1CN1"}}, {"Date": "on September 10, 2014", "Text": "It's a good story, even though the genre has become predictable. I can suspend disbelief and buy into the premise of their journey. Here's the thing - even if one of the teens had died, none of them would have been missed by the reader due to lack of character development. Supposedly, this was a new, re-edited version, but it's clear you weren't working with a professional editor. The writing often feels stilted and \"clunky\" and there's far too much telling instead of showing. At times I wondered if the author was \"padding\" to reach a certain word count - almost no contractions are used in the dialogue, making the teens sound like caricatures, and there are a lot of extraneous info dumps. For example - I could accept the stereotypes, i.e. the geek, the prom queen, the jock, etc. What I couldn't accept was the author actually labeling them for the reader early in the story. There's also a lot of head hopping, especially as the story continues. Verdict: I liked the story enough that I want to read the next one, but the writing will keep me from buying it.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DTKS66IPY87P"}}, {"Date": "on March 7, 2015", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26YX8MTQYPWDU"}}, {"Date": "on August 29, 2014", "Text": "I very much enjoyed this book, and may buy the sequel immediately. I like post-apocalyptic fiction, and found this was enjoyable reading. It has it's share of bad guys are taking advantage of the post-EMP chaos, but also relates stories of people along the way, just trying to survive.  I thought it was very realistic how they managing continue on their way, share their food, protect themselves *and* risk themselves for others.  I liked the characters, who were distinctly drawn to each other and could play off their various skills, but I wish writers would not end their stories like an old fashion drama always forcing you to read the next volumne.  Many authors have published multiple books, that carry the background of the characters into the next book but don't try to force you to buy the next issue.  Jack Reacher and Robert Parker are examples of a continuing story line without challenging the reader to buy the next issue.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UHFAJSU9KT6V"}}, {"Date": "on September 22, 2014", "Text": "Never hearing about Theresa Shaver, and reading the title, i thought this book was going to be blah.  Well let me tell you how wrong i was!  This book captured my attention right away and sucked me into the story line so deep, I really felt like I was in the adventure itself.  I was angry about some things going on in the character's environment, and apprehensive about the hard decisions these kids had to make to survive.  I couldn't put it down, but I HAD to put it down when the situations got so real that I had to step away for a while.  This book is so real.  Matter of fact, I'm going to make a note of how they survived just in case the United States has this very realistic and plausible thing happen.  In this day and age, with all that is going on in our world, it just might.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2J4UGNB82RMB7"}}, {"Date": "on November 13, 2014", "Text": "A group of high school students from Canada taking a once in a lifetime trip see that change in a blink of an eye. Luckily for them one of the teachers on the trip is a prepper - someone who preps/plans for \"doomsday scenarios\" - and is able to bring things into perspective for them right away. 10 of the kids decide to go out on their own to try and get home to Canada while the other adults and kids want to get to the Embassy in CA for the \"government\" to help them. This story is about the group of 5 that decide to bike home. By the end of the book the entire group has grown and matured beyond their years. I didn't like that the book ended in a cliffhanger and you have to read the next book to find out what happens, but I've enjoyed the journey so far", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A260C7HG3HUGSG"}}, {"Date": "on February 22, 2013", "Text": "Land and Sea are both excellent. They focus on what needs to be done to survive and the kids actually try to help others. In many societal collapse books, it's really every man for himself, no thoughts of others. The author does a nice job of showing how the two situations are different and how they need to be handled differently and require different skills. Yes, lots of \"lucky\" things line up for them, but there are always a few in real disasters for whom this is true and the stories are most interesting when you focus on them. Let's face it, if she wrote from the POV of a person who had the bad luck to be in a car that was hit during the EMP and died immediately, the books wouldn't be very long or interesting.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1X93FZ32M33O2"}}, {"Date": "on December 17, 2014", "Text": "Well written for the genre.  There were some grammar and word usage errors, but it didn't detract from the flow and  only the grammar police will be upset.  Ms. Shaver made the standard  story of a Post-EMP survival situation more interesting by making it about a group of  high school students stranded while visiting Disneyland from Canada who decide to split up into three groups. This story is about the group that decides to travel home overland.  Their adventures and the growth they experience as they face danger and overcome obstacles in their journey home makes for a very interesting and enjoyable read.  Can't wait to read how the group attempting to return to Canada via the sea fare.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VAV1IKNDTMAX"}}, {"Date": "on July 31, 2014", "Text": "There are four books in this series and I have already downloaded them. I am not certain, but I believe these may be intended for an adolescent or late teen audience. That being said, the book is engaging and fast paced. The characters, for the most part, are interesting and believable. If I were to complain about anything it might be about the female protagonist's youth and focus on \"romantic\" issues in a crisis grid-down situation. Other than that, it is pretty well written. The author obviously knows something about prepping and the bug-out details are well done without being over the top. Every time the phrase \"Maple Leaf Mafia\" shows up I LOL. A pretty good read.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Q9H01DZZRYBL"}}, {"Date": "on February 8, 2013", "Text": "I loved this book and the one following it!! I can't wait until the novella and the next book in the series comes out. The writing style was engaging and had me involved, caring about the characters! It thought it was realistic without being overly grim/ dark that some books in this post-apocolypitic style can be. I want to read stories that the main characters DO survive. And I think teens could do this. My kids could. I just can't say how much I enjoyed this story. I am two years out of a long abusive marriage and it has been hard to read characters I like being deceived and hurt. This author wrote in such a way that I was able to push through those sections. It is a great series!!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NGRPFKGAE0QS"}}, {"Date": "on July 27, 2014", "Text": "The book may have a few writing flaws but overall it was a good read. There was a bit too much concentration on the disastrous concept of teenage romance. I thought that I was fully prepared for what is going to happen when the world implodes but I learned a few things from this author. Her biggest negative was having Alex's group leave the Golden Retriever behind and alone after its owners had died. It would have added significantly to the story to have the rescued dog become one of their traveling companions. Ms. Shaver made up for that mistake by coining a very clever phrase, \"wife beater tank top.\" She is a promising  writer and I will look forward to future work.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZBZN1HJQ3076"}}, {"Date": "on December 14, 2014", "Text": "The world ends at Disneyland! After reading this one I bought the others, 4 in all with 1 more just coming out. I will get this one too. My poor husband didn't see anything but me with my nose in the story for  a week. This is a book series I will re-read. Three groups of teenagers and only one with a teacher to guide them. Some die, they learn to work together or not. You loose your favorites and gain others. You'll wonder about a few and will be pleased or displeased with how they turn out. This isn't a guide to survival but if this old world of humans goes under it will add to the ideas of how to survive.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YZLJXXK5KPUH"}}, {"Date": "on October 15, 2014", "Text": "Strong characters, good action, well paced.  The \"Maple Leaf Mafia\" are a group of Canadian kids stranded on a school field trip to Disneyland by WWIII's EMP.  This is the tale of their journey back to Alberta, as they learn survival skills and the art of killing bad guys.  You will enjoy the ride.  Hobbit-like, what's left of our heroes find their home town in the hands of bad guys at the end of this book, so there is bound to be a sequel as they try to liberate it.  Another group of kids chose a different route home, so a side-quel is also promised.  I will read them both.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EZRW5DHLCA8Y"}}, {"Date": "on August 29, 2014", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HTAM9UM9HLU3"}}, {"Date": "on September 23, 2014", "Text": "I enjoyed this story. I couldn't put it down once I started & bought the other books in the series one after another. The main characters are engaging, the story is interesting in a different way from other apocalypse stories & sometimes it was just plain fun to see the apocalypse from the eyes of teenagers, who previously were glued to facebook & going through teen angst, to then have to grow up quickly & fight to survive in a world that is drastically changed. Thanks for a good story. I don't want to give away any spoilers but I recommend the whole series.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DZ3OFC92G6ZF"}}, {"Date": "on November 26, 2012", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFB75WNH5X6G2"}}, {"Date": "on January 6, 2013", "Text": "Land is the first of a series about a group of students that get stuck in Disneyland during a long term electrical grid down emergency and have to make their way back home. Some parents and students insist that they go to the Canadian embassy. Another group decides they will go by boat and this group is determined to get home by land. This is a great read and you will immediately want to read Sea. The only disappointment is that the books after Sea have not been released yet and you will want to read the full series. I can't wait for them to come out.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25YOHSKRI2ZV3"}}, {"Date": "on May 13, 2015", "Text": "As a fan of the post-apocalyptic genre, I tried out this novel for free, because who doesn't like a free book? I am happy that I did. Even though I give the story 3 stars, it's not because I hated it. I enjoyed the pulp-style in that the heroes always manage to win the day. However, I feel that this was rather unrealistic in that regard as well. The one thing that got it 3 stars instead of 2 is one line in the books, which I shall not repeat here. However, once you do read it, you'll know exactly what I'm talking about.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARLJ2J5ETXZ0X"}}, {"Date": "on November 5, 2014", "Text": "I was a little hesitant at the first because it seemed so cookie cut. As I read further the story unfolded to a great adventure filled with hope, happiness, heroes, hard times, lost relationships and new found strong bonds. I have this novel five stars because an a young adult book it seems to be exactly how I imagine a group of basic teens going through this time. Loving, smart, strong willed and through it all still thinking they're invincible. I will definitely read the entire series. *  *  *  *  * stars ;)", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZ4X8VSJNGW35"}}, {"Date": "on September 1, 2014", "Text": "Shaver's book, Land/Stranded is an excellent YA book to my mind with plenty of conflict and drama as the world teters on anarchy thanks to some electronic explosion. Alex is the main female leader who is called upon to perform well beyond her willingness. There is romance involved but is put on hold as the group attempts to get to Canada. They're only teenagers, whose characters are well-rounded, but they have to be adults if they want to reach home. And there is a follow-up book or two.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AB7M0MEP43IZZ"}}, {"Date": "on August 31, 2014", "Text": "I really enjoyed this Stranded novel.  I like books that contain people learning that they have more courage and inventiveness than they knew.  As for the critics who have picked on this book saying the kids have too much good luck, I disagree. For one thing the original premise is these kids are being rewarded for very high test scores.  So they are smart and the are farm kids used  to being self-sufficient, This is a book series written for entertainment.  It's entertaining.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JNG0QRI0VFPT"}}, {"Date": "on February 16, 2015", "Text": "This is awesome story. I love how the author has characterized the characters in the story vulnerable and strong  throughout the book. Being a peppered myself. I could imagine it being this way, however, there still could have been lot more harsher environment for them to overcome. But the movie Red Dawn could related with the characters in the book to never give up and fight mentally, spiritually and physically and you will over come diversity. Good job Theresa.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AL2VASUQ7V91S"}}, {"Date": "on July 17, 2012", "Text": "We all have an idea of what would happen in reality.  I think she gave us an overview of that. But she chose to focus her storyline on the goodness in people, which I think made the book.  The kids,even though they had to make some grisley choices, were fast to offer their help and share what they had.  My biggest disappointment was the end; realizing that they are so close to home and the book ends.  Bigger disappointment, there isn't a second book yet. :(", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3J6G79MUUJ1BV"}}, {"Date": "on November 20, 2012", "Text": "Just finished Land and going to start Sea! Theresa you are making me lose valuable sleep but it is worth it!! I admire the fact that you have chosen not to resort to sex, vulgarity or adult themes to sensationalize the book. While maybe not for the little kids it is actually a good book for young adults and adults to learn about pulling together during tough times. Can't wait for City and Home and I guarantee they will be on my wish list!!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIEJ6B58WPQ67"}}, {"Date": "on February 21, 2015", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWMQUXCT227O8"}}, {"Date": "on December 2, 2012", "Text": "Love it - great read.  A lot of thinking went into this novel.  You will learn a lot of things that can save your life.  We may need these skills in the near future.  Read, enjoy and learn.  Alex is my hero.  These kids were great - if they made a mistake, they didn't make it again.  Never giving up is the key.  I am reading Sea now - but I can see the set up - when is the third novel in this series going to be out - please hurry!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHRZ36WLWZDAS"}}, {"Date": "on July 24, 2012", "Text": "I just finished reading this writers first novel.  I think it is a very good story. Canadian high schoolers on a trip to Disneyland when the EMP ruins everything for them.  Their trek back to Canada shows that teens are able to take care of themselves and do some good and well as deal with the bad. I couldn't find any typos or gramatical errors which impresses me.  I will be anxious to read the coming volumes of this series.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15LDYHVYWRN9Z"}}, {"Date": "on July 13, 2012", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IRK6G27FHB9"}}, {"Date": "on June 9, 2012", "Text": "I just finished Land. I must admit i honestly found it to be a very interesting story. A fresh idea and very well writen. I will definitely read more books by this author", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZEEGIKWY04R8"}}, {"Date": "on May 26, 2012", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DUM0HFISATWV"}}, {"Date": "on August 31, 2014", "Text": "I think that I am being a little generous giving Land 4 stars, but I am looking at the book from an adult perspective, and it was written for teenagers. I imagine many in that age group would really like the book. It has brave, intelligent, resourceful young characters and I salute that. For me, though, those characters never became \"people\" whom I got to know and hated to say goodbye to at the end of the story.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Y7SNNR2SPRMP"}}, {"Date": "on September 6, 2014", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1763NXN5HGL0A"}}, {"Date": "on August 29, 2014", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1G9JEDXP0ACRD"}}, {"Date": "on July 17, 2014", "Text": "Canadian teens stranded in California after EMP detonation and must make it back home. No Zombies but they do have to contend with bad folks. After 40 + zombie books this one cleaned my palate. Well written, wonderful story line which keeps your interest page to page. nice kids who are easy to like. will most definitely read author's next book as she has earned my financial support.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PNKWB97TL9A6"}}, {"Date": "on August 8, 2013", "Text": "I rather enjoyed this book!  I was a bit skeptical about starting it, but once I did I was hooked.  The characters are pretty cliche and a bit cheesy, but the story was exciting!  In fact, I would give the story 5 stars, but the editing would garner only 3 stars, thus I averaged and gave the work 4 stars. I am currently reading \"Home\" which is the final book in the series.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AS1Q6A7WVHIZA"}}, {"Date": "on October 3, 2014", "Text": "I really, really enjoyed this book! I loved the characters! I especially liked it that the teens were heroes. I like heroes! Not too much teen angst, lot of storyline. All that happened to them might not happen in real life in the same situation, but that is the beauty of fiction.  Bravo Theresa Shaver! I purchased the next 3 books in the series. I don't often do that.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GFF31LRLGZ5R"}}, {"Date": "on May 12, 2015", "Text": "This is a great story for all ages. I love the characters, they are great kids doing what they have to to make it home. Helping others when they are able to, and standing up for each other. I want to read all the other books to see how the rest of their class is doing! Also I have to see how they free their home town from being held prisoners, and slave labor's.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13XLKDTSM49IZ"}}, {"Date": "on July 15, 2014", "Text": "It is rather simplistic but not too bad.  Reads at middle school level.  Charters are charming if a little too good to be believed totally.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2THHOKBVH0N3E"}}, {"Date": "on July 11, 2014", "Text": "It's fast moving and keeps me reading.  It's a very real possibility.  It could happen!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NOXS3CSYK76W"}}, {"Date": "on July 10, 2014", "Text": "A good story about a post apocalyptic world that doesn't have zombies in it.  Only sometimes was it a little too simplistic or easy for them to find what they needed.  Would be a good older but still young adult book.  I will be looking for the rest of the series.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MUH6IX4UI78U"}}, {"Date": "on July 9, 2014", "Text": "I liked the bravery and forward thinking survivalist young people.  No whining, just getting the job done.  I hope and pray there are tons of young adults out there who would take good skills and attitudes into their lives like these did.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A00196542CDR5UXK70XT4"}}, {"Date": "on July 9, 2014", "Text": "Now I devoured this book. One of the best, I'd say, in the genre I've read. SHTF scenario, believable and humorously told. Characters compelling and made you care about them. I bought the second book in the series within minutes of finishing.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASH0OHAMF2Q2X"}}, {"Date": "on July 9, 2014", "Text": "I purchased this book because I thought my grandson would like it. But I started reading and couldn't put it down lol. It's 1:30am and I have to get up a 6:00am for work and I'm wanting to start the second book.  A great story.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GJ8L67H0R2PD"}}, {"Date": "on July 8, 2014", "Text": "I don't usually get into YA books but I've had this one on my wish list for a while. I like \"end of the world\" books. I liked the idea of this one & that the kids were @ Disneyland when \"it hit the fan\"! I grew up in Anaheim, CA so this peaked my interest. I've read Land, Sea & just bought Home ~ I've really enjoyed this series and I'm a bit invested in the kids getting home! I enjoy reading how others act & react in bad situations & the ideas they come up with to do what needs to be done. I sincerely hope I never have to face such issues but books like this get you thinking about \"what ifs...\"  It's never a bad idea to think ahead & be prepared while enjoying a good read. I like this series & would recommend it!  :)", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OBAX0SBTE86K"}}, {"Date": "on July 8, 2014", "Text": "A group of Canadian teenagers make a journey home from Califonia after an Emp.  I am not a young one any more and enjoyed this story in spite of the age of the travelers.  I can see this becoming a movie or series worth watching. I`m moving into book two Sea.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15D5QQBSMUZBV"}}, {"Date": "on July 8, 2014", "Text": "Usually half of the good guys die. Not this time. I like that. Very well written. Excellent characters. This old man likes having teens shown in a positive light, with a girl leading them, even. I'm going to be looking for the companion \"Sea\".", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Z0WP85TOSM73"}}, {"Date": "on July 5, 2014", "Text": "I love this book. If someone ever asked me what it was like I will be talking for hours. I won't just be summarizing it I will repeat the entire book. a big suggestion to those that love mystery and adventure as much as I do. I suggest this book to anyone who has read the Woodlands.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VZXE25JAQYF"}}, {"Date": "on July 1, 2014", "Text": "Loved the books and would definately recommend them.  When I finished one book I couldn't wait to start the next one.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AY10Q9GM735LE"}}, {"Date": "on June 29, 2014", "Text": "I really enjoyed T. Shavers's \"Land.\" Yes, some of the scenarios may be a little implausible but overall a great story for teens and adults. Also a good introduction for all on the importance of preparedness.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AFBCFJDHVZIK"}}, {"Date": "on June 29, 2014", "Text": "Good story. Can't wait to see what happens with the other group of students. It feels a little like Red Dawn, but I am still enjoying it.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1V96UX5T9BOKG"}}, {"Date": "on June 24, 2014", "Text": "Not a great read but not a bad read either.  A little predictable but entertaining anyway.  Characters got along together way better than they probably would of in real life.  Never should have left the dog, come on take the golden retriever with you.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GXXQ0NZ7BJDC"}}, {"Date": "on June 18, 2014", "Text": "Good story line that is easy to follow with good character development through the book. I will get the next book in the series!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BDZ8RTIS4WI9"}}, {"Date": "on June 16, 2014", "Text": "Nothing mind blowing here but it's an easy read. Characters are a little one dimensional and mostly stereotypical but it'll help you pass the time", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWZUCZK4RXWF3"}}, {"Date": "on June 13, 2014", "Text": "A bit different than the norm.  I really enjoyed reading this book.  Easy read/fast read and recommend it to anyone", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3I2QR1XOC30MF"}}, {"Date": "on June 12, 2014", "Text": "Love the story line, the writing, the characters. I can't wait to read the next books in the series. Definitely recommend if you like disaster novels.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VBATKO9Q8LHF"}}, {"Date": "on May 31, 2014", "Text": "Very entertaining enjoyed reading can't wait to finish the rest of the stranded novels. I did not want to put it down", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AS6R5PMSZBTQ"}}, {"Date": "on May 29, 2014", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VOIBCPTGPV9B"}}, {"Date": "on May 21, 2014", "Text": "I read all 3- found them entertaining and some what realistic- SOMEWHAT- a little to Hunger games wannabe- but good!", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AH2X1X8CYOHMC"}}, {"Date": "on May 17, 2014", "Text": "The whole \"EMP shuts down all electronics all over the country with one nuke over Kansas\" myth is a tatol unscientific fabrication. The Canadian author may not know much about firearms, but if she is going to write about a subject, she should research it if she don't know  what she is talking about. Proof read proof read proof read, and have others do it for you too. Here's a sequence: Biker gang goes into town, our heroes head to town but hide off the road so they don't meet the bikers head on on their way back.  Bikers go by them.  Heroes head into town now.  Oh, what's this--a ROADBLOCK!  Since the bikers, we are confirmed later, made it into town, how come they didn't get stopped at the roadblock?  Oh, and the stereo playing at the bikers hideout. No explanation of how this electronic thing works but nothing else in the country works.  Running water at the vet's house.  HUH? No electric for well pump, no city water, no explanation. These tripups take away from what could have been a very good doomer novel, which, BTW, should give the reader lots of useful survival information like most of them do. Now for the good part. The character descriptions and histories bring them alive in the imagination. There is good consistency in their behaviors.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQR657NXC15RC"}}, {"Date": "on May 15, 2014", "Text": "Great writing, story, and characters!  The characters are so likeable they are easy to empathize with. I was able to imagine my teenagers rising to the challenges this group faced. The story was written so well I couldnt put it down! Thank you Ms. Shaver for the great book. Just purchased the second one. Can't wait!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WJ27JXC5QFDI"}}, {"Date": "on May 15, 2014", "Text": "To challenge a group of people to make such a journey would often result in defeat before the journey is begun.  Teens as in this story would not consider the hard task ahead as many adults would.  Thank God for the strength held in young bodies.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CSW95FERCW3F"}}, {"Date": "on May 12, 2014", "Text": "I wasn't really sure about this book but after the 1st pass I was hooked. I can't wait to read the next in the series!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3H0YYQ92DOKEG"}}, {"Date": "on May 11, 2014", "Text": "What an amazing start to this series. I can't wait to read the rest. Theresa Shaver has done an outstanding job. I find myself interested in a subject matter that I've never thought about before.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Z3DQ7P9JYRLG"}}, {"Date": "on May 6, 2014", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BO1P3W7YOLIT"}}, {"Date": "on April 29, 2014", "Text": "The interaction between the characters was better than the plotline.  Brought together faith and destiny in a quick read.  I would read the next book in the series.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2W8FWYG1W9PBL"}}, {"Date": "on April 21, 2014", "Text": "For a novel about teens it is a good read. I dont know why others give it such low stars. I ended up reading this in one day as it was hard to put down and am off to buy the next part. Yes this could be read as a stand alone however be warned, you are going to want to know what happens to the other kids and what they went thru too! I have been reading a lot of these books and I was hooked with this one. Now on to the next one in this series .. I have to know!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13VENZC543MTF"}}, {"Date": "on April 19, 2014", "Text": "Slow at first and stilted conversation. Really starts to pick up quickly, though. Glad I stuck in there, cause it turned out to be a great book.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AL57Q19U98TU"}}, {"Date": "on April 12, 2014", "Text": "Pretty good.  Seems somewhat far fetched for 16 year olds who get stranded by an electro magnetic pulse in Disneyland.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1N92OEX04MRSV"}}, {"Date": "on April 7, 2014", "Text": "I started with Land which I loved.  Good characterizations--moves along quickly--as these teens tried to get back home to Canada after an EMP which ocurred while they were at Disneyland.  Then I went on to Sea about the teens who tried to get home by sailing up the Pacific coast and then a short story about what happened to the rest who stayed in the city.  All great reads--very imaginative.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYIK2L22ZPLFA"}}, {"Date": "on March 27, 2014", "Text": "Great book and very suspenseful all the way through. If you like action this book is for you. I didnt even want to put it down once i got into it.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AM1WHNCXE6IA9"}}, {"Date": "on March 23, 2014", "Text": "Great book!!! Huge dystopia fan but can't stand the zombie books! This is an awesome read. Highly recommended. Can't wait for book two!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NFIEJX1F2ZDM"}}, {"Date": "on March 18, 2014", "Text": "Good storyline. It would be fun to know how they continued to live after they were back home and the majority of bad guys were gone.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARQ87UYHBVLL3"}}, {"Date": "on March 18, 2014", "Text": "This book was good.  I really liked the characters.  It's the first of 3 and I am looking forward to reading number 2, but really looking forward to reading number 3, just so I can get back to these characters followed in Land.  It's good to read a pa book where kids still think and think better than most adults at times and humanity isn't completely gone.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2H0YY7YJ8G9D4"}}, {"Date": "on March 13, 2014", "Text": "What a fantastic read! I couldn't put it down. The characters are complex and extremely interesting. I can not wait to read the rest!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QKRQTYYGF6YQ"}}, {"Date": "on March 12, 2014", "Text": "I did enjoy this book but my only 'concern' is that people will read this and think that an EMP won't be all that bad. 99% most likely will not have campers and food and water the way these kids did. However, it was an enjoyable read and I am about to start reading 'Sea'.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OFNPJKUYOWY7"}}, {"Date": "on February 28, 2014", "Text": "This is really a good story.  Kept me from sleeping till late at night!!  I'm really anxious for the next book to come out", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22HT9LT52Q1R0"}}, {"Date": "on February 22, 2014", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KZGPCRLJSTM1"}}, {"Date": "on February 18, 2014", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEUTI2RA86YVV"}}, {"Date": "on February 16, 2014", "Text": "So often with this genre bad prevails.  But this book shows that even in the darkest times, good people still exist.  I loved that there were preppers in all walks of life. Can't wait to read the rest of the series.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2T67A9KSCK5D6"}}, {"Date": "on January 11, 2014", "Text": "I went through many books before stopping on this one! I completely enjoyed it and can't wait to read Emily's story next! it's everything I wanted it to be. I could've used a little harder trials and a tad more romance drama but I thoroughly enjoyed it. Thank you Theresa!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NA48YLFXP6M1"}}, {"Date": "on January 8, 2014", "Text": "This story is well conceived and  well written. It is very interesting and entertaining.  Characters are strong and easy to  get to know and love. A strong story of survival in a world gone wrong.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1INPLOMVFOQTA"}}, {"Date": "on January 2, 2014", "Text": "Very well written.It kept your attention right from the start and you can relate to the characters from the authors description. I read it in a day and am eager for book2.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14LG657BU0URK"}}, {"Date": "on November 13, 2013", "Text": "Fun YA end of the world read. Felt unrealistic, but still a fun read. I don't think I'll be picking up the other book(s) in the series because I don't care that much about the characters. Didn't leave me curious.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A255TCZWJY7BR7"}}, {"Date": "on November 7, 2013", "Text": "It's been a month or so (maybe 5 books ago!) since I read this book. While I liked the plot, the book simply wasn't a smooth read. I think with some smart editting, the book could have been much better. Not one I'll re-read and won't be looking for the next book in the series.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A272FW45XBZ8CZ"}}, {"Date": "on November 4, 2013", "Text": "Can't wait for the Sea book!  I really want to see what happens when this crew fights for their town", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27KNW4DHYY3D6"}}, {"Date": "on October 28, 2013", "Text": "Won't open another one of these on a weekday. A few distracting spelling errors, but not so bad to distract from the plot. Thanks for the read Miss Shaved, I'm sure you will keep me up till four am again sometime.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12X3VTH3G1JHD"}}, {"Date": "on October 17, 2013", "Text": "The story moves quickly, the characters are developed well enough to carry out the daring occasions, and the action is just enough to keep you reading. However, twice the pages were downloaded about 25 times repeating.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AM6SHYFID4L3B"}}, {"Date": "on October 13, 2013", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A90BW4P5F84ND"}}, {"Date": "on September 22, 2013", "Text": "Loved it, couldn't stop.  Excellent \"disaster\" story.  You just can't wait to see what happens next.  Can't wait for the next book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3M983JOEVTSJO"}}, {"Date": "on September 22, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30YE1RJ9B55SA"}}, {"Date": "on September 8, 2013", "Text": "This story is too good to waste on the poor editing. Please get an editor and this story could be on a best seller list. I agree with the other reviewer who said a 4 star read, a 3 star edit. I love the characters and care what may happen to them. Can't wait to read the rest of the series. This series is great for teens and adults.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3A11HNWMG62YJ"}}, {"Date": "on September 5, 2013", "Text": "Really good story...Sorry it ended, was just getting ready for a big fight and see where the kids go. Guess I'll have to wait and read Sea....", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASQ4ZG4C3C0PW"}}, {"Date": "on September 2, 2013", "Text": "Good book, but was left hanging.  Will have to find the next book offered by this particular author.  Interesting read.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9QY4KYM3C61E"}}, {"Date": "on September 1, 2013", "Text": "Spelling errors really ruin the story sometimes. My mother said it was a good read and she was right about it", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1J55NZY1QBBT0"}}, {"Date": "on August 31, 2013", "Text": "THIS IS A GREAT BOOK!  These kids are a hope for humanity.  You can't help but hope they all make it home.  I am looking forward to the next book.  I enjoyed this author!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12R3SDVSY4UQO"}}, {"Date": "on August 30, 2013", "Text": "First thing this was a great book . Fast pace reading, good plot,lots of excitement and lots of Emotions, coulnd not put it down til it was finished. THANKS, Theresa Shaver keep writing . I hope to read the next book Sea !", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2X7WD61UZ4GQD"}}, {"Date": "on August 27, 2013", "Text": "This is a good story with believable characters, a scenario that could really happen, and plot twists that kept me wanting to read on. I read it to preview before my 13 yr old son reads it, and it passed my requirements. Just enough action, just enough emotion, not too much in the sex department for teens to be reading. Excited to grab the next in the series!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJDRRHICIKRGT"}}, {"Date": "on August 18, 2013", "Text": "While the writing is simplistic and the plot somewhat predictable, the story and characters are compelling enough to keep me engaged and buying the next book.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASS7945MYXKNP"}}, {"Date": "on August 16, 2013", "Text": "At the beginning of the book I almost stopped reading but decided to give it a few more pages. I'm certainly glad I did. I became invested in the story and thereafter couldn't put it down. I think the characters could have used a little more development but, in the end, I guess that really didn't matter.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A01872381QDPNSLNDUOGF"}}, {"Date": "on August 8, 2013", "Text": "Although it has what seems a slow start, it really progresses quickly onto the story. There's not a neat ending but rather an abrupt cliffhanger. Clumsy.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19T1A4TS1WHOZ"}}, {"Date": "on August 4, 2013", "Text": "This book kept me on my toes had to finish the book.  I had to read the last book to find out what happens to the them still have to read the 2 book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31EA3S78S076M"}}, {"Date": "on July 30, 2013", "Text": "It was very amateurishly written and very unbelievable as well as predictable. It may appeal to high school age. Decent story line but needs development. Read it in two afternoons. It is a series with more groups of kids leaving LA in different modes following a electronic magnetic pulse.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOXHHW6JWWLT9"}}, {"Date": "on July 23, 2013", "Text": "This book showed that our young generation can rise up to meet the challenge of surviving. This young group had to problems solve difficult issues in order to survive and get back home.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SSAR5TGNDKTP"}}, {"Date": "on July 16, 2013", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9FKZFLGY9I1P"}}, {"Date": "on July 11, 2013", "Text": "Lots of action,definetly not a book I would worry about offending someone and still provide insights into the possibilities of what happens after a nationwide catastrophe.Read it ! Hope to read a sequel.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXAGJCUY2TEJ4"}}, {"Date": "on July 9, 2013", "Text": "If you are over eighteen or looking for depth this is not for you. I must say it did well with the fifteen year old I am tutoring, tho. He at least wants to know what happens next. So a good read for younger or problem readers.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DQWWJ2HYR5C0"}}, {"Date": "on July 8, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1494N203T4R49"}}, {"Date": "on July 7, 2013", "Text": "I really enjoyed this as a feel good and things are going to work out book.  It's probably unrealistic but I don't care.  For once I really enjoyed reading a book that had good things happening in an awful world.  I will be buying the other two books.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADU6LGFXOO4XF"}}, {"Date": "on July 3, 2013", "Text": "I ordered the book becasue I thought the idea of a group of people trying to get home after a catastrophic event had a lot of potential. What it turned out to be was a book written on an adolescent level about adolescents. The plot was sometimes overly simplistic and there are just too many things that coincidentally happen to help these survivors on their way. One or two I can understand but the author just does it too often. I'm a believer in Murphy's law and people just don't have that kind of luck in real life so they just shouldn't have that kind of luck in a work of fiction.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5EE4BL8EOD9Y"}}, {"Date": "on July 2, 2013", "Text": "This book held my interest. It was not over the top like some other survival stories. I thoroughly  enjoyed it.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2K0EOXQNJNZO6"}}, {"Date": "on July 1, 2013", "Text": "Starts with bang and then things get to easy the further along the go in their journey.  Will read book 2 to see if stays on story", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DJQ3CJ6W17L1"}}, {"Date": "on June 26, 2013", "Text": "I enjoyed the story line of this book.  It was a bit predictable though.  I prefer when the author keeps me guessing!", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1M2EE2RF4UGG7"}}, {"Date": "on June 14, 2013", "Text": "Really enjoyed land and look forward to reading the other books in the series. Thank you and will look for more from this author in the future.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Y4LV1FVB2GTQ"}}, {"Date": "on June 14, 2013", "Text": "This was a very good, although at times contrived story. Not exactly consistent, and I was a little disappointed when the author let these brilliant kids do foolish things like let themselves be overrun without so much as a whimper. Everything else they had done was text book perfect, why not give them a situation they could not avoid instead of letting us readers down by having the dream team try to throw their lives away with one insanely poor decision. But after that it was a really fun read and I'm looking forward to reading the next book!", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOKTFUNT1UJC3"}}, {"Date": "on June 13, 2013", "Text": "Loved the book.  Good premise and the characters are well developed. I would recommend this series to everyone who likes the what if type novels.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PWB276OKELKN"}}, {"Date": "on June 9, 2013", "Text": "I have read over 100 books of apocalypse adventures this series would rate in the the top 5, I would recommend it to anybody of all ages that like a feel good book where the good guy wins! Also I rarely if ever give reviews, this is my third after a  157 books.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32JZZMBTBG1VN"}}, {"Date": "on June 7, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1G4WOJ25OR7H3"}}, {"Date": "on June 5, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A373BLR8ZLUUOV"}}, {"Date": "on June 3, 2013", "Text": "This book is so much better than I thought it would be when I began reading it.  It is definitely a 5 star book. The characters are believable.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GWWN2TI552OR"}}, {"Date": "on June 2, 2013", "Text": "I have read the Land (Stranded) and Sea (Stranded) novels. Theresa, if you read this you are a great story teller with good imagination, but please, please, please let me do the proofreading on your next book before it is published.  I just finished \"Sea\" and there were at least 200 typos, misused words or grammatical errors.  Since I was reading the Kindle version it is possible some of the errors were made by the transcription to electronic media.  If you are currently using a proofreader, he needs some backup.  I'll proof your next work for free.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JSP5NBXQ0WXD"}}, {"Date": "on May 31, 2013", "Text": "I enjoyed reading this book and look forward to reading more from the author in this series.  I could have personally done without so much profanity from the kids, especially the F bomb, but that's just me.  I do wish the author would do a bit more research in regards to weapons, I.e. semiautomatic does not mean three round burst, but one shot per each pull of the trigger and AK,s either fire fully automatic or semiautomatic.  I've seen much worse mistakes by other authors though.  Overall I really liked it.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19COUGKGEBSW7"}}, {"Date": "on May 29, 2013", "Text": "I couldn't put it down & can't wait to start the next one. There were a few editing errors that really drove me nuts, though. Is Dara's brother named Jake or Jack?", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TUZAA3FC0XEC"}}, {"Date": "on May 27, 2013", "Text": "Once I picked it up I couldn't put it down! Full of action and always wanting to see what the next page brings. Wonderful characters I really felt connected to.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUR6WYQXUMMEC"}}, {"Date": "on May 24, 2013", "Text": "Loved these books. Good story, characters and easy to get caught with the story.  I really looked forward to reading the next book.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1E0AIHH6QW3XQ"}}], "ReviewUrl": "http://www.amazon.com/Land-Stranded-Novel-Theresa-Shaver/product-reviews/1475199325/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.3 out of 5 stars"}, "OfferPrice": "$9.99", "Salesrank": "#811,917", "ListPrice": ""}