{"Category": "in Books (", "Name": ["Last and First Men and Star Maker : Two Science Fiction Novels"], "Timestamp": "2015-05-24 23:44:01.065795", "itemurl": "http://www.amazon.com/Last-First-Men-Star-Maker/dp/0486219623", "Reviews": {"TotalReviewCount": "28", "ReviewList": [{"Date": "on April 8, 2000", "Text": null, "Helpfulness": 0.9473684210526315, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BYTP4NJQIDR7"}}, {"Date": "on July 30, 1996", "Text": null, "Helpfulness": 0.9629629629629629, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on August 5, 2005", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22IMBUSYHCQ37"}}, {"Date": "on August 3, 1998", "Text": "Within these two works, Stapleton dares to speculate on some of the most fundamental and unanswerable questions to ever occur to the mind of man, whilst at the same time presenting two original, innovative and captivating tales which draw the reader on and upward, litterally taking ones breath away with their majesty. Last and First Men is the story of us, and how we could develop and evolve, a tale of our future, which, despite being over sixty years old, has dated very little, largely due to the sheer scale upon which it is set. Whilst initialy hard going, once the reader becomes use to the style, the content more than makes up for this and one is soon lost in man's struggle for survival, and for his own mind and what it could be come, a prevailing theme through out this and the sequel, Star Maker. Star Maker takes the ideas from Last and First Men one step further, following the development of the mind beyond mankind, though alien evolutions, up to the end of the uni! verse itself, a daunting concept. Both these tales are challenging ones, questioning what is known and what could be, and are possibly some of the most thought provoking works of Science Fiction, Cosmology and Philosophy you are likely to come across.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A70Q57RCOFRCJ"}}, {"Date": "on August 11, 2003", "Text": null, "Helpfulness": 0.8888888888888888, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ULO3KDF8PBEW"}}, {"Date": "on March 22, 2005", "Text": "My first encounter with science fiction was 44 years ago, when my father gave me a tattered novel to read. I'd not long graduated from the Beano and Dandy comics, and I initially found the tiny print and hundreds of pages of that Penguin edition of Last and First Men rather daunting. It proved, however, to be not only a rewarding task, but truly nothing short of a spiritual experience. There are many other reviews available, so I won't bore you with yet another synopsis. I am simply eager to tell you that this book is almost a one-off - almost, but not quite, if you count Mr. Stapledon's other related great work, Star Maker. Whilst these two novels are best described as sci-fi, they are, in my experience, unique in the history of the genre. Their depth and beauty causes them stand gracefully aloof as special works of art.", "Helpfulness": 0.875, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IH7UKWYVM5SF"}}, {"Date": "on June 29, 2006", "Text": "Last and First Men has been my favorite book for almost 30 years.  W.O.S. is my favorite author of all time.  I find myself re-reading it every few years to marvel at the accuracy of his predictions.  The chapter on the Americanization of the planet and the conflict with China is eerie in it's accuracy.  This from a book written before WWII.  I've loaned out several copies and they always wind up on extended journeys.  I bought this paperback edition to give to my 17y.o.  This book is a must for any serious SF fan!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABGDZXVFE0R5Q"}}, {"Date": "on August 3, 2007", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2B9Y0WXNSN17U"}}, {"Date": "on September 30, 2000", "Text": "If you can get past Stapledon's somewhat stilted prose (he was, after all, an Oxford educated philosophy student, so I cut him some slack here), there was probably no other sci-fi author who could convey such a sense of the vastness of the universe and of man's tiny little speck-like piece of it. For in Star-Maker, the cosmos is brimming with literally thousands of sentient civilizations, and humankind is only one insignificant cultural outpost in the midst of an infinitely bigger universe. I sort of liked this idea, because I would hate to think that humans, with all their shortcomings, are the only sentient species out there, not that the other species described in this book don't have their problems either. But I would like to think that there are other possiblities such as those that Stapledon describes in this novel, since it seems unlikely to me that the human race will evolve physically and and socially much further than its current state.", "Helpfulness": 0.8, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MJMYLRTZ76ZX"}}, {"Date": "on July 9, 2010", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACSC6M1COW4JE"}}, {"Date": "on February 9, 2000", "Text": null, "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on July 1, 1998", "Text": "These books are ideational gems. The imagination and spiritual vision of the writer are truly great.  I know of no other work of speculative fiction that even approaches the  cosmic grandeur of the writers vision of the Universe and mans place in it.  An absolute must read.", "Helpfulness": 0.8, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on May 31, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALDSYMGO9Y6G9"}}, {"Date": "on June 16, 2014", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FMSUJ6UJS81O"}}, {"Date": "on September 14, 2005", "Text": null, "Helpfulness": 0.6428571428571429, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QMC9FN6PWH4N"}}, {"Date": "on October 22, 2012", "Text": "This is definately not a conventional book, sci-fi or otherwise.  For brevity, I'll just talk about the First and Last Men, though much of the same could be said of Star Maker.  If you're looking for easy-reading, fast-flowing modern entertainment, don't read this book.  It's slow at times, has almost no individual characters and is in many ways unrealistic.  On the other hand, it has better than average prose, is broader in scale than almost any other book (being a history of eighteen successive species spanning billions of years), and can be very enjoyable if you can get into it.  I'm a sci-fi fan and was looking for some more unusual books when I came across this.  I enjoyed it very much but I don't think the average reader would.  If you're constantly judging the material, or anticipating goal-oriented plot/suspense points as you might in a more modern novel, you'll probably find it unreadable.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QO6VIT828QAU"}}, {"Date": "on December 15, 2011", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HT9SM95045LJ"}}, {"Date": "on September 3, 2007", "Text": "Stapledon's epic ages of man tour-de-force.  This is by no means a detailed character study, but a study of a theme - the evolution of humanity, and its spread.  You are not quite sure how one man could get his head around this at the time, but he managed, in a masterful way.  Very influential and exciting, this book.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1X8VZWTOG8IS6"}}, {"Date": "on July 24, 2014", "Text": "Wow, it is really interesting somebody thought like this so long ago.  Very well developed although hard to conceive a history that's million of years old and man still survived!  The Russians will make sure the world won't survive in the next 100 years!", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38LXFSB0LMY89"}}, {"Date": "on April 2, 2002", "Text": null, "Helpfulness": 0.5714285714285714, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADOZJJSJ9R5XI"}}, {"Date": "on September 6, 2004", "Text": null, "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A311UY26EVPPPD"}}, {"Date": "on March 3, 2005", "Text": null, "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DXJRGHULAGJ5"}}, {"Date": "on March 16, 1999", "Text": "Olaf Stapledon, oxford philosophy department head, see's Hitlers mad march and what he fears will be WW2.Presient scientifically and historically: a future nostradamus of cosmic scale unfoldings.  He questions how in the  face of such a present danger he can respond with such a work as Starmaker?  Find out, unmmask your great Voyager man within. Be ready to be in the  presence of a chammpionsip mind, at its best wrestling with itself and with  a historic projection of Man's possibilities. Here in a growing sequence of  mind mergers he finds himself  swimming up the stream of creation to that  supreme moment to confront the Starmaker. His way of describing his feeling  of limitation by using only words-when no one has ever used them better-is  truly touching. A great use of a great mind; awe has been struck into  words. Bless this world which even in its agonies can birth such noble  truthful singers.", "Helpfulness": 0.4444444444444444, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on May 11, 2008", "Text": null, "Helpfulness": 0.2222222222222222, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXWN38PAMV814"}}, {"Date": "on April 29, 2002", "Text": null, "Helpfulness": 0.4117647058823529, "StarRating": "1", "Author": {"ProfileUrl": ""}}, {"Date": "on August 10, 2002", "Text": null, "Helpfulness": 0.34782608695652173, "StarRating": "1", "Author": {"ProfileUrl": ""}}, {"Date": "on October 10, 2003", "Text": null, "Helpfulness": 0.22857142857142856, "StarRating": "1", "Author": {"ProfileUrl": ""}}, {"Date": "on July 20, 2004", "Text": null, "Helpfulness": 0.06451612903225806, "StarRating": "1", "Author": {"ProfileUrl": ""}}], "ReviewUrl": "http://www.amazon.com/Last-First-Men-Star-Maker/product-reviews/0486219623/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.1 out of 5 stars"}, "OfferPrice": "", "Salesrank": "#485,223", "ListPrice": ""}