{"Category": "in Books (", "Name": ["We: A New Translation of the Classic Science Fiction Novel"], "Timestamp": "2015-05-24 23:35:28.802738", "itemurl": "http://www.amazon.com/We-Translation-Classic-Science-Fiction/dp/1478375035", "Reviews": {"TotalReviewCount": "9", "ReviewList": [{"Date": "on July 25, 2011", "Text": "I have been waiting to read this book for years.  I downloaded the new translation onto my Kindle and was very, very disappointed.  I'm not sure if it was the translation, poor editing, or what, but the countless grammatical errors -- missing end quotation marks, periods in the middle of sentences, etc. -- truly interfered with my enjoyment, appreciation, and understanding of the book.  These weren't grammatical errors that were stylistic; these were sloppy errors. I felt as if I were reading a student paper. What a shame.", "Helpfulness": 0.9, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUJCVKUCUY649"}}, {"Date": "on October 3, 2013", "Text": "This translation is awful. Here's a sample: \"Would be better her to keep silence, it's exactly lead nowhere.\"  The same sentence from the Macmillan edition: \"Strictly speaking, she was out of order.\" This translator is overly literal, leading to sentences which are not just Russian-flavoured English but simply bad English. The Macmillan translator preserves the intent and meaning while using grammatical English. The novel is great and and a must read for dystopic sci-fi fans, but don't buy this translation.", "Helpfulness": 1.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2G103V84599XO"}}, {"Date": "on September 18, 2012", "Text": "This is a book written by a Russian author nearly 90 years ago. It takes some getting used to in the beginning, but you get to understand  what was occurring in Russia at the time. The idea of a very controlled society immediately shows you what was going on at the time. That is one part of the story. But, other parts become even more interesting and even pull in science fiction elements. This is long book, but if you stick with it you will come away having read a great story.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Z2XJ52VH137Y"}}, {"Date": "on December 1, 2013", "Text": "I understood this book to be a predecessor to 1984 and that it influenced Eric A. Blair (George Orwell) in his politics and eventual, excellent works of 1984 and Animal Farm.  Because I read this book after many readings and study of 1984 and because it was not written in the straight-forward style of Orwell, it was a little more difficult for me to enjoy and engross myself in the story.  Still, I am glad I discovered it and dedicated time and effort to work my way through it.  I believe you will feel the same way should you choose to purchase this volume.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXQ0OUKMBNBGO"}}, {"Date": "on May 22, 2014", "Text": "This is a great book - a must read for anyone who likes dystopian fiction or Russian writers. Unfortunately, this edition has quite a few typos. It isn't enough to ruin the book, but it is slightly distracting sometimes.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16T2E3PEDV9NE"}}, {"Date": "on June 26, 2014", "Text": "After reading 1984 I learned that one of George Orwell's inspirations was Zamyatin's We. We was a little strange at first. Eventually, I loved the synopsis records. Different perspective but, very cool.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31GBKUCHMDC8T"}}, {"Date": "on August 19, 2013", "Text": "I really liked this book.  I am a fan of Russian literature and dystopian future novels and this met all my expectations and then some.  Good read.  Really different.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EZW7XMWNMZEM"}}, {"Date": "on December 29, 2013", "Text": "very progressive in ideas for the time it was written. the writing comes through the translation still in good form. I recommend this.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3V2BA3Q8DETAW"}}, {"Date": "on August 23, 2014", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MFPR1ILOQPJY"}}], "ReviewUrl": "http://www.amazon.com/We-Translation-Classic-Science-Fiction/product-reviews/1478375035/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "3.4 out of 5 stars"}, "OfferPrice": "$6.29", "Salesrank": "#1,023,858", "ListPrice": "$6.99"}