{"Category": "in Books (", "Name": ["Station Eleven"], "Timestamp": "2015-05-24 23:44:05.901288", "itemurl": "http://www.amazon.com/Station-Eleven-Emily-John-Mandel/dp/0804172447", "Reviews": {"TotalReviewCount": "1,713", "ReviewList": [{"Date": "on July 29, 2014", "Text": null, "Helpfulness": 0.9299363057324841, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36NIZYOZ36ZHG"}}, {"Date": "on November 6, 2014", "Text": null, "Helpfulness": 0.8454545454545455, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DLGD5AVUH5QH"}}, {"Date": "on October 31, 2014", "Text": null, "Helpfulness": 0.8144654088050315, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31ZIWO6T64F92"}}, {"Date": "on September 20, 2014", "Text": null, "Helpfulness": 0.8666666666666667, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2O8FS9MZMBX7C"}}, {"Date": "on September 8, 2014", "Text": null, "Helpfulness": 0.80990099009901, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A231LBC8EGPO5L"}}, {"Date": "on September 15, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ADHAQLZHHBGO"}}, {"Date": "on December 10, 2014", "Text": null, "Helpfulness": 0.8571428571428571, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXWZG069JC0JH"}}, {"Date": "on October 18, 2014", "Text": null, "Helpfulness": 0.8695652173913043, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1M5T4H3Q499JP"}}, {"Date": "on July 13, 2014", "Text": null, "Helpfulness": 0.8222222222222222, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QQEFV51EMD7E"}}, {"Date": "on August 20, 2014", "Text": null, "Helpfulness": 0.8636363636363636, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFN32PGTZ31MV"}}, {"Date": "on January 4, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XXRM09DOGEX2"}}, {"Date": "on November 2, 2014", "Text": "A lot of lower star reviews convey much of my own impression of this book. Its an interesting enough premise - but I was left wondering the entire book as to how civilization fell SO FAR. It was a disease, not a natural disaster. There is no reason for settlements to have formed in fast food restaurants or Walmarts instead of abandoned houses, let alone for comfort, and certainly not still going after 20 years. Transformers were not destroyed. Satellite signals were not disconnected. I found it incredibly hard to believe that there was no one among the survivors who had knowledge of how to keep modern civilization stumbling on to even a basic extent, especially with the size of the IT community in our society. I also felt there were too many secondary characters that I ended up not really caring about, and stories that were not fully evolved. Overall it was original enough to read to the end, but I thought it was more stupid than anything.", "Helpfulness": 0.8048780487804879, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HVHSW9G4L33C"}}, {"Date": "on October 15, 2014", "Text": "A flight from Russia lands in America, its passengers carrying a quick killing virus. In a blink, the world as we know it collapses. This book got such high reviews (not sure why) but I have to say, I was disappointed. I thought it was all over the place and I just didn't care for most of the characters. Not sure how Station Eleven even fit into the story. It did keep my interest but there were many times when I thought, \"I just wish this book would end.\"", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37ES2LNDQQ613"}}, {"Date": "on September 19, 2014", "Text": "There was life before the collapse and life after the collapse. One of her many achievements in the novel is how she uses this dividing line to illuminate the many things we take for granted. Not by wagging her finger and giving us a lecture, but through thoughtful, understated writing. And the writing is sharp and pointed:at a pre-collapse dinner party, describing a guest as a woman who mistook \"rudeness for intellectual rigor.\" Perfect pitch. And there is the technical achievement of cutting back and forth between pre-collapse and post-collapse and telling the story from the viewpoints of several characters. All in the service of helping us understand that while life is brutish and harsh, we still have the impulse towards decency( a central character  is staggering out of her hotel in order to die on the beach, sees a man curled up and dying and while she is too weak to speak, thinks to herself that I looked at him and she hopes the look gave him a connection);another central character is about to be executed by The Prophet, and thinks to herself how she \"so desperately loves\" the actors and musicians she traveled with and hopes that they know that she understood why they could not save her and  that they forgive themselves). In the end we choose life, not because of some animal liike survival instinct but because we are human which  means we want to live for others, not just ourselves.", "Helpfulness": 0.9090909090909091, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A135Y35RRGHY3G"}}, {"Date": "on November 15, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10C8Q8V2ZQUQQ"}}, {"Date": "on July 10, 2014", "Text": null, "Helpfulness": 0.8461538461538461, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MFGULNTMAJS9"}}, {"Date": "on August 28, 2014", "Text": null, "Helpfulness": 0.8461538461538461, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PD27UKAD3Q00"}}, {"Date": "on November 26, 2014", "Text": "The premise is ridiculous and scientifically unsound.  The idea that people are scavenging in the immediate aftermath of losing 99% of the world's population is ridiculous - same amount of stuff, far fewer people.  The whole thing knocks hard against common sense.  The characters are not strong enough to overcome this.  No idea how it was a NBA finalist.  And aviation fuel in a motorcycle?  Was it meant to be a farce?", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EV9QIF0QMGJC"}}, {"Date": "on October 4, 2014", "Text": null, "Helpfulness": 0.7894736842105263, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28HO8AE8GPUIY"}}, {"Date": "on October 10, 2014", "Text": "Not my cup of post apocalyptic tea.  From the rather flowery, ridiculous names to the amount of time spent pre apocalypse outlining the love life of a dead actor the book never really engaged me.  I will say focusing on the preservation of the arts was an interesting take on the genre, but the characters werent that interesting, and the remains of society not explored sufficiently.  Obviously I'm in the minority, but the other thing is 1% of humanity is still a a lot of people.  More than enough to get to together and re-establish society with the infrastructure that is in place.", "Helpfulness": 0.8125, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWR4SUM2V8YBX"}}, {"Date": "on January 20, 2015", "Text": "Although this book is no doubt meant to be read as a fable, the sheer ineptitude and timidity of the survivors is extremely aggravating.  If, as suggested, there are as few as 30,000 people left in the U.S., they should not have to be living in gas stations and fast food restaurants for decades, without making any effort at re-establishing civilization.  Apparently, none of these survivors have ever heard of solar cells, wind power, or hydroelectric dams, and are thus resigned to living without electricity.  None of them have heard of electric vehicles with solar chargers, or cars that run on ethanol or biodiesel, so they are resigned to using horses as their primary mode of transportation. There are apparently no ham radio operators left among the living, so nobody makes any attempt at long-range communications using low-tech, low power radios, or even attempts short-range communications using battery-powered walkie-talkies from Radio Shack.  Nobody remembers how to man a sailboat, so there is no traffic up and down the nation's rivers, bringing trade goods and news.  Guns and ammunition are running low, despite the fact that at the time of the collapse there were about 300 million guns in the U.S., about ten thousand for every man, woman and child left alive after the plague. Prepared foods and medicines are unobtainable, despite the fact that 30,000 survivors wouldn't make much of dent in the supply of medicine on the shelves of the nation's 40,000 chain pharmacies, or in the supply of food in the nation's 40,0000 chain supermarkets (not to mention the thousands and thousands of independent pharmacies and grocery stores).  I could go on and on, but I think you get the idea.  You have to work very hard to suspend your disbelief of this highly improbable post-apocalyptic future.  It's an interesting story if you can buy the premise, but that's a pretty big if.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EP6E18AOVAB2"}}, {"Date": "on September 22, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35OO2ZWN7ICD4"}}, {"Date": "on September 9, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LH7RNJDSNCUD"}}, {"Date": "on January 6, 2015", "Text": "I so wanted this book to be like \"Not A Drop To Drink\", and maybe even better.  You know, a good, honest book about a kid that had to get tough to be a survivor, and a story that didn't have to be spun out into a trilogy.  The basic material for just that is in \"Station Eleven\", but it gets lost in too much trashy, Hollywood-esq back story about characters that have, at best, only a minor connection to the essential character and her development.  I found myself leafing past page after page of useless incidents about characters that didn't matter to the story, or to me.  And that main character, who I was  just starting to get interested in, and her story, which was finally getting somewhere, get cut off in a \"what-the-heck\" conclusion.  It almost seems like the author ran up against a word limit or a page limit, and had to wrap it up real quick.  There was so much in the book that I didn't want to know, and so much left out that I did want to know.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZN7J1KAG3FWX"}}, {"Date": "on December 24, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3M035CHEIVR1G"}}, {"Date": "on August 23, 2014", "Text": null, "Helpfulness": 0.8571428571428571, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QXWM5P0CT45"}}, {"Date": "on December 28, 2014", "Text": "Well written but only about 1/4 of the story.  Characters not fully fleshed out.  Young female characters interchangeable.  So many unanswered questions.  Completely bored by the movie-star story-line which took up half the book -- I kept waiting for it all to make sense and it didn't.  Perhaps I was looking more for a pandemic adventure story, I don't know.  The fact that I'm still thinking about the book a few days later probably says something, but mostly I feel that I've read a quarter of a book and I wish I could pick it up and finish it.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3H7GT27EHMHEQ"}}, {"Date": "on December 23, 2014", "Text": "If one is voyeuristic, that is liking to live in the heads of others, this is a fine read.  Otherwise it is weak on plot, and predictable from the almost the very beginning.  Characters are sketched rather than fully investigated from my point of view.  A slightly up beat ending leaves things hanging on a more reassuring note.  However, for some readers perhaps more introspective than I ma, it may be a satisfying read.  Borrow it from a from a friend or read a chapter or two in the book store before buying, just to be sure.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CAH49PNR35BZ"}}, {"Date": "on January 16, 2015", "Text": null, "Helpfulness": 0.7619047619047619, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2U8UG287D6QW8"}}, {"Date": "on April 4, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2T9CD7QDXFUHC"}}, {"Date": "on January 17, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGMT6PW8RAH6T"}}, {"Date": "on January 15, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21EI3PR50SWR7"}}, {"Date": "on December 29, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BQFW41XDLR93"}}, {"Date": "on December 28, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UN4S3N7VYLEV"}}, {"Date": "on December 17, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GTJRUDVH3RK2"}}, {"Date": "on October 19, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1S2NZSC6BQ15X"}}, {"Date": "on October 16, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CUWCJHUPGL9W"}}, {"Date": "on September 24, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUJBQNXUHOP84"}}, {"Date": "on September 18, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14Y0D60QO1J6E"}}, {"Date": "on September 16, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8710RWTFG3IY"}}, {"Date": "on September 15, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2F6N60Z96CAJI"}}, {"Date": "on September 16, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JP42TKK5ZJEI"}}, {"Date": "on December 2, 2014", "Text": "This is an instance in which the book sample fooled me into a bad purchase. The story began well with detailed scene setting for a world-changing plague tale and then quickly morphed into something very boring about young actors and musicians.  I could not finish it and would not recommend it.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RBAQUQ7O3TUX"}}, {"Date": "on September 15, 2014", "Text": "Purchased because of several good reviews I'd seen in various publications. Novel is a blend of science fiction, adventure and romance, which was seamlessly written and beautifully narrated by ESJM. The story unfolds around a population decimating epidemic, giving equal time to the months before the pandemic, the event, and the aftermath, but cleverly jumping between the three instead of using a chronological format to relate the story. Often the use of this type of storytelling is confusing at first, sometimes to the point the reader gives up. Recently I read a young adult novel called \"Code Name Verity\", which had won numerous prestigious awards, was highly thought of, came with rave reviews, and try as I might, I could not get past Chapter 3, it was so confusing in the way it jumped back and forth between locations, characters, years, countries, I gave up (I went back to it later after having read an introduction and description of the novel and spent 5 hours reading it front to back, SUPER BOOK, IF YOU HAVENT READ IT, YOU SHOULD) . The way the story unfolds out-of-order in this novel is what makes the book a compelling and provocative read, written using current colloquial verbiage and terminology which immediately hooks the audience, with such familiarity it seems as if the story is taking place somewhere you've been, the people are like people you know, the surroundings and landmarks are familiar, but the tale being told is like nothing you can imagine, a glimpse of a shocking brutal future. Excellent. Worth the price, would buy again. A+", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZQBQFQL3N469"}}, {"Date": "on December 26, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D87TI72ZTL2F"}}, {"Date": "on January 14, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DHVB477XCRXF"}}, {"Date": "on November 7, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AKIN8TP14O9M"}}, {"Date": "on December 3, 2014", "Text": "As a fan of dystopian novels, I tend to enjoy the gamut of tones taken in these works. From the bleak-but-hopeful (The Passage), to the really bleak with a drop of hope (The Road) to the uber-bleak (1984). Along this spectrum of emotional tones, Mandel's work arguably sits on the more hopeful end. I found this hope to be refreshing, without being pollyannish (if such a label could ever appropriately be given to a novel in which 99% of the world is wiped out, and roving bands of criminals and murderous cults play a role). Indeed, I was struck by the richness of the narrative, and by the effectiveness of the Lost-like flash-back-flash-forward technique used to flesh out the characters, and to draw attention to different facets of the human experience. While there were some narratives that tied up just a little too well for my tastes, overall these aren't enough to dissuade me from really loving the novel itself. I found myself constantly coming back to the book, as much for its plot as for its reflections on how we remember events, and how much of our adulthood is spent re-examining and trying to adequately narrate the flecks of memory that linger with us from our childhoods. In short, I would highly recommend this novel.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RJ3DGJNIJZT"}}, {"Date": "on October 17, 2014", "Text": "If you're looking for a post apocalyptic dystopian novel about a group of hard scrabble survivors savagely learning to live in a new cruel world a la, 'The Walking Dead', this is not the book for you. Instead, Mandel writes what I feel is a meditative and highly moving take on what it means to survive,and what it is to remember, and cherish, and regret, and love and lose. I'm certain the book adds an additional resonance in this current day of ebola hysteria, building momentum with every passing hour, but I found myself constantly wondering what if something like this Georgia flu in the story really happened? How would the world and it's survivors fare in a before/after scenario. There's also such terrific writing in her juxtaposition between the purity of art as we follow this ragtag band of performers who move from each small survivor town bringing music and Shakespeare, and the flashbacks of a mega superstar actor and the trappings of fame before his heart attack on stage that opens the book. I loved this book. Loved its haunting sadness, and its ability for its characters to find the beauty in the everyday, in the simple.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYT4FJYVCHYLE"}}, {"Date": "on November 14, 2014", "Text": "I was really excited to read this book because of the awesome reviews it was getting. Maybe it was because I was expecting to be blown away that I was not as impressed with this book as I had hoped. I certainly liked the book - but did not think it was worth all the hype. The book is a post-apocalyptic novel in which a terrible virus wipes out most of the population. Due to this, cities fall to ruin, technology becomes obsolete, and the remaining people become nomadic tribes or  closed communities. The question of whether or not there is a 'world' beyond them - e.g. that the virus only touched the U.S. - and if their friends and family survived but are unable to contact them haunts many of those who survived the plague. The main characters are a troupe of traveling actors and focuses on the relationships between them as well as the relationships and lives they lived both before and after the terrible virus caused the collapse of the world  as they knew it.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GKP8AOANOK91"}}, {"Date": "on November 19, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FLS76XZFRMZX"}}, {"Date": "on September 10, 2014", "Text": null, "Helpfulness": 0.8333333333333334, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IF83HCHVSRW2"}}, {"Date": "on October 30, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FH2TV5N2G3VK"}}, {"Date": "on December 13, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1W2TNCAC2XDP3"}}, {"Date": "on January 12, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A630U5ET4DPB7"}}, {"Date": "on October 21, 2014", "Text": "I haven't finished this book yet.....just started it yesterday....will likely be done today unless I can hold off....but I doubt I can. I love this novel.....I'm a sucker for apocalyptic tales and human drama....this has both and works so well for me. I love the interwoven stories....the descriptions of our life now and how it looks to those who survive after this life is gone. I love the traveling symphony and the happiness they bring to the survivors. I'm excited to see how the story ends.....though I am pretty sure it will simply be with people keeping on keeping on......which is also okay. I will definitely be reading her other novels. Best $6 I've spent in a long time!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2M9GE5ES28APB"}}, {"Date": "on December 13, 2014", "Text": "This is a book I could read again. It is a post apocalyptic  novel that felt very real and in the now.  A flu endemic wipes out 99% of humanity. With no man power to keep the world in working order, most of the world just stops functioning. It brings to light how much we depend on technology and globalization. For example, a basic life-skill like growing food can depend on a machine- irrigation, water purification systems, etc). It makes one realize how much we take for granted. Most of the main characters were well developed. The plot lets the reader experience the full scale apocalypse, before, during and after.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NKCKOO87ETPD"}}, {"Date": "on October 30, 2014", "Text": null, "Helpfulness": 0.8333333333333334, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17HXR5IMGZNO0"}}, {"Date": "on October 22, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QGT62ZVNU4PH"}}, {"Date": "on November 7, 2014", "Text": "A wonderfully contemplative and poignant exploration of loss and connection in a dystopian world, where 99 per cent of the global population has died. The premise that \"survival is insufficient\" is fully explored in this new terrible world. The novel sweeps back and forth between the present wiped out world and the old world, where we see how much we had in terms of stuff and technology but were lacking in relationships and real connectivity. A wonderful read, which I would strongly recommend.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PADTJZFE0TGP"}}, {"Date": "on September 17, 2014", "Text": "In the novel, a deadly flu virus which originated in a little country overseas suddenly turns into a global pandemic and wipes out most of humanity.  I read the book just as the Ebola virus was going out of control in West Africa.  This novel is a quick read and worth a look for sf apocalypse fans.  I gave just 3 stars because while the writing is very good, I found the plot to be intermittently boring and the characters rather one-dimensional.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PADKL4HYJTEK"}}, {"Date": "on December 23, 2014", "Text": "It's okay.  I don't understand all the hype about it.  She pretty much ripped off the plot from Steven King's The Stand.  I guess if some reviewers never read The Stand that's why they would think it was a great storyline.  I did not find any of the characters likable, nor did I care very much what happened to them.  It is a good reminder to appreciate what you have, as it can be gone in a heartbeat.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FT5RK0AGBERA"}}, {"Date": "on November 21, 2014", "Text": "The writing is solid but where's the story? I kept waiting for the death of the celebrity on the eve of the apocalypse to have some kind of meaning to the story but it didn't. Seems like a cheap plot device to get people to continue reading. Same with the graphic novel that we heard about incessantly and the ex wives of the actor. The whole thing was just a monumental let down.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMNWN1NULFTRE"}}, {"Date": "on November 30, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38NJKH1ITZ6UN"}}, {"Date": "on November 2, 2014", "Text": "Good book to read on the plane or beach. Easy to set down and pick back up again despite the frequent flashbacks. Interesting story concept and would actually adapt well to a tv screenplay. However, if you're looking for a book to emotionally draw you in or connect with the characters, take a pass.  I didn't experience either of those with this book.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NM4KXEU0M6GU"}}, {"Date": "on November 20, 2014", "Text": "The strength of this novel is in its character portraits. In the end, the interconnected story lines didn't come together in a satisfying way. The post-apocalyptic theme is handled nicely, but not with any particular originality. And yet, I'm still thinking about it days after I finished. It was quite nice and a few hours well spent.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OVKH22ANSRWC"}}, {"Date": "on August 3, 2014", "Text": null, "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFJFXN42RZ3G2"}}, {"Date": "on April 6, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JUB3UTMCW4U3"}}, {"Date": "on March 28, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RAXVVNQ93T7Y"}}, {"Date": "on February 17, 2015", "Text": "In the super abundant post apocalyptic genre, it's critical to find a unique voice to distinguish yourself from the other works clogging the canon. While I applaud St. John Mandel for taking a tiring theme and breathing into it fresh perspective, I cannot say that the ground she treads here is riveting or inspired. The novel has a present, past, present variability that is easy to follow and a cast of characters that seem random, but Mandel pulls together with precision and aplomb that would disgrace many of her peers. Station Eleven doesn't have a central character, nor does it have a specific direction. About halfway through the book, I stopped reading and evaluated how entertained I was and to what degree the book's plot had actually achieved anything. The answer to both was very little. While the second half of the book is better, it never reaches the heights I'd hoped for. It ties up threads nicely, but it also becomes liberal and preachy in a way that is off putting. I found that I cared very little about any of the characters. By the end, perhaps only Kristen had any relevance for me, and that only in the way of her grit and determination that seemed to overshadow many of her fellow cast mates. Add in contrivances that are silly in retrospect, and the disappointment deepens. Why would people live in Wendy's and McDonald's and airplanes? 99.9% of the population is gone. There are plenty of houses available. Same goes for ammunition shortages. With essentially 100% of the populace dead, there'd be more ammo than the survivors could ever use. Throw in a shameless religious attack with an antagonist labeled as \"The Prophet\" (kid you not, yep, The Prophet), and you've got tropes that drag this wildly benign story to depths that Dr. Eleven wouldn't have been able to reach. I guess in the end, I was largely unmoved. With a finite amount of time to enjoy novels, I wish I would have read The Road or World War Z again instead of wasting my time with this one.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BXZ6YA1RG3SK"}}, {"Date": "on January 27, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2STKYO3NMZL3P"}}, {"Date": "on January 16, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FZDP1IYDVNOK"}}, {"Date": "on December 14, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3H4JL44P4KNQO"}}, {"Date": "on November 20, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8IPQ1Q1O7YX5"}}, {"Date": "on October 30, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SFD5V9RS92G5"}}, {"Date": "on October 30, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TCOJDGNWFLP1"}}, {"Date": "on October 7, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30EJREZES67TA"}}, {"Date": "on October 3, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZKRFNQ8EFO4T"}}, {"Date": "on September 18, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3A7DII49DAMF"}}, {"Date": "on August 25, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HOBP97RKKY0M"}}, {"Date": "on February 5, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A257XGMVGITLCT"}}, {"Date": "on March 9, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KMPWPKV7B16T"}}, {"Date": "on January 11, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BBN7CAS3XWDC"}}, {"Date": "on January 10, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHNVHX22OTPFA"}}, {"Date": "on January 4, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15PYCET4XH22X"}}, {"Date": "on November 25, 2014", "Text": "I could have been content with only the first two and final two chapters. The embedded comic may have been more interesting and entertaining. A collection of jumbled ashen puzzle pieces; makes me wonder So what? Who cares? Clearly none of the characters.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11A8UZXD5QUHP"}}, {"Date": "on January 13, 2015", "Text": "This is subtler than most dystopian novels, which tend to scold the world for present-day failings. The plague (a flu) that dismantles the world happens for no human-made reason except the reality of globalism. It's hard to imagine any defense against an airborne virus which is near-100% lethal  and spreads by air travel before anyone is aware of the threat. (One of the primary conflicts is between the \"prophet,\" who preaches that everything happens for a reason, and most survivors, who know it was just a mutated virus and only luck separates the living from the dead.)  The book's strongest metaphor is the Orchestra which travels between  survivor outposts and plays Shakespeare and music.  I hadn't thought about how Shakespeare's life and plays were shadowed by the plague, which restricted travel in Elizabethan times and banished theater to the countryside. The book is nowhere near as harrowing as \"The Road,\" where I was often scared to turn the page, but the details of deprivation and improvisation, and the nostalgia for our present,  are similarly fascinating. I like that the book revolves around an unpublished graphic novel, and that its motto isn't from Shakespeare but from Star Trek. I like that none of the characters is truly evil and that everyone's humanity is acknowledged, including that of the sinister prophet.  The style is completely different, and the book is rarely funny, but the closest writer in spirit might be Kurt Vonnegut.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16PJABXZ49XBJ"}}, {"Date": "on January 19, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32DYU82G6X3AO"}}, {"Date": "on November 9, 2014", "Text": "I'm highly skeptical of \"the next big thing,\" especially when the author being touted is young and beautiful. So I approached \"Station Eleven\" with healthy skepticism. But Emily St. John Mandel's book is the real deal.  When I write reviews, I tend not to summarize plots.  The Library Journal did so very nicely in one or two sentences.  Suffice it to say that the novel is about a post-apocalyptic world, a world decimated by an incurable virus. In this world the things we take for granted no longer exist: electricity, gasoline, communication.  But in Mandel's book we do not experience the apocalypse through the eyes of roving marauders or the hero - \"The Road Warrior\" (movie) - trying to survive despite them. Nor do we see the world through the nihilistic eyes of a dying father trying to save his son - \"The Road\" (novel).  Instead, we are provided a troupe of actors and musicians, a paparazzo-turned-EMT, and a boy who grows up to become the leader of a band of religious survivalists - echoes of \"Lost\" (TV show). Time is fluid and characters connected in surprising but believable ways.  The only reason I did not go all out with 5 stars is that the pacing is a bit slow and at times the book tries too hard to be plotted like a movie or TV show with chapter-ending cliff-hangers. But this is minor. The book deserves a standing ovation. Bravo!", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RF5I5OJOSEXK"}}, {"Date": "on September 22, 2014", "Text": "a beautiful, gripping book that shifts back and forward in time from 20 years after a pandemic that wipes out 99% of the world's population, to the day it started and the years before in the lives of various characters all connected by their relationship to a charismatic actor, Arthur Leander, who died on stage, playing King Lear in Toronto, on the night the plague began. Some of them -- including a girl, Kirsten Raymonde who was 8 years old that night, silently playing one of Lear's daughters as a little girl -- have banded together into a traveling symphony and repertory company that performs Beethoven and Shakespeare for the scattered settlements of surviviors. Their motto (from an old Star Trek episode)\" Survivial is Insufficient\". The book's title \"Station Eleven\" refers to a beautiful graphic novel that was the life work of Arthur's first wife, Miranda, and encapsulates all Kirtsen's longing for a lost world she can barely remember. The new world is Arcadian but fraught with danger, in the form a man who calls himself the Prophet. The evils of the of the old world aren't quite dead yet. This haunting novel deserves wide recognition and a broad readership. The best book of its kind since Cormac McCarthy's \"The Road\" -- but far more hopeful and uplifting.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HL8UAM5GIVGE"}}, {"Date": "on December 23, 2014", "Text": "Quite good.  What I say is more of an observation than a criticism.  Like many current novels it's influenced structurally by movies and TV.  By that I mean there are many stories in it and the author uses the cut-away to another story very often to create an effect. Since I work in film I'm aware of that device (the un-filmed scene) which sometimes becomes a trick.  This novel is really several short stories that are linked cleverly, some might say a bit too cleverly and stretched a bit far,  But, yes, the characters are interesting and the dystopian setting is well devised, too, (although we may be nearing the end of this particular trend - oh, please!).  The author manages to write well about fame.  But as I feel in many series and movies I often wished she'd taken one or two characters and followed them.  I wanted to know more about him or her and less about another.  But I'm an older guy and grew up on the classics and writers like Bellow and Gordimer and Updike.  While it's admittedly time to move on from them and their styles and subjects, those writers can still show how to follow a strong story-line and character and get the same result that a grab bag like this does.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38PADI08XBTJ9"}}, {"Date": "on November 5, 2014", "Text": null, "Helpfulness": 0.8, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A319DZUFC1H92T"}}, {"Date": "on September 10, 2014", "Text": null, "Helpfulness": 0.8, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2D9XR8XO8UNLN"}}, {"Date": "on January 4, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OE7BNM8MM59L"}}, {"Date": "on January 7, 2015", "Text": "I have to agree with other 2 and 3 star reviews.  This novel has a good premise but it is never fully fleshed out in both characters and story line. I don't understand why folks are so nuts for this book.  I haven't finished reading it yet, but have decided not to - I just don't care - as other reviewers have said.  The incessant jumping back and forth through time is annoying. I really wanted to like this book, and I hate to put a book down, but this time I will.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3N1K28XS3FY3T"}}, {"Date": "on February 24, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3V5XZL28IAXTH"}}, {"Date": "on February 21, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VJ7SIZTIUDVW"}}, {"Date": "on January 19, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BVQHM1C6B9UW"}}, {"Date": "on January 10, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A312K5WL31QKR"}}, {"Date": "on December 30, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1V09ASZ9HWQAE"}}, {"Date": "on December 29, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RYKGO7IUYUZV"}}, {"Date": "on December 16, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AB2UHDGRAEHO"}}, {"Date": "on December 26, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUQWCKG981Y43"}}, {"Date": "on December 15, 2014", "Text": "I thoroughly enjoyed this book.  And yet, I also can see how people have such an utter disinterest for this book at the same time.  This story starts in a theater in Toronto when an actor has a heart attack and dies.  The rest of the story is told from different people's perspective about past and future events.  Everyone character in the story has some connection to this actor and his death.  And then to make things a little more interesting the future is set in an apocalyptic environment where 99% of the human population is gone.  Is it a dystopian novel?  Yes and no. And I think if you are expecting a end of the world thriller, you will be disappointed in this book.  A lot of people also thought this book was disjointed.  And this is true.  Many of the characters are not referred to by their name, but instead the instrument they play, and then a few sentences later they will be referred to by their name again.  Also sometimes the story is told more traditionally, other times its told through an interview format, and some chapters were laid out in the form of lists.  But for me, this didn't hurt the story, but instead enhanced it.  I really liked how the book keeps you on your toes by changing perspectives and formats constantly.  Finally what really matters most for me when I read, is the quality of the writing and the originality of the story.  And both of these were great.  This is truly an unique story that was written beautifully.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QURQXHM9GZLD"}}, {"Date": "on February 7, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IZ3TRDEEJBRT"}}, {"Date": "on September 9, 2014", "Text": null, "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVD347AL4UF11"}}, {"Date": "on December 28, 2014", "Text": "not great, not sure why all the great reviews.  there were portions that were good, but i found it mostly boring, hard to follow and when it got interesting, it moved to another sub plot....I was disappointed.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IOR3OTTUK3O5"}}, {"Date": "on December 22, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HN4878M7CPXS"}}, {"Date": "on December 19, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XQJ5Y0PCZE76"}}, {"Date": "on December 8, 2014", "Text": "A great book overall and masterfully written.  Difficult for the first half as it bounces about in different lives and times but worth the wait as the stories weave together.  Thanks Emily.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJINLB7NPCX8K"}}, {"Date": "on December 3, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QKXX9HO4SGM9"}}, {"Date": "on September 9, 2014", "Text": null, "Helpfulness": 0.7142857142857143, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APBA7Y4SINS0H"}}, {"Date": "on December 20, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Q6YZCCAVNF8P"}}, {"Date": "on December 5, 2014", "Text": null, "Helpfulness": 0.75, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACREHLVRC4H5B"}}, {"Date": "on February 8, 2015", "Text": "Took me forever to finish.....I had no connection to any of the characters. Wanted to love it....simply just did not get all the hype. Wondering what I missed?!??", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10T2I7XRU9YUG"}}, {"Date": "on January 13, 2015", "Text": "One of the subtler post-apocalyptic novels I have read, Station Eleven is more of bard's tale than a traditional adventure novel. It tells a twenty year sweep of the fall of civilization to a 99% fatal plague and the slow emergence of post-violent humanity, connecting everything to a famous actor named Arthur Leander. Told in snapshots of the various people connect to Arthur, the story delves into pre-plague events, the initial weeks of the fall, and the rekindling of humanity 15 to 20 years later. Unlike most apocalyptic novels which rely on fast-paced action to describe the story, Station Eleven focuses on a large cast of characters as they struggle to regain what has been lost of their humanity. The action is minimal, but appropriately violent and abrupt when it happens. In many ways, Station Eleven is likely a truer telling of what a post-apocalypse would look like - not roving bands of leather clad bikers, but rather roving bands of actors and musicians visiting one fledgling enclave after another.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BW1O1IUAUC7K"}}, {"Date": "on February 1, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27DHWV8II710X"}}, {"Date": "on February 1, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAA5AZR2ZL4L1"}}, {"Date": "on December 27, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1T53VW604RKE9"}}, {"Date": "on March 4, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LTGSJ902DI73"}}, {"Date": "on January 8, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1P2CGPWVVU344"}}, {"Date": "on March 7, 2015", "Text": "So, so, so ridiculously good. When \"they\" say that this was the best book of 2014, they were not lying. So enthralling!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Z81RXPJ04IGO"}}, {"Date": "on November 29, 2014", "Text": "I was enjoying the early part of the book and then it seemed disjointed.  Would not go out of my way to recommend it to others.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJ2BVBOBMRXY9"}}, {"Date": "on September 13, 2014", "Text": null, "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XPD3WFBJ38WK"}}, {"Date": "on February 7, 2015", "Text": "This is an excellent story by an extremely talented young writer. I give it 4.5 stars and I enjoyed the book very much. Mandel paints vivid, stark pictures with economy, an amazing gift. Dystopian-themed novels are the rage right now, to the point that I have become tired of them. But this one is different and certainly deserves the praise it's been receiving. She populates the story with very interesting characters and manages to weave a bit of despair, dignity, and hope into the book, all at the same time. I also like the way she chose to end the story. I withhold five stars only because I found splitting the story between different decades slightly confusing at a couple of points. I highly recommend this novel to science fiction fans and look forward to more from author Emily St. John Mandel.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JE2E7SQC9R15"}}, {"Date": "on March 17, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RKXJ9QPOTBZP"}}, {"Date": "on December 27, 2014", "Text": "For a few days after finishing this book I was almost without the ability to form a coherent sentence about it--at least one that came anywhere close to doing justice to the story. The set-up is that a deadly, fast acting, highly contagious, flu epidemic brings on the end of the world as we know it by wiping out almost everyone in just a matter of days, leaving small groups of widely scattered survivors coping in various ways with their new stripped down reality, but the aftermath while gritty and dangerous still isn’t without hope, beauty, art, and a sense of community. Told through a series of masterfully woven, interconnected stories revolving around a troupe of traveling orchestra musicians and Shakespearean actors, Station Eleven is one of my favorite books of the year.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32EOHLFZYXJEP"}}, {"Date": "on December 29, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14RIR98KQ7353"}}, {"Date": "on December 27, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATOLBR9PDC86W"}}, {"Date": "on November 29, 2014", "Text": "I loved this book. Although the premise is a post-apocalyptic scenario where most of the world's population is killed off by a sudden pandemic, Station Eleven is not a typical survivalist adventure, but rather a character-driven novel where the back-story of the characters whose lives intersect with each other prior to (and to a degree after) the pandemic was to me by far the  more interesting aspect of the novel. Judging by other reviews, this cuts both ways. If you're hoping for survivalist adventure this may not be what you're looking for, but if you're looking for finely written and crafted characters whose lives happen to intersect around the time of the end of the world as we know it, I strongly recommend it.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23WRE5K45FA4B"}}, {"Date": "on April 23, 2015", "Text": "\"Spanning decades, moving back and forth in time\" is exactly what this book does. Unfortunately this is rarely, if ever, a good way to depict a story. It is similar to \"The Road\", except that the flashbacks are continous throughout the book. The author does manage to connect the dots between the main characters, but there are no parts, except for one notable exception, where there is any suspense. Finally, the books attempts to end in a big cliffhanger, but it fail completely. I get the impression that the cliffhanger ending is there to justify writing a follow-up in case this book earns a profit. I found little interest in the story and will not consider to purchase any sequal.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RGJQPQU0KZY"}}, {"Date": "on January 22, 2015", "Text": "Do not be fooled into buying this.  The first few chapters are excellent, then suddenly it's twenty years later, and nothing, I mean nothing, of note has happened in those years.  The author then spends the rest of the book wandering in the wilderness.  Literally.  Basically no plot from there on, no character development, we're just going to wander, not trying to rebuild society, maybe we'll put on a play tonight.  No explanations of how one group of people miraculously survived the plague that killed 99% of everyone else, or what the survivors have been eating for the 20 years they've lived in an airport, nothing.  The book doesn't have an ending, it just gets tired of wandering and quits.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ODPW5151SW5F"}}, {"Date": "on January 25, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39JMI1B1W7ZW5"}}, {"Date": "on October 31, 2014", "Text": "I don't usually read dystopian fiction. I can see the appeal and understand why it's popular but I don't need the depressive (and usually too cynical) view of humanity-under-siege. Mandel's novel is different, not only because of her good writing and character development, but because despite the collapse-of-civilization theme, her view of people (the bad as well as the good) and her overall story actually are hopeful. It ends with a vision of ships at sea. I prefer to think of the Traveling Symphony in search of audiences, rosin and bow hair. (Not to mention new strings.) I'll read Mandel's first novel, Last Night in Montreal, now and probably the others as well.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TMFQU22GNMF2"}}, {"Date": "on October 3, 2014", "Text": "Don't let the premise fool you. It is not a science fiction book. It is a book about several people before, during and after a flu pandemic. I loved this story and was so sad when I got to the last page. It is beautifully written. The characters each have wonderful stories. I did really like reading about the pandemic and all that you would lose if this happened. It was fascinating how the author merged all of this into a story. It can not be defined in a genre. It stands alone, yet is for anyone who wants to read a great story. I highly recommend this book. My son is reading it now and loves it too. Don't judge this book by the cover, you will miss a great read.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D6JQD9TIV7TS"}}, {"Date": "on September 18, 2014", "Text": "Fascinating story of the world just before and about 20 years after a plague wipes out most of humanity.  The story goes back and forth between the two time periods, and in the post-plague world follows three characters whose lives converge both before and after the end of the world as we know it.  I wasn't as interested in the pre-plague parts of the book as in the depiction of the future world, but all the characters are complex and interesting and the author writes so well that I never lost interest despite the jumping around.  I highly recommend this book, although in the context of the current Ebola outbreak it will bring chills of fear to any reader.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23CHQBN62X1LH"}}, {"Date": "on January 12, 2015", "Text": "I am still in awe at this book. Several intertwined stories are told spanning several years, all surrounding a famous actor and a deadly flu pandemic that kills off most humans, and makes many of the survivors lose their humanity. The book bounces back and forth between many characters at many different points in time, from the night before the outbreak spreads, to 20 years after, to 10 years before and then just a few days after. The book deals with the nature of art, celebrity, and preservation of the old world after the apocalypse. many of these questions are often ignored in post apocalyptic stories, making Station Eleven a beautiful, original work.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11PTGUM6HN3UZ"}}, {"Date": "on November 15, 2014", "Text": "Without a doubt one of the best books I have read this year, full of wonder and sadness and change and hope. Unlike so many post apocalyptic novels, Station Eleven is a quiet exploration of a group of people connected by friendship, love and work who find themselves among some of the few left after a pandemic. There is no gore, little violence and it left me wanting to know what happened in Year 21 and beyond. It is well-written, the characters and their actions make sense and the one twist in the plot is not pulled out of thin air, rather it has the effect of the reader saying, \"Of course.\" I thoroughly enjoyed it and would highly recommend.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMEFN7442PARJ"}}, {"Date": "on February 3, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJG1HRDTQXQQU"}}, {"Date": "on March 12, 2015", "Text": "Enjoyed the characters and their different stories intertwined into others like pieces of a puzzle.  I would read another if this turns into a series.  Some profanity. A homosexual (of course) but not too offensive. Don't know why every author feels this need, given that this lifestyle is a very small minority of the population.  Also there is the ever present \"religious insane murderer\", that story line is somewhat tiresome and over used.  I know, a crazy idea! Couples are married and in love, \"religious\" people are kind and generous.  Guess that is boring.  Just my opinion.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4RI0XO55RQ06"}}, {"Date": "on March 21, 2015", "Text": "I really enjoyed it. Given the post-apocalyptic subject matter, perhaps enjoyed is the wrong word. I was captivated by the characters.  I wanted it to continue. I looked forward to reading it as I tread milled every day.  The writing was quite good. Im sure some might be put off by the seemingly random way it jumped around, past to present, and points of view, but I thought it was another way to emphasize the chaos the collapse of civilization must bring. If you like dystopian, post-apacolypse, similar to Steven Kings The Stand, Station Eleven is a worthy read", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQ5UOFCSS5T59"}}, {"Date": "on January 31, 2015", "Text": "It almost doesn't matter that Station Eleven is set in an apocalypse.  I'm stunned by the care that went into the plot.  It's a fractal plot: layers upon layers, so many exquisite connections.  Several of the characters are truly poignant.  The book is filled with sensitivity, and epiphanies put perfectly, about everything from the \"little\" details of a life to death itself.  The use of the English language is, I think, the most expressive I've ever seen.  What a pleasure to read and re-read a book that someone put so much care into.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AK6QF8AT4WKS8"}}, {"Date": "on May 11, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27G08L9QB5WRU"}}, {"Date": "on October 25, 2014", "Text": "Well-written novel that provided an unusual and interesting take on the post-apocalyptic world.  Enjoyable and thought-provoking, but it feels like the novel's potential never gets maximized. The author does an excellent job of immersing the reader into the world she envisioned, but the reader never has a chance to become invested in any of the characters.  I'd compare it to watching a very good sports game without wanting to root for either team.  Worth the read but probably not something you'll recommend to everyone.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1E18VFO8CWX1O"}}, {"Date": "on February 14, 2015", "Text": "I'm still not really sure who/what this book is about. Too many superfluous characters confuse the main storyline. But then again I'm not totally clear which was the main storyline! It drifts from one time period to another and through several seemingly disconnected characters. I kept find myself wondering why I should care about these people. In the end, I saw how they were connected but - with few exceptions - I didn't really care for the characters any more than before. Maybe I missed something.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20WT6L0YEZ2DJ"}}, {"Date": "on April 21, 2015", "Text": "The author is an excellent writer. The subject matter is riveting. And yet, like many books I have read recently that received many 5 star ratings, this one was thrown together out of sequence making parts of it almost nonsensical. It isn't until over halfway through the story that things begin to come together. By that time I had repeatedly put this book aside to read others. The end almost overcomes the jumbled beginning but not quite. A good editor could have turned this into a phenomenal read.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NI8P7QEGYI23"}}, {"Date": "on November 6, 2014", "Text": "One of the 5 or 6 best books I have ever read. This book doesn't really have a main character it's all driven by the story. The author goes back and forth in time and weaves the stories of each character together in such a seamless way. The story is so bleak but full of humanity and hope and love and all the things that make us human. This is the first \"post apocalyptic\" tale told in such a way and it is just perfect. Three cheers, this will be on my to re read list for years to come.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DM8JYZGTTAL2"}}, {"Date": "on November 4, 2014", "Text": "Lacked an ending and there' more to story than tracking a dead actor!", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UPL1EYY7G8O4"}}, {"Date": "on November 14, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NC2CAC5CQWTP"}}, {"Date": "on December 16, 2014", "Text": "Although it's well written and I like her writing style, I felt the story was lacking details and even though some claim it was suspenseful, I didn't feel that way. I really wish some of the important characters in the story were fleshed out a little more and that she spent less time on the lesser characters. In a nutshell, too much build up for unimportant characters and not enough on the ones that could have really made the story exciting.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Q2F25YZKL2Q3"}}, {"Date": "on May 9, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18FKUH6P10NWI"}}, {"Date": "on January 12, 2015", "Text": "I really enjoyed this book.  The time-shifting narrative was a little disorienting, but I quickly got used to it.  The structure of the text is really superb -- each of the flashbacks/forwards occurs at exactly the right moment to illumine the story.  The characters are well-drawn and interesting.  I really wanted to know what happened next!  I think this one of the best post-Apocalyptic books I've ever read.  Strongly recommend.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PF7E6Z8AUVP9"}}, {"Date": "on September 10, 2014", "Text": null, "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVP6RYDBUL9SA"}}, {"Date": "on March 21, 2015", "Text": "I enjoyed reading station eleven. I thought the way the characters were tied together was done extremely well. The only reason I didn't give it 5 stars is the ending. It's extremely hard to end stories of this genre. It's not that I disliked the ending but I just found myself wanting more. Perhaps an ending like Six Feet Under, showing how all the main characters died. Either way, I would certainly recommend it to others.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A726VQQ9NCJZK"}}, {"Date": "on December 19, 2014", "Text": "Station Eleven starts off as a character driven novel then disintegrates into a plot driven tangle of undeveloped characters ensnaring the reader until the conclusion of what ever this work calls itself  The promised literary allusions dangled in front of the reader from the first page lured me in and kept me ensnarled, with just enough Shakespeare bait, that never gets reeled in, until the end.  Don't waste your time.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AD00QJLH6TXB4"}}, {"Date": "on May 14, 2015", "Text": "This book was beautifully structured and I loved the way the many strands of Arthur's life were drawn together. The writing is elegant and spare. It reminded me somewhat of Ian McEwan's 'Atonement' in that many of the characters, though flawed, seemed intrinsically good or in search of goodness. Throughout the book I had many questions and points of disagreement but it was a treat to read such a thought-provoking work", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A286JZJXLUDHLO"}}, {"Date": "on March 31, 2015", "Text": "I have read at least 200 novels since I started using my Kindle and in that time I have only given three books a two star review.  This book is one of them. I love a good PA novel and a bargain. I thought I was getting both with Station 11 but was proven very wrong. I struggled to finish this book and the only reason I did was that I paid $3 for it. I've read several free Kindle books that were better than this one.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEIFYL2Y8NW2I"}}, {"Date": "on January 9, 2015", "Text": "I really liked this one a lot.  It was pleasantly surprising to find that not all authors will resort to the same old boring crap in these kinds of stories.  Sure, lots of people died, lots of bad things happened,however there was a huge hopefulness here, that you won't usually find in this type of book.  T'was quite refreshing, really!  Well written, wonderful characters, interesting subplots, nicely done!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASHKKOZM0Z2TR"}}, {"Date": "on May 11, 2015", "Text": "Commendable effort at a post-apocalytic tale with time jumps back and forth in the narrative and interrelationships that tie together in sometimes surprising ways.  Takes a while for some of the story to work out. I also found it hard to identify with what I suppose is the protagonist; there felt like several options to choose from as the novel moved along.  Not the easiest book to read, in my view.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A204RI6YIPYR4H"}}, {"Date": "on February 9, 2015", "Text": "A wonderful blend of Shakespeare and post-apocalyptic fiction (and I'm not an avid reader of either). This is a quick read. The author uses exactly the right amount of ink on character development and the story unfolds nicely. At the end of the book I was sad to be leaving the Traveling Symphony behind. Would love to see a \"graphic novel\" version.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2X1XMJY3UTNOA"}}, {"Date": "on September 14, 2014", "Text": "Mandel's fourth novel is a gripping journey through the present and into the future. It's easy to become absorbed in her tale of a pandemic that devastates the world, but it's the vivid characters and their mysterious and complex linked stories that will hold you for the entirety of the novel and beyond. -Swapna Krishna, Bloggers Recommend", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6R7UMU1J68XQ"}}, {"Date": "on March 18, 2015", "Text": "This is a post-apocalyptic fantasy novel, I suppose; but that is VERY misleading.  It is in fact a brilliant reverie on being human, on mortality, on what makes life worth living (Shakespeare, among other things), on the calculus of what is moral if necessary to staying alive, on time and memory, and more.  This is a HELL of a novel.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EFLERQGU829V"}}, {"Date": "on November 1, 2014", "Text": "Who would have guessed that the subject of the \"apocalypse\" could have been transcended by such incredible writing skills , as provided by ESJ, including (but not limited to) character development and a nuance of plot development that hooks from page one to \"acknowledgements.\"  This was an altogether  fine read.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYTYGNNH1HO8T"}}, {"Date": "on April 6, 2015", "Text": "I read this book in just about two days, and let me tell you, I adored it. The emotion was spot on, as well as the attention to detail. I loved the Shakespeare and the star trek and the humanity at the root of the story, and Kirsten and Miranda are some of the best female characters I've encountered in a long, long while.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1U4VJT6C966BY"}}, {"Date": "on March 16, 2015", "Text": "This novel starts out well, but really loses its focus- the constant jumping of narrators and periods of time doesn't help the cause.  It's another post- disease pandemic situation- that setting has been done to death recently.  I read it bec of some sterling reviews- it's an OK read, but nothing too stellar.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3U8IUE5Z2GCGT"}}, {"Date": "on March 7, 2015", "Text": "Great book. Not what I thought it was going to be like.  I was kind of dreading/anticipating a violent depressing post-apocalyptic story, but it was actually a more hopeful tale, one that reflects (hopefully) the real world.  By that I mean that most people are good and want to do the right thing by others.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MOEKO1DRUVUS"}}, {"Date": "on March 7, 2015", "Text": "I loved the story line!  The novel was well developed. There were many characters that were adequately and fully developed. Lots of action. I did not want to put it down. I personally wanted more adventure from the \"Symphony\" on the road and less or shorter flash backs. I would recommend it.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WF6AHI8VKXCN"}}, {"Date": "on November 10, 2014", "Text": "In the story, almost everything makes sense ( a rare occurrence in a story about the end of civilization as we know it). The author does a wonderful job of tying details together to connect the characters and their experiences. Sadly, the tale is completely believable. A most enjoyable read!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DMXNBPQWG0D1"}}, {"Date": "on November 3, 2014", "Text": "Absolutely stunning ! This book creates such a complete world of disaster and loss, struggle and survival, and celebrates the human need for beauty and capacity for kindness. You will view the world a little differently and have a deeper appreciation for life while reading this moving story.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DHLK8J85U32F"}}, {"Date": "on December 23, 2014", "Text": "I really enjoyed the way the book unravels its story. The flashbacks are well done. I was engrossed with the opening chapters. I'd recommend this book for someone that enjoys an engaging read. It may be about the end of the world, but it's a book that will leave you with a warm feeling.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HUJV6QVEDR02"}}], "ReviewUrl": "http://www.amazon.com/Station-Eleven-Emily-John-Mandel/product-reviews/0804172447/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.2 out of 5 stars"}, "OfferPrice": "$11.24", "Salesrank": "#2,485", "ListPrice": "$15.95"}