{"Category": "in Books (", "Name": ["Shipstar: A Science Fiction Novel"], "Timestamp": "2015-05-24 23:18:43.930098", "itemurl": "http://www.amazon.com/Shipstar-Science-Fiction-Gregory-Benford/dp/0765367122", "Reviews": {"TotalReviewCount": "111", "ReviewList": [{"Date": "on May 9, 2014", "Text": null, "Helpfulness": 0.9142857142857143, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACGYUI9DWL856"}}, {"Date": "on April 14, 2014", "Text": null, "Helpfulness": 0.8709677419354839, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JXRXYVSUAW6I"}}, {"Date": "on June 1, 2014", "Text": null, "Helpfulness": 0.8461538461538461, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14AQ7J4WB5SXC"}}, {"Date": "on July 15, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YMEKKO6WDQ3T"}}, {"Date": "on April 21, 2014", "Text": "When I bought \"Shipstar\" and began reading it on my Kindle, I almost stopped and put it down. The beginning was very, very confusing. But I discovered that was because I hadn't read \"Bowl of Heaven\" and didn't realize \"Shipstar\" was part two of the story. I'm glad I kept reading it and in the end I enjoyed it very much. I enjoyed it so much that now I've purchased \"The Bowl of Heaven\" to read and the Whispersynch connected audio. There seem to be people who really haven't liked either book. I'm not one of them. Read \"Shipstar\", but only after you've read \"Bowl of Heaven\".", "Helpfulness": 0.8125, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACKRTP2N44GHW"}}, {"Date": "on April 19, 2014", "Text": "Very interesting concept. Well written. Interesting characters both human and alien with thoughtful character development. Fast paced and exciting. A great weekend read!", "Helpfulness": 0.8888888888888888, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33LW68HNRC0F5"}}, {"Date": "on April 28, 2014", "Text": "Benford & Niven deliver on the promise of of book one, Bowl of Heaven, with the fantastical imagination, story line and hard sci fi explanations of the 'physics' one expects from these two, if not the anticipated outcome (book three?). But both the high action unfolding drama conducted at such huge scale during  short time duration, and the deep historical revelations toward the end strain credulity just a bit.", "Helpfulness": 0.8571428571428571, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BCCWMHGZMVVO"}}, {"Date": "on March 4, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3Q0JVGY4TQ9YY"}}, {"Date": "on March 23, 2015", "Text": "There's an over abundance of really awkward techno-babble throughout the book - and that detracts from the flow - the actual story is a good one and it moves along at a reasonable pace until the last third of the book when all of a sudden things start to move very quickly and worse, as the end of the book approaches, they  go even faster and faster... so much so that the events at the ending almost don't really make sense, It's also clear that while this is supposedly the second of a two novel saga,that at least a third has to follow or there will be so many questions left unanswered that it would be ridiculous. As said, the story is interesting (albeit despite attempts to separate the 'bowl' from the Ringworld, there are many similarities in structure) and the ideas involved are original and interesting, but the way it's written - especially the flow at the end - makes things begin not to make sense (and  the techno-babble which in my opinion also increases greatly towards the end, compounds that).That's a 3 1/2 Star above.Good enough to read, but could have been a whole lot better.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XGJ4JQ7YX87U"}}, {"Date": "on October 21, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQC6ULHGZFWZK"}}, {"Date": "on June 13, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1N6RXZX0M1X8E"}}, {"Date": "on July 18, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LEPEGX84Y17V"}}, {"Date": "on May 10, 2014", "Text": "Bowl of Heaven and Shipstar are just what I would expect of Niven.  He, and Benford think of a truly BIG idea, populate it with humans and explore.  The character development isn't really the primary motive here.  Though I thought the characters were developed just fine. Beware of some hinted at spoilers:  The idea that these \"Folk\", ancient Bird beings from a familiar planet, have the ability to stay in their \"Overmind\",  accessing their \"Undermind\" only when necessary gives them a superiority over ordinary mish-mash Human consciousness (consciousness / unconsciousness working in tandem) is an interesting contest.  And the reader will see who wins out.  I totally loved exploring , well the characters running for their lives, the underground superstructures and rail way tunnels at supersonic speed,  almost reminiscent of Clarke's \"Rendezvous with Rama\".  Super great fun!  period.", "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HKQ4JVFT7DWM"}}, {"Date": "on April 30, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39K1U5IHCUXXM"}}, {"Date": "on June 18, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2O8BVZ03VQFU4"}}, {"Date": "on April 23, 2014", "Text": "Bigger than Ringworld, but in dynamic equilibrium, the ShipStar (sequel to Bowl of Heaven) is a bowl about one AU wide with a star at its \"focus\".  The star is manipulated by mirrors and magnets to produce a jet, thus making the bowl and star a ship, just one far bigger than worlds.  Learn of the birdfolk's \"great shame\" and find out who really runs the shipstar.  Larry Niven has been a favorite of mine since junior high---I know he's \"getting up there\" in years, but I hope he keeps writing stories.  Just maybe \"boosterspice\" will be invented in time.  Gregory Benford has written lots of good stuff as well, though I didn't \"discover\" him till much later in life.", "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GSWFEUMYF616"}}, {"Date": "on September 18, 2014", "Text": "The first book was slow, but you might need to re-read the last bit to figure out where it stopped. This is a few months after, but with all the same things in motion. This book is a frightening look at very alien concepts. When thinking about how big the universe is and how small the Earth is, it helps to make you feel even smaller. A lot of the concepts sound like an echo of the Uplift series and other Sci-Fi series, but adds a sense of desperation that is so much more prevalent. You don't just sense the immensity and desperation, you feel it in your bones.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2A6K54HRZUQ44"}}, {"Date": "on April 26, 2014", "Text": "Enjoyed reading the story. The two books together along with the characters made the books interesting.  If you like a good sf book read it.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KYLBNRI72Z7R"}}, {"Date": "on April 12, 2015", "Text": "Jarring continuity errors and recycled ideas from both Niven and Benford make this and the prior book, a muddled read.  Okay to get through a plane trip.  It felt like there was a real issue with conflicting goals between the writers in terms of levels of technology, and character development and personality.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JIAY8K3NKNX8"}}, {"Date": "on May 26, 2014", "Text": "This is an instant classic. I first read Ringworld back in 1973, and this easily bested it. The ideas presented, and the character development is first rate, especially the aliens depicted. I would recommend this novel to anyone who loves great hard SF!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DR27YBKPWZUG"}}, {"Date": "on April 21, 2014", "Text": "It's new. It's Niven (and Benford)! That says it all! I'd give it 10 stars if I could! Now if Niven could just finish the 'Magic Goes Away' trilogy (missing is Burning Mountain), I could let go of this world.....", "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Y3NOQ23EVSZA"}}, {"Date": "on April 14, 2015", "Text": "This is a worthy sequel to Bowl of Heaven, with more plusses than minuses overall. One the plus side: The narrative kept my interest throughout; the science part of the story is strong, i.e. big, imaginative ideas, with a reasonable level of plausibility. I felt there were a lot of minuses, only a few worth mentioning (others fall into the nitpicky category, but exist nonetheless): Behavior of and human interaction with the Folk was not the way I would imagine it; the dialogue style used by the authors for scenes with humans and aliens was weak, even terrible at times; and, one of the stronger subplots through most of the book involved Cliff and his cat-and-mouse game eluding the Folk, which suddenly and unceremoniously fizzled out at the end....that part was a real let-down for me. Finally, I was hoping for (and pretty much expecting) the story to peak with a big showdown between the Folk and Sunseeker/Redwing, which did not happen. The whole reason for Sunseeker to fly into the jet and wreak havoc was to send a message to the Folk, which I assumed was set-up for a stand-off, which would have been great drama and fun to read...but alas, the authors introduced a new alien species at the end that diffused the situation, which I felt deprived the reader from experiencing a good ol' fashioned humans-outmaneuver-powerful aliens ending. I deducted a star from my rating for this reason alone, but liked the overall story enough to ignore my other complaints and give this read 4 stars.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1126LDV2MNILE"}}, {"Date": "on May 28, 2014", "Text": "Wonderful continuation of the story created by these two dynamic writers in the book Bowl of Heaven. It leads us into the minds of the alien from many perspectives! Very thought provoking!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YL0S0QJ0TZVD"}}, {"Date": "on December 7, 2014", "Text": "Gregory Benford's idea to use a star as a propulsion device for a gigantic spaceship is amazing and credible. It is a worthy descendant to Larry Niven's \"Ringworld\" series.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2M6C95812AMML"}}, {"Date": "on July 15, 2014", "Text": "What a great read! These guys can really put it together. Both authors have been favorites of mine but when they join forces -boom!  Great mix of science and fiction. Must read!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EQHV9AJLY71D"}}, {"Date": "on April 3, 2015", "Text": "Not one of Niven's best works. The story seems repetitive, with long sequences describing the bowl and the main characters travel across its surface,", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38FJ8PUMICAR1"}}, {"Date": "on July 23, 2014", "Text": "I enjoyed Shipstar far more than Bowl of Heaven. The bigger picture emerged and there was finally some continuity to the story line.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JAR2MWZ5DLIT"}}, {"Date": "on June 22, 2014", "Text": "Different way of thinking.  Enjoyed the voyage, could lead into more, but good enough as a 2 book series.  Good Read.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7M97HQKHX9Q1"}}, {"Date": "on February 21, 2015", "Text": "I read all the story line leading up to this book, but I found the efforts to make alien thought processes outside our own modes of thinking very distracting. I would have liked their motives to be more understandable to me. It grew tiresome at time for me. The tie-in to prehistoric Earth was too far fetched for my belief. The vastness of the dish, and the slow mode of travel makes for a plot that isn't resolved fast enough for my tastes, although it is a grand design, and probably follows closer to the science and advanced technology such travelers could manage (no jump to warp speed).", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJIJPUP1F63KT"}}, {"Date": "on August 11, 2014", "Text": "The second in the series following \"Bowl of Heaven\". I thought this was a better book than \"Bowl of Heaven\" which was a bit slow to start but the story did pick up and by the end of the second book, I was well into the story. I got the feeling that the book was wrapping up and that a 3rd book was not in the cards. When I look back at the story it has so much more potential and I don't think the two authors did it justice. Still, a good read if you are willing to stick it out to the end of the second book. This is one time I wish they could go back and rewrite the books.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2C4177OJ8Z6V8"}}, {"Date": "on September 12, 2014", "Text": "This is second book of series. I should have started with the first, but was able to follow the minimal plot. Science was good. Lots of interesting species and characters, but pace was slow and not at all compelling. Obviously a sequel to follow and I probably will read it when it is available. I wanted a book with no magic, no faster-than-light tricks, fantasies, etc.  I got it, but found that maybe I need a little more fantasy to keep motivated, such as in my real life.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2II1CU0ME8A57"}}, {"Date": "on September 23, 2014", "Text": "It was fun to return to the universe of super habitats, being the realm of Niven's RINGWORLD, HALO and Varley's GAEA. The BOWL, as referred to in the 1st of this 2 volume tale, or SHIPSTAR represents an innovative approach that Benford brings to life with his scientific rigor and Niven enhances with his superlative narrative style. Lacks that one last star for the absence of any promise of continuation(s), since these 2 volumes have merely opened the door on this tale.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARJUBWP7PFUCD"}}, {"Date": "on August 29, 2014", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RIV04HAYRV62"}}, {"Date": "on April 26, 2014", "Text": "If you liked Ringworld then you will be intregued by this novel.  The characters are introduced and the broad stage set for more thrilling tales against a bCkground of good science..... Oh boy whats next?", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AW9W7EH6Q0FVB"}}, {"Date": "on April 21, 2014", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23W8LP8YUC0MF"}}, {"Date": "on May 6, 2015", "Text": "This is of the genre, or subgenre, hard science fiction; it can be a bit technical at times but this does not take away from or complicate the story.  This is a great read, and a wonderful sequel to Bowl of Heaven.  Very well written with three or four plot lines running throughout, alternating by chapter.  I thought it would lead into a third book, a trilogy, but apparently the authors are going to publish a volume of stories in this same universe written by other sci-fi writers.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15JYGO4X3B04K"}}, {"Date": "on July 12, 2014", "Text": "Excellent follow up to Bowl of Heaven. Fun read.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AESQKWWVKO3O2"}}, {"Date": "on July 6, 2014", "Text": "An interesting plot with an interesting technical premise based in sound math.  Character development was pretty good also.  Readers will not be disappointed with the book given the price point.  The different writing styles of Benford and Niven seem to lead themselves to the book.  Technical aspects of the actual artifact seem well ground and the different big pictures concepts on lifeforms also seem well thought out.  Benford's hand is probably in the characters which seem real.  The romantic subterfuge between some characters was also believable.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17FT51T335LCU"}}, {"Date": "on June 24, 2014", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SWY3WT2B1PU9"}}, {"Date": "on June 18, 2014", "Text": "All in all a good read, just the smallest feeling that as the end of the book was drawing near certain alien capabilities appeared in just the nick of time. Definitely recommended, well thought out physical consistencies and believable architecture", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HO8XA9F6E7MR"}}, {"Date": "on June 18, 2014", "Text": "Continued on where first book left off. Loved the grand idea and the micro details of the story line were excellent.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KUY7A0QOV67B"}}, {"Date": "on June 16, 2014", "Text": "Can't wait to see what happens in next volume. This is a fun and excellent series. Well written, creative and simply a good series.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGI31UKZY2O3J"}}, {"Date": "on June 16, 2014", "Text": "I would give this book another 1/2 star but I found the \"magnetic plasma\" beings to be quite a disconnect from the other aliens, even the cold minds.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HJDU1542URFY"}}, {"Date": "on June 13, 2014", "Text": "It was a good follow up with some surprises .  My favorite part is that the dynamic of the flight crew growth of pilot and how the Captain Redwing has to bet everything to stay on mission and also the \"ship star \"  is full of mysteries even to it's own inhabitant and supposed rulers.  Looking forward to third book.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHM4JVY4XISJL"}}, {"Date": "on June 9, 2014", "Text": "The author has a very nice writing style, and does not need to use mystics or strange ideas in the plot. A good classic SF-novel.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ERD64CHPLJN"}}, {"Date": "on June 9, 2014", "Text": "Book on a grand 100 million year plus scale.  interesting dynamic star faring ship with multiple lifeforms.  Good and interesting science involved.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QX0B27MQD9R8"}}, {"Date": "on June 2, 2014", "Text": "I've read Niven for more than 40 years and his early books were some of best hard scifi ever.  I don't know where to put this duology but I waded through it and don't think it was a waste of time.  When it seems like fantasy has pushed true science fiction into the shadows, I guess I'll take anything that incorporates real science.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XMATFY4GU5MR"}}, {"Date": "on May 29, 2014", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EDA24LFKEHTH"}}, {"Date": "on May 8, 2014", "Text": "The second half of this collaboration between Benford & Niven takes us back to the Bowl -- a Big Smart Object traveling through interstellar space and discovered by an Earth expedition (seen Bowl of Heaven; book one of the set for the story of its discovery and the Earth crew mission). I like both authors and believe they've told a good, but not great story, with this duology. There was just too much sight-seeing, too little examination of the cultures found on the Bowl, and an all-too-convenient wrap-up. Frankly, Ringworld has been a much more interesting storyline. So... not a bad set of books just don't set your expectations too high and enjoy the sights. Maybe if the authors had either tried to tell the story in a single book or went the other way and expanded it to a series they could have found the right mix of technology, story, character, and culture. This just misses the mark.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RI05C8BVQIWB"}}, {"Date": "on May 4, 2014", "Text": "This is a excellent conclusion to the Bowl of Heaven. The steady unraveling of the underlying mysteries of the Bowl makes it very hard to put down.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIP91B6O9JRW4"}}, {"Date": "on May 22, 2015", "Text": "I think this was a great book and and (unexpectedly) better followup to the Bowl of Heaven. It continued to explore some deep and disparate topics (extinction of dinosaurs, colonization, our unconscious mind, etc.). I was sorry to see it end but it probably did leave open a new series on \"Glory\". A well written, fine science fiction novel.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1D0EJPEXE8ZOP"}}, {"Date": "on August 2, 2014", "Text": "Shipstar is an exciting conclusion to the saga started in the Bowl of Heaven. The ideas are big and bold. Some of the concepts feel slightly reused from the universes of both authors. The assembly of characters and players make for an intriguing assemblage of vastly different world views. A totally enjoyable read, but not quite a 5 star read.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXY2J3HG44YGU"}}, {"Date": "on November 2, 2014", "Text": "This is a very good read, in the same genre as Ringworld. Larry Niven and Greg Benford write very well together, and I will be looking forward to other books  from them.  This is very good science fiction - with a detailed description of a new advanced environment and problems, and some cool adventures for the good guys to get out of.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NCMVXRA8KH4L"}}, {"Date": "on October 20, 2014", "Text": "I have been reading Larry Niven for a long time. I have always liked how he plugs science into his stories. Not the nonsense of Skylark of Space,where copper is the fuel source and you fly past Saturn in five minutes. He also works the idea of alien cultures and how they may have evolved. A good story should make you think.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFBXDJ0IGDQM9"}}, {"Date": "on August 5, 2014", "Text": "I have enjoyed the BIG ideas in this story. This is the second of two novels and I am not sure if it stands alone. Read \"The Bowl of Heaven\" first. The story is very attractive and fun. I don't know how to describe it without giving stuff away. A good fun summer read!", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QM4X1MFYUZX"}}, {"Date": "on July 14, 2014", "Text": "excellent follow up to1st volume", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3WB96OY5WE7J"}}, {"Date": "on September 24, 2014", "Text": "Concept was interesting, but reminded me a lot of Ringworld.  Plot was a bit slow moving.  Characters were somewhat predictable and not very well developed.  I'm a big Benford and Niven fan, and this was not their best work.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38JUYK6VLYFZ7"}}, {"Date": "on March 3, 2015", "Text": "The sequel to \"The Bowl of Heaven\", \"Shipstar\" by Gregory Benford & Larry Niven is a tedious novel that tries to fill in the history of the Bowl & explain its origins. With the crew of the Sun Seeker split up, the plot is in multiple pieces from things aboard ship to a member left behind who gets held captive to a team whose sole purpose is to explore the edge of the Bowl. Each step of the way, we the reader are taken on an at times very confusing journey to discovery just where the Bowl & its inhabitants came from. The book itself for the most part is very sound science fiction with a plot twist that I as a reader never saw coming about halfway through; however, I found it hard to read just because of the rotating plots & at time uneven flow. The book being broken down into as many sections as it is also hurts things since I feel like I was reading a television script with the end of each part being a good place to go to commercial. Overall a disappointing sequel which in theory should be the last book in this series although there is room for more if needed.", "Helpfulness": 0.5, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30A1WM2G71L12"}}, {"Date": "on March 21, 2015", "Text": "Larry Niven at his best with help from Benford. Nothing like a big thing novel with plenty of science to push our imagination along to our real world invention. More please.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9W7HD4E2MCXG"}}, {"Date": "on January 25, 2015", "Text": "Sequel to 'Bowl of Heaven', continues the story started there. A totally fascinating concept (an artificial \"planet\" the size of our solar system, driven through space by a \"captive\" star), the story (spanning both books) is well written, as always with Niven and his collaborations with other authors. Character development is \"thick enough\" for good science fiction, though a little \"thin\" if this were a more \"conventional\" genre of writing. The people are a huge part of the story, but there is also considerable impact on the story by the science (and technology) involved in describing the environment and how events do (or could) impact that environment. For me, this is all a nice \"balance\" of emphasis in contributing aspects of telling this kind of story.  I've never met a Niven++ book I didn't enjoy in some way.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UITVFE1CW58C"}}, {"Date": "on May 7, 2015", "Text": "there are several books worth of ideas but none of them were developed.  I just feel that the authors were in a hurry to publish something, anything.", "Helpfulness": "", "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2159XV5F9G3QR"}}, {"Date": "on February 20, 2015", "Text": "Much better than the first book.  Better paced and better described.  They should write more novels like this but with a more concise ending.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RXE32GA3FUR9"}}, {"Date": "on May 22, 2014", "Text": "Both Larry and Niven and Gregory Benford have written about huge objects in space like Larry Niven’s Ringworld. This time their Bowl of Heaven (paper) is literally bowl shaped with a huge living area and a sun that forces this Shipstar (hard from Tor) to move from star system to starsystem. Lots of intelligent beings have settled there. Alas for the human crew of a star ship Sunseeker and the still sleeping colonists intended for another world, the rules of the bowl want the humans to settle there instead of continuing to a world that has sent back threatening signals. These two grand masters of science fiction don’t disappoint even though the plot is mainly an excuse to show off the wonders. Wow!Review Published by Philadelphia Weekly Press.", "Helpfulness": 0.5, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22M4X1AWZMIDK"}}, {"Date": "on September 13, 2014", "Text": "Good so far! Interesting stuff and I like the bowl-world... Consistent setting and compelling story. Still reading but I like it so far", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHHAHYWD0XH8U"}}, {"Date": "on October 6, 2014", "Text": "A good story overall, but I was just not feeling this one.  Maybe it was because I just finished the Game of Thrones 5-book series.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2F9VMHVH1ZAXK"}}, {"Date": "on October 31, 2014", "Text": "The captain/crew interactions were a nice surprise.  The story development makes me wonder an awful lot about the Glorians.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AH0ZK0DG3OZRG"}}, {"Date": "on May 7, 2014", "Text": "After the disaster that is part one of this series \"Bowl of Heaven\" you would think there would be nowhere to go but up. You would be wrong. Continuity errors still abound. Reads like a draft copy.", "Helpfulness": 0.6363636363636364, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AI2GPJQAN2NL4"}}, {"Date": "on September 11, 2014", "Text": "I had been looking forward to the finishing story from \"The Bowl of Heaven.\" An exciting read.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RAQYB2QGG668"}}, {"Date": "on October 7, 2014", "Text": "ok, wish I had got the first book to read first. took awhile to get into it.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DPJUQ8AJJ6JU"}}, {"Date": "on September 1, 2014", "Text": "Was only marginally grabbed by it. I read it because I read the first part.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OND1FLXVXSLX"}}, {"Date": "on May 18, 2015", "Text": "Started out well, got bogged down about 1/3 of way through", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JHFYS7U2IWR0"}}, {"Date": "on June 17, 2014", "Text": "The novel is dense, unreadable, and murky.  I remember the Sci-Fi buzz about the \"Killer Bees\" from a decade or so ago, but none of them have lived up to their hype.", "Helpfulness": 0.6, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27N00KHSHX7IQ"}}, {"Date": "on November 24, 2014", "Text": "Odd, quirky story that's over too fast.  I enjoyed it.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25R6EQMYCF290"}}, {"Date": "on May 24, 2015", "Text": "unusual and unique life-forms on a grand scale", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGJVCOMKPZ61S"}}, {"Date": "on April 29, 2015", "Text": "a great sequel to \"Bowl of Heaven\"", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AB1LUHJCTPT3Y"}}, {"Date": "on August 3, 2014", "Text": "These are my favorite sci-fi writers.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3K91WPZQOJV9L"}}, {"Date": "on August 15, 2014", "Text": "Great follow up to Bowl of Heaven.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWQXSJ035D1JU"}}, {"Date": "on March 11, 2015", "Text": "Far too much verbose exposition.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1G449R30J70X7"}}, {"Date": "on May 1, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7SCPJGYNEOOH"}}, {"Date": "on April 30, 2014", "Text": "A terrific read that only Benford, Niven and a few others could provide / Hoping that there will be future creations by either one of the two or both", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A163M85E0C307D"}}, {"Date": "on January 23, 2015", "Text": "An excellent book. Very complex and though-provoking. The effort to lay things out with such depth is incredible. Loved it.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFV4UULW64BAW"}}, {"Date": "on April 13, 2015", "Text": "Falls short of Book 1", "Helpfulness": "", "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LEA2T5IWZKX8"}}, {"Date": "on August 27, 2014", "Text": "Interesting concept.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A144CYFRDU7C6D"}}, {"Date": "on July 19, 2014", "Text": "I like ir very much!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13A0YXJSS4A15"}}, {"Date": "on July 6, 2014", "Text": "Alien characters were shallow and human like. Story could have had more depth.", "Helpfulness": 0.5, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30EIC35TI9SH3"}}, {"Date": "on November 15, 2014", "Text": "I found that it took me much longer to finish this book than the first book in the series, Bowl of Heaven. This one just didn't hold my interest as much. I'm not quite sure why... perhaps it was because of the interplay of the different alien clusters. Normally I like that kind of stuff, and without divulging too much of the ending, let me just say that it smacked of the kind of deus ex machina for which Star Trek was often criticized.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ORWAR4CAOPAC"}}, {"Date": "on December 7, 2014", "Text": "Tough reading, too much complicated science. It interferes with the story line. Characters were good and interesting, but, they many times get lost in the fog of the complicated science. I like some of this stuff, but, to much takes some of the joy out of the read. The authors put a lot of work and sweat into this and should get some sort of attaboy, so, I give them a salute for work.", "Helpfulness": 0.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30XZ090HA3D7Q"}}, {"Date": "on September 14, 2014", "Text": "super!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASEMNS35YX9XF"}}, {"Date": "on August 1, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UT6FWQBRECIR"}}, {"Date": "on April 30, 2014", "Text": "I'm usually a huge fan of Larry Niven because his story lines are intricately woven with scientific phenomenon related to space travel that you normally wouldn't think about, but this book seems to cast much of this aside in favor of meandering character development and increasingly imaginative alien races and technology.  While I appreciate the scale and detail of the story the authors are trying to establish, it seems like they've kind of let their imagination run wild on this one.  It's good, but not quite up to par with Niven's previous works, in my opinion, of course.", "Helpfulness": 0.3333333333333333, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACY07IY2RAJ2Y"}}, {"Date": "on April 28, 2014", "Text": "The book was OK;I felt it dragged quite a bit.  Not enough story; too much technical information...not as good as the Ringworld books.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NDPZKKPGN8ZZ"}}, {"Date": "on November 30, 2014", "Text": "this book is a grand story but it gets bogged down to the point were I just stopped caring and never finished.", "Helpfulness": 0.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26OXKSKTG3X2S"}}, {"Date": "on April 16, 2014", "Text": null, "Helpfulness": 0.5333333333333333, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A321S1TOCW8JNY"}}, {"Date": "on February 28, 2015", "Text": "I liked it alot cant wait for the next book", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A252M6GP1BFXMC"}}, {"Date": "on May 9, 2014", "Text": "Excellent writers. I have been a Larry Niven fan since inception. But this was too much of a regurgitation of Ringworld. Disappointing", "Helpfulness": 0.3333333333333333, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30U2T6ATA6LJV"}}, {"Date": "on February 24, 2015", "Text": "Long, involved, some original ideas.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38H5KBBSJKW4E"}}, {"Date": "on April 27, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35GMB3B70XAG8"}}, {"Date": "on May 16, 2014", "Text": null, "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I2O9Y3X3HXLS"}}, {"Date": "on April 26, 2014", "Text": "Possible spoiler.  Overall an OK read.  Some interesting ideas and generally well written, but I can't remember the last time I saw a book that was so clearly the next chapter of the previous book.  Might be me, but I'm used to getting at least a little introduction and reminder of how we got here.  None of that here, just simply the next chapter.  I was also surprised that this was the end.  It felt like the middle more than the first book felt like a first book.  As a concept the origin of the bird like characters is laughable.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28XEZRUQQC64H"}}, {"Date": "on May 18, 2014", "Text": "Niven's forte is interesting plausible aliens, both in biological and sociological terms. The aliens and ecology here just aren't as engaging as those of his Known Space stories, Footfall, or The Mote in God's Eye. Benford's strength is weaving real physics into good stories without the reader feeling like he or she is falling behind in a pre-med natural science class. This one's not as good as Timescape, I did feel bogged down by the hard science. This sequel did I not live up to the promise of the first book.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BD8STGDN1RT8"}}, {"Date": "on April 22, 2014", "Text": "After the disaster of the first half not going to waste my time or money. The whole thing should have been released as one book AFTER an editor had a wack at it. Shame on Mr. Benford and Niven and the publisher.", "Helpfulness": 0.5, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZY6ZJABOQX9Z"}}, {"Date": "on April 3, 2015", "Text": "very good", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2P0C5T593S4ZZ"}}, {"Date": "on May 18, 2014", "Text": null, "Helpfulness": 0.25, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GTOIX13PLVL6"}}, {"Date": "on January 11, 2015", "Text": "This sequel is also brilliant, building an amazing world with vivid people and aliens.  It is, however, ponderous, so slow at times that it puts me to sleep.  I would suggest trying something else.", "Helpfulness": 0.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PYQGI9WYZ3J4"}}, {"Date": "on May 4, 2014", "Text": "Excellent story about a big small object and the conflict between human explorers and the civilization of the structure.  Good buy for fans of both authors.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VS6VPKJQF4JK"}}, {"Date": "on April 23, 2014", "Text": "was not to impressed with this book to much stuff in it about how the spaceship liked to hear moore about the people in the book and the aliens", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8P9QIHAP8SBR"}}, {"Date": "on February 17, 2015", "Text": "nice", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13W2KDUU6HW02"}}, {"Date": "on April 22, 2014", "Text": null, "Helpfulness": 0.2, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TL04YTHZLALF"}}, {"Date": "on May 30, 2014", "Text": "Way to wordy! Could have cut a quarter of the text out. And WHY is it common practice now to always write a trilogy? What ever happened to a good SINGLE novel? Honestly, is seems like this book was really stretched out solely to prevent then ending from being written until the next volume.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHZI30JNVK6Y7"}}, {"Date": "on November 9, 2014", "Text": "I said I wasn't going to even bother with this one after \"Bowl of Heaven\" But I caved in... Who knows maybe this part will be better. WRONG! I read both of 'em and was disappointed...  I've seen Niven do very good collaborations before... but this isn't 2 of em..", "Helpfulness": 0.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GGFP2BB7OQV9"}}, {"Date": "on April 16, 2014", "Text": null, "Helpfulness": 0.4375, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6V3G393774IF"}}], "ReviewUrl": "http://www.amazon.com/Shipstar-Science-Fiction-Gregory-Benford/product-reviews/0765367122/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "3.7 out of 5 stars"}, "OfferPrice": "$9.99", "Salesrank": "#123,085", "ListPrice": ""}