{"Category": "in Books (", "Name": ["Physics: Why Matter Matters!"], "Timestamp": "2015-05-23 13:16:21.427632", "itemurl": "http://www.amazon.com/Physics-Matter-Matters-Dan-Green/dp/0753462141/ref=sr_1_8?s=books&ie=UTF8&qid=1432393584&sr=1-8&keywords=physics+books+paperback", "Reviews": {"TotalReviewCount": "46", "ReviewList": [{"Date": "on May 14, 2008", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9CFVIRMT9X5I/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #10,726,402", "Helpfulness": "60%", "Name": "delzey", "Location": "new england"}}, {"Date": "on August 10, 2010", "Text": "Physics is oftentimes considered the hardest of the hard sciences, and to many people it is one of the most difficult subjects to master. It is also my own chosen profession, and something that I am very passionate about. I find it to be an enormously fascinating subject, and I always appreciate new ways of sharing my knowledge of the subject with my students, friends and acquaintances. In my professional life of a college professor I find it continuously challenging to present the most important Physics concepts in such a way that is both accessible to the intended audience and it does justice to the field. Unfortunately even in the higher education there has been an increasing pressure to dilute various subjects in order to make them more \"relevant\" to the modern students. These attempts, however well-intended they may be, have the consequence of creating more and more generations of scientifically illiterate citizens. Fortunately, this small book does not subscribe to this misguided approach to science. The concepts and ideas are as part of the traditional Physics curriculum as they come. They are introduced in a playful, amusing way, and yet each short description is completely accurate and relevant. There are a few facts and numbers that help with describing each one of the concepts, but they are only given in sidebars and don't constitute the bulk of the material. In my opinion this is a pedagogically well founded way of presenting these concepts to someone for the first time. The illustrations in the book are extremely well done and serve the purpose of personifying various physical concepts and quantities. This may be particularly appealing to the young readers. I would also recommend this book even to the older audience that perhaps has not heard of some of these concepts, or has not really thought about Physics in many years. Overall this is an excellent low-level introduction to Physics.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36K2N527TXXJN/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "#45", "Helpfulness": "94%", "Name": "Dr. Bojan Tunguz", "Location": "Indiana, USA"}}, {"Date": "on June 25, 2008", "Text": "My six year old plowed through this book in one afternoon... he knew he'd love it because the Periodic Table version is an old favorite.  The information is clear, concise, and engaging, the pictures appealing to my little Pokemon fan.  I love that we had a whole discussion of strong vs. weak force at dinner last night.  Not really a textbook, but a fantastic introduction to physics for kids who read well on thier own.", "Helpfulness": 0.9473684210526315, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RXISMUWQ77MK/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "#64,619", "Helpfulness": "93%", "Name": "Three Crows", "Location": "Virginia, USA"}}, {"Date": "on January 17, 2009", "Text": null, "Helpfulness": 0.9285714285714286, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NMQWBDWT3SQF/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "#4,362", "Helpfulness": "88%", "Name": "Lorel Shea", "Location": "New England"}}, {"Date": "on January 18, 2009", "Text": "My son is 12, and he is a bookworm.  He is also interested in science.  I saw this book, and I thought that it would make a perfect stocking stuffer for him.  I love buying things for my children that are not only fun for them, but that are good for them too.  My son likes this book, and I think it'll definitely give him a headstart when he begins learning this in school.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZMGOEYPWYL8E/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #1,444,302", "Helpfulness": "93%", "Name": "V. Nettles", "Location": "Fort Sam Houston, TX"}}, {"Date": "on March 18, 2011", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31KSQ9F70WB2N/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #2,989,432", "Helpfulness": "75%", "Name": "J. Newfield", "Location": "Virginia"}}, {"Date": "on September 4, 2008", "Text": "I teach 5th grade and my students are in love with these books as well as The Periodic Table: Elements with Style.  It makes it easy for them to understand.  They borrow the books from me daily and it really triggers an interest in science for them.  These books have been so successful in my classroom I pre-ordered the biology version coming out in September.  I can't say enough good things about it/them.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VRGW7FA6F9NJ/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #249,042", "Helpfulness": "83%", "Name": "Nicole Perry", "Location": "Boca Raton, Florida"}}, {"Date": "on May 19, 2008", "Text": "The only drawback to this book is the fact that now my 6 year old knows what alpha particles are and I have no idea. This is another outstanding science book for children that not only teaches but excites them about the subject matter as well. The book arrived in the mail last week and on the first day my son read the entire book. Never fear however the subject matter is introduced well enough to entertain and inform in that first reading, however it is physics. He has and will I am sure continue reading, understanding a little more each time. He was disappointed that Physics did not come with a poster like The Periodic Table: Elements with Style. I do recommend reading the book thoroughly, if like me you are not into physics, before your child does. The conversations go better when you don't have to look everything up.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6YK2BR677KPO/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #3,116,026", "Helpfulness": "76%", "Name": "Mother and reader", "Location": "APO, AP United States"}}, {"Date": "on May 23, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ILJJI3TD7K01/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #651,705", "Helpfulness": "95%", "Name": "Melissa T.", "Location": "Under the X in Texas"}}, {"Date": "on March 28, 2009", "Text": "This book will provide an excellent foundation for children. This book broke things down to the simplest form possible and my 3 year old like it a lot.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OOQQKY1NIYIP/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #30,641,271", "Helpfulness": "34%", "Name": "NIA", "Location": ""}}, {"Date": "on May 25, 2010", "Text": "I'm a physicist and father of a VERY curious 10 year-old boy. I decided to introduce him to some concepts in physics and found this book on Amazon. I bought it, but had little hope it was going to anything but a physics book with pictures for kids. And how wrong I was!! The text is cool, funny, and attractive, and at the same time it touches the concepts with fine precision. Clearly, the authors put a lot of thought when writing the book (and I DO respect a scientist putting his time to write a physics book for kids!). In short, it's a great book for young kids. Congratulations!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GKH6DBGHZZET/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #24,985,565", "Helpfulness": "100%", "Name": "Luiz Jacobsohn", "Location": "South Carolina, USA"}}, {"Date": "on December 19, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SBN5XWNJ5JJD/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #226,492", "Helpfulness": "83%", "Name": "guitar geek", "Location": "near Boston, MA"}}, {"Date": "on January 8, 2009", "Text": "Good product to help my kid in school, as a Chemistry major I liked the depth and scope of this product and the manner in which it relates the material to younger audinces!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3J05GFK3QZCWS/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #10,486,837", "Helpfulness": "60%", "Name": "Mike", "Location": ""}}, {"Date": "on March 8, 2009", "Text": "I purchased this book for me and my 12 year old daughter.  We loved it so much that I purchased another 1 for my sister's family.  My daughter showed this book to her Science teacher and he loved it!  If you purchase this book you will not be disappointed!  The information is easy to understand and remember and the pictures are very very cute!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1C0YOZT8ULLJX/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #23,080,284", "Helpfulness": "50%", "Name": "bigsupermonkey", "Location": "Green Bay, WI USA"}}, {"Date": "on February 23, 2011", "Text": "i really like this book because it has a lot of different types of physics that were easy for me, as a second grader, to understand.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on November 12, 2009", "Text": "Amazing. Fantastic.  My 6 and 8 year old love this book.  I bought it because my sister (their aunt) has a Ph.D in physics and I wanted a kids book that explained some of the concept of what she does.  What surprised me is the elegance and creativity of the illustrations and the writing.  It is not something you see often in kids books.  I found the words stayed with me and the kids.  The kids would refer to the \"friends\" and could tell me about the different concepts days later.  Definitely get it if you have kids curious about the world and you want to give them broad awareness of how the universe works.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3K0L728OP9HKR/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #19,567,511", "Helpfulness": "82%", "Name": "L. Frederick", "Location": ""}}, {"Date": "on May 11, 2011", "Text": "My son has an interest in science, so I looked for books that seemed age appropriate for him and I came upon this series. We've purchased every book in the series, though the Physics:Why Matter Matters! is his favorite.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XE1R7JYJRLZZ/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #521,567", "Helpfulness": "69%", "Name": "Steve Wise", "Location": "Boston, MA"}}, {"Date": "on August 3, 2014", "Text": "I can imagine a whole lot of better ways they could have written a book on Physics for toddlers or small children. The drawings are not especially cute or appealing, there are no stories to catch the imagination, no character interaction or dialog, nothing that would get a small child interested in the subject. Each page is just a disparate explanation of some single phenomenon or particle, with no connection to any other page in the book. The explanations are in the first person, as if the particles or phenomena were characters explaining themselves to the child. Some of them are a little cute or fun. Overall though they seem to me to lack much imagination or charm. And some of the explanations are just a bit dubious.  I'll try reading this to our little girl as she grows older, but I'm not too confident this will inspire any love of physics in her.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35XOQCHAATVEU/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #151,664", "Helpfulness": "80%", "Name": "jon f", "Location": "mission viejo, ca United States"}}, {"Date": "on January 26, 2011", "Text": "I know this is supposed to be one of the coolest new science book around, and the pictures are groovy to look at, but I and my 8 year-old son found this book downright disappointing. In trying to be cool, it's got so much slang in it we didn't always get what the author meant. There's very little substance in here and I can't imagine having this be a useful book in a school.", "Helpfulness": 0.6666666666666666, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DMXX5K6UA2G9/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #20,681,718", "Helpfulness": "67%", "Name": "M. Nelson", "Location": "Switzerland"}}, {"Date": "on March 11, 2012", "Text": "My ten year old loves all of these Basher books. I've never seen him so excited about reading. This Physics books is the one that started it all. The presentation is really fun and it does make difficult concepts easier to understand. Each concept is presented as a character and it has inspired him to make up characters on his own. I think it appeals to that pokemon/superhero thing that so many boys are drawn to. All the books in this series have been great and I think if your child is interested in physics they will enjoy this book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UF91CPX22A2T/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #523,712", "Helpfulness": "89%", "Name": "J. R.", "Location": ""}}, {"Date": "on March 31, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10DYTGIWV3RJZ/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #249,168", "Helpfulness": "68%", "Name": "j.g.", "Location": ""}}, {"Date": "on October 31, 2012", "Text": "My son loves science, non-fiction, and cartoons, so this book is a huge hit!  While he doesn't always completely understand all the concepts, he understands enough to keep him interested, and this has often been his choice to bring with on long car rides for entertainment.  It's a great book for a younger child (my son is 8) who is interested in more complicated ideas!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1U0WQQEU0TB0H/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #385,720", "Helpfulness": "81%", "Name": "Andrea S", "Location": ""}}, {"Date": "on January 30, 2012", "Text": "I purchased \"Physics: Why Matter Matters!\" for my 10-year old daughter, but found the layout and the approachable content a pleasure to read myself. The book was such a hit that several of my daughter's friends asked to borrow it to help with studying, and their parents commented that they were also pleased with the presentation of the material enough to seek out other titles in the same series. Well done.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASFTUITLR4QQ1/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #877,260", "Helpfulness": "97%", "Name": "Beth Brown", "Location": "Richmond, VA USA"}}, {"Date": "on June 7, 2011", "Text": "I bought several of the Basher series of books based on other reviews and have not been disappointed. My 3 1/2 year old son wanted us to read him the books as soon as he saw the covers - so that definitely grabbed his attention. He has asked for them to be read repeatedly so it's not just a first sight curiosity. I don't expect him to really understand most of the concepts but it's good to introduce just the words and ideas into his head and he enjoys it.  These books aren't meant to be detailed explanations but are high level concept overviews and it does a good job at that.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARXIMFEVM3XO/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #290,498", "Helpfulness": "93%", "Name": "R. Pan", "Location": "RPV, CA USA"}}, {"Date": "on March 14, 2012", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WDG0JJJ14AYZ/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #191,731", "Helpfulness": "90%", "Name": "Amazon Customer", "Location": "California"}}, {"Date": "on September 22, 2010", "Text": "If you are looking for cartoons and a physics concept to be explained in a paragraph-this is the book for you.  I use this in my junior high class.  They love it when I read them a page ... and they have to tell me what it is.  Fun and cute all in one.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DAPHWUJMQPYZ/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #21,721,983", "Helpfulness": "", "Name": "ASIscience", "Location": ""}}, {"Date": "on October 17, 2013", "Text": "My grandson who was turning 8 specifically asked for this book.  Evidently he has other books by the same author and was very interested in the Physics one.  He really loved it.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOOFTUBYYBAPC/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #4,346,729", "Helpfulness": "33%", "Name": "Kathy G", "Location": "San Francisco, CA"}}, {"Date": "on July 8, 2014", "Text": "My daughter and her dad love to talk science and come up with experiments to do together. She loved reading this book and then talking about it with her dad. Great book!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AY0HYITLBNC54/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #323,722", "Helpfulness": "76%", "Name": "Kimberly Haun", "Location": ""}}, {"Date": "on January 29, 2015", "Text": "These books are a great way to get children interested in science. I showed them to my child's school and they are planning on buying some to use in their curriculum.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YBYQ1H7FUSVG/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #819,577", "Helpfulness": "86%", "Name": "Rich", "Location": "Edgewater, NJ USA"}}, {"Date": "on June 15, 2010", "Text": "got for my nine year old and she's read it twice in the first two weeks. really a great setup for children to get interested in complex things.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXPVRHFC3O6HM/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #12,388,440", "Helpfulness": "", "Name": "Johnathan D. Istre", "Location": "Jennings, LA United States"}}, {"Date": "on December 9, 2013", "Text": "so fun! great narrative to help my students understand physics! they enjoy the pictures and helpful descriptions of difficult topics!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QBL6AFK4W2MI/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #688,660", "Helpfulness": "88%", "Name": "living the life", "Location": ""}}, {"Date": "on April 5, 2015", "Text": "I Like the descriptive text of each element! Good way to get reluctant readers interested in scientific facts!", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A47OQ7U8KNHIY/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #6,682,412", "Helpfulness": "", "Name": "Tara Wanicur", "Location": ""}}, {"Date": "on May 11, 2013", "Text": "I needed this book for a science class! I had to do a reflection on this book! It was what I expected!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11N1A6HEORSL5/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #1,570,531", "Helpfulness": "83%", "Name": "Jodi", "Location": ""}}, {"Date": "on September 15, 2014", "Text": "My son utterly adores the Basher Science books...  and someday they will ALL be his!  *smile*", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ONXFWF0QLKH8/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #7,022,034", "Helpfulness": "100%", "Name": "Selina Harvey", "Location": ""}}, {"Date": "on November 4, 2013", "Text": "As has been written by a couple of other reviewers, the manner in which this book is written is confusing and hard to \"digest.\" \"Cute\" expressions and dated \"slang\" are used throughout the book, causing difficulties for my 8 year old (who reads above his age level) to understand. I have to stop a lot to explain funny expressions. The book is a great concept but I don't know how much we're really going to get out of the books ultimately, we can't use them for much at the moment.", "Helpfulness": 0.5, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RTC2D5WJH78S/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #1,008,643", "Helpfulness": "86%", "Name": "chrisbutanyway", "Location": ""}}, {"Date": "on August 7, 2014", "Text": "My 1st grader loves this book, fun graphics with real but simplified physics concepts!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AND93TWBFJFA/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #2,277,256", "Helpfulness": "75%", "Name": "mama mia", "Location": "USA"}}, {"Date": "on February 22, 2015", "Text": "Good for science students reinforcement of the lesson.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12QASBDRO476W/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #370,753", "Helpfulness": "58%", "Name": "Music is fun", "Location": ""}}, {"Date": "on December 13, 2014", "Text": "Great introduction for my 8 year old...he loves it!!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RV4589ZDCZ4Q/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #222,402", "Helpfulness": "86%", "Name": "Mark", "Location": ""}}, {"Date": "on March 27, 2015", "Text": "Great book. My 6 year old loves it.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2R4GY0TEG6QF2/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #565,167", "Helpfulness": "100%", "Name": "E", "Location": ""}}, {"Date": "on January 10, 2015", "Text": "Just what I wanted!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OA017772CA1U/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #31,297,059", "Helpfulness": "30%", "Name": "merlynpi", "Location": ""}}, {"Date": "on May 11, 2015", "Text": "Great little book!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HRHHQ6M2NDYP/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #1,029,590", "Helpfulness": "100%", "Name": "Bethany", "Location": "Iowa"}}, {"Date": "on August 6, 2014", "Text": "Love it", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GI8UYNL35I6Q/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #31,332,358", "Helpfulness": "7%", "Name": "Dev", "Location": ""}}, {"Date": "on January 13, 2014", "Text": "The illustrations are great, and I was really hoping for a little bit more fun supporting story lines or character development that is not science related.  I think kids will need more than the illustrations to keep them interested in this book.", "Helpfulness": 0.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AU7RN1MLXO4L/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "#96,921", "Helpfulness": "83%", "Name": "Tim J", "Location": "USA"}}, {"Date": "on December 13, 2014", "Text": "Useless.", "Helpfulness": 0.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YPDHFUV6CBNM/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #3,733,535", "Helpfulness": "63%", "Name": "Wanda Spitzer", "Location": "southern New Mexico"}}, {"Date": "on March 9, 2015", "Text": "Disappointing!", "Helpfulness": 0.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A370OUUPONNY20/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #31,329,763", "Helpfulness": "38%", "Name": "Mom with Ph.D.", "Location": ""}}, {"Date": "on November 14, 2013", "Text": "Was hoping for an \"idiot's guide to physics\" for kids. This is to modern and flippant for my tastes. It might appeal to ditsy nerd wannabes.  But I don't think they'd actually learn anything from it.", "Helpfulness": 0.16666666666666666, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DZDM31MLPE1U/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #31,312,142", "Helpfulness": "22%", "Name": "luv great kids books", "Location": "Yakima, WA"}}], "ReviewUrl": "http://www.amazon.com/Physics-Matter-Matters-Dan-Green/product-reviews/0753462141/ref=sr_1_8?s=books&ie=UTF8&qid=1432393584&sr=1-8&keywords=physics+books+paperback/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.4 out of 5 stars"}, "OfferPrice": "$8.89", "Salesrank": "#10,747", "ListPrice": "$8.99"}