{"Category": "in Books (", "Name": ["Introduction to Quantum Mechanics with Applications to Chemistry (Dover Books on Physics)"], "Timestamp": "2015-05-23 13:19:40.516641", "itemurl": "http://www.amazon.com/Introduction-Quantum-Mechanics-Applications-Chemistry/dp/0486648710/ref=sr_1_19?s=books&ie=UTF8&qid=1432393585&sr=1-19&keywords=physics+books+paperback", "Reviews": {"TotalReviewCount": "31", "ReviewList": [{"Date": "on June 12, 2002", "Text": null, "Helpfulness": 0.9871794871794872, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A216EMII36UPY9/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #2,761,782", "Helpfulness": "92%", "Name": "Bosco Ho", "Location": "San Francisco, USA"}}, {"Date": "on October 14, 2000", "Text": "Linus Pauling's treatise on quantum chemistry is even more brilliant than that on general chemistry.  His vivid and clear explanation makes quantum theory so interesting and appealing to learn.  Instead of going through the obscure mathematics and operator mechanics, Pauling conveys the essence of quantum mechanics in very simple language.  Maybe this is how Pauling distinguishes himself as a Nobel Prize laureate.  I studied Donald McQuarrie \"Physical Chemistry: A Molecular Approach\" (you may find my review for McQuarrie here as well) and found McQuarrie so much more understandable than Atkins.  Yet Pauling's account on the subject is even more concise and motivating.  The book teaches basic concepts but also ensures understanding of applied theory.  While \"Introduction to Quantum Mechanics\" might not be as reader-friendly as its counterpart in general chemistry, I highly recommend this book for all chemistry students and those who want to adventure in advanced chemistry.", "Helpfulness": 0.896551724137931, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ARA52HB238HT/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #1,737,232", "Helpfulness": "86%", "Name": "Matthew M. Yau", "Location": "San Francisco, CA"}}, {"Date": "on August 26, 1999", "Text": "In my opinion I found this book very useful if you start studying QM, it describe in very interesting way how the modern QM theory was develop from the old one, it use simple mathematics to describe the physical phenomena  compare to the other books in the same subject, and the chemistry  application is something definitely you need to understand the applied  theory, with this amazing low price and the material inside the book it  worth every penny.", "Helpfulness": 0.896551724137931, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on May 6, 2000", "Text": "Linus Pauling revolutionised the chemical world by his magnum opus 'The Nature of the Chemical Bond' which would come out a few years after this book. This work first came out in the 30s when people were beginning to  perceive the potential uses of quantum mechanics in Chemistry, it reveals  everything you need to know about the foundations of quantum chemistry and  it's indeed a priceless gem for any aspiring chemist.  The problem with  newer books is that they present the subject in a very dogmatic and, at  times, superficial way leaving the student often puzzled and confused with  all the mathematical formalities. This book has everything and I mean  EVERYTHING ! At the risk of becoming pedantic for those more knowledgeable  in calculus and linear algebra, every calculation and every reasoning is  justified. The formalities are all unveiled and minimized but it still digs  deep into the characterization of the theories of the chemical bond,  electronic structure, the infamous group theory and some basic  spectroscopy.", "Helpfulness": 0.9090909090909091, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28AHZJCBQQD2Y/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #28,175,606", "Helpfulness": "81%", "Name": "Nuno Bandeira", "Location": "Lisbon, Portugal"}}, {"Date": "on June 28, 2004", "Text": "How would an \"Introduction to Philosophy\" by Socrates or a \"Basics of the Piano\" by Mozart sound like? This is something similar. Linus Pauling, the unprecedented pioneer of the application of Quantum Mechanics to Chemistry, had written this book in the 1930s as perhaps the first introduction to QM for Chemists, supported by his colleague, E Bright Wilson, a brilliant chemist in his own right. A generation of Chemists grew up learning from this book, and its content is as relevant and articulate today as it was then. Hundreds of Quantum Chemistry books, some of which are excellent, have been written in the times since it was first published. But this book still retains an incomparable flavour that brings out the fundamental nature of QM and Chemical Bonding. I have to admit that I found this book slightly difficult, because Pauling and Wilson, although being extremely lucid, never compromise on the Math. But gradually I learnt that this is the kind of book which belongs in the same category of, say, Ernest Eliel's stereochemistry book. That means that every moment you spent on it will be worth it, even if it takes you a very long time to go through it. This is one of those books where every word is carefully thought and then stated, making the journey difficult at places, but always rewarding. And why not. It is hard to imagine anyone else writing with so much confidence on the topic. So it is important not to gloss over this book quickly and then discard it as being dry, but persist in reading it and get insight out of it. The book opens with a discussion of Lagrangian mechanics and discusses some simple examples of its applications. It then moves on to the basic principles of QM, and comes to the Hydrogen molecule, which was the pinnacle of succcess for the Physicists. I think that this book has the best discussion of the H molecule ever written. I have seen other excellent Quantum Chemistry books giving a reference to this work whenever they discuss the H molecule. Moreover, I believe that a thorough understanding of the H molecule is of paramount importance for understanding any further application of QM to Chemistry. Discussion of this molecule opens the door to understanding orbitals, spherical harmonics, angular momentum and all the important concepts in theoretical Chemistry. So the book will score top points for this alone. Later on there are excellent discussions of the Variational Method, Perturbation theory and finally the various important approximations like Hartree-Fock theory and the structure of molecules. The appendices deal with detailed discussions of derivation and some mathematical topics. All in all, a clear and extremely lucid presentation, well worth every moment you can spend on it, by one of the greatest scientists of all time.", "Helpfulness": 0.9230769230769231, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36A9HWQ9U1IK4/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "#1,494", "Helpfulness": "91%", "Name": "A. Jogalekar", "Location": "Cambridge, MA USA"}}, {"Date": "on September 29, 2001", "Text": null, "Helpfulness": 0.9166666666666666, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on December 18, 2002", "Text": "If you are an undergraduate and you want everything you need, this is the book.  The lack of matrix mechanics makes this book unsuitable for serious graduate students, though.  I think it would actually be best for 1st or 2nd year serious undergraduate chemists who are well acquainted with differential equations.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1C4J9CUHT3UXE/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #678,908", "Helpfulness": "72%", "Name": "Jeff", "Location": "Portland, OR, United States"}}, {"Date": "on September 12, 2003", "Text": "This is a great, simple presentation of the Schroedinger viewpoint.  There is no Dirac representation and no matrix mechanics.  However, there is much to be liked about this book and it is a pleasure to read.  Those who are baffled completely by quantum mechanics will find this an enlightening introduction and a simple understandable place to start.  This is another one of those lesser known gems.", "Helpfulness": 0.9090909090909091, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18I8EYPJK3XMA/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #3,404,465", "Helpfulness": "77%", "Name": "James H. McDuffie", "Location": "Huntsville, Alabama United States"}}, {"Date": "on August 5, 2000", "Text": "After all these years Pauling & Wilson still is one of the fundamental works on making chemistry an \"exact\" science. This Dover edition  made it affordable to any undergrad/grad student, no more excuses for using  such junk approaches like the first chapters on the subject like Phys  Chem/Atkins", "Helpfulness": 0.8181818181818182, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZ6ALGGFVHJ50/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #28,298,565", "Helpfulness": "76%", "Name": "Richard Axor", "Location": "Brazil"}}, {"Date": "on October 20, 2007", "Text": "As an alum holding both undergrad and graduate degrees in a related field, I figured I would pick this title up for some pretty heavy reading.  I was right.  Even thought the title says \"an introduction\", there are several pre-requisites to understanding Quantum Mechanics, and the style of Linus Pauling's writing in general.  The book reads very much like a textbook, and I would suggest at least a pretty good understanding of physics, mathematics, and technical writing before diving in.  It's a great book, and a classic text.  It's just not a casual Sunday read.", "Helpfulness": 0.8571428571428571, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WIAQ1IMIHECC/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #9,826,880", "Helpfulness": "70%", "Name": "J. Drumheller", "Location": "Morrison, CO"}}, {"Date": "on June 11, 2008", "Text": null, "Helpfulness": 0.8, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28VLIV2QOCH9O/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #19,838,251", "Helpfulness": "33%", "Name": "Jane Grimes", "Location": "Perth, Western Australia"}}, {"Date": "on January 6, 2010", "Text": null, "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3STUU6SA6ECR2/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "#85,935", "Helpfulness": "94%", "Name": "Jason Dowd", "Location": "Lost in Thought"}}, {"Date": "on December 30, 2008", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GH79SIO3HLVY/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #25,320,564", "Helpfulness": "100%", "Name": "Roger Stanton Fager", "Location": "Fort Myers, FL  USA"}}, {"Date": "on March 3, 2014", "Text": "Although this Introduction to Quantum Mechanics was published in the same year as Schrodinger's Cat Paradox and therefore may seem naive by modern standards, it gets into mathematical details in a more meaningful way than many more modern texts.  As an outsider, I particularly like the way it builds upon Newtonian physics and explains how quantum concepts apply to classical chemistry.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOE17HCQ3Q9EN/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #686,028", "Helpfulness": "59%", "Name": "R. H. Page", "Location": "Willsboro, NY USA"}}, {"Date": "on October 17, 2007", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10RHAJQPCRO9P/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #27,260,867", "Helpfulness": "30%", "Name": "Boris", "Location": ""}}, {"Date": "on March 29, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APH8DPK6LWHNW/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #253,707", "Helpfulness": "72%", "Name": "Glen Clark", "Location": ""}}, {"Date": "on June 30, 2013", "Text": "I got the book because Pauling was a genius - a legend in his own time.  I figured that anything he had to say would reflect that genius.  I wasn't disappointed there.  The down-side to that is that the book isn't a \"read\" - it's a \"slog\" - a bit like the College Outline Series: meant for the reader who already learned it all at some point, and is just going back to brush up on a few pesky points.  If you want a teaching text on the subject, there are doubtless those which are easier on the student.  If you want books with lots of homework exercises at the end of each chapter, look elsewhere.  If, however, your tastes run to a dense reference book that leans more heaviliy on text and equations than on diagrams and illustrations, I suggest you seriously consider this book.  I'm keeping it.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Z4YYMGQM2MZY/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #136,636", "Helpfulness": "73%", "Name": "NorthTXguy", "Location": ""}}, {"Date": "on December 16, 2014", "Text": "Flip through most modern chemistry and material science texts for QM and you see the same examples and methods taught.  But newer books try to be more concise and leave out the background that Pauling and Wilson didn't assume of chemists of their day.  I just found the material as presented originally by Pauling and Wilson more understandable.  This was still a textbook for science majors, so you really need college-level math and science.  If you haven't, it would be tough slogging through the academic material, and why would you be interested in it anyway?", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14UR7O0YQFUIP/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #1,357,963", "Helpfulness": "80%", "Name": "Cerritos reader", "Location": "California, USA"}}, {"Date": "on April 26, 2014", "Text": "As I started reading it I loved it, is so easy to understand it because it leads you from the basic equations which are needed to understand the theory, the origins of it and how did it changed trough time because of the observations and experiments made to explain it, it includes basic problems for the hydrogen atom and much more about  the quantum explanation of matter.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZNYRZTXKY7MY/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #18,683,505", "Helpfulness": "", "Name": "Isaura Avalos", "Location": ""}}, {"Date": "on December 7, 2007", "Text": "This is the best ever text in quantum mechanics. Every one which intents start in this field should read this book. It contains all the elementary steps to understand this difficult field in a language and in such detail which is not found any more in the modern books.", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJG73881QLK5G/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #5,710,857", "Helpfulness": "50%", "Name": "Roberto B. Faria", "Location": "Rio de Janeiro, Brazil"}}, {"Date": "on September 9, 2014", "Text": "It is a book more for chemistry than for physics, I specially liked the first chapters. For my point of view it is not and introductory book is more and advanced book, so be careful if you are not involve in quantum theory yet", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16XCR9C3KQ18V/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #4,001,137", "Helpfulness": "100%", "Name": "Elctrinic", "Location": ""}}, {"Date": "on January 12, 2015", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RX1NARM6WAB4/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #29,788,536", "Helpfulness": "43%", "Name": "Joseph B. Ennis", "Location": "Florida USA"}}, {"Date": "on November 8, 2014", "Text": "This has many jewels, if I can see through the battle ground of many decades of new found - profound - scholarship and research.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOT12T9BV0XDG/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #31,157,007", "Helpfulness": "27%", "Name": "KP in SW Michigan", "Location": ""}}, {"Date": "on January 29, 2013", "Text": "def not for a beginner really need to kno the basic of quantum mechanics and its theory's other then that it is a wonderful book", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9EWA6GFYD2XU/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #20,246,489", "Helpfulness": "", "Name": "Joey", "Location": "New York"}}, {"Date": "on November 13, 2014", "Text": "I bought this book for my son.  He told me that \"it came in the minimum time stated and is everything I wanted\"", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A340UH6ELR9659/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #5,451,332", "Helpfulness": "", "Name": "Connie S. Riddle", "Location": ""}}, {"Date": "on December 11, 2014", "Text": "Good book", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MEG7MBEY8YFT/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #15,171,144", "Helpfulness": "", "Name": "Bruno Leite", "Location": "Recife, Brazil"}}, {"Date": "on April 21, 2013", "Text": "This book is one of my favorite scientists, Pauling's work, and my teacher recommend me to read it. I can't wait to read it!! If you want to understand how Nobelist \"see\" quantum world, you have to read it~", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TPC84VX1W6F9/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #23,970,752", "Helpfulness": "0%", "Name": "Chien-Lun Hung", "Location": ""}}, {"Date": "on April 20, 2013", "Text": "I am quite satisfied with my purchase of this book. The author is a famous scientist in theis and other fields, so keeping this book is a bit of a keepsake or collector's item.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IVJUOML0I5FD/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #16,289,528", "Helpfulness": "0%", "Name": "John Ball", "Location": "GRIFFIN, GA, US"}}, {"Date": "on June 24, 2008", "Text": "This book covers all the basics about Quantum Mechanics for Chemists. I highly recommend it for all Chemist Students.", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AE81NAE20PLP1/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #607,011", "Helpfulness": "74%", "Name": "Alexandre A. Souza", "Location": "Professor in Brazil"}}, {"Date": "on May 20, 2007", "Text": null, "Helpfulness": 0.35, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38UB3E1355O42/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #26,946,238", "Helpfulness": "62%", "Name": "Purushottam D. Dixit", "Location": "Baltimore, MD"}}, {"Date": "on October 11, 2011", "Text": null, "Helpfulness": 0.05263157894736842, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25ASD5GSI0WV/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #30,737,082", "Helpfulness": "30%", "Name": "Amazon Customer", "Location": "NEWFOUNDLAND, PENNSYLVANIA, US"}}], "ReviewUrl": "http://www.amazon.com/Introduction-Quantum-Mechanics-Applications-Chemistry/product-reviews/0486648710/ref=sr_1_19?s=books&ie=UTF8&qid=1432393585&sr=1-19&keywords=physics+books+paperback/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.7 out of 5 stars"}, "OfferPrice": "$13.71", "Salesrank": "#81,267", "ListPrice": "$18.95"}