{"Category": "in Books (", "Name": ["Survivor: A Novel"], "Timestamp": "2015-05-21 22:24:05.816390", "itemurl": "http://www.amazon.com/Survivor-Novel-Chuck-Palahniuk/dp/039333807X/ref=sr_1_11?s=books&ie=UTF8&qid=1432261234&sr=1-11&keywords=fiction+novels+paperback", "Reviews": {"MaxNumReviews": 15, "ReviewList": [{"Date": "on July 3, 2000", "Text": null, "Helpfulness": 0.934640522875817, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2U155JNVBJJDK/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #27,529,106", "Helpfulness": "86%", "Name": "figurat", "Location": ""}}, {"Date": "on June 15, 2001", "Text": null, "Helpfulness": 0.9565217391304348, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGPUTNPHE9P8J/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #1,423,804", "Helpfulness": "98%", "Name": "m_s_", "Location": ""}}, {"Date": "on October 24, 2000", "Text": null, "Helpfulness": 0.8571428571428571, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BM615LYZYAY0/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #29,197,011", "Helpfulness": "86%", "Name": "Ian Arsenault (buickyouth11@hotmail.com)", "Location": "Chicago, IL"}}, {"Date": "on May 3, 2001", "Text": null, "Helpfulness": 0.7931034482758621, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUVX4758GOLUX/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #136,232", "Helpfulness": "90%", "Name": "Fred", "Location": "CHAPEL HILL, NC, United States"}}, {"Date": "on November 26, 2002", "Text": null, "Helpfulness": 0.8421052631578947, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZLROGIL2V7GV/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #215,732", "Helpfulness": "87%", "Name": "Michael Crane", "Location": "Orland Park, IL USA"}}, {"Date": "on November 20, 2000", "Text": "After seeing the movie Fight Club, I became very interested in Chuck Palahniuk's work.  So I went to the bookstore looking for some of his other novels.  You know the saying \"don't judge a book by its cover\"?  Well I do judge books by their covers.  The covers of books now are just so... corny.  I could tell Survivor was going to be a good book from its unique cover.  It is very plan, almost completely silver, but it has style.  The novel is centered on the thought to be only survivor of a Creedish Death Cult, Tender Branson.  In the first chapter, chapter 47, it is explained that Tender Branson is alone on a high jacked commercial airplane and he is going to crash it into the Australian Outback. But before that happens he is going to tell his life story to the \"indestructible black box of Flight 2039\".  As the chapters work their way down to 1, there is a very dark apocalyptic story of Tender's rise to stardom from a housemaid for a strange yuppie couple.  In his work experience with this yuppie couple, Tender learns helpful facts like how to get bloodstains off of wallpaper.  Also how to hide stab holes in tuxedos. No book is complete without a love interest, and Fertility Hollis adds that and much more.  Tender falls for the very interesting character Fertility, who happens to be the sister of a man Tender killed (in a round about way).  The plot takes many twists and turns that keep you very interested, for instance Tender's twin brother might be trying to kill him so that all of the Cult would be in their rightful place, dead.  \"'What's the difference between a Creedish and a corpse?'  Just a matter of hours.\"  It is a very unpredictable, enticing, hilarious novel that is so real, it might make you consider suicide.  I loved this very unique novel and would recommend it to everyone, except people who have considered suicide, because it might just push them over the edge.", "Helpfulness": 0.8421052631578947, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZ2SH3SABTZ9J/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #29,510,302", "Helpfulness": "84%", "Name": "Michael Downing", "Location": "Gorham, ME  USA"}}, {"Date": "on June 17, 2005", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8QCB68UL50NX/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #812,686", "Helpfulness": "86%", "Name": "Amazon Customer", "Location": "Austin, TX"}}, {"Date": "on December 29, 2000", "Text": null, "Helpfulness": 0.8333333333333334, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33TY0UEC0SYB3/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #27,743,555", "Helpfulness": "72%", "Name": "Exodus", "Location": "Del Mar, California United States"}}, {"Date": "on June 22, 2000", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AF50ULMYITS9J/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #27,947,369", "Helpfulness": "83%", "Name": "Corey Slack", "Location": ""}}, {"Date": "on December 4, 2003", "Text": "Did you think Fight Club was strange? It only scratched the surface of Chuck Palahniuk's satirical psyche, only served as a warmup for this deadpan media/religion scather that concludes in an even more over-the-top fashion than Palahniuk's debut novel. That the pages and chapter numbers of Survivor count down instead of up is only the most superficial aberration. You'll recognize some of Palahniuk's devices from Fight Club immediately -- the short paragraphs, choppy sentences, narrator dialogue not distinguished with quote marks. The all-knowing consumerism and dead-on ideological emptiness. And, of course, the beginning that reveals the ending and spends the rest of the book arriving at that point through flashbacks. Without giving any more away, I implore that you pick up this book! Definitely a permanent addition to your collection! Also recommended: Life of Pi by Martel, The Losers' Club by Richard Perez", "Helpfulness": 0.8571428571428571, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on November 22, 2003", "Text": null, "Helpfulness": 0.8888888888888888, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FVFJ8D95E9KY/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #30,195,220", "Helpfulness": "62%", "Name": "K. Bentley", "Location": "Stratford, CT United States"}}, {"Date": "on May 10, 2001", "Text": "Palahniuk is one seriously f-ed up writer. That doesn't mean that he still cant write. While I loved Fight Club, I found Survivor just as good. The one thing I like about Palahniuk is that, while some authors tend to rehash the same plotline, story, and ending, (*cough* Grisham) Palahniuk manages to create something new and original every time. Fight Club was about anarchist overthrows funded by soap sales. Survivor is about Tender Branson, a man who's the last surviving member of the Creedish Church (or, as it's referred to later, \"The Old Testament Death Cult\"). He's all alone in an airplane about to crash into the Austrailian outback. However, before the plane crashes, he reveals everything in the plane's black box recorder, from his growing up within the Creedish Church, how to get blood stains out of carpet using common household items, to becoming a buffed, to being the last surviving member of \"The Deliverence\", to becoming a steriod-infused media conglomerate, to his on-again, off-again relationship with Fertility Hollis. He'll reveal the truth about the Tender Branson Sensitive Materials Sanitary Landfill (aka The PornFill), the \"Deliverance\", the stadium tours, the autographed Bibles, the Genesis Project, and The Book Of Very Common Prayer. I don't want to give away too much, but Palahniuk's sense of humor, in this book, Fight Club, and so on, is very f-ed up with his dark takes on society, and brings to light stuff you've  thought you've known for a long time and does a complete twist on it. The ending's also a shocker, too. It's not quite as intense as Fight Club's ending was, but it's one of those \"the exact opposite of what you think is going to happen\" endings. This is a great read if you're a fan of dark fiction. I can't wait to see if the movie's going to be as good as Fight Club...", "Helpfulness": 0.875, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3B08DCVOC1BDI/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #26,959,673", "Helpfulness": "75%", "Name": "halo1000", "Location": "A Warm Place"}}, {"Date": "on October 31, 2000", "Text": null, "Helpfulness": 0.875, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CHM200OEN65X/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "#1,067", "Helpfulness": "90%", "Name": "Eric Wilson", "Location": "Nashville, TN United States"}}, {"Date": "on November 1, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AODKUG6FAKD2Z/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "#3,632", "Helpfulness": "87%", "Name": "Bryan Byrd", "Location": "Earth"}}, {"Date": "on March 28, 2001", "Text": "When you hear people constantly giving an author great reviews for a book turned into a movie like \"Fight Club\" you can't help but see what else he has done. Survivor keeps all of the satire that fight club had except it has a certian edge to it.  I know fight club was a great novel but the only reason people say this one isn't quite as good is because more people know about Fight Club.  This novel deserves five stars.  It keeps you guessing and lets you laugh at what happens throught the novel.  A man from a cult which thinks suicide is delivering yourself to heaven is the last remaining of his kind.  The Creedish, the cult he originates from, tests him and then throws him out into the world and now he is famous.  This novel gives you a look at the world from a stars eyes and it keeps you guessing.  Amazing job Chuck.", "Helpfulness": 0.875, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11IJTF91HLPFI/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #29,277,466", "Helpfulness": "70%", "Name": "pyrotechnic", "Location": "Wisconsin Rapids, WI USA"}}, {"Date": "on March 25, 2000", "Text": "There's a big debate on which Palahniuk book is better:  Fight Club or Survivor?  I think Fight Club is better, but it's all just a matter of taste.  This one's just a funny (if not more).  This one is more mainstream though (not saying it's mainstream, just mainstreamer).  It doesn't feel as  dangerous as Fight Club.  This book is written much more cohesively, which  I think is a shame because I liked Fight Club's choppiness.  It's also not  nearly as stylish.  But enough of that.  Celebrities always talk about  how bad it is being a celebrity, but no one ever believes them.  This book  changed my mind.  I was horrified by the price of fame Tender Branson paid.  Tender Branson is so obligated to fame and phoniness that you feel  claustrophobic just reading it.  It's twisted like only Palahniuk can, and  yet you still wonder how real is this?  Chuck has some philosophy for you  again, unfortunately this time it's moronic (Adam's sex philosophy is  something that doesn't leave the notepad).  It starts off boring enough,  but as the pages count down (yep, literally.  It's kind of a neat gimmick),  it seems like you're going at the speed of that doomed plane.  The climax  is actually pretty powerful.  As always, Chuck has good characters and  funny parts and philosophy and everything.  I don't think this will ever  change.  Ever.  For better or worse.  Perhaps a bad sign is that each of  Palahniuk's books has been a bit worse than the one before it.  Hopefully,  this pattern will not continue.  So basically, I'm going to reccomend this  book, unless you haven't read Fight Club yet.  Then go there.", "Helpfulness": 0.8571428571428571, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38RWZNLU2NWRP/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #28,536,843", "Helpfulness": "58%", "Name": "cary fritz", "Location": ""}}, {"Date": "on March 1, 2000", "Text": null, "Helpfulness": 0.8571428571428571, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BXPW5YIR4A52/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #3,808,243", "Helpfulness": "78%", "Name": "James Andresen", "Location": ""}}, {"Date": "on May 14, 2003", "Text": null, "Helpfulness": 0.8571428571428571, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CAA94EOP0J2S/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #23,358,489", "Helpfulness": "83%", "Name": "Travis J Smith", "Location": ""}}, {"Date": "on July 11, 2002", "Text": null, "Helpfulness": 0.8, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AE0E6UII0VSZA/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #9,928,065", "Helpfulness": "78%", "Name": "Blake the Movie Nerd", "Location": "Video Producer in Troy, Michigan United States"}}, {"Date": "on January 17, 2000", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IO7O5T3KTZ2M/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #28,725,564", "Helpfulness": "76%", "Name": "T. Martin", "Location": ""}}], "ReviewUrl": "http://www.amazon.com/Survivor-Novel-Chuck-Palahniuk/product-reviews/039333807X/ref=sr_1_11?s=books&ie=UTF8&qid=1432261234&sr=1-11&keywords=fiction+novels+paperback/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": ""}, "OfferPrice": "$13.29", "Salesrank": "#15,166", "ListPrice": "$15.95"}