{"Category": "in Books (", "Name": ["Fight Club: A Novel"], "Timestamp": "2015-05-21 22:21:28.475090", "itemurl": "http://www.amazon.com/Fight-Club-Novel-Chuck-Palahniuk/dp/0393327345/ref=sr_1_3?s=books&ie=UTF8&qid=1432261234&sr=1-3&keywords=fiction+novels+paperback", "Reviews": {"MaxNumReviews": 15, "ReviewList": [{"Date": "on January 23, 2002", "Text": null, "Helpfulness": 0.9337748344370861, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZ1UFPNARPZD2/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #101,458", "Helpfulness": "88%", "Name": "Jeffrey Ellis", "Location": "Richardson, Texas United States"}}, {"Date": "on May 4, 2000", "Text": null, "Helpfulness": 0.8780487804878049, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADGM3UNCOFOC5/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #29,371,950", "Helpfulness": "88%", "Name": "amazonedude", "Location": ""}}, {"Date": "on May 29, 2000", "Text": "If you're coming to the book after seeing the film-it's ok to raise your hand here as your reviewer did also-you'll see the screenwriter pretty much took the book's contents verbatim. What's missing are a few funny moments  like Marla's unwitting part in the soap-making process and some disturbing  details of her's and Tyler's sex life. Plus a different and more satisfying  ending (c'mon, you didn't think the narrator and Marla were really in love  did you?)Palahniuk's jump-cut, stream-of-consciousness style take a little  getting used to, but this is a clever black comedy that leaves you with  more to think about than the punchlines when it's over. It's about a  culture of numbness, where Huxley, not Orwell, was right and the only way  to feel is to drive yourself to the limits of physical pain or destroy  something beautiful. You've probably seen the movie and giving away plot  details would just detract from the experience. Just read it!", "Helpfulness": 0.8823529411764706, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DKB9QZUJYBE3/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "#89,747", "Helpfulness": "87%", "Name": "Trixie", "Location": "Ohio"}}, {"Date": "on May 23, 2001", "Text": null, "Helpfulness": 0.8709677419354839, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3B08DCVOC1BDI/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #26,959,673", "Helpfulness": "75%", "Name": "halo1000", "Location": "A Warm Place"}}, {"Date": "on December 24, 2000", "Text": null, "Helpfulness": 0.8571428571428571, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PF2NF7LX3CAB/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #301,193", "Helpfulness": "74%", "Name": "Dan Seitz", "Location": "Somerville, MA, USA"}}, {"Date": "on October 30, 1999", "Text": "I don't know about you, but I'm sick of watching movies and forgetting what happened in them before I even leave the theater.  However, after  watching Fight Club, I could not get it out of my head.  I went to watch  Bringing out the Dead that same day and couldn't even concentrate on what  Nicholas Cage was doing, because Fight Club kept playing itself over and  over again in my head.  The next day I went out and bought Fight Club,  Invisible Monsters, and ordered Survivor.  I figured that if the book was  half as good as the movie I would be satisfied.  I read Fight Club every  spare moment I had and finished it in two days.  Let me tell you, this book  is awesome!  The movie keeps the intent of the book, but the book takes the  storyline to a whole other level.  No one but Palahniuk can mix together so  many different story lines and odd images into a working novel.  His  imagery and style are breathtaking and if you're anything after me, as soon  as you're done reading it, you'll want to read it again.", "Helpfulness": 0.9, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on June 22, 2002", "Text": null, "Helpfulness": 0.9333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1A5E0R7BKZPWK/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #11,344,447", "Helpfulness": "80%", "Name": "ScarletArrow", "Location": "Akron, Ohio"}}, {"Date": "on April 6, 2001", "Text": null, "Helpfulness": 0.875, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33TY0UEC0SYB3/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #27,743,555", "Helpfulness": "72%", "Name": "Exodus", "Location": "Del Mar, California United States"}}, {"Date": "on November 10, 2000", "Text": null, "Helpfulness": 0.8571428571428571, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUVX4758GOLUX/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #159,720", "Helpfulness": "90%", "Name": "Fred", "Location": "CHAPEL HILL, NC, United States"}}, {"Date": "on November 11, 2003", "Text": null, "Helpfulness": 0.8636363636363636, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JEG9VLTPCAAM/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #28,579,331", "Helpfulness": "86%", "Name": "jessikarose", "Location": "sterling hts, mi"}}, {"Date": "on May 23, 2000", "Text": "I may be \"out of line\" here but to be truthful I'm not all that concerned.  Those of us that have read \"Fight Club,\" and especially those of us that love \"Fight Club\" have one thing in  common, we often feel like those men mentioned in \"Fight Club.\"  The book deals with underground boxing matches that lead the participants,  mainly a group of disgruntled and unsatisfied young men, into a life of  servitude at the hands of an insane, yet strangely sensible, character  named Tyler Durden. Now don't get me wrong, I don't advocate the methods of  attention that the book mentions, but there is definitely something  grabbing and satisfying about the way these characters deal with an  increasingly commercialistic and selfish society.  I don't think there's a  person out there who doesn't from time to time wonder if we would be better  off if credit cards had never been invented or mass media was less  concerned with the sensational. \"Fight Club\" is about more than a  group of militant crusaders out to change the world, it's a parable if you  will, something to be read and discussed and deciphered how you see fit.  Yes, some who read it could say it's nothing more than a tale of men gone  bad, but there's also those of us that see an appropriateness in the  characters increasing desperation at the loss of their individuality to  corporations and brand names. Don't miss this book.  It has some important  things to teach and it does an amazingly effective and entertaining job at  doing just that.  It's a definite must have.", "Helpfulness": 0.9166666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12AG1OXXG1ZNO/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #28,716,184", "Helpfulness": "84%", "Name": "Eric J. Pray", "Location": ""}}, {"Date": "on May 10, 2002", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3075RVSKC27HU/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #4,187,225", "Helpfulness": "75%", "Name": "P. Nicholas Keppler", "Location": "Pittsburgh, Pennsylvania United States"}}, {"Date": "on October 29, 2000", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2E3VGCMBXEHIR/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #29,493,160", "Helpfulness": "88%", "Name": "Chris T", "Location": ""}}, {"Date": "on July 4, 2000", "Text": null, "Helpfulness": 0.8, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GKEGKYSI7DQ2/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #27,934,573", "Helpfulness": "88%", "Name": "Thrash Jazz Assassin", "Location": ""}}, {"Date": "on April 15, 2003", "Text": "This is not the easiest book to read.  It has a brilliant or at least odd idea on every page, and if you want to get the most out of it, you'll have to put it down and think about it more than a few times.  It's philosophy disguised as throwaway pop culture, it is a new use of the written word and it is, in my humble opinion, brilliant.  The only other novel that I've ever read that matches it's style is We All Fall Down by Brian Caldwell.  It's a Figh Club like take on the Christian apocalypse and it struck me as very similar to Fight Club in it's depth of ideas and density of insight.  Both Palahniuk and Caldwell are a new breed of writer's who seem to be building on what's been done before rather than simply re-hashing it.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FWDQZU22A40B/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #29,201,487", "Helpfulness": "100%", "Name": "Julie Givens", "Location": ""}}, {"Date": "on December 1, 2002", "Text": "I was braced for this book by having seen its film adaptation about seven times before I read it, but I can only imagine what reading this book must have felt like for the uninitiated.  Much like the bare-knuckle brawls its characters stage, \"Fight Club\" is a no-holds barred look at the nihilism that lurks just beneath the facade of our modern society.  With American culture now obviously placing heavy emphasis on consumerism and status, it's interesting to see what one man thinks it may be breeding.  And I can't think of a better man to deliver the message than Chuck Palahniuk.  As most now know, \"Fight Club\" centers around a group of disillusioned young men who pummel each other on a regular basis in order to fight the numbness of living in a superifical society.  And as this and all of Palahniuk's subsequent novels prove, he has a gift for creating both striking sentences and memorable characters.  The most memorable character here, of course, is Tyler Durden.  He's a one-man wrecking crew of sorts, using Fight Club to aim at nothing less than the total destruction of society. In Tyler's view, the world is so far gone that there's nothing left to do but start over.  Countering his extreme pessimism is his alter ego, the narrator, who obviously symphathizes with Tyler's beliefs but can't quite commit to his methods.  The struggle for supremacy between these two personalities forms the crux of the novel, with the fate of American civilization perhaps in the balance.  By the end, the book has gotten a little out of control, but the read getting there is about as compelling and thought-provoking as they come.", "Helpfulness": 0.8888888888888888, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3N5XIM9R2OQH0/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #122,524", "Helpfulness": "85%", "Name": "Wheelchair Assassin", "Location": "The Great Concavity"}}, {"Date": "on February 17, 2001", "Text": null, "Helpfulness": 0.8461538461538461, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AI8GES0A82068/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #24,915,604", "Helpfulness": "89%", "Name": "G. Knight", "Location": "Los Angeles, CA"}}, {"Date": "on January 24, 2001", "Text": "An outstanding adaptation to film. Considering the Hollywood trend for adaptation, usually grossly pathetic adaptation, Fincher has succeeded in making a film that truly embodies the concept and intensity that Chuck Palahniuk set to text in 1996. Granted phrases were edited, scenes were dropped but Fincher managed to stay true to Palahniuks tale of mans fight against the fakeness and meaninglessness that life easily reverts too under the right amount of repression. In literature right now this is not a unique theme. Nihilism seems to be on the verge of a comeback amongst the contemporary thirty something year old writers and the younger audiences who are intent to shell out the cash for it. Fight Club however is on the top of my list as one of the more explicit espousers of this philosophy. Palahniuks Narrator is a character who is no longer an active participant in his life. Apathy turns into self-hate, self-hate to the more violent self-destruction, or (and this is the fork in the road) revolution.  He seeks meaning through materialism and only really has control over what furniture to purchase for his condo. This kind of alienation and disassociation from anything real or human is the warm and dark breading ground for, among things, nihilism. In essence nihilism seeks to find meaning through violence; the only way that our Narrator can incorporate meaning into his superficiality and insignificance is through the destruction of everything and everyone around him. The Stranger by Albert Camus follows a man completely devoid of responsibility a man who can find no meaning in anything in his life until an act of senseless violence drives him the realization that the only meaning in life is the meaning that you yourself make. Unlike Palahniuks Narrator time is up for the stranger and this profound realization becomes useless to all but those who recognize it and learn from it. Fight club went under fire for its graphic intensity but I think that what most people didn't notice was that for all its morbidity this film is an abstraction of reality and not a literal `apocalyptic vision of the future'. Not to say that it doesn't contain truth, but that the truth and the lesson need to exist in the absurdity and intensity for them to be of any relevance at all.  Suggested reading: Knucklehead by Peter Gault, Survivor by Chuck Palahniuk, anything by Hunter S. Thompson, and something I just finished which is a complete Fight Club imitation but contains some interesting nuggets of abstruse sagacity, Fake.Liar.Cheat. by Tom Goldberg.....", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVWONFHGE6MS0/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #29,616,464", "Helpfulness": "100%", "Name": "sid mayse", "Location": "chicago"}}, {"Date": "on July 20, 2000", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VB1EKGM7P4B6/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #29,330,760", "Helpfulness": "90%", "Name": "Josh George", "Location": ""}}, {"Date": "on September 13, 2003", "Text": null, "Helpfulness": 0.8125, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A193AABQ821L9Z/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #4,046,853", "Helpfulness": "73%", "Name": "fellicity", "Location": "Orange County, CA"}}], "ReviewUrl": "http://www.amazon.com/Fight-Club-Novel-Chuck-Palahniuk/product-reviews/0393327345/ref=sr_1_3?s=books&ie=UTF8&qid=1432261234&sr=1-3&keywords=fiction+novels+paperback/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": ""}, "OfferPrice": "$10.07", "Salesrank": "#1,582", "ListPrice": "$14.95"}