{"Category": "Paid in Kindle Store (", "Name": "", "Timestamp": "2015-05-21 23:23:34.284700", "itemurl": "http://www.amazon.com/Essential-Oils-Beginners-Recipes-Included-ebook/dp/B00VGSD886/ref=sr_1_9?s=digital-text&ie=UTF8&qid=1432264827&sr=1-9&keywords=Free+chemistry+books", "Reviews": {"MaxNumReviews": 15, "ReviewList": [{"Date": "on April 17, 2015", "Text": "This book is very useful to everyone. It gives me a detailed knowledge about essential oil as what they are, how they works, when i was totally out of this knowledge. If you are wanting to learn more on the benefits of Essential Oils and other natural tools this is the book to own. This book taught me so much and I still use it all the time. Very informative, will try several of these recipes. Things used for centuries can't be wrong. Much easier than going the prescription or manufactured route. I really appreciate this book is because that you can make homemade tea essentials of your own. It is a very great book that explains well the different uses of oil. This book gathers lots of info about essential oils. This is a great reference book for anyone seeking natural alternatives to healthcare. I enjoyed the book very much and I recommend any to read this book to bring change in their life.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1S733YP8NH9SB/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "#6,175", "Helpfulness": "92%", "Name": "Sidra Sultana Malik", "Location": "Virtual Assistant  in Pakistan"}}, {"Date": "on April 16, 2015", "Text": "I am planning to start a new business mid of this year. I have chosen the best 2 options that I have and considered selling different kinds of essential oil. I want to make my own and sell it but I need recipes and benefits to offer my clients. This book is the answer of my dilemma. It has different essentials and also shared recipes on how to make it. I was overwhelmed as I don’t need to look for more books coz almost have everything I need, I just need to worry for my label and packaging. For now, I’ll make my own essential oils and have my family and friends use it, then once I perfected everything I will definitely start the business. Thank you so much for this book. It will help a lot of aspiring entrepreneurs like me.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1X4BM1GVUUY5S/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #148,994", "Helpfulness": "81%", "Name": "Martina Glaze", "Location": ""}}, {"Date": "on April 19, 2015", "Text": "This was very well written book  about Essential Oils. These oils are the Top natural remedy for countless problems. They Have Been Proven To Help With Weight Loss, Anti-Aging, Healing Aches And Pains, Revitalizing Your Skin, Treating Your Hair, And Sharpening Your Mind. Although They May Seem Easy To Use, You Need The Proper Guide If You Want To Avoid Harmful Side-Effects And Receive All Of The Numerous Benefits Of Essential Oils. This Book Has Exactly What You Need To Change Your Life With Essential Oils. Not Only Will This Book Teach You About Essential Oils, It Will Give You Directions And Even Include The Recipes To Many Of The Problems We All Have!I have learned many things from this book like Essential Oils 101 What They Are And How They Work, How To Use Essential Oils,Using Essential Oils To Treat Your Skin, Essential Oil Recipes For Your Skin,Essential Oil Recipes To Treat Your Body,Essential Oil To Cure Sore Throats, Fevers, Ulcers And More,Essential Oil Recipes To Treat Your Mind,Essential Oil Blends For Stress Relief, Anxiety And Addressing Anger and many more.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3U975CE5R04OG/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "#33,206", "Helpfulness": "88%", "Name": "Ben Hebin", "Location": ""}}, {"Date": "on April 16, 2015", "Text": "Lot of books on essential oils came out, even essential oils for pets.. but this book hooked me, among the many choices to pick from I must say this got my choosy attention... yeah... I love this book because everything I needed and everything I wanted to learn is here. form the basic essential oils, form what they are composed with... on what essential oil you need for certain diseases or sickness, you wont need any other resource because this book already entails everything... i usually uses herbs and combinations of them before when I have to treat some simple ailments but now, essential oils can cure even some complex diseases and those diseases cured can also be found in here... as I told you so this book is complete with the information and detail... a good book to keep for life.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VWNT2LGCTOWK/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #107,398", "Helpfulness": "90%", "Name": "Kendra L. Whiddon", "Location": ""}}, {"Date": "on April 17, 2015", "Text": "I got interested with its title that is why I purchased the book. The book's information is all worth it! The book introduced me to the different essential oils, their functions, and how to use it. I've learned that it is excreted by the human body after the essential oil was able to do its purpose. I've also learned that you need to avoid the bitter almond oil, calamus, pennyroyal, and the camphor. I've used camphor a lot of times. The book showed information that the sample oils I mentioned should be avoided even if its a skin contact because of its toxicity. The book also showed me recipes to treat various skin problems, fever, sinusitis, constipation, varicose veins, sore throat and other problems. I highly recommend this book. Kudos to the author!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4Y1NM0JTYCTX/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "#67,654", "Helpfulness": "94%", "Name": "Kimberly Davis", "Location": "638 Lakewood Pl,  Dover, DE 19904"}}, {"Date": "on April 18, 2015", "Text": "I got fascinated with its heading that is why I bought the book. The book exemplifies the vital oils you can use as a formula, to settle body, shock skin and mind. The book is ample with all you need to know about vital oils and is existence clarified in a full way.  I found it very actual advice on dealing and regulating with a contented lifestyle by essential oils. This book has over 70 essential oils recipes for healthy hair, skin and to treat your body and mind. Truly helpful, the book really covers the topic well. . I really esteemed the book and I really endorse it. I am grateful to the author ... Amy Moore", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVGGCMFJ76G6Q/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #169,491", "Helpfulness": "77%", "Name": "A anas", "Location": ""}}, {"Date": "on April 16, 2015", "Text": "This book is just an awesome piece, just found being drawn to it by the beautiful cover and the dripping oil. The information inside is quite enlightening too. The book illustrates the essential oils you can use as a recipe, to heal body, hair skin and mind. Essentials oils are naturally extracted from different components of a plant. They are high in antibacterial, antifungal, and antiviral properties making them very suitable and healthy for human use. With the various health challenges people face due to use of various oils, I would highly recommend this book to anyone having different health challenges.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ERB8XPMA4J6A/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #146,347", "Helpfulness": "89%", "Name": "Kettie", "Location": ""}}, {"Date": "on April 20, 2015", "Text": "I've read several books on essential oils lately, as I am really wanting to find out more about this concentrated healing source. I found out from Amy Moore, the author that these oils are antibacteria, antifungal and antiviral.can are best used as inhalants or used topically. I tend to have oil skin and I wanted to try to combat this and found what I was looking for in a recipe. She has remedies for sunburn, sinusitis, sore throat, stress relief and even for anger an hair growth.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3V0BVCTO4AU0K/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "#7,589", "Helpfulness": "91%", "Name": "Denniger Bolton", "Location": "mystery writer in Austin, Texas"}}, {"Date": "on April 19, 2015", "Text": "We are all beginners once. This is a friendly list of DOs and DON’T using essential oils. Easy to read guide that will help you get started with essential oils. Benefits, tips and how to apply it are just some of the perks of this book. And as I’ve been learning more about it, the more I can enjoy it’s usage.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3K47HJNRXPWQW/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #375,637", "Helpfulness": "77%", "Name": "Lana Beakin", "Location": ""}}, {"Date": "on April 16, 2015", "Text": "Really informative, the book really covers the topic well. I found a lot of helpful things, like a treatment for eczema. Makes me want to go get some of the other oils I need for some recipes. I was lucky enough to download the book for free but either this is a good book well worth its price.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LH7N80NF82AU/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #323,383", "Helpfulness": "76%", "Name": "Martin", "Location": ""}}, {"Date": "on April 7, 2015", "Text": "A great book about essential oils. The book is complete with everything you need to know about essential oils and is being explained in a detailed manner. I'd definitely try some of the recipes on the book and improve my skincare through it. Amazing book and definitely worth the buy!", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JYA0YSANYQKJ/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "#3,066", "Helpfulness": "89%", "Name": "Richie S", "Location": ""}}, {"Date": "on April 13, 2015", "Text": "Essential oils are naturally sourced and while they have been used for centuries for cosmetic purposes, they have also been used for therapeutic ones; everything from healing open wounds and burns to alleviating muscle pain. Essential Oils for Beginners is a comprehensive guide to employing time-tested essential oil treatments, which scientific research has proven to be as effective as many prescribed medications and cost-prohibitive modern medical treatments. If you are interested in natural substitutes for chemically based cosmetics, home products, and medicines, this book offers a fantastic step-by-step introduction to the versatile world of essential oils. This book is a comprehensive guide to essential oils, covering everything from their historical origins to current uses and proper storage/handling. I was previously unaware of the complex chemical nature of aromatherapy (each oil contains approximately 100 different components), so the information was quite enlightening. This book has the necessary information for the beginner and the experienced as well. I find myself returning to it remind myself of the basics.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14R9PAZ8FXXFL/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "#5,578", "Helpfulness": "88%", "Name": "FIVMendoza", "Location": ""}}, {"Date": "on April 15, 2015", "Text": "Essential Oils. Learn how to heal with essential oil. This is a great Essential oil for beginners guide. Recommended.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CO4MD7X6FZYZ/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "#5,042", "Helpfulness": "92%", "Name": "Mae R. Hunt", "Location": ""}}, {"Date": "on April 27, 2015", "Text": "In short this book talks about all the uses and recipes for various conditions like acne, psoriasis, fever, and varicose veins.  The most important part of this book is the chapter on acne and psoriasis for me because I suffer from those 2 conditions and they actually take a toll on my self esteem.  Essential oils didn't cure them, but reduced it by quite a bit.  The most helpful part of this book is the chapter on anxiety because I also suffer from anxiety.  The remedy is actually a blend of oils, which I love.  I enjoyed that this book was a quick read and easy to implement, which is important to me.--Speed of implementation for books.  I will definitely share this book with my friends in the future when they run into the problems the author listed.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IUOM1GT9Q893/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #354,020", "Helpfulness": "100%", "Name": "Kyle Halston", "Location": ""}}, {"Date": "on April 8, 2015", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BE6VDFZ23MSV/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #185,905", "Helpfulness": "89%", "Name": "Deon Nazworth", "Location": ""}}, {"Date": "on April 6, 2015", "Text": "Seriously, the only oil that I used to know about was olive oil for my dressing. Little did I know that there is a huge variety of oils that are available, and these oils can actually have so many benefits! Amy Moore has published an informative book that introduces beginners to essential oils. Amy talks about how anyone can use essential oil recipes to heal skin problems, such as acne, psoriasis, eczema, and even varicose veins! She also shares how these oils can treat constipation, sinusitis, and a host of other illnesses!", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A48VW5RSCZ2JN/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "#24,855", "Helpfulness": "84%", "Name": "Peter Smith", "Location": "saleman in United Stated"}}, {"Date": "on April 18, 2015", "Text": "This is a very thorough guide to essential oils. This Essential Oils by Amy Moore far surpasses my own expectations, even though I had had the book described to me many times. It is very thorough and extremely well written and well documented. It also tells you about specific ailments and where to look for them. It's to easy to find the things you need and so informative! I wouldn't have got near as much use from my oils without having this book!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15S8XTMNUEZNT/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #236,564", "Helpfulness": "61%", "Name": "Bella White", "Location": ""}}, {"Date": "on April 8, 2015", "Text": "Essential oils are so beneficial to a healthy body. Essential oils are made naturally so they don't have that chemical contents and no side effects. The use of essential oils can give us a soothing feel. The antibacterial, anti fungal, antiviral contents of essential oils add up to its benefit. I like reading book like this.This book teaches us how to properly use essential oils as a massage and for hair care. Good book and very relevant.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7I813OX6968K/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #247,848", "Helpfulness": "74%", "Name": "Nate Pascapala", "Location": ""}}, {"Date": "on April 12, 2015", "Text": "I am fairly novice when it comes to essential oils but I've been pounding away at my keyboard researching the different properties of essential oils for over a month now.This book offers a fantastic step-by-step introduction to the versatile world of essential oils. It goes on to explain how to get them, store them, use them  and what oils are useful for what.Great book for those who are looking to religiously use essential oils.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3V3OSFVJZRJED/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "#14,666", "Helpfulness": "85%", "Name": "toni", "Location": ""}}, {"Date": "on April 7, 2015", "Text": "A nice, short fact-based and solution book for people who prefers natural element than outer products for skin care. I found it very effective guideline on dealing and adjusting with a comfortable lifestyle by essential oils. Loved the author’s detail description on recipes according to specific skin and body. This could be a revolution for you; you can recover from Sore throats, fevers, ulcers  by coping with natural ingredients.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1M40XWKUEOINY/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "100%", "Helpfulness": "100%", "Name": "Edward", "Location": ""}}], "ReviewUrl": "http://www.amazon.com/Essential-Oils-Beginners-Recipes-Included-ebook/product-reviews/B00VGSD886/ref=sr_1_9?s=digital-text&ie=UTF8&qid=1432264827&sr=1-9&keywords=Free+chemistry+books/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": ""}, "OfferPrice": "", "Salesrank": "#82,296", "ListPrice": ""}