{"Category": "in Books (", "Name": ["General Chemistry (Dover Books on Chemistry)"], "Timestamp": "2015-05-21 22:59:24.922720", "itemurl": "http://www.amazon.com/General-Chemistry-Dover-Books/dp/0486656225/ref=sr_1_3?s=books&ie=UTF8&qid=1432263491&sr=1-3&keywords=chemistry+books+paperback", "Reviews": {"MaxNumReviews": 15, "ReviewList": [{"Date": "on December 16, 2001", "Text": "When Linus Pauling was teaching undergraduates at Caltech, he found that none of the existing undergrad texts would serve his purpose.So he decided to write his own. This was in the 1940's. The result, 'General Chemistry', even after more than 50 years, is one of the best introductions to chemistry at the University level that I know of. I discovered this book in my sophomore year and after that I couldn't put it down. If you really read this book thoroughly, you can probably say that you have an excellent grasp of most of the fundamental principles of chemistry. Pauling's masterly style of explaining the essentials without compromising on information is unmatched. The small, simple calculations that he illustrates in each chapter are enlightening. In addition, the book is lavishly illustrated with beautiful figures by Roger Hayward. Pauling has a special knack of bringing out the flavor of seemingly boring but important topics like thermochemistry and ionic equilibrium. If you want one book that will launch your chemical knowledge on the right trajectory, trust me and buy this one. You will be enlightened by it forever.", "Helpfulness": 0.9685863874345549, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36A9HWQ9U1IK4/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "#1,490", "Helpfulness": "91%", "Name": "A. Jogalekar", "Location": "Cambridge, MA USA"}}, {"Date": "on September 23, 2006", "Text": null, "Helpfulness": 0.9652173913043478, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VYU5IAMTJ3R7/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #16,458,082", "Helpfulness": "74%", "Name": "Einsteinian", "Location": "Oregon"}}, {"Date": "on October 3, 1999", "Text": "Even though this is NOT the most up to date and technically correct text out there, it is still the best introduction to general chemistry I've seen which is why I rated it 5 stars (I refuse to dock it points for being old,  unlike other reviews of other books I've seen).  I found a copy at a garage  sale, best four bucks I've spent in a while.  The format of this book is  superb, basing thermodynamics on his discussion of statistical mechanics  and QM-he found it makes learning much more smooth, and I happen to agree.  If someone would get permission to update this book and not much more,  perfect general chem text for a college sequence.  For those who'd like  more physical and mathematical detail, the appendices are chock full of  derivations, integrations and connections to make your heart swoon.  Excellent book.", "Helpfulness": 0.9833333333333333, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on October 14, 2000", "Text": "Linus Pauling's treatise on general chemistry is exciting and interesting.  The book presents very basic but in-depth discussion of chemical phenomena such as thermodynamics and molecular structure.  It is clear, reader-friendly, and easy to read.  It is not meant to be just a textbook but a fun book for evening reading.  No mathematical background is assumed.  I recommend this book for undergraduate students as well as everyone who is interested in reading science but curbed by all the mathematical manipulations.", "Helpfulness": 0.9538461538461539, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ARA52HB238HT/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #1,736,191", "Helpfulness": "86%", "Name": "Matthew M. Yau", "Location": "San Francisco, CA"}}, {"Date": "on May 21, 2004", "Text": null, "Helpfulness": 0.95, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MJMYLRTZ76ZX/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "#669", "Helpfulness": "83%", "Name": "Magellan", "Location": "Retired  in Santa Clara, CA"}}, {"Date": "on November 21, 2005", "Text": "For people who are serious about learning chemistry, this is without a doubt the best general chemistry book available.  The treatment of fundamentals is more rigorous than in standard texts, however it is not more difficult to follow.  Pauling's writing style, and ability to explain concepts clearly, are truly admirable.  The depth and coverage of the book are also very impressive.  While some of the nomenclature has fallen out of fashion, this is a very trivial issue when weighed against the overall quality of the text, and anyone planning a future in chemistry who cannot or will not learn the older conventions along with the new is going to have some trouble down the road anyway.  An update, or new edition would not improve the real substance of this book.  Colorful new general chemistry texts retail for approximately 10-fold the price of this fat little workhorse, and publishers would have you believe they are next to worthless when the newer new edition comes out after 2 years.  It is difficult to justify not buying this book, and if you are serious about learning chemistry, and want to learn in more depth than will be covered in your general chemistry class, then you really need to own this book.", "Helpfulness": 0.9714285714285714, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARFLESOGLXAFD/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #201,008", "Helpfulness": "90%", "Name": "Doc Dave", "Location": "Georgia"}}, {"Date": "on October 3, 2000", "Text": "Although Linus Pauling is a Nobel Prize laureat, his text \"General Chemistry\" can be easily read and understood by the average high school graduate. The text is extremely comprehensive, yet straight forward. For more advanced readers, Pauling has included appendices, such as one on the tetrahedral bond, proving with such simplicity and elegance that the tetrahedral bond is the strongest bond of a four bond system.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21FQQH2WILH5X/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #29,676,336", "Helpfulness": "100%", "Name": "Bernard J  Schlund JR", "Location": "Pinetop Arizona"}}, {"Date": "on April 13, 2008", "Text": "Rooted in both vigor and simplicity, this chemistry text will amaze you. Pauling is very mindful of how the student ought to recieve information and in that he carefully picks the order of topics. Too often people disreguard the importance of the presentation of information. It's a shame because they are being willfully ignorant to techniques that catalyze and promote learning. Our brains are more responsive to associative learning because biologically that's what goes on in neural circuitry. Anyways, it's best I don't spur off into a tangent. Buy this book. It taught me chemistry.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3I2DWNLJ17YZB/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #31,108,901", "Helpfulness": "52%", "Name": "R. Young", "Location": "Houston, TX"}}, {"Date": "on November 25, 2005", "Text": "Just remember when reading resonance that structures don't actually resonate from one Lewis structure to the other. It kinda is confusing. Some sections he sounds like he's saying the compounds resonate and in other sections he says that all valid lewis structures contribute to the overall structure. What I really love about this general chem book is the calculus. Almost no general chem text uses calculus anymore, which I guess is designed to be a gen ed for a non-chem major. Unfortunately it hurts the chem major who will be almost overwhelmed with higher math when p-chem rolls around.", "Helpfulness": 0.95, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZFCGIFL2IMGW/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #1,187,451", "Helpfulness": "94%", "Name": "Marc C.", "Location": "richmond, VA"}}, {"Date": "on May 9, 2006", "Text": "This is by far the best introductory book I have seen so far. It is very concise and thorough. There are no flashy pictures or cool sidenotes with the practical applications of the concepts. But the basic concepts are very well explained with lots of helpful diagrams. Also, the price of the book is very good. Hooray for Dover Publications for publishing this masterpiece as such reasonable price!", "Helpfulness": 0.9444444444444444, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XDCW0894WNNP/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #28,253,023", "Helpfulness": "94%", "Name": "CB", "Location": "Michigan, USA"}}, {"Date": "on May 29, 2010", "Text": "I am a chemistry teacher and a chemist, with a background in physical chemistry. I have had the good fortune of having some world-class chemists as teachers during my education, who's insight and wisdom I have (with much effort) tried to incorporate into my own teaching style, as they have changed my life in very significant ways. I purchased this textbook after reading many positive reviews, leaving me curious to hear the words from the horses mouth. Although I have only read the first few chapters so far, I can say that this is the greatest inorganic chemistry textbook that I have ever read. Pauling does a beautiful job of synthesizing classic and modern physics in developing the theories of what is now known as Quantum Mechanics -- his approach is from that of pure thermodynamics, and masterfully done, I might add. Never condescending, but coming from a very different level of understanding, reading this book is like watching any master artist creating their art before your very eyes -- genius in it's raw, pure, unadulterated form. The best that any intelligent being can do is sit back and watch the artist do his thing -- in awe.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFM7FK7NFEKFZ/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "#11,395", "Helpfulness": "90%", "Name": "Mark D. Schnittman", "Location": "Rocky Point, NY USA"}}, {"Date": "on March 10, 2007", "Text": "This book will never look old. It’s still much more clear than many (college) chemistry books. In my opinion this volume should be suggested as a reference for a general chemistry college course.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANFAZLVY8WKZ/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #28,012,440", "Helpfulness": "100%", "Name": "John Smith", "Location": "Italy"}}, {"Date": "on June 21, 2009", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A808JK3GOUC95/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #1,132,648", "Helpfulness": "54%", "Name": "mjare", "Location": ""}}, {"Date": "on October 16, 2002", "Text": null, "Helpfulness": 0.8235294117647058, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOIBJFRQLX1LK/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "#55,692", "Helpfulness": "92%", "Name": "Jason M. Waskiewicz", "Location": "Bowman, ND USA"}}, {"Date": "on July 14, 2010", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IZWTVAQVJIFE/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #31,290,642", "Helpfulness": "38%", "Name": "Rerevisionist", "Location": "Manchester, England"}}, {"Date": "on April 22, 2010", "Text": "I bought this book several years ago as a resource to complement my work in physics.  At the time I was studying ferromagnetic materials.  Pauling writes so well and with such clarity that I found myself wondering why physics textbooks were so dull and hard to understand by comparison.  I should have written this review years ago so that others in the sciences could have benefited from access to such a wonderful reference book.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11FNDXYXNC9SC/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #122,997", "Helpfulness": "90%", "Name": "W. Clement", "Location": "Los Angeles, CA. USA"}}, {"Date": "on November 1, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKHOCYPYUDV45/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #1,316,714", "Helpfulness": "93%", "Name": "L.S. Chang", "Location": ""}}, {"Date": "on October 25, 2005", "Text": "This book is not only about general chemistry. It's written in a very exciting manner, adding quotes about related topics. So, it's very easy and wonderul to read it. Pauling's nobel prize is perceived along the text.", "Helpfulness": 0.875, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2G3GT8XZ8IX56/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #27,865,998", "Helpfulness": "88%", "Name": "J. Prado", "Location": "Madrid, Spain"}}, {"Date": "on May 9, 2011", "Text": "I am about to start a General Chemistry class at university and was nervous because I have never taken  high school chem.  This book is great! It explains everything clearly, and breaks down hard abstract concepts into clear analogies for us humanists.  The layout is super helpful, too, with key concepts highlighted in green boxes or in bold green script.  The tests throughout the chapters are an excellent way to check be sure that you have learned each new thing, and the answer key helps you understand even better.  I'm so grateful I got this book.  I feel so much more confident now about my ability to solve equations and understand this subject. I'm amazed every time I take one of the tests that I get the answers right.  When I looked at chem books in the past, my eyes glazed over, and I thought I'd never get my head around this topic.  This book is making it all make sense.", "Helpfulness": 0.8333333333333334, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3O1N9T0NQ8RUY/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #1,594,085", "Helpfulness": "83%", "Name": "DJ Fryer", "Location": ""}}, {"Date": "on March 8, 2011", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APH8DPK6LWHNW/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #213,348", "Helpfulness": "72%", "Name": "Glen Clark", "Location": ""}}], "ReviewUrl": "http://www.amazon.com/General-Chemistry-Dover-Books/product-reviews/0486656225/ref=sr_1_3?s=books&ie=UTF8&qid=1432263491&sr=1-3&keywords=chemistry+books+paperback/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": ""}, "OfferPrice": "", "Salesrank": "#82,135", "ListPrice": ""}