{"Category": "in Books (", "Name": ["Chemistry For Dummies"], "Timestamp": "2015-05-21 22:58:15.862841", "itemurl": "http://www.amazon.com/Chemistry-Dummies-John-T-Moore/dp/1118007301/ref=sr_1_1?s=books&ie=UTF8&qid=1432263491&sr=1-1&keywords=chemistry+books+paperback", "Reviews": {"MaxNumReviews": 15, "ReviewList": [{"Date": "on July 20, 2011", "Text": null, "Helpfulness": 0.952755905511811, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13D840K8WD3YF/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #2,169,367", "Helpfulness": "92%", "Name": "Chris N. Goodman", "Location": "Gig Harbor, WA USA"}}, {"Date": "on April 11, 2004", "Text": null, "Helpfulness": 0.9368421052631579, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APHTZ9HHYQ9O/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #26,478,007", "Helpfulness": "92%", "Name": "Bonnie A. Mccue", "Location": "Florida"}}, {"Date": "on December 17, 2011", "Text": "Entering a Chemistry class which is a requirement for my RN degree worried me. I was worried that because I had not taken a chemistry course in high school  my grades would be hindered. This prompted me to check Amazon in search of a solution. I decided to purchase Chemistry for Dummies. It is amazing how just skimming through this book familiarized me enough in Chemistry lingo to understand my class. I highly recommend, \"Chemistry for Dummies\". vaf", "Helpfulness": 0.9473684210526315, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Q2SOA0XO5Y2F/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #2,090,940", "Helpfulness": "95%", "Name": "vaf", "Location": ""}}, {"Date": "on November 18, 2005", "Text": null, "Helpfulness": 0.918918918918919, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JJNSW1XHXX9B/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "#45,068", "Helpfulness": "77%", "Name": "BaPuters", "Location": "Colorado, USA"}}, {"Date": "on September 24, 2003", "Text": null, "Helpfulness": 0.9010989010989011, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A384WUHVHVYJHJ/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #28,062,988", "Helpfulness": "91%", "Name": "sloppy", "Location": "Hartford, CT USA"}}, {"Date": "on July 20, 2006", "Text": "I bought this book as a supplement to my Chemistry 101 textbook.  I was really looking for a more complete explanation of electron configuration, which I didn't find this book to be that helpful with.  Overall, I thought this book helped to reinforce some of the basic concepts, but didn't really have much of an impact on my grade.  I would recommend this book to someone who wants an overview of chemistry before taking the course or to someone who needs to brush up on basic chemistry before taking a more advanced course.  It can also be helpful if you're having trouble with a particular topic.  I did enjoy the supplemental information in the book having to do with chemistry of everyday life.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35FJJK35S8AAF/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #10,558,778", "Helpfulness": "96%", "Name": "K. Lynch", "Location": "South Bend, IN USA"}}, {"Date": "on October 6, 2003", "Text": null, "Helpfulness": 0.9230769230769231, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on March 8, 2006", "Text": "This book is an excellent introduction to chemistry. If all 'for dummies' books are as good as this one, I will certainly buy more of them. I have a background in natural sciences myself (master's degree in mathematics), but I never studied chemistry at the university (or in high school for that matter). Given this background, I was afraid that a 'for dummies' book would be too dumbed down. I was happy to learn that this is not the case. I was surprised at the degree of understanding I got from this book. You actually learn how electrons take part in reactions (valence numbers and all that), and how to do simple calculations. This means that you learn enough theory to predict to a certain extent what will happen in a reaction. In addition there are lots of real life examples, with chapters on organic chemistry, pollution, chemistry in the home, and so on. This book is not meant to replace a university text book of course, but I doubt if you learn more theory than this in a high school course in chemistry. Actually I would think you learn less in a high school course, since I think some of the topics would be difficult for high school students. But of course you learn to do a few experiments in high school, which this book could never teach you (it would probably be irresponsible to try this in self-study book).", "Helpfulness": 0.92, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1X55UPTSLBT2I/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #31,273,042", "Helpfulness": "48%", "Name": "Oivind", "Location": "Norway"}}, {"Date": "on October 8, 2003", "Text": "Chemistry for Dummies, by John T. Moore, is a book that I highly recommend to everyone!  It explains everything about the fundamentals of chemistry in an easy and understandable way.  The book utilizes a variety of techniques that enable the reader to make sense out of the complexities of chemistry.  For example, the pages of the book are loaded with helpful diagrmas, illustrations, examples, and tables that correspond with the text and make the information meaningful. Additionally, the book is organized in an easy-to-follow format.  This book can simply serve as a guide to understanding the basics of chemistry or it can be used as a supplement to school textbooks that are typically confusing.  This book is extremely interesting and has helped me out so much!!", "Helpfulness": 0.9130434782608695, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on June 21, 2006", "Text": "One thing I always enjoyed about the \"for Dummies\" series is the sense of humor and real realism in them. This book does an OK job, and is written by a Professor who understands what students struggle with and tries to make it as simple as possible. But Chemistry is a very complex and vast subject, no one book could contain every aspect of it. This book should be seen as a review or a brush up on chemistry, it by no means covers all the topics you will take in a Inorganic Chemistry class, especially the farther you go into the semester. The fact is most people who will be using this book are those students entering into Inorganic Chemistry, or General Chemistry. I do feel he could devote a few of the chapters to topics that will discussed in most Inorganic chemistry textbooks instead of such things as Organic Chemistry, which is a subject unto itself, air pollution, water pollution, and chemistry in the home for example. All relevant topics, but not really going to help you get a passing grade on a test. This is a supplement to your textbook that I feel is well worth spending a few bucks on and using it to your advantage.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAL2LJNUDV3K8/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #9,209,763", "Helpfulness": "87%", "Name": "Jonathan C. Anthony", "Location": ""}}, {"Date": "on October 2, 2005", "Text": null, "Helpfulness": 0.9333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28WJUJF6D2ULA/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "#7,868", "Helpfulness": "73%", "Name": "Dai-keag-ity", "Location": "In the attic."}}, {"Date": "on July 22, 2011", "Text": "On Monday I found out I had to take a placement test for an advanced chemistry course that Wednesday morning. I have never taken chemistry in my life. The school provided me with a sample test after taking a pass through it, I couldn't answer a single question correctly. In fact, I looked up the principles behind the questions online and then tried again, still getting the wrong answers. After reading reviews I ran out and picked up a copy of Chemistry for Dummies. I spent Tuesday reading and studying for about 9 hours. Some concepts were still difficult after reading the descriptions, but after spending some extra time it started coming together. Anyway, I passed the placement test on Wednesday! There were still questions I didn't know the answers to (especially since I only studied for 1 day) but it was enough to get me by. My only complaint is that the content is a bit light on math and formulas, but the basic concepts are well represented.", "Helpfulness": 0.7948717948717948, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2W6KM91HOF4NL/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #2,343,325", "Helpfulness": "77%", "Name": "LMac", "Location": ""}}, {"Date": "on March 17, 2008", "Text": "As a High Schooler who is taking Honors Chemistry, I bought this book in case I needed help understanding its abstract ideas.  And boy am I glad I did!  I don't know how many times I have referred to this book when struggling with the material covered in class.  With its simple English for \"Dummies\", this book is very well written and really helps me grasp the concepts of Chemistry.  If you are taking this class in the future and a little apprehensive about how well you will do in the world of atoms, isotopes, the periodic table, and more, then do yourself a favor a BUY this book, you won't be sorry!", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1M8P4S3TH7PD2/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #26,201,005", "Helpfulness": "100%", "Name": "booklover71755", "Location": "California"}}, {"Date": "on July 24, 2014", "Text": "I saw a few people comment on here that were not happy with quantum mechanics being in the book, even a high school chemistry teacher said this.  But it appears that today, at least in college level chemistry, they tend to include at least an entire chapter on quantum mechanics in a general chemistry course, which would be why it was covered in the newer edition of this book.  So I give it 5 stars because all topics in the book were covered pretty well and summarized nicely.  If you don't like the quantum mechanics part and don't need to know it for your class, then just don't read that part.  But don't give the author a bad review for \"diverging\" into quantum mechanics because that is the way it is taught today.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38QOTI1BA2S93/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #7,368,836", "Helpfulness": "100%", "Name": "Devin K.", "Location": ""}}, {"Date": "on December 28, 2005", "Text": "I read this book before diving into an undergrad Into to Chemistry class. This book was extremely helpful, by making sense of the textbook I would later use (Timberlake, also highly recommended). I've read many Dummies books, some good, some bad, and this is one of the best.", "Helpfulness": 0.8, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FWZ7GRAQHCEP/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #212,146", "Helpfulness": "85%", "Name": "Douglas Long", "Location": "San Rafael, CA USA"}}, {"Date": "on March 11, 2013", "Text": "Very helpful for intro college chem!  When I just couldn't get something, I turned to this book!  Love it! Highly recommended!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5W35IV37RL8L/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #8,323,663", "Helpfulness": "100%", "Name": "Alison Berlin", "Location": ""}}, {"Date": "on April 14, 2009", "Text": "Obviously when I bought this book I knew nothing at all about chemistry.  And I must say that this book majorly helped me to understand what I had originally assumed was a tough subject to learn.  If you're like I was and feel threatened by chemistry, don't worry about it.  Believe it or not, chemistry is mainly common sense.  Example, if you had two molecules and wanted one of them to hit the other right on a certain spot, you can use a \"catalyst\" which will hold down one of the molecules so that its other side is showing and available to be hit or bonded, etc.  That's a heterogenous catalyst.  Still sound complicated?  If so don't worry because you get a nice slow introduction before that part.  Catalysts aren't even discussed until a third of the way into the book.  There's a lot of common sense to the world and the way it operates on an atomic and subatomic level.  Although I haven't taken any chemistry courses yet, I have faith that just this book alone will give me an edge over the other students in general chemistry as well as organic chemistry.  I'll have to check back then and write a follow-up review, but for now this book is highly recommended.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EDLI3D8MOSUA/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #174,708", "Helpfulness": "68%", "Name": "Feral Puma", "Location": "Northern California, USA"}}, {"Date": "on June 19, 2003", "Text": "This book is very informative and to the point.  The examples and analogies are perfect to the content explained.  The author actually makes it fun to learn chemistry, and makes you want to pursue a future in it (I'm going into Chem. Engineering). Like most books this doesn't put you to sleep with boring facts after facts.  This is recommended to any high school student or beginner of college, and will give you a good head start.", "Helpfulness": 0.7777777777777778, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LRYGAH7JGZUR/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #28,438,279", "Helpfulness": "60%", "Name": "dan125", "Location": "McKees Rocks, PA United States"}}, {"Date": "on July 1, 2011", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XANZ2KYGRRGM/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "#57,442", "Helpfulness": "96%", "Name": "Antriksh Yadav", "Location": "Student in La Jolla, CA"}}, {"Date": "on February 7, 2010", "Text": "I bought this book to help my 10th grade son in Chemistry.  His grade improved from a 68 to 95 in six weeks.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHOSGUV7UB7ZN/ref=cm_cr_pr_pdp?ie=UTF8", "Ranking": "Reviewer ranking: #2,914,770", "Helpfulness": "100%", "Name": "E. Dozier", "Location": "Snellville, GA USA"}}], "ReviewUrl": "http://www.amazon.com/Chemistry-Dummies-John-T-Moore/product-reviews/1118007301/ref=sr_1_1?s=books&ie=UTF8&qid=1432263491&sr=1-1&keywords=chemistry+books+paperback/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": ""}, "OfferPrice": "", "Salesrank": "#11,584", "ListPrice": ""}