{
    "Category": "in Books (",
    "ListPrice": "$19.95",
    "Name": [
        "Quantum Theology: Spiritual Implications of the New Physics"
    ],
    "OfferPrice": "$16.86",
    "Reviews": {
        "AverageStarRating": "3.5 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32MO2KZ2BQTKU"
                },
                "Date": "on November 13, 1998",
                "Helpfulness": 0.875,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AE918AI4JQZTH"
                },
                "Date": "on May 20, 2010",
                "Helpfulness": 0.8095238095238095,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AREIVFBPWMKD9"
                },
                "Date": "on August 2, 1999",
                "Helpfulness": 0.7547169811320755,
                "StarRating": "1",
                "Text": "O'Murchu claims to have reached a synthesis of religion and science, including the \"new physics\" of quantum mechanics (hence the title).  This is an interesting idea, but the author of a book such as this  needs to have background in both physics and theology, and O'Murchu has  little to say about classical theology and no knowledge of any kind of  science.  The list of scientists he has consulted is impressive (including  David Bohm, Stephen Hawking, and Paul Davies), but it would appear that he  threw out everything they told him; the book is filled with misinformation  and outright lies about quantum mechanics.  Beyond this, O'Murchu  constantly invokes \"energy fields\" and \"forces\" all of  which are undocumented in science but factor heavily in New Age type  beliefs.  In short, O'Murchu has no idea what he is talking about, and his  writing makes for a nonsensical book that is filled with non-sequiturs and  poorly explained reasoning."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOH0AYHFRW9ZF"
                },
                "Date": "on April 5, 2000",
                "Helpfulness": 0.76,
                "StarRating": "1",
                "Text": "Having read perhaps sixty or seventy books concerning quantum phenomena, I was eager to enlarge my horizons with this one.  Now that I have read it twice, I am still searching for some indication that the author has found a  connection between theology (I grant him expertise in this) and quantum  anything.  In fact, though it is merely implicit, he makes the naive error  of considering the quantum as something large, when semi-informed lay  readers know that the quantum is the smallest measurable amount of energy.  thebigo@gte.net"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IDYP6AMVRAK"
                },
                "Date": "on March 23, 2001",
                "Helpfulness": 0.7419354838709677,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A197A9NHS6AT1H"
                },
                "Date": "on September 7, 2007",
                "Helpfulness": 0.7647058823529411,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZHFJA6VO3F17"
                },
                "Date": "on February 21, 2006",
                "Helpfulness": 0.7272727272727273,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXXHV2NOZDDJ2"
                },
                "Date": "on April 25, 2000",
                "Helpfulness": 0.6976744186046512,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EC1IG3LOB0NF"
                },
                "Date": "on January 27, 2001",
                "Helpfulness": 0.696969696969697,
                "StarRating": "2",
                "Text": "I thought may be I found a book that would explain to me the relations between the Quantum Physics and Religion. As the Physical determinism is gone how do we content with Quantum indeterminism and relate it with old fashioned Religion. Author talks about a lot of things in the first half of the book and I had difficulty in relating one to other and all to Quantum Physics. The only concept that I could pick in the pages regarding the Quantum Theory was \"influence at distance\", therefore all universe is interrelated and God is part of it. I am not even sure if I took it correctly. Certainly to me author did not have much conviction in Christianity or Islam as common peaople knows it. There are a lot of references and a lot of new subjects. It does not speak of Quantum Physics, it does not speak of Religion or Theology as I know it, he seem to define a \"Quantum Theologian\" as he goes along who looks at the nature as the whole, God and Nature. At the end of the book, in Appendix, finally author defines the \"Quantum Theology\" with 12 rules that are also expanded with some basic conclusions. It was difficult to read these conclusions in the text itself. May be the book is highly Philosophical and difficult for all to read. Rule #1 clearly defines God as energy and part of nature,Rule #10 says there is no beginning and no end to this world. This book was not for me, I think it is a misnamed book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DVZ92OSMPX6A"
                },
                "Date": "on July 27, 1999",
                "Helpfulness": 0.6944444444444444,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YBRVR2JDMFKN"
                },
                "Date": "on November 13, 2001",
                "Helpfulness": 0.7058823529411765,
                "StarRating": "5",
                "Text": "Quantum theology has been the perfect book for where I'm at spiritually right now.  Much of what O'Murchu says resonates with me in a very deep way.  Having ended my tumultuous love affair with traditional Chrisitianity some time ago, Quantum Theology affirms my sense that I can still have faith, hope, and divine experience in daily life.  I recommend this book highly."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2R2UOSOE3YL32"
                },
                "Date": "on January 21, 1998",
                "Helpfulness": 0.6896551724137931,
                "StarRating": "5",
                "Text": "If there is one book that will expand your definition of God, it is this one.  The author manages to breathe new life into Christian theology, no easy task in these days of stultified dogma and mindless tradition, using the findings of quantum physics to express a new, and far more empowering and life-affirming, perspective on the fundamentals of Christianity.  It is not just Christians who will profit from reading this book.  Anybody who has even the vaguest interest in things spiritual will find something, some concept or idea, that resonates with their current beliefs hopefully showing that whatever we hold to be true, we are all partly right.  After all, all religions and beliefs are simply different paths up the same mountain and Quantum Theology describes that mountain like no other book I have read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASOJRFZ5MQF0F"
                },
                "Date": "on May 7, 2014",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "Our book club chose this selection and we took about 7 weeks to discuss it slowly and in depth. It is not an easy read.. However for those interested in one of the cutting edge books on this topic, it is a good choice. Our entire book group felt glad we chose to \"do\" this book together. I cannot fathom reading it alone. The  3 stars are for my response and do not reflect anything negative about the author or the book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2X12XGUC2NY7"
                },
                "Date": "on June 22, 2013",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "This book, in many ways, has changed my life.  It has refined my understanding of Theology & Cosmology.  It has affected the way I think about everything!  I keep re-reading it to strengthen my appreciation of all things."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37KBCWVVX2P74"
                },
                "Date": "on June 6, 2001",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "1",
                "Text": "This book is based on very healthy premises I think and the Table of Contents looks great ! What the author does with it though is very confusing. I have not found one chapter that was fully developped or even well understood. Even the chapter on mystics is I think quite poor and/or assumes you know everything about the subject. I think the book too ambitious and the author not clearly knowing where he wanted to take the reader. Very disappointing if you already have some insight on the subjects tackled."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAAX7GJHE56RI"
                },
                "Date": "on January 16, 2005",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GO19IO365TTD"
                },
                "Date": "on March 29, 2011",
                "Helpfulness": 0.6,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AD71YN0O07VQC"
                },
                "Date": "on May 13, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11TU4QTR1QJ3R"
                },
                "Date": "on May 18, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Amazing - very deep - will require very careful reading and re-reading to fully comprehend the messages."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A287ZN8L5QYVCO"
                },
                "Date": "on July 13, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "As a scientist and theologian It was a must read for me. Excellent Challenge."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2M9DSXPBCNIUU"
                },
                "Date": "on December 14, 2012",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": "I found it interesting in many ways but it seemed not avoid being preachy and seemed to draw conclusions not warranted. I have been mind boggled as an amateur reader of quantum cosmology, but recommend care in taking liberties with the mysteries it hints at."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATTAC3H0NK2FW"
                },
                "Date": "on September 3, 2009",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "I was so captivated by this book, that I not only have read it through three times, but have ordered copies for my friends.  It opens the mind to unlimited creativity of the universe and its creator."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GAD4WTV5FQ3W"
                },
                "Date": "on November 9, 2006",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2I9V51DUXAD60"
                },
                "Date": "on July 30, 2008",
                "Helpfulness": 0.25,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZOYSEWK8PMK9"
                },
                "Date": "on May 27, 2013",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "Bought this as a surprise for my very smart nephew, but it looked too dirty to give. Haven't had much time to read it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VLVM8HA9LQE8"
                },
                "Date": "on August 8, 2005",
                "Helpfulness": 0.4666666666666667,
                "StarRating": "4",
                "Text": "\"Oddly enough O'Murchu ignores Alcoholics Anonymous which has had the greatest success by far in getting people to abstain from drink mainly by entering into a spiritual life much like the one he seems to be advocating.\"  [...] erroneously states this.  On Page 195 of the 1998 printed version, it clearly states ... \"Practically every approach to the treatment of additions invokes, in one form or another, the twelve steps of Alcoholics Anonymous (A.A.).  Central to this vision is an acknowledgment that we, individually, are no longer in contgrol, and that wae are not ultimately responsible fr what we are or do.  We learn, often slowly and painfully, to accept a 'power' higher than ourselves, within whose love and energy we are not absorbed or consumed, but rediscover anew our true selves, as people born with the capacity to love and to be loved.  It is in this rediscovery of love that we recapture something of our true nature.  We come home to ourselves.\""
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QVFNB1IUFURN"
                },
                "Date": "on October 2, 2008",
                "Helpfulness": 0.25,
                "StarRating": "2",
                "Text": "An interesting topic, but a difficult read.  Author seems to go around in circles"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on April 28, 1999",
                "Helpfulness": 0.4666666666666667,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2T7TBJM0ETP2M"
                },
                "Date": "on July 29, 2003",
                "Helpfulness": 0.35714285714285715,
                "StarRating": "4",
                "Text": "Like so many I know everything is in transition. The book gave me something to consider, of course he puts alot of political correct spins on it, feminism, anti industrial ya, ya, stuff. But the book does offer food for thought and I will look forward to viewing some more of his work in the near future."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on December 20, 1998",
                "Helpfulness": 0.35714285714285715,
                "StarRating": "5",
                "Text": "I like to quote what David stated in his Psalms- \"Today if you hear the Lord's voice,harden not your heart.\" Diarmuid could be that Voice-in today's wildernes-to create a new global theology of oneness. Let  us take up his invitation and usher a new era."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DYT87L84OVSS"
                },
                "Date": "on February 18, 1998",
                "Helpfulness": 0.2727272727272727,
                "StarRating": "4",
                "Text": "The author describes a new era in spirituality that is currently developing. He gathers scientific and theological evidence that suggests a post denominational age for religions and faith  traditions. This is a profound work that will enable believers to journey into the next century with a wholistic vision of the Divinity, Revelation, and Creation. I hope others who are interested in this topic/movement will contact me."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JTFK5TJ5ON4Z"
                },
                "Date": "on August 25, 2010",
                "Helpfulness": 0.125,
                "StarRating": "1",
                "Text": "The book was advertised as brand new, but it had pencil markings and words written in the margin in one of the chapters.  Very disappointed.  Also took a long time to receive.  Didn't want to send it back because I'd waited so long and had to return library copy, transfer paragraph tags, etc."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Quantum-Theology-Spiritual-Implications-Physics/product-reviews/082452263X/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "32"
    },
    "Salesrank": "#485,454",
    "Timestamp": "2015-05-24 13:07:38.942823",
    "itemurl": "http://www.amazon.com/Quantum-Theology-Spiritual-Implications-Physics/dp/082452263X"
}
