{
    "Category": "in Books (",
    "ListPrice": "$18.95",
    "Name": [
        "Black Holes and Time Warps: Einstein's Outrageous Legacy (Commonwealth Fund Book Program)"
    ],
    "OfferPrice": "$11.29",
    "Reviews": {
        "AverageStarRating": "4.7 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WB7712KRT758"
                },
                "Date": "on March 19, 2000",
                "Helpfulness": 0.9354838709677419,
                "StarRating": "5",
                "Text": "I thought not. I was wrong. The reason: Kip Thorne. I really enjoyed the reading of this book because it offers the theoretical face of the so-called \"Black Holes Mechanics\" and a very important and delightful part,  the history behind the theorems. The book begins with several chapters  dedicated almost exclusively to the bases of the Special Theory of  Relativity and the General Theory of Relativity, which describes the  gravitation field in almost any place of our universe (if you get the book  you will see why I say \"almost\"). Thereafter, the text covers the most  important aspects of stellar implosion, which, in fact, brings Black Holes  into existence. Once you are immersed in the very topic of the holes, the  author studied profoundly their properties with informative boxes,  spacetime diagrams, lots of references about discoveries, people and, the  great difference with others books, an outstanding and thorough historical  background. By the end, the author presents the most excitement predictions  about the future use of Black Holes and the yet ill-understood Quantum  Gravity Theory (predictions like backward time travel and wormholes).  Finally, Kip Thorne closed the book with an excellent glossary of exotic  terms and a list of principal characters that appeared throughout the text.  I can say, without any doubt, that this is one of the most illustrative and  complete books I have ever read, and in my opinion, is a book that every  \"Black Hole serious student\" might have in his/her shelve. If you are  looking for a less technical book, I suggest you \"Black Holes: A Traveler's  Guide\" by Clifford Pickover. Nevertheless, if you want a higher challenge,  get the book \"Gravitation\" by Thorne, Wheeler and Misner."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUIPB4Y8XT2YU"
                },
                "Date": "on May 23, 2001",
                "Helpfulness": 0.967741935483871,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2B9Y0WXNSN17U"
                },
                "Date": "on February 10, 2002",
                "Helpfulness": 0.8666666666666667,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVXKXKID66M7C"
                },
                "Date": "on June 9, 2000",
                "Helpfulness": 0.9090909090909091,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1G3HFW2SEE721"
                },
                "Date": "on January 17, 2001",
                "Helpfulness": 0.9047619047619048,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 23, 1999",
                "Helpfulness": 0.875,
                "StarRating": "5",
                "Text": "When I first received the book, I said to myself, \"Whoa, 619 pages! It'll take me a while to read this!\"...I honestly could not put the  book down!  Overall, it took me about a week to finish the book.  Every  page had something interesting on it!  Thorne even threw in some neat  equations, which were easy enough for a 15-year-old high-school genius to  figure out.  I would highly recommend this book to anyone who wants to be  blasted with information about our universe...and others!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A373ZCB1AYOZC"
                },
                "Date": "on October 19, 2002",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EXV0ZGV2G2N8"
                },
                "Date": "on November 25, 2001",
                "Helpfulness": 0.8666666666666667,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31T7AQEJ4TL6L"
                },
                "Date": "on April 29, 2003",
                "Helpfulness": 0.9,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A382FWQJ4BBPHQ"
                },
                "Date": "on July 25, 2005",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12UDTK3RE0O6L"
                },
                "Date": "on January 25, 2002",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1F7SX3GNVBNE3"
                },
                "Date": "on May 2, 2009",
                "Helpfulness": 0.875,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on November 22, 1998",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I'm just a high school kid who likes astromomy and math.  I bought this book by pure chance, i was looking for a book that would be interseting and was long (i had a lot of spare time), it was both.  It was written so the  average smart guy could understand all of the concepts and be able to  explain them.  This book also has great pictures that go in depth on the  ideas.  This was a fantasic book!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19KUAJCTY8MXT"
                },
                "Date": "on April 28, 1999",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book is definitely a one size fits all physics journey.  It let me get as technical as I wanted to and it will let everyone walk away with a much fuller understanding of this magnificent multi-faceted topic. Also,  there are numerous illustrations that help make the text hit home.  I would  recommend this book to anyone who has an interest in the universe and what  makes it tick.  Fabulous!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A75NDUQM2H3L6"
                },
                "Date": "on December 31, 1999",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PKF6UP4BCBQB"
                },
                "Date": "on December 24, 2004",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AS6EPVW1IRRP5"
                },
                "Date": "on March 27, 2005",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27ZH1AQORJ1L"
                },
                "Date": "on September 19, 2003",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on April 25, 1999",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "They don't get much better than this! A great introduction to black holes for the non-scientist, and for the more advanced reader, great background reading on the scientists who shaped what we know about black holes"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SHJF7U07CD4C"
                },
                "Date": "on April 1, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IO7MPX2U52HX"
                },
                "Date": "on June 5, 2002",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TZPRIVAK2C1P"
                },
                "Date": "on October 14, 2003",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 5, 1997",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CWKF5ITOLL30"
                },
                "Date": "on April 6, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1H7Y5XKPGT0OS"
                },
                "Date": "on April 15, 2004",
                "Helpfulness": 0.7777777777777778,
                "StarRating": "5",
                "Text": "Kip Thorne is an eccentric author who reveals scientific enterprise of quantum gravity and black holes research in a simple language. This book is rich in history, and classical (Newtonian physics and theory of relativity) and modern physics (quantum mechanics) are presented in non mathematical form. We get rare first hand insights of scientific styles and temperament, and his personal involvement in various aspects of black holes research and his interaction with scientists all over the world especially those from former Soviet Union and the impact of communism on black hole research. The first part of the book describes theory of relativity, concept of spacetime fabric of the universe and curvature of spacetime in presence of matter (stars, galaxies, etc.) to generate gravity. The author gives us a good historical background to build his case for black hole concept. Theory of relativity predicts the existence of black holes but Einstein refused to accept it and so is Arthur Eddington another leading exponent of theory of relativity. The idea of black holes remained in academic obscurity among few who believed in it and it progressively became clear that dying giant stars undergo implosions in which nuclear force the strongest of all four forces of cosmos buckles under gravitational force creating a blackholes. Black holes have been discovered in the center of dying giant stars and in centers of galaxies, and efforts are underway to detect the black hole gravitational waves carried to earth from distant parts of the universe and to seek the secret of what is inside a black hole: a route to another universe? The author warps up the second part by discussing the possibility of constructing wormholes with exotic matter (tunnels in space connecting two widely separated locations in the universe) through hyperspace for interstellar travel and back to the future. He is one of the leaders in proposing interstellar travel. Physicists and academics are too conservative to get involved in space travel research as it is traditionally linked to science fiction and Star Trek junkies. The author can mesmerize the reader with his incredible knowledge and ease with which he can communicate to the reader; at the same time he is eccentric enough to work in one of his laboratory (Palomar Mountains) nude and draw criticisms from peers. He is also crazy enough to take bet with peers for things such as Penthouse magazine and annoy his wife and family with Mormon heritage. This book is free of marketing strategies of the publisher as the author shares his knowledge with the reader to his best of abilities to make everyone understands it even by offering few simple calculations and formulas. Do not be discouraged by the size of the book (619 pages). The text flows well and it is deeply engrossing. Anyone interested in black hole and space travel must have this book."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 26, 2001",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "WOW! A lot has changed in physics since I was in high school (1961).  I wanted to catch up on some of these changes, and no one could have written a better book for me than this book from Kip Thorne.  He has the rare ability to write about complex issues in physics for a layperson.  Even without a small background in the subject, this would have been an excellent read, not at all difficult.  It was both easy and fun."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 6, 1999",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Black holes are perhaps the most exotic objects in the universe--objects from which not even light can escape.  With over 600 pages, Kip Thorne's BLACK HOLES & TIME WARPS is the best book on the subject--clear,  entertaining, substantial, and informative.  He does for black holes what  Ken Croswell's PLANET QUEST does for extrasolar planets.  If you have any  curiosity about the subject, this is THE book to get."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FQ20MGVCDLQI"
                },
                "Date": "on September 8, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UTKYA2U8542F"
                },
                "Date": "on June 11, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BM1A2FI2RH72"
                },
                "Date": "on December 22, 2001",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RFXU3P0XKKF4"
                },
                "Date": "on June 28, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1S9ZFNUU3BJB5"
                },
                "Date": "on October 12, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BIVXJRYAJ6CJ"
                },
                "Date": "on July 14, 2001",
                "Helpfulness": 0.7777777777777778,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on January 8, 1997",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35H0XIWPU4Y39"
                },
                "Date": "on July 9, 2000",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "If you are interested in not only the modern accumulated knowledge about  black holes, time warps, etc.., but also the history of science discoveries  in those fields, this book is superb. It throughly develops the current  understanding of black holes, in particular, adn does so by citing what  seems to be almost every researcher who worked on the projects that made  discoveries into black holes. At points, Thorne seems to be writing more  about the atmosphere f the time of a particular discover than the  consequences of that discovery. However, if the history of current theories  interests you, this 500 page book provides that history. Personally, I  found the parts about theory well written, but tired when reading a long  section about the history of the theory. Overall, I would recommend this  book, but with the reservation that if you dislike history, there are more  concise books for you."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AE68I04K30VHS"
                },
                "Date": "on March 17, 2005",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QP7JR0B39SJZ"
                },
                "Date": "on April 20, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book contains so much information on the wonders of our universe including everything mentioned by Stephen Hawking in \"A Brief History of Time\" plus so much more. He expounds in depth on black holes, what  they're made of, how they're created, and how they may be of use to us. Kip  Thorne shows an incredible amount of hard work as he accurately gives dates  and proper names of physicists all the while teaching, not merely reciting,  to the reader how black holes function. Kip even goes farther than most  physicists in his book by explaining the possibilites of using wormholes as  time machines. He leaves nothing out in this great book, and makes it easy  to understand for the average person (atleast most of it..)"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 18, 1998",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Kip Thorne wrote a magnificent book. Though I work on this area I learned quite a bit. Particularly outstanding is the description of how the whole thing of Hawking radiation was born, starting from the ideas of the great, ebullient russian physicist Zel'dovich. The analogy Zeldovich found between electromagnetic waves emitted from a conducting rotating sphere and the waves (which should be ) emitted by a rotating black hole is so aptly dercribed taht I had to stop reading to try my hand on its consequences. I told about this  to a former student of mine, then at Brown University, and he eventually produced a paper based on it!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1C76OF2971G2D"
                },
                "Date": "on January 6, 2001",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book is simply the best I've ever read.Thorne uses simple  explanations about the nature of black holes.He introduces you into the history about the discovery and search for black holes.Sometimes he even focuses on experiences he had, researching the concepts of black holes.The first chapters are kind of history but then they get really better, until he gets to the last chapter, which I think was the best. Talking about time machines , Thorne gives all of what he has , and believe me he knows more that what you could imagine."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 2, 2001",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on December 29, 1995",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31K884TAZTUHE"
                },
                "Date": "on August 11, 2002",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 28, 1999",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Kip Thorne's book is fantastic! It progresses from Einstein's start to the fundamental concepts of the subject we know today. The seperation of certain topics to boxes, to elaberate on the explanation, works very well.  If you read this book, and like it, then read Stephen Hawking's \"A  Brief History of Time\". This is also a great book"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A333CZMKKOQLXA"
                },
                "Date": "on March 16, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is a great book on its subject. It somehow gets across the key ideas of black holes and general relativity while showing a glimpse of the intricate mathematics behind the scenes. I wish I understood the details  well enough to go where the notes point to, but this book does a great job  of guiding me through the shallow waters."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AW07SB2RZ7GNK"
                },
                "Date": "on February 14, 2000",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": "It is really amazing.....I really liked the presentation in which, the author presents the historical facts first then the Physics....I think that this book allows you to have a deeper understanding of physics and  expecially black hole formation and evaporation!  Besides the amount of  information in this book is phenomenal, it is a reference for persons  interested in physics and would like to learn more details."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SRG05KBH1AT3"
                },
                "Date": "on August 24, 2003",
                "Helpfulness": 0.6855670103092784,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on April 29, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "You can't consider yourself truly educated if you don't have at least a basic understanding of the topics covered in this book.  Thorne makes what might otherwise be a difficult subject both accessible and enjoyable  through clear explantions and common-sense examples.  A wothwhile book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RBGEV4IHL1XM"
                },
                "Date": "on October 19, 2008",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGF4FSEIT1GNP"
                },
                "Date": "on January 3, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A239ESBBZ7HA6K"
                },
                "Date": "on April 2, 2001",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3I1J1K5Y8Q7PY"
                },
                "Date": "on April 2, 2008",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "I didn't understand a lot of this book. The physics was largely beyond me and I could not grasp the embedded diagrams that Kip Thorne used. These embedded diagrams attempt to represent three-dimensional space-time on a two-dimensional piece of paper. But I enjoyed reading the book nonetheless. One can look at science in two (or perhaps more) ways; the process and the results. I am interested in process, the building of one idea upon another. And Thorne does this particularly well. I am not a big fan of the results which is a good thing because I didn't really understand them, at least in this book. Thorne also included a lot of biographical information which I found very interesting. Thorne also admitted when he had made mistakes, which was refreshing; a nice human element. The most interesting parts of the book were when he compared the different styles of the various research teams. This is especially true when he compared first the American/British research style with the Russian research style and later in the book, the American, British, and French styles and their differing use of mathematics. Overall, this book was a good read, but by the end I was anxious to finish so that I could start reading Leon Lederman's new offering."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XFXQRSBY17FV"
                },
                "Date": "on August 11, 2011",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GHSD9VY8XS4Q"
                },
                "Date": "on January 21, 2004",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2V8F0RILFIZG2"
                },
                "Date": "on January 10, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is the story of the some most exciting scientific developments to date, spanning the entire twentieth century, as delightfully told by one of its main actors. Without the least condescension, the author takes great pains to make difficult technical concepts (almost) accessible to the lay reader. He clearly works on the assumption that the reader is intelligent and curious, though not necessarily knowledgeable in physics or mathematics. (It is probably not a coincidence that Kip Thorne is the Richard Feynman Professor of Physics at Caltech!) Furthermore, being very much on the \"inside,\" Thorne succeeds in telling a very human story about the amazing characters involved in the search, thus giving lots of insights into the way science is practiced around the world. The end of the story will probably be revealed sometime in the twenty-first century when, in the words of John Archibald Wheeler, the theories of General Relativity and Quantum Mechanics \"consume their fiery marriage.\" Thanks, Kip -- I can't wait for the sequel ..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8T4X9WAUZ0RH"
                },
                "Date": "on March 6, 2001",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "The title of my review is cribbed from a translation of Aristotle (the POETICS, I believe). It occurred to me simply because I am nearing the end of this fine, fine book and -- even after more than 500 pages -- am wishing that it could go on forever. Thorne is a *very* talented writer: I am astonished at the things he pulls off in this book. It succeeds as personal memoir, as history of 20th century physics, as exploration of the difference between U.S. and [then] Soviet approaches to science, as well-grounded speculation, as explication of the scientific method, as portrait gallery ... aaahh, I could go on forever, myself, but who would read it? There are dozens of other reviews of -Black Holes and Time Warps ... save your time and buy the book! You will not regret it. Oh: and the interplay between Thorne's text and the illustrations by Matt Zimet are exemplary."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DBXZY8JN2VEX"
                },
                "Date": "on April 24, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A111P7M1OK8FXO"
                },
                "Date": "on November 29, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Although a bit dated now, this book is a fascinating explanation of the history of black holes.  It is very accessible to readers not trained in advanced physics.  The author's writing style is engaging throughout and the book is full of anecdotes about the physicists who contributed to our understanding of black holes.  The author explains relativity, warped space-time, gravitation, singularities, how black holes are formed, and how they may evaporate.  The final chapter is a diversion about the possibility of wormholes and time machines, with a interesting connection to Carl Sagan's book Contact (which was made into a wonderful movie by the same name)."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 10, 2004",
                "Helpfulness": 0.75,
                "StarRating": "4",
                "Text": "Black holes & time warps is great, it explains things thoroughly. And without complex mathematical equations that are inherent in many books that discuss the same subject. I'm not so great on calculus so this is easier on me. Nearly everything was good, but the reason I gave it only four stars is due to the fact that they include too much history you have to read for pages and pages before they actually discuss the topic of the chapter. The first couple of pages are about how a research group got started or who was using the bathroom when something important happened. And it's loaded with personal history that I don't want to know about. Although if like the historical parts then this is your dream book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YGFS36G0NNU0"
                },
                "Date": "on December 7, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALTBXKW53OO7D"
                },
                "Date": "on January 4, 1998",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is a surprisingly good book for someone interested in the complex world of general relativity, without having to understand the detailed math behind the scenes. Kip Thorne provides small boxes in the text body, to explain in plain english the physical intuition and ideas, and to extend the understanding of complex experiments.  A realy good bet if you are curious about modern astrophysics but do not remember the technical tools or if you do not have time do brush the tools up. Highly recomended."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2838EYP1FYK3U"
                },
                "Date": "on May 14, 2003",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "This book basically is quite simple in structure and features no hard core mathematical concepts of any sort. Thorne created the book so that even the most ambiguous of concepts concerning the esoteric field of physics can be understood by almost anyone. As a high school student I highly recommend this book to those who have plenty of time to spare and love to delve into the history relativistic theory and it's presumptions in our 4 dimension universe. All in all it's worth your money and it's non condescending."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FDEI8O1SU0EI"
                },
                "Date": "on February 15, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Kip S. Thorne explains Einstein's Theory of Relativity well.  I have always been interested in time and space, and black holes, and anything that had to do with the universe and space.  Thanks to this book my understanding of some theories has increased.  I learned more about Enstein's quirks and devotion to the pursuit of scientific knowledge.  A fascinating book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2H0T0PY5IMEFX"
                },
                "Date": "on September 25, 1998",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "A great book for understanding the theories that are driving physics  today.  The history lessions are invaluable and allow the reader to  understand how modern physics evolved.  The authors style is easy to read  and his ability to explain the most complex concepts makes reading  enjoyable.  I highly recomend this book for anyone with an interest in  physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GQEGYO0D4OA6"
                },
                "Date": "on July 24, 1998",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "What a book. I am not a keen book reader but this one in particular captivated my mind and time! Some time ago there was a documentary on the British television which, I think, it was partly based on the book. It even featured Kip Thorne and had an animated space voyage similar to the one described in his prologue."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2M7HTUSPIS2CD"
                },
                "Date": "on June 27, 2001",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I finished reading this book today. It is not only written in a clear and understandable way, it is also very amusing! It contains all the details on how black holes were discovered and leaves a final chapter for speculation on wormholes. Fantastic reading!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BYCL8JOX0AME"
                },
                "Date": "on June 13, 2010",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MQ6WLQFZXMP8"
                },
                "Date": "on November 2, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Very well written and easy to read book.  It was used in our Black Holes Astronomy class at Virginia Tech. It covered many topics in a way that made difficult concepts easier to understand."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TL9FGSMTSQXP"
                },
                "Date": "on November 4, 2003",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "As I have with \"Stephen Hawking's Universe\" by John Boslough, I've read this book a number of times.  The beginning pages of Kip Thorne's book give a hypothetical situation of a space traveler caught in the unapologetic and unforgiving throes of a tortuous black hole.  Kip Thorne then goes into tremendous detail and great length about black holes including much history about legendary and not-so-well-known scientists and their contributions to black hole-type theories.  This book effectively combines science history with science fact.  While the book, at times, seems rather \"heavy\", a few re-reads of certain parts makes the information more easily digestible.  This book is not generally an easy read, but it is a fascinating journey through the history of cosmological science.  This book is, without doubt, one of the best (non-fiction) books I've ever read on any topic.  Kip Thorne is an exceptional writer and, from what I can gather from this book, an exceptional scientist as well.  This book laid a lot of the foundation work for my research into black holes in preparation for the writing of my science fiction novel \"Temporal Armageddon\"."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KQQ743HOY263"
                },
                "Date": "on August 21, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book is very easy to read and has a lot of interesting history.  I have enjoyed reading it and highly recommend it for black holes enthusiasts and novices alike."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KES5UP72CYCO"
                },
                "Date": "on July 19, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8OATGDIENBNC"
                },
                "Date": "on January 18, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Dr. Thorne is intelligible, conversational and enlightening.  He discusses an area that is of interest and many topics that touch on it.  He engages in some Science Fiction fancy, but only by way of a form of preface to his serious talk.  While this section is not a strength of the work, it gets its points across for the uninitiated in a reasonable manner avoiding the more flighty manner taken up by Michio Kaku in a recent reading of his Hyperspace.  There is interesting history in a memoir fashion in a good deal of the recent events and in a more distant narrative from earlier periods.  All is engrossing and paced as lively as I could imagine the material can be so presented.  I can imagine that some may have difficulty understanding a few of the concepts, but they have been presented about as simply as I believe it to be feasible."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3C3P1H56NROV0"
                },
                "Date": "on August 31, 2000",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "4",
                "Text": "This book is a great book for anyone interested in learning more about  black holes and other anomolies.  It's extensive in its explanations  regarding the more unknown areas of physics and astrophysics, however, it  might be a bit too in-depth for the average reader.  I wouldn't suggest  this book unless you either know a bit about physics already OR if you are  like me, extremely fascinated by these types of things (black holes, time  travel, worm holes, etc.)  Otherwise, be prepared for a wild ride and a  wonderful opening by Hawking who is amazingly gifted at presenting material  in a way that anyone can understand."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GB4WEW3WWEAR"
                },
                "Date": "on July 19, 2010",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A67ND41TYPKIE"
                },
                "Date": "on December 14, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3092KMZGWE1Q8"
                },
                "Date": "on February 1, 2003",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "Kip Thorne has done a magnificent job in explaining in great detail how the universe works. Mr. Thorne actually takes you into the minds and thought processes of the scientists who made the great discoveries of our time. His book is clear, thorough and excting. Unlike other books of the same subject that are like two astrophysists talking to each other, Mr. Thorne has given the layman the tools to understand physical science from the smallest of sub-atomic partilles to objects many light years in diameter. I highly recommend this book for everyone who is interested in the subject."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 1, 1998",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I have read other books on theoretical physics, and while most of them have been great, this one is truly a superior piece of literary work.  A detailed history on the development of our knowledge of black holes that gives the reader great insight to the logic behind black holes.  As of this time I have not yet reached the chapter on time travel and worm holes, though I am extremely enthusiastic about it.  If you are interested in mysterious black holes and associated theoretical physics, then you absolutely must read this book. The previous statement is an absolute.  Purchase this book.  Read this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8HPMCK5OY8G6"
                },
                "Date": "on May 21, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book is written by a very well known expert in general relativity and black holes area. Very recently, Professor Thorne provided the necessary expertise into the realization of Interstellar Film where the scientific content has been made compatible with what is actually known about cosmology and black holes. He wrote also an excellent dedicated book focused on the film content (2014). Anyway, the \"Black Holes and Time...\" book is very interesting and it does not require deep knowledge in theoritical physics to understand fully its content."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on September 18, 1996",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Boldly go where no man has gone before...  You thought the black hole was just some hole in the universe...  you thought time travel is a bunch of bull...  well you thought wrong!  Kip Thorne, in this book, explains things so WE can understand the PHYSICS of how time travel works, what the black hole is about, etc.  I would recommend it for any Physics students or to people that have always liked STAR WARS and STAR TREK and all that kinda stuff...  I think this book alone taught me more than any Physics professor could teach me in 4 years"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33JJSDJ47LDLO"
                },
                "Date": "on May 16, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The book is well written; it explains terms and ideas in simple formats so a layman can understand how black holes work, what a worm hole is, the meaning of \"the point of no return\" and much more. If you are interested in \"beam me up Scottie\" and all that goes with it, you'll want to get your hands on this book. In our house we still pick it up from time to time ...to review...and always find ourselves discovering something we missed."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on April 18, 1998",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book is perfect for the casual science reader. Kip Thorne touches all the bases with an  insightfull look into the legacy of Einsteins theory of Relativity. He covers the basic concepts behind relativity, quantum mechanics, black holes, time warps(machines), quasars, pulsars, neutron stars, and so on.. I found this book to be inspirational. I hope that people like Thorne and Hawking continue to reach out to the masses. We are ready and waiting."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SGR7LE899LGG"
                },
                "Date": "on July 24, 2003",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "4",
                "Text": "This book is excellent. The mixed history and physics gives it a strong structure of thought and makes it flow in the right direction. This book is not for the novice but it still is, mostly, easy to understand. It does a very good job in explaining the physics behind black holes, time warps, wormholes and various kinds of stars. Overall: EXCELLENT."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LJQN8H1AD8HE"
                },
                "Date": "on February 3, 2000",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "do you like to understand thing al little more deep than others, have you read a little physics before if your answers are yes even if you are not na expert this book is going to be perfect for you, the insights and new ways  to review old theories is great, for my was insight pure insight and I hoe  it will be for you to"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UORGGRUE5Z52"
                },
                "Date": "on July 27, 2000",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "This book is long and sometimes difficult, but Thorne keeps the narrative personal and adds lots of his own views and experiences as the book progresses. Contains excellent summaries of the general and special  theories of relativity and, of course, lots of information on black hole  theory."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1L2FPFH8NH8RC"
                },
                "Date": "on March 16, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HFKOT811F88O"
                },
                "Date": "on December 15, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "An entertaining and insightful read. I am not an expert in this particular field of science, and yet found the material approachable. I purchased this primarily in anticipation of Interstellar's release and was not disappointed. Much of the film's plot and of course theories were derived from the work in this text. I highly recommend picking up a copy."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39JZRZXQC6J1Y"
                },
                "Date": "on December 7, 2008",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I have read more physics books after reading this one, only to be disappointed. No other book no matter how well written, with so very few expections to few to mention can compare with how well this book reads. It's surprising what a fast read it is as well. I strongly suggest anyone who is at least alittle interested in this subject matter start here."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AISTL7WCXQD74"
                },
                "Date": "on April 11, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I use this book to teach a university course on black holes to non-science majors. The students love it. The only downside is that it isn't current in terms of what we have for empirical evidence of blacks holes, but I use a more modern text for that. The historical perspective shows just how complicated and intricate scientific discovery can be."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YNAV6LWLHPXS"
                },
                "Date": "on October 1, 2004",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I thought this book was excellent. I read this a few years ago and feel it is still one of the best books on the subject. Lucid and entertaining, you will learn from the best. Personally, I found this book to be much better than the over-hyped Elegant Universe and would highly recommend it to anyone interested in this subject."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 25, 1998",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I really liked this book. Black Holes and Time Warps has a lot of information on black holes and the deaths of stars and related objects, but unlike most books on black holes, it also has the history of the theories and breakthroughs in black holes research and the background of the people who came up with them."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHWUEUVZA2J76"
                },
                "Date": "on February 23, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Thorne's ability to make all these ideas sound complex but understandable with layman's terminology shows his skill as an author. Diagrams that he provides throughout the book are immensely helpful in understanding the concepts he lays out for you. Definitely a must read for anybody interested in the subject."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 10, 1999",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on September 28, 1999",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "A fluently written and facinating book, yet understandable to the layperson, unlike many others. I read it first when I was a sophomore in high school."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AS0CQR9JP7P8D"
                },
                "Date": "on August 10, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I remember my dad reading this to me when I was sick in the hospital and having read it again now, I have to say this is the penultimate work on this specific area of quantum mechanics. Easy to read, but with plenty of room to think."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 21, 1999",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Thorne explains a difficult subject very comprehensive with historical context and charatacers. It is his uniqe capability to write a very hard science topic as a scienific fiction. It is very enjoyable and instructive."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SCH0BI2CUPEX"
                },
                "Date": "on September 8, 1997",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "\"Black Holes & Time Warps\" was one of my favorite books on the subject. Kip Thorne explained everything very well. He discusses all of the subjects to their fullest. Wonderfully written. Outstanding"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGZYW6RZK7WPN"
                },
                "Date": "on May 5, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "What is space? What is time? Can we travel through time? When a black hole forms? And one of worm? If you are follower of Einstein, you can not miss this review of relativity and its consequences in the cosmos."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2I9VQGJEZD3VF"
                },
                "Date": "on March 7, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2W8VEF487RENZ"
                },
                "Date": "on March 18, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A good book by an expert.  He is a surprisingly good writer as well.  Some of the findings may be dated by now (published in the early 90s), but it was still well presented for a non-expert audience."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PNI6RJ2UUYN1"
                },
                "Date": "on December 7, 1998",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I have read a lot of books on relativity, especially general relativity. This one is top! Definitely 5 stars! Very easy to read and understand. Had a very pleasant time reading it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14DHMLJD7EHKZ"
                },
                "Date": "on January 14, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is far and away the best book about modern physics that I have read (and I have read many). So much more comprehensible than Hawking. Read it!! You will not be disappointed."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7DFLRZG223C9"
                },
                "Date": "on November 24, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book is very readable book on the history and physics of the black holes and associated other topics.  The writer is one of the top theoretical physicists and teachers."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 24, 1998",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Simply beautiful. I felt like I was living through those great days of  astronomy. Captivating. Great deal of Knowledge. This book is a treasure  for me..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BTORW8SO1LRK"
                },
                "Date": "on March 5, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I will preface this review that this was a gift for my gal, after we saw the movie \"Interstellar\" she was intrigued by the subject. She loves it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BNKQLRTR0K0G"
                },
                "Date": "on September 30, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book is also good for reference but I must admit I have come across better reference books. However, this one met my needs so I gave it the 5 stars."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XOGAPU00RRHT"
                },
                "Date": "on December 29, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Awesome book! The topics are so much fun and the  author presents really complex ideas in a way which is easy for the average Joe to understand"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2E6RXASMBEKA5"
                },
                "Date": "on December 20, 2008",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RFABG8W8K4GK"
                },
                "Date": "on January 21, 2004",
                "Helpfulness": 0.6,
                "StarRating": "5",
                "Text": "Black holes and time warps: Einstein's outrageous legacy, by Kip S. Thorne. My mother checked out a copy at the downtown library for me when I was 4 years old. I loved it then and I still love it now. It's truly one of my favorite books. It's probably one of the most to-the-point books about such subjects as blackholes and wormholes. It's easy to swallow, and it's not too long! No book on blackholes could ever be too long. Kip Thorne is a genius, and his books show it. Many would-be astrophysics buffs, such as many posting here, like to illuminate their egos by trying to challange the fabric of this book by throwing in such nonsense as \"it's kinda flawed\" and \"it's good for the non-intellectual, but I found it lacking\". Trust me, this book isn't all sugar and spice. Still, give it a break. 1) It's pretty old. 2) How many of these losers are professors at CalTech and are close friends with Stephen Hawking himself? Get my drift? Now, get this book!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FYYJEY569U1H"
                },
                "Date": "on January 3, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Wonderfully informative and entertaining book and in great condition!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TDLU3QP6O44K"
                },
                "Date": "on July 28, 2006",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "You could consider this as a good place to continue if you have already read Stephen Hawkins' \"A Short History of Time\" and want to deepen your understanding of modern cosmology at an introductory level."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A290S7M79P7OGO"
                },
                "Date": "on December 10, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great present, slow delivery"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Q7NZEP3HXVD5"
                },
                "Date": "on September 2, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Item delivered as expected."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EMO3ZEBWIO8O"
                },
                "Date": "on November 22, 2007",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "Mr. Thorne offers insight into an important world of science that only a person who has first hand experience could.  While this book is a book about black holes, it is just as much a book about the science leading up to the ability of science to recognize and study them.  It is very detailed with numerous \"boxes\" that include extra information.  While it is not necessary to have an extensive science background in physics/astrophysics etc..., it would help.  If one gives the book the patience that it takes, a world of information is available.  It is not a quick read, but it is very interesting stuff no doubt."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HGJJIDED7AP6"
                },
                "Date": "on April 22, 2003",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "This book is an interesting juxtaposition of history and science-for-the-layman. Kip Thorne tells the story of how Einstein's relativity went from a misunderstood curiosity to a universal standard in the physics community. He describes many of relativity's bizzare predictions about the nature of space and time. The level of technical difficulty is relaxed but not overly simplified; a person with no physics background might need to dwell on some parts. Overall, however, I found it a good read and would definitely recommend it to anyone curious about the subject."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30MJRYHIZ8QOI"
                },
                "Date": "on January 2, 1998",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "This is one of the really good science books I read in recent times. Apart from the content, it also gives one a sense of how research is done. I would recommend it all serious science and technology students."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2200V8XPO37PE"
                },
                "Date": "on December 17, 2002",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I found this book exciting and most of all interesting.  I have never read a physics book before this one & I am now hooked.  Kip did a great job & I am waiting for the next..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VS6VPKJQF4JK"
                },
                "Date": "on December 12, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "While this is not a new book, this book does outline the state of the art in relativity physics with respect to black holes, wormholes, and time machines."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FS3O16DDNYJK"
                },
                "Date": "on March 2, 1999",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": "Fascinating, informative and easily understandable. I have read many books on relativity and quantum mechanics but this book really blew me away. Dr Thorne gives a thrill ride par excellence!!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EOF7RWQK2P4C"
                },
                "Date": "on October 11, 2013",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "A little outdated, but still a very interesting read about black holes. Have not read the entire book yet, but it has held my attention so far as a supplement to another book for a college course."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JXKMHLMGLATL"
                },
                "Date": "on February 23, 2015",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Great!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on December 17, 1999",
                "Helpfulness": 0.25,
                "StarRating": "5",
                "Text": "I thought that this book was a very educational book.  It really helped me with my science project about Nuetron stars and Pulsars and helped me earn an A in the class."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on April 6, 1999",
                "Helpfulness": 0.25,
                "StarRating": "5",
                "Text": "After reading this book, I wrote a speech over Black Holes for the Acadimic Decathalon and won several medals.  I'm only 17 and understood it, so ANYONE can!!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IMYQOC1BIRE6"
                },
                "Date": "on December 28, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A711BTGM1SRNB"
                },
                "Date": "on December 30, 2014",
                "Helpfulness": 0.16666666666666666,
                "StarRating": "1",
                "Text": "Not good for Kindle."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2B8IJRK63KPZP"
                },
                "Date": "on March 29, 2014",
                "Helpfulness": 0.07692307692307693,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16T91D46K9RTM"
                },
                "Date": "on February 11, 2013",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "The book was OK to many anecdotes for me personally and the explanations where some what hard to understand for the layman. A Little more facts would have been nice. Maybe a easir vocab also"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JMQIMKKPAA3X"
                },
                "Date": "on December 21, 1999",
                "Helpfulness": 0.29411764705882354,
                "StarRating": "3",
                "Text": "Overall it was a good book, but it was filled with too much unrelated personal information.  I don't care how long Einstein lived with his parents, or who his love intrests were.  Plus the sci-fi story was lame. I  bought a book for straight facts, discussions, and possibilities, not Kip  Thorne's bets with Stephen Hawking."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QRZ06JM57LS6"
                },
                "Date": "on August 28, 2014",
                "Helpfulness": 0.0625,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 15, 1999",
                "Helpfulness": 0.05555555555555555,
                "StarRating": "5",
                "Text": "oh yeah very good mustlovebu"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17PJCXX958LSM"
                },
                "Date": "on July 20, 2012",
                "Helpfulness": 0.045454545454545456,
                "StarRating": "1",
                "Text": "I would really like to make an exchange. I ordered this book a while ago but didn't have a chance to read it. I just noticed three pages are ripped in exactly the same spot; maybe something during maufacturing. I would have to say the book is not worth much with the pages ripped."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Black-Holes-Time-Warps-Commonwealth/product-reviews/0393312763/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "129"
    },
    "Salesrank": "#21,009",
    "Timestamp": "2015-05-24 12:55:09.061461",
    "itemurl": "http://www.amazon.com/Black-Holes-Time-Warps-Commonwealth/dp/0393312763"
}
