{
    "Category": "in Books (",
    "ListPrice": "$18.95",
    "Name": [
        "Mathematical Analysis of Physical Problems (Dover Books on Physics)"
    ],
    "OfferPrice": "$17.06",
    "Reviews": {
        "AverageStarRating": "4.5 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2A95VLM9VXNX4"
                },
                "Date": "on November 17, 2000",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "This is a very good feeling, when you handle a book which provides all the mathematics (separation of variables, Fourier Laplace analysis, complex plane integration, Green's functions...) necessary to solve almost all the physical problems; especially dealing with partial derivative equations (from vibrating string to Schroedinger equation). The price is also a good point. Thank you Dover."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABO7P8EHB0GOV"
                },
                "Date": "on February 9, 2007",
                "Helpfulness": 0.9090909090909091,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on September 20, 1999",
                "Helpfulness": 0.8666666666666667,
                "StarRating": "5",
                "Text": "This book is much different than the other books dealing with math and physics. A brief description for this book is represent the link between the math used to describe the physical phenomena and the physical phenomena  itself, in other words is the answer for this question why this mathematics  exactly used in this particular phenomena? which a lot of physics  mathematics books don't viewing this point. It is unique and great book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13WXBS7VAUCHO"
                },
                "Date": "on October 7, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "OK, the cover is tacky and the print looks like it has been done on a 1960s Remington, but I am yet to see a book which explains mathematical methods so well, and also shows you how you can use them to solve physics problems.  I have loved every Dover book I've read, and this one too is a masterpiece just like the others. Beautiful stuff!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JUHXK5NWA4YF"
                },
                "Date": "on March 18, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I really enjoy this book.  I like the author's style , his approach and the topics he's chosen.  However, IMO,  it's intended for those with plenty of experience but who are still looking for another viewpoint to help clear up those loopholes we all have when trying to understand something that isn't easy."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EC1IG3LOB0NF"
                },
                "Date": "on July 27, 2001",
                "Helpfulness": 0.46153846153846156,
                "StarRating": "3",
                "Text": "Well this is a good Mathematical Reference Books for Theoretical Physisicst but has nothing to do with Mathematical Analysis of Physical Problems. It has all the tools you need that is fine, there are many similiar books as a reference book but if you think you will find ideas and methods \"how to structure the Physical Problems in Mathematical terms\", this is not the book."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Mathematical-Analysis-Physical-Problems-Physics/product-reviews/0486646769/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "6"
    },
    "Salesrank": "#1,085,933",
    "Timestamp": "2015-05-24 12:28:18.591170",
    "itemurl": "http://www.amazon.com/Mathematical-Analysis-Physical-Problems-Physics/dp/0486646769"
}
