{
    "Category": "in Books (",
    "ListPrice": "",
    "Name": [
        "University Physics Vol 2 (Chapters 21-37) (12th Edition)"
    ],
    "OfferPrice": "$19.44",
    "Reviews": {
        "AverageStarRating": "3.7 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1294XJ37QQD5M"
                },
                "Date": "on November 10, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is a really good college-level introductory physics textbook.  It's very well written with very detailed and clear chapters, and the problems are nicely constructed to allow full understanding of the concepts.  If you really want to learn physics, get this text."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AT5O5T2ZRMDX4"
                },
                "Date": "on September 13, 2011",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "This is an exceptional physics book, contains very clear and easy to understand explanations, and all necessary equations.  If this book is being purchased for a course along with a subscription to Mastering Physics, I can say that while the online homeworks did get somewhat challenging and made you think about the problem, they were often on second thought simple, and taught you how to properly apply and use the necessary equations from the book.  All in all, I would say that the combination of the book and the online homeworks was an overall enjoyable way to expand my knowledge and understanding of physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ILWAD4MBZM1V"
                },
                "Date": "on December 24, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17U51RVJA0I0Q"
                },
                "Date": "on February 12, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Both Vol. 1 and 2 are great. If you are going through all four series of Physics buy the set at a discount.  Great examples and lots of online help."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZ03HZGW5IU0U"
                },
                "Date": "on September 10, 2010",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book cost over $140 at my school's book store and it was used without the CD. I got it on here for $60 or so in excellent shape with the new CD. Plus I got it fast. Excellent work Amazon!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADOXAO1AQN58V"
                },
                "Date": "on October 30, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Anyone interested in learning physics from scratch Volumes 1, 3 & 3 are the way to go.  The 12th edition may be a few years old, but basic physics hasn't changed.  Great examples."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ON2YKJ7YSNXG"
                },
                "Date": "on July 17, 2011",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "it is good enough for reference, you still need a good professor in the course who knows material and also knows how to teach it unless you are really smart."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YRVHWBBGHKC9"
                },
                "Date": "on September 15, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "Must have Physics for freshman year in college or if you have spare time!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26T8TSUIB9Y5G"
                },
                "Date": "on October 19, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This is a very good book!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7IYX4LCYH459"
                },
                "Date": "on May 26, 2011",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": "The text in this book is actually extremely helpful. I read the book instead of going to lecture so ya it's that good (or my professor is that bad, take your pick). The reason I gave it 2 stars instead of 5 is because I don't know about the rest of you but I have the special UCSD version or whatever which is all just a big scheme to prevent us students from buying used textbooks. Anyway, the version I got is really poorly bound. It's more like a physics pamphlet instead of an actual book. if im gonna pay 100 bucks for a book i need for one quarter, the publisher should at least print it on something thicker than toilet paper. So publishers if you're reading this, please step it up, because im afraid if i so much as sneeze on this book it's gonna disintegrate."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEWZ829BWS302"
                },
                "Date": "on February 11, 2013",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "Why dis guy tryin ta play me like imma violin.  Im smart.  Smarter than this thing in this chicken wing wango tango bango bam!  This guy wins!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29MBBCRV9F3K2"
                },
                "Date": "on August 29, 2014",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": "the worst textbook you can get"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MQ0XSSJNLOPR"
                },
                "Date": "on September 2, 2011",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "The book is in very good condition. Slightly bent corners, but to be expected with paperbacks. All the pages were still attached, the cover was clean and still looked good. The only problem I had was the excessive amount of highlighting. I acknowledge that there is some highlighting to be expected with a used textbook. However, almost every single equation or definition is highlighted which makes it distracting to read through. Compared to the other used copies offered for this book I feel the price I paid was fair for what I got. However, I might have to purchase another used copy, possibly more expensive copy, if the highlighting continues to prove too distracting for me while reading."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EMCEFRC3GFB"
                },
                "Date": "on August 20, 2010",
                "Helpfulness": 0.4166666666666667,
                "StarRating": "1",
                "Text": "When I buy a book advertised as *new* from my bookstore, it comes with the book, of course, as well as any supplementary materials provided with that book, such as online product codes, cd's, solution manuals, etc,. Apparently, when you buy a book advertised as *new* from Amazon.com, you get the book. Just...the book. Nothing else. This wouldn't be a problem, had Amazon.com (the seller in my case) advertised this fact. There was no mention of any supplementary material, omitted or included. Maybe that's my fault for assuming *new* meant *includes everything that would normally be included with the new book*. Either way, \"clever\" advertising on your behalf Amazon...you got me."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MZ1HUOVP9MMU"
                },
                "Date": "on September 25, 2010",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "The book was shipped quickly and on time. Upon receiving the book, it was evidently in good condition: the pages were clean and there were no markings, just minor cover wear."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31SGHYYUFHMWV"
                },
                "Date": "on September 17, 2013",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "The book condition was listed as \"Just like new\" but it had bent corners and writing and highlighting on some pages.  The personalized note on the inside made my day :)  Forever a Wolverine at heart <3 GO BLUE!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIYXIUNQ8NH83"
                },
                "Date": "on September 8, 2009",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "Thank you for your patience and sorry for all the trouble i have brought you."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/University-Physics-Chapters-21-37-12th/product-reviews/0321500768/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "17"
    },
    "Salesrank": "#36,283",
    "Timestamp": "2015-05-24 13:14:29.798062",
    "itemurl": "http://www.amazon.com/University-Physics-Chapters-21-37-12th/dp/0321500768"
}
