{
    "Category": "in Books (",
    "ListPrice": "$37.95",
    "Name": [
        "Theoretical Mechanics of Particles and Continua (Dover Books on Physics)"
    ],
    "OfferPrice": "$23.68",
    "Reviews": {
        "AverageStarRating": "4.5 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GROFBG96NDA3"
                },
                "Date": "on April 19, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39FO603B6EVQT"
                },
                "Date": "on November 11, 2006",
                "Helpfulness": 0.9393939393939394,
                "StarRating": "5",
                "Text": "This book covers all the main topics that a mechanics course at the advance undergraduate or graduate level should have and more. It starts with a first chapter on Basic Principles where the authors do a general review about Newtonian mechanics, that is, Newton's laws, angular momentum, energy, conservation laws, center of mass motion, two body motion with a central potential and scattering. Then follows a chapter on Accelerated Coordinate Systems where you encounter things like the Corioly acceleration and centrifugal forces. Chapter three is a delight, it is about Lagrangian Dynamics where you learn a much powerfull formalism than newton's equations to solve problems using the Lagrangian function, learning about virtual displacements and generalized coordinates (also D'Alambert and Hamilton's principle). Chapter four is about Small Oscillations, it is very important since here you learn to work with many-particle systems that are use a lot in condense matter physics, the very well known normal coordinates are here introduced. Chapter five is about Rigid Bodies, chapter six is about Hamiltonian Dynamics, this chapter connects very well with chapter three illustrating yet another method to solve mechanics problems by defining canonically momentas for every generalized coordinates and then finding a set of first orders differential equations involving the hamiltonian (as opposed to chapter three where either D'Alambert or Hamilton principle lead to a system of second order differential equations) The hamiltonian is defined as a Legendre transformation of the Lagrangian function, also the Poisson brackets are introduced here and it is even explained how to do the transition between classical and quantum mechanics and also canonical transformations are introduced. This first six chapters make purchasing this book worthwhile but as if this weren't enough there are still another seven chapters more! I will just write their names: 7-Strings, 8-Membranes, 9-Sound waves in fluids, 10-Surface waves on fluids, 11- Heat Conduction, 12-Viscous Fluids and 13-Elastic continua. It also brings 5 appendices. This book is very well written and I always come back to it when I have to remember some mechanics formula or issue to re-study, I say that this book, Landau and Goldstein are the best books you can get on classical mechanics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CVH4EZPA0YPW"
                },
                "Date": "on January 11, 2013",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGRGYWPM67F8J"
                },
                "Date": "on August 10, 2014",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "Good book, good examples. Of course, there could always be more example problems."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RFSXRN99TVDS"
                },
                "Date": "on April 1, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Works great for my purpose, it is very good and new as described it also arrived as scheduled, very ok"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TIZWBC4GZO8I"
                },
                "Date": "on June 19, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "this is the first time that I bought book on the internet, whatever, it is very good, I like physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38DA9727SL4Y1"
                },
                "Date": "on October 30, 2011",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "My professor uses it as a textbook. I think it can help those who have a bit backgroud knowledge to learn more about theoretical mechanics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WO79HNQI0FG2"
                },
                "Date": "on August 3, 2009",
                "Helpfulness": 0.125,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39E69AYWO5CIK"
                },
                "Date": "on September 13, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "This book is the textbook for my class of classical mechanics. Its content is very good. Five stars! ! haahh"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LUBK4FMHFFDH"
                },
                "Date": "on July 13, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I got a book like a brand new one and really love it. Greatly appreciate the service and recommend it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADUZLBZFNBNPM"
                },
                "Date": "on December 15, 2011",
                "Helpfulness": 0.06666666666666667,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LWO6DP2C8TU7"
                },
                "Date": "on October 2, 2013",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "It is OK. I cannot comment to much for the textbook. About the speed, they delieverd it soon, the book is fine."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Theoretical-Mechanics-Particles-Continua-Physics/product-reviews/0486432610/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "12"
    },
    "Salesrank": "#318,117",
    "Timestamp": "2015-05-24 12:41:05.745593",
    "itemurl": "http://www.amazon.com/Theoretical-Mechanics-Particles-Continua-Physics/dp/0486432610"
}
