{
    "Category": "in Books (",
    "ListPrice": "$16.99",
    "Name": [
        "In Search of Time: The History, Physics, and Philosophy of Time"
    ],
    "OfferPrice": "$14.54",
    "Reviews": {
        "AverageStarRating": "4.2 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ELEXULYZ74N3"
                },
                "Date": "on December 28, 2008",
                "Helpfulness": 0.9333333333333333,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARNEUO7BF3J55"
                },
                "Date": "on December 3, 2009",
                "Helpfulness": 0.9565217391304348,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QP3OE395HBFU"
                },
                "Date": "on January 19, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "In this book, Mr. Falk gives the reader a broad survey of current and ancient thinking about a question that has vexed humanity since the beginning: what is the nature of time? One of the difficulties with the question is that we don't even have a universally accepted definition of what time actually \"is\". For most of recorded history the topic of time was the domain of philosphy and physics. Mr. Falk walks the reader through the main philosophical theories about time and then shows how Isaac Newton decisively brought time into the grip of physical science. A couple of centuries later, Einstein overthrew some of our misconceptions about time and showed that time, like space, is not absolute but relative. Mr. Falk explains some of the key conclusions of Einstein's theories of special and general relativity in a way that a general reader can easily follow. In more recent times, Mr. Falk informs us, psychologists and cognitive scientists have begun tackling the subject of time as they systematically probe the nature of the human mind. By the way, the mind and the nature of consciousness is another 'little' subject that will continue to defy us for the forseable future. In addition to the philosophical and scientific theories about time, the book also covers cultural and sociological aspects of how humans deal with time.  The language and diction of book are of high caliber."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29MXYQ74NVWI6"
                },
                "Date": "on October 29, 2012",
                "Helpfulness": 0.9166666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UTKYA2U8542F"
                },
                "Date": "on March 9, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2M90LGAGAIH0S"
                },
                "Date": "on August 31, 2010",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1C9AZW5QYAHVW"
                },
                "Date": "on September 18, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DLQ64TCES0P8"
                },
                "Date": "on November 17, 2012",
                "Helpfulness": 0.75,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANWCZ3GS8BSA6"
                },
                "Date": "on February 4, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VX6A9UZBLEPI"
                },
                "Date": "on January 13, 2009",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "In twelve fascinating chapters, the author discusses the vast subject of time. Each of these chapters contains a different perspective on this fascinating yet elusive topic. Roughly the first half of the book includes chapters on: humanity's early recognition of, and musings on, the passage of time, the development of the calendar, the invention of hours and minutes, as well as the cultural and psychological aspects of time. The second half of the book mainly deals with the physical, scientific and philosophical aspects of time, from Isaac Newton's perspective to the latest abstract thinking on the nature and existence of time. Here we find discussions on time's arrow, the beginning and the end of time as well as classical, relativistic and quantum mechanics. The writing style is clear, friendly, quite engaging and accessible to a wide readership. The author takes the time to explain any terms that may be unfamiliar to the casual reader but does not pull any punches when it comes to relaying the views of the various individuals, mainly scientists and philosophers, which he consulted in writing this book. Although anyone can enjoy it, this book would likely be appreciated the most by science buffs."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APYCB6F7C7IJG"
                },
                "Date": "on December 19, 2010",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "In Search of Time briefly, very briefly, discusses the various historical, philosophical, scientific, and cultural aspects of time by visiting the people, places and things with a prominent time-related role. As a cursory introduction, the book succeeds because it whets the appetite for such a profound subject by succinctly describing how mankind has struggled with measuring, using and understanding time.  However, it falls flat when it stops describing and starts opining:  the author does not have the philosophic know-how to adequately discuss the subtlety and depth of this topic. Also irksome are the occasional display of flabby jokes and the frequent quotation of authors without any citation of their books (e.g., a reference to Alfred Crosby's label of \"quantitative revolution\" on p. 64 is made without citing a book or article).  Despite these flaws, this is an enjoyable ride."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AMVC4V396KER"
                },
                "Date": "on January 30, 2010",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BM5NTLX7CES1"
                },
                "Date": "on May 10, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book presents a \"history\" of time, with a heavy focus on physics and how physicists throughout history have approached and tried to conceptualize and explain time. The author does an excellent job of presenting a wide variety of both contemporary and historical perceptions of time. I enjoyed reading this book because it provided some food for thought on how I understand and conceptualize time. I recommend it to anyone who finds the concept of time fascinating and wants to learn what others have to say about it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QPRIVLMV9UMX"
                },
                "Date": "on May 16, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MJIGALPXAHRP"
                },
                "Date": "on June 3, 2009",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The book is excellent specially if you dont have a technical background (e.i Physics etc). Took me just a week to read it, the reading is easy yet extremely interesting. I was gonna buy it to re-sell it later on but im keeping this one for my personal library. A must have...I dont say that about a lot books...:)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10N0BY2H96TPB"
                },
                "Date": "on April 23, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A bit technical sometimes - I wouldn't call it light reading, but very interesting and worth the effort.  I learned some things from this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EHE7M69JB346"
                },
                "Date": "on September 7, 2013",
                "Helpfulness": 0.5,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2A4F18ROW0OW1"
                },
                "Date": "on February 22, 2009",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "This is a very complete and easily digested review of all knowledge pertaining to and the history of our understanding of that difficult and illusive subject we named TIME.  A very much needed addition to our modern library of scientific data."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HMVLAD4MGPNC"
                },
                "Date": "on March 5, 2011",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASVUPVH2ATLL2"
                },
                "Date": "on November 19, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellant"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OYK5IX499ERC"
                },
                "Date": "on July 29, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Engaging."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Search-Time-History-Physics-Philosophy/product-reviews/0312603517/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "21"
    },
    "Salesrank": "#674,773",
    "Timestamp": "2015-05-24 13:19:17.267993",
    "itemurl": "http://www.amazon.com/Search-Time-History-Physics-Philosophy/dp/0312603517"
}
