{
    "Category": "in Books (",
    "ListPrice": "$14.99",
    "Name": [
        "Six Easy Pieces: Essentials of Physics Explained by Its Most Brilliant Teacher"
    ],
    "OfferPrice": "$9.97",
    "Reviews": {
        "AverageStarRating": "4.5 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1S3C5OFU508P3"
                },
                "Date": "on April 16, 2002",
                "Helpfulness": 0.9701492537313433,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6TC09O65HUD6"
                },
                "Date": "on February 27, 2001",
                "Helpfulness": 0.9382716049382716,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUTBHG6070SL4"
                },
                "Date": "on May 7, 2006",
                "Helpfulness": 0.9333333333333333,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RNMSNX5Y5J3T"
                },
                "Date": "on January 3, 2007",
                "Helpfulness": 0.9302325581395349,
                "StarRating": "5",
                "Text": "I took three semesters of physics to complete my undergraduate degree; I'll never forget the dumbfounded look on my instructor's face when we were studying electrical force and I asked, \"so, why *do* protons attract electrons, anyway?\"  The professor sputtered and said, \"it's just a force of the universe.  Shut up and stop asking stupid questions.\"  Or when the instructor presented Newton's third law (\"every action has an equal and opposite reaction\"), and I asked, \"So why is it that when I push against a wall it doesn't push back and fall apart?\"  The answer was, \"Well, the wall doesn't fall apart does it?  So that's that.  Shut up and stop asking stupid questions.\"  Dr. Feynman addresses *exactly* these types of questions, over and over again.  (If the earth and the moon are attracted to each other, why don't they crash into each other?  Why are snowflakes shaped the way they are?  Why does blowing on soup cool it down?)  I only wish this book had been 1300 pages rather than 130 - every page answered some nagging problem I've had with the physics explanation of the universe.  I don't think you can learn physics from this book, but you can get excited enough about it to start digging around and discovering more, like I did."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXSH6O4OP5L4M"
                },
                "Date": "on July 28, 2007",
                "Helpfulness": 0.9,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALXB8RERGC7SB"
                },
                "Date": "on July 11, 2002",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A361LE16VBQDP8"
                },
                "Date": "on January 29, 2006",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMVOUSJS2ZM3C"
                },
                "Date": "on February 23, 2003",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DWXVGOE2XZIQ"
                },
                "Date": "on July 23, 2002",
                "Helpfulness": 0.82,
                "StarRating": "5",
                "Text": "As a college physics teacher, and like many other reviewers, I too found the content of this abridged version of Feynman's famous lectures not worth the price of the book, but as I listened to the tapes (and by the way, several are extremely poor quality), it occured to me that the brilliance that comes through is Feynman the Educator, not the Nobel Laureate, or physicist, or college professor......and from this standpoint this set is well worth both the cost and time to anyone who fancies themself as a teacher.  I have degrees in education and get great reviews from my students on a regular basis, but that didn't stop me from learning a lot from Feynman about how to expand a student's perception, application, and analysis skills and for this addition to my own personal bag of skills, I thank him."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on January 13, 1998",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "5",
                "Text": "As a top graduate student in engineering and science, physics is a part of my life. A number of courses I took have taught me plenty of analytical tools and essentials of physics. Having thought that I know almost everything about physics, I looked at Feyman's 6-easy pieces and couldn't help reading it to find out if there is something I can learn from a small and elementary physics novel. Well, I am so surprised that Feynman taught me quite a bit about things that I've never thought about before, even if I am well familiar the complicated and challenging quantum electrodynamics that he developed. He had such simple explanations on conceptually deep natural phenomena such as motion of planets and stars, probabilistic interpretation in quantum physics ; and amusingly interesting insights on daily events such as why blowing your soup to make it cooler. That's what I thought of Feynman's 6-easy pieces as a person who knows physics better than most people. In fact, I bought and will read Feynman's lecture on physics (3-volume) after reading 6-easy pieces. I am sure that I will learn much more from Feynman and so will anyone."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 20, 1997",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "ONE PIECE AIN'T SO EASY:  Coefficients of friction and inclined planes give physicists the image of chemists without the charisma. In contrast, Nobel prize winner Richard Feynman, Ph.D., led part of the Manhattan Project in his mid-twenties, played the bongo well enough to have a compact disk issued, wrote several general interest and technical books, picked locks with ease, did informal stand-up comedy, served on the blue ribbon commission investigating the explosion of the shuttle Challenger, had three wives (two lost to deaths, the first hers, the third his) and a string of girlfriends in between. Students applauded at the end of his physics lectures, and frequently chuckled throughout.Richard Feynman was the Robin Williams of physics. What Williams can do through free association to make you laugh, Feynman could do to make you understand, and smile.In the scary Sputnik years, it had become apparent that fewer students were choosing physics just as the field was becoming more complicated,. And more of those students were dropping out in the early years, before they were exposed to the good stuff: particle physics, black holes and superconductors. Seeking a way to reverse this trend, Caltech approached their most brilliant physicist. At 43, Feynman designed then taught a two-year introductory course intended to minimize the tedious masses-and-pulleys work of freshman physics, and to maximize the exposure to the exciting frontiers of physics. He hoped to capture young imaginations while still malleable, before other interests distracted them.As Feynman agreed to do this only once, Caltech assigned a team of professors and grad students to record, transcribe and document the lectures for the benefit of the rest of the world. The only result for thirty years were three red books called The Feynman Lectures on Physics, since translated into ten languages. After his death in 1988, friends and colleagues, in awe of the man, have worked to make his work and thoughts available to the layman. (This also resulted in the book \"Why Do You Care What Other People Think?\", a sequel to his wonderful memoirs, \"Surely You¹re Joking, Mr. Feynman.\")In \"Six Easy Pieces,\" the editors have compacted what are purported to be the easiest six of the Feynman Lectures into one book. In my college days, a good way to get sleepy fast was to read a physics text. \"Six Easy Pieces\" in print, though well thought out, is not much different. The man wasn¹t Anna Quindlen. What makes the book worth the weighty price are the audio tapes that come with the package. The original lectures delivered in Feynman¹s voice make the book easily digestible during a week of commuting. His inflections, joking, and laughter lead you through the drudgery and reveal some of the wonder Feynman saw in nature. The irritating exclamation marks throughout the book are merely an attempt to reflect how the physicist talked. It makes for okay reading, but wonderful listening.Some of the lectures border on poetry. Wrapping up the excellent chapter wherein he describes the relationship of physics to each of the other sciences, and holding a full wine goblet he had used to illustrate a previous point,  he concludes with a thought that describes his approach to life:³A poet once said, \u008cThe whole universe is in a glass of wine.¹ We will probably never know in what sense he meant that, for poets do not write to be understood. But it is true that if we look at a glass of wine closely enough we see the entire universe....How vivid is the claret, pressing its existence into the consciousness that watches it! If our small minds, for some convenience, divide this glass of wine, this universe, into parts--physics, biology, geology, astronomy, psychology, and so on--remember that nature does not know it! So let us put it all back together, not forgetting ultimately what it is for. Let it give us one more final pleasure: drink it and forget it all!²Neither the tape nor the book so indicate, but I¹m betting he downed the glass.An unfortunate flaw in this collection is the tape quality. They¹ve done their best to digitally recover these thirty-year-old tapes, and tapes two through six are quite listenable. Tape one, however, is very grating and difficult to hear. While this first lecture is good, I¹m surprised the publishers didn¹t pick another or even use an actor to reproduce it.\"Six Easy Pieces\" is not for readers with no interest in the field. It¹s best for techies of any age that can enjoy a fresh approach to what they should have learned when they were paying tuition.-- End --"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PR70XCP996LG"
                },
                "Date": "on November 19, 1998",
                "Helpfulness": 0.8823529411764706,
                "StarRating": "5",
                "Text": "What is remarkable about the book Six Easy pieces is that Richard Feynman is able to explain concepts in physics with simple examples that anyone can understand.  He is also refreshingly honest -- he says \"This is what  we know\" and \"This is what we don't know\" in a very  straightforward way.  The book is very good at explaining physics concepts  and would make a good primer for someone who skipped high school physics.  The book also explains the relationship of physics to other sciences  (chemistry, biology, etc.) in a way that is simple and yet clear."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATZRQCRGI1OC3"
                },
                "Date": "on May 27, 2000",
                "Helpfulness": 0.85,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KSBNXFCEY6D6"
                },
                "Date": "on November 2, 2002",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "This book consists of what the editors consider to be six of the easier lessons from Richard Feynman's Lectures on Physics, a three volume work adapted from a series of freshman and sophomore level lectures given at Caltech in the 1960s. Each piece elegantly explains its intended topic without complicated or in depth mathematics. The reader will obtain the gist of the principles behind theses physical phenomena. Feynman whole heartedly admits to the limits of scientific knowledge of his time and in doing so very much dates his lectures. They nonetheless contain rich morsels of the knowledge of physics which will benefit the modern reader. This book is not intended to be an overview of physics. It assumes the reader has some basic education in some subjects, and a previous knowledge of elementary physics greatly helps to understand the pieces. More than anything, it is Feynman's style of teaching that is conveyed through the work's pages. The greatest joy in reading Six East Pieces is to experience Feynman's intuitive knowledge of physics and his subtly elegant conveyance of this topic."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on August 6, 1998",
                "Helpfulness": 0.875,
                "StarRating": "5",
                "Text": "This is an outstanding collection of lectures, but you're going to want more. If you are a physics or math enthusiast (and have a long commute, like me), you may want to seriously consider purchasing the entire set of lectures at once, rather than wasting money on \"Six Easy Pieces\", then \"Six Not So Easy Pieces,\" then buying the combined set that includes them all. (Yes, you can buy the entire 2-year course from Amazon Books.) Even on relatively \"simple\" topics, such as gravitation, it is amazing how Feynman can help open your eyes to the big picture that underlies the subject. The first lecture, \"Atoms in Motion,\" as well as the 2nd, \"Basic Physics,\" have deceptively s! imple titles. I am fairly sure you will not be bored by them. The last lecture, on quantum uncertainty, is by far the best. However, for this last lecture, you'll want to keep the diagrams handy for when you reach stoplights.  If you can keep from applauding with the audience at the end of each lecture, even while driving, you will have accomplished what I could not. Enjoy!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KJO5VP4K3CHU"
                },
                "Date": "on October 17, 2007",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQFYUO5LU5AYK"
                },
                "Date": "on March 21, 2005",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2M7HTUSPIS2CD"
                },
                "Date": "on June 27, 2001",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "You don't have to be a physicist to read this book! It has almost no equations at all! Feynman had the ability -and the patience- to try and explain things in different ways so he would make sure people understood him. I also read QED and Six not so easy pieces. They are a bit harder but great also!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36LABGIH4PIV4"
                },
                "Date": "on October 21, 2003",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I'm a high school physics teacher who is currently using this book to supplement my physics students' reading. Well, actually, there have been whole subject matters, such as Conservation of Energy and Law of Universal Gravitation which we have entirely taken from this book. My students are from diverse backgrounds, and Feynman has allowed them to really get their hands on these complicated ideas, which, frankly, a math-only-oriented program wouldn't let someone with high school math skills do. This book has convinced me to look for other appropriate texts by Feynman for my class."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3F8S77RGQ0VEB"
                },
                "Date": "on December 2, 2000",
                "Helpfulness": 0.8181818181818182,
                "StarRating": "5",
                "Text": "As a student of physics, I came to appreciate the teachings of Richard P. Feynman. In Six Pieces, the lectures he presents are both clear and simple. The book is a small sample of the larger collection, The lecture series, but in a small digestable chunks that everyone interested in how physics works will fully appreciate. As a teacher of physics now, I often brouse through these lectures to get ideas of how my lectures should flow, as  Feynman's did. I hope to see more of these lectures in small books that illustrate the true nature of how things work. J.Camarena. Van Nuys CA."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AF3X7J0XC391L"
                },
                "Date": "on December 20, 2006",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Dr. Feynman's work as an educator still goes unsurpassed.  Nobody conveys the scientific with the passion and humor he does.  Dr. Feynman does not teach you physics, he helps you fall in love with physics.  He knew that once you fell in love, there would be no holding you back.  Educators of all topics can learn from his example, but be careful, the physics cupid is waiting inside and you probably will not escape his charms."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZ7QNRPFJ2IW1"
                },
                "Date": "on December 28, 2005",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DET8JZRKSF2P"
                },
                "Date": "on May 26, 2001",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OB2OEWJRGUQU"
                },
                "Date": "on June 25, 2001",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AM73E1NU3DVUC"
                },
                "Date": "on February 9, 2005",
                "Helpfulness": 0.7368421052631579,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 6, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "If you are a layperson in physics, I suggest this book as the best introduction to the field. Also, if you are a technical professional, who have already studied physics (and maybe have hated it), this book will show things in a much different and clever way, and I assure you'll have a very enjoyable time reading it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AS7MDGC3HVTP0"
                },
                "Date": "on June 5, 2001",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2N8DSDSDOBUXA"
                },
                "Date": "on June 7, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "The book is relative short, but all Feynman writings are excellent.  Dispite holding a degree in Physics, I did not find the \"pieces\" all that easy, but very worth-while reading.  The lectures increased in difficulty, but all helped me understand the subjects better.  (I'm only bitter about not being aware of Feynman and his writings / lectures when I was an undergrad in college.)  I expect to re-read this little volume multiple times, because dispite it's claim to be \"easy\", the material is very rich, and mostly Feynman leads you from the known to the unknown.  I certainly recommend this book to all students of physics, from high school students to graduate students.  Other science and medical students will probably benefit from it also.  Interested layman may find it worth attempting."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on September 23, 1996",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I've always been interested in physics but wouldn't say that it was a subject that really makes you feel like a genius.  As a matter of fact, re-reading difficult passages and really savoring each word is not the best way to feel like an intellectual giant.  I mean, those super-geniuses can understand complex principles of physical law in the first reading, right?  Well, so could I when I had Dr. Feynman actually giving me the lecture over my stereo.  His pacing, voice inflection, and tone really made dense ideas seem clear and easy to understand.  As a matter of fact, I must cut this review a bit short so I can get back to work on the new anti-gravity ray I'm developing thanks to the teachings of the good doctor"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GSPLYHQYNYX3"
                },
                "Date": "on December 30, 2012",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANUK2TWQL6DRI"
                },
                "Date": "on September 15, 2014",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21X0EO0R0T6FT"
                },
                "Date": "on June 14, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on January 9, 1996",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8O3H327R5B8U"
                },
                "Date": "on January 11, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is an excellent book. Feynman uncovers very intricate issues in most simple terms. A must read for both students and teachers of science."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3L7N70CHDZ1E9"
                },
                "Date": "on January 5, 2009",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Six Easy Pieces, written by one of the most famous physicists to ever live, covers six topics that you will likely encounter in an introductory college physics course.  If you have already had a physics course or two, there is a good chance you won't learn much, although there are lots of interesting side notes you may not have known.  If you haven't had a physics course yet, or don't plan on taking one, then this book will come in handy in helping to explain topics such as atoms, basic physics, how physics relates to other disciplines, conservation of energy, gravitation, and quantum behavior.  This material is presented in a very easy to understand (no math!) and very conversational tone that will make the book easy to read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LW4RK8LHUSSQ"
                },
                "Date": "on January 16, 2003",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "Richard Feynman cohesively and cocisely explains the basics of physics in this book, aptly earning him the title \"physics' most brilliant teacher\". The genius of Feynman's writing is his uncommon ability to explain effectively concepts of physics often not explained as well by textbooks or other sources. For example, I found his explanation of uniform circular motion (that an orbiting object is \"falling around\" that which it orbits) extremely helpful. That Feynman was able to unlock some of the more arcane aspects of physics to those who had been attempting to understand them conceptually for years is further testimony to his brilliance. The book is therefore requisite for both those who are troubled by the study of physics and those enthused by it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJCUWSJ18OEN9"
                },
                "Date": "on March 1, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "This is a great intro to some key physics concepts. However, like a chain of undersea mountains, all you get to see are a few peaks rather than the underlying structure. It is made clear that this is merely a selection from the much longer lecture series and thus it lacks a narrative flow that most popular science books aim for. I enjoyed it thoroughly because I had some familiarity with the material covered and Prof Feynman is such an entertaining lecturer. That said, I think that if you are looking for a good introduction to physics concepts, you'd be better served by a more complete book"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34MW3DEWQQ2NY"
                },
                "Date": "on October 2, 2005",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1M5TMFT8NDN77"
                },
                "Date": "on December 13, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Although it is a transcribed version of a spoken lecture, Feynman's eloquence and enthusiasm nonethless makes it's way onto the page, decades after he spoke these words.  His articulation of the basic concepts of physics is truely remarkable and I whole-heartedly recommend this book for those beginning their studies in physics and those beginning their teaching career physics.  This is, in particular, a good book for the struggling student, as well as for the struggling teacher."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16W8HTCIWYDZ6"
                },
                "Date": "on August 15, 2000",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "5",
                "Text": "What a delight and previlige to listen in on a master at work.  My physics  is now quite rusty (after 32 years !); but Dr. Feynman's cogent  explanations sure whet the appetite.  After a first hearing I replay the  CDs while browsing through the book.  This really brings home the point.  I  truly believe that this set should be required reading and listening for  high school seniors and/or first year undergraduates.  What a classic !!  Just buy it and enjoy..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16JGRW3AUS5XC"
                },
                "Date": "on June 3, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Richard Feynman was a genius.  I wish I had the honor of being one of his students.  He will be missed."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1130F4HNWMJMX"
                },
                "Date": "on January 14, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is a book of problem solving on a quantum scale from the great master himself. I don't recommend this to anyone not solidly grounded in Quantum theory though."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OTLEL9ZWTEFD"
                },
                "Date": "on October 30, 2010",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35TUFQ3D372NA"
                },
                "Date": "on August 30, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Feynman! If you're even thinking about this book, just buy it. He's the best. If you can catch his contagious desire to understand all things large and small, you'll do well in life. This books is great for beginners too!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AU9N153CPDKX"
                },
                "Date": "on July 23, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7P4F23NQGCRL"
                },
                "Date": "on February 17, 2009",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LI2WLIWBK1V5"
                },
                "Date": "on October 22, 2010",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ME5HY6FHN2OG"
                },
                "Date": "on September 3, 2007",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1P0ZB4YAA312R"
                },
                "Date": "on February 24, 2009",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AR1UT8EO0DIU0"
                },
                "Date": "on January 26, 2005",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EFLE7F515TIE"
                },
                "Date": "on October 15, 2001",
                "Helpfulness": 0.75,
                "StarRating": "4",
                "Text": "I have the QED and 6 Not So Easy Pieces. In general, Feynman makes physics seem easy. From this book I was able to get all the basics I needed. I highly recommend it!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31K8MOQLJTU81"
                },
                "Date": "on July 19, 2009",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11DCTGTPS7M0C"
                },
                "Date": "on November 19, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3E038Y3N3L2LG"
                },
                "Date": "on January 24, 2015",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALEYVZ5GPV7TU"
                },
                "Date": "on June 28, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Dr. Feynman was a great instructor. He made complicated things seem easy to learn albeit you had to have some knowledge about the subject."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JT0VZE1TEZ13"
                },
                "Date": "on August 22, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33CT7P95B2DXR"
                },
                "Date": "on August 29, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Love Richard Feynman's books and this is no exception.  If you are interested in science, this is a good choice."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XQ5LZHTD4AFT"
                },
                "Date": "on July 13, 2004",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Feynman is one of my favorite American heros.  It is hard not to admire any one aspect of his life.  Above all, he was a great teacher obviously.  The book is a collection of his lectures for introductory physics, may be a little too elementary for some.  Note that, nowadays such topics are delivered to students at earlier ages since Feynman first started these lectures. Still, how he uses daily language and examples to explain and highlight the basic principles of physics is impressive.  More importantly, he is very open and clear about exactly what is known and explainable and what we really do not know yet.  This comes in very handy in the last chapter on quantum physics, which I enjoyed the most."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PJ4B9FE1T6F2"
                },
                "Date": "on August 5, 2008",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Like most of Dr. Feynman's other books, this one provides someone with a short but understandable account of a variety of important subjects in physics.  His descriptions of physics are entertaining and reveal his particular way of approaching the subject.  To really understand any subject, it is helpful, I feel, to understand the way the people who have made important contributions to the subject think about the subject.  It is also important to know the pursuit of an understanding is within one's reach and is fun. Dr. Feynman does not dissapoint the reader in these respects.  It would have been fun to have been a colleague of his."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXNPB4JWIILZ0"
                },
                "Date": "on January 27, 2005",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Feynman is easy to understand even for the physically challenged. This book is a great place to start for those just getting into physics. Feynman applies this science to things in life that I, even as a first year physics student, began to get a grasp on as the book progressed. Other books I had started to read on this field were boring and it was easy to lose focus. I would find myself pages ahead but realizing I hadn't caught anything of what I just read. With this book it was interesting enough where if I didn't get something the first time I actually wanted to go back and double check. Six Easy Pieces really is pretty easy."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ELYGBTWY38DH"
                },
                "Date": "on July 13, 2004",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I love reading Feynman. I am not going to write a long review of this book. If you are interested enough in physics to be at this page, then reading this book is a no brainer. I will say that I read QED first, and that is Feynman's masterpiece. This work suffers by comparison only in that he is addressing underclassman and trying to get them interested in the big picture, whereas QED is the big picture. The great thing about this book is its conversational tone. You can almost imagine yourself in a classroom headed by the most brilliant physics teacher or our time. That's worth something, I'd say. Enjoy."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AX4WT9X4BSODE"
                },
                "Date": "on September 16, 2009",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WW0K826FUHEQ"
                },
                "Date": "on August 4, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The zeal that Feynman had for teaching comes through the book and it must have been something to see live.  I read this book after I read QED which was a tough read for me as I don't have a background in Physics (other than the basic course I took in college).  I would recommend reading Six Easy Pieces prior to QED if you want to read both.  Each of the chapters in Six Easy Pieces is easily consumable in a sitting so you can read the whole chapter and take some to think about it without reaching the end of the chapter and feeling mentally exhausted."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGJD65TLIQIXG"
                },
                "Date": "on February 12, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I cannot think of a reason to not give this book a 5 star rating. Whether you are a physicist or an interested high school student (like myself), this book is a pleasure to read. Most of the material I was already familiar with but Feynman's way of writing kept me interested the whole way. After reading this book I will definitely be checking out more Richard Feynman books. P.S.- If you end up getting this book (which you should) and like, then I suggest you check out books my Michio Kaku. More specifically Physics of the Impossible."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1B4YHR0OGCYJK"
                },
                "Date": "on November 7, 2009",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Having read several excellent books about Dr. Richard Feynman, and his critical insights into modern science as well as his lively personality and unorthodox way of thinking, I thought I should do him justice and read his own words about his ideas and vision of the world.  He is as spectacular as I hoped.  I read a chapter every morning and feel greatly enriched by that daily experience."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9H3ABJYSGMUM"
                },
                "Date": "on May 19, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FOMRECNDEMFR"
                },
                "Date": "on June 18, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1H2JL6N00REB"
                },
                "Date": "on May 5, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I'm a very novice lover of physics. Enjoyed the humor, visuals and stories to make the points needed to teach"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3I4PSHQJBPKPZ"
                },
                "Date": "on March 28, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11M9UDCNZQNF2"
                },
                "Date": "on March 7, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I wish I had read this book before I ever attempted to study physics in school.  Makes the real-world application make perfect sense, so the math is easy to follow."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3G8X0WFF69RAB"
                },
                "Date": "on February 2, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I knew Feynman at Cal Tech.  It was his goal to make physics both understandable and attractive.  This collection of his work shows how well he succeeded.  He was a true renaissance man and is sorely missed."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MULZL8CPYBSX"
                },
                "Date": "on January 14, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LA547KRUQ6CJ"
                },
                "Date": "on December 12, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A299WH9CLQU8XG"
                },
                "Date": "on November 27, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book is more than entertaining, If read carefully it will help make sense of much of freshman physics. I fly your are not a freshman physics student, read it anyway, you will be entertained and learn something no matter how much you think you know,"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VYKVTWPBC2VW"
                },
                "Date": "on November 9, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I really enjoyed this read, but was glad that I had taken calculus, which seems almost necessary in order to fully understand it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CI0BFCTHOPDI"
                },
                "Date": "on October 5, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Feynman is my favorite physicist and though I've only taken a couple of physics classes, I am amazed by science and have been interested in it since I was a kid.  I think this book is a great intro to some of the foundational principle of science and as a layman, I really enjoyed it and it gave me additional understanding of some of the core concepts."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KU9ITIS9UHDJ"
                },
                "Date": "on September 1, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "You can get a big picture of science in two days by reading this book. It is very vivid, lively and enlightening. I wish I had read it two years earlier."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A277T562KDUOQW"
                },
                "Date": "on August 29, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Feynman did an excellent job in getting the concept of atomic structure to the beginning reader.  Not boring at all...unlike so many other physics books that cover the basics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16GCKCRMWL3FR"
                },
                "Date": "on August 9, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Not always the easiest subject matter but it also doesn't over-simplify.  Feynman was very skilled at using metaphors and analogies to make the subject easier to visualize and comprehend.  A good starting set for anyone interested in physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZXATX4EEI4F0"
                },
                "Date": "on June 20, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3V9GCM62THCQ6"
                },
                "Date": "on June 14, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Emphasis on \"essentials\", and I needed a rudimentary approach. Also, think painless. The author's presentation was not boring and it was enlightening for this ordinary man. I enjoyed reading it and I could relate to the examples and analogies. Do yourself a favor and let Feynman teach you what you should already know. If you already know, the book is entertaining as well."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GTR4WSPUJT8U"
                },
                "Date": "on May 15, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARSCORKFWNGT3"
                },
                "Date": "on March 13, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This book has been written in a very enjoyable style, and I came to appreciate fully Mr.Feynman; it can be a great help to newcomers and also to people who already have some understanding and knowledge of physics. I recommend it fully; I already ordered the second book (not so easy pieces !)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUYJ7F25DI97B"
                },
                "Date": "on February 4, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Of course this book is only for those who appreciate physics and are exposed to the trials and tribulations of teaching the subject to the undeserving masses."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11NLJ170S1UM4"
                },
                "Date": "on November 24, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Feynman was a genius, a polymath.  He comes cl;ose to making these \"easy\" subjects understandable to the ordinary person who is not a genius.  The charts in the Kindle edition are small and hard to read which is unavoidable considering the size of the Kindle screen.  I will try it on my Kindle Fire.  On the Fire a small part of the screen can be enlarged."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AC0FX92EQGN3L"
                },
                "Date": "on October 26, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2F5S17KEF08G3"
                },
                "Date": "on September 10, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Richard Feynman has the gift to exlain difficult concepts in an understanadble way without cutting corners. A pleasure to read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35H0XIWPU4Y39"
                },
                "Date": "on July 9, 2000",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Feynman is regaurded as the greatest physics teacher of all time, and in  this series of lectures for beginners, one clearly sees why. If you are  beginning on the road to inlightenment through physics and are not sure  where to start, these lectures will give you a firm grounding for  exploration through clear examples and clear, concise writing."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I38NJVAYOC1S"
                },
                "Date": "on May 19, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I had checked this out of the library because I had heard about it from \"somewhere\".  I enjoyed it but knew it wasn't something I would just casuallly read then put aside.  So I bought my own copy and really enjoyed it.  I enjoyed it so much I went online to YouTube and watched his lectures.  Awesome!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EWL4GFMZP7SC"
                },
                "Date": "on October 23, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Came in a timely fashion in the promised condition. Looks brand new and even smells as such. This sentence's only purpose is to make sure I have enough words to submit review. Seriously though, great read from a brilliant mind. If you are thinking about buying this you will love it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27ORENC9USL0G"
                },
                "Date": "on March 23, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "not as easy as you think, even if you don't have prior knowledge of these topics it's not like it is explained to a five year old. Read it slowly at times you'll really appreciate not trying to blast through readings like this, I mean it's richard feynman's lectures enjoy them."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ORSMB1YET7PI"
                },
                "Date": "on January 23, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Very informative and entertaining. Was recommended  by a friend and I was not disappointed. Covers the basics of physics and is  easy to understand. Loved the drawings which really helps the reader  have a better understanding of what Feynman is talking about."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CJ0YM9OOM1EL"
                },
                "Date": "on October 22, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Book arrived quickly.  Loved it!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2N1IAIZ9ZZGX2"
                },
                "Date": "on December 20, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Great little book.  I would definitely advise also getting the CD of Feynman's lectures on Physics.  Because he was such a terrific lecturer, hearing the words (which are edited nicely in this volume) is important."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AL37F8A5KLQGO"
                },
                "Date": "on August 11, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A layman's chance to get a glimpse of real science from a master scientist philosopher. This is a printing of some of the lecture given by Fineman to some undergraduate physics students in the 60's."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GZOAL3I6IL3J"
                },
                "Date": "on July 17, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "well, as with any book that mentions Feynman, this book is yet another one of my faves.  After reading \"surely you're joking Mr Feynman\" I just had to keep going... now, Onto the next...."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MOFT2UJZR38U"
                },
                "Date": "on July 16, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I really enjoyed reading this book even though I am not a physicist by any stretch of one's imagination. It is well written and even a \"layman\" can understand the concepts put forth."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1X9HCAC1YX13L"
                },
                "Date": "on June 3, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is Richard Feynman at his best/ It's a ton of fun to read if you are interested in this sort of thing. He really does make the covered topics easy to understand, and he is always fun."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GWO46MWB02H5"
                },
                "Date": "on December 5, 2010",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "great book for the non physics focused student.  the essential elements are explained so that the fundamental principles are understood."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36OXAACJNMFVP"
                },
                "Date": "on December 4, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Five star for this little book, i felt like a young student when i was reading...you can understand many aspects about science because Feynman was an excellent teacher. Great book"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CPJQ6C9F492W"
                },
                "Date": "on November 19, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "so far so good.  Very much a physics primer.  There have not been super intense concepts and the author has a unique voice and vision of the material and why it matters."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GNL5MXR8P6TS"
                },
                "Date": "on July 28, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "What can I say.  Feynman may be the greatest physics teacher of all time.  Not to mention a genius.  The world lost a great man when he passed to early in life."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20AK2WX9222SE"
                },
                "Date": "on May 14, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The book was new and exactly what I had hoped for. I had heard Amazon was good, but when I received the book in three day I was overwhelmed.  Thanks."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AD5E41KLIJGG2"
                },
                "Date": "on March 15, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great explanation of physics without math formulas.  Explains some concepts really well.  Very thought provoking.  I highly recommend it for you."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A313ZWKPAT6NA1"
                },
                "Date": "on February 15, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The book arrived on time in excellent condition, must read for an potential physics student at any level or even the interested reader"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2L6U8RY1I05MU"
                },
                "Date": "on July 16, 2004",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAVVPHV7ALEAY"
                },
                "Date": "on April 8, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent, excellent, excellent. Dr. Feynman had a gift, and it clearly showed at the Investigation of the Challenger Explosion."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HCUXU5268RTY"
                },
                "Date": "on November 3, 2000",
                "Helpfulness": 0.6,
                "StarRating": "5",
                "Text": "Lucidly written with clear, almost easy to understand examples. Great for everybody, age 13 and up. Feynman's exposition of each topic amazes me. How i wish he was my physics teacher. The books is jam packed with information. Written and punblished for the genaral audience, Feynman's attempt to deviate from the complex and complicated mathematics is a successful one, although there is still some math,but simple ones.  Get it now. Its a great book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LODDH64E9413"
                },
                "Date": "on January 24, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Funny and smart. Great background in science for the novice with an. Interest in physics.  Good intro to the field"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AU2NZQ5H8X5K6"
                },
                "Date": "on February 27, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Love it. If more Professors were like Feynman, more students would take Physics"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1J2LBWOAKMDB0"
                },
                "Date": "on December 16, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "Looks like it must have been more exciting at the time of its first edition."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IIL6QMG09RMS"
                },
                "Date": "on December 4, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Elementary physics at its fineness. Out of date (1963) but worth the read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WFXJG2HHLHD2"
                },
                "Date": "on January 26, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Richard Feynman. . . . .great. .  ; ; ; ; ; ; as always. . . Enough said ."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WY5AW4BIXZUY"
                },
                "Date": "on October 27, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Classic Feynman! Great read for the amateurs and professionals alike."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2I6VJBS8JF0T3"
                },
                "Date": "on February 25, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This is a wonderful set of essays that are still relevant today."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ON0F2V09VW63"
                },
                "Date": "on November 1, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent intro to both physics & the mind of a physics genius"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BY3Z4BAN0EPH"
                },
                "Date": "on February 26, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Written for us by one of the smartest people ever to live."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A115I0TKHQD58A"
                },
                "Date": "on February 26, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Book referred by Elon Musk.  A quick lesson in physics"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IGDSM9RLRHGG"
                },
                "Date": "on July 26, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Historically interesting, but substantially outdated"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BBFRB6BMHH3F"
                },
                "Date": "on February 12, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent reading for physics and chemistry majors"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A335ACV7IF5904"
                },
                "Date": "on November 16, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Still a solid book for undergraduates.  A classic."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17JUXNU7PUWMU"
                },
                "Date": "on December 16, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Anything by Richard Feynman is great to own"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2I05RUVN2GIRP"
                },
                "Date": "on March 11, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Good refresher for the general reader."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATO9XRWKWG13I"
                },
                "Date": "on March 6, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Good product and good service."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VLWLP0WI7FWF"
                },
                "Date": "on May 6, 2011",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": "I enjoyed the rhythm of his speaking. We can see how he thought about the physics to understand the world."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A290JO6QURDHFM"
                },
                "Date": "on March 4, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "As advertised"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on May 22, 1999",
                "Helpfulness": 0.5555555555555556,
                "StarRating": "5",
                "Text": "buy this book if you enjoy the superious feeling you get after asking someone if they know why soup cools down when you blow on it... ha ha ha!!! this book is the perfect physics 101 class. or class primer. it's so great  knowing the answers to all the teachers questions before taking the  class......"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A246PCXQEMSJIK"
                },
                "Date": "on January 26, 2005",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1O577GT5P7IEU"
                },
                "Date": "on March 23, 1998",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Judging by the sheer number of biographies and other books, Dr. Feynman was indeed a most curious character. His voice, New York accent and humorous and direct delivery make this lecture series a joy to listen to. Physics has never been so clear and enjoyable!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASTMMKET7T0NW"
                },
                "Date": "on February 13, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "great"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28BWF3NTVY6PO"
                },
                "Date": "on April 30, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "good"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4Y1IJIQO2T4M"
                },
                "Date": "on August 27, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Love it!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMFUPHOWZ4QKC"
                },
                "Date": "on August 27, 2000",
                "Helpfulness": 0.4444444444444444,
                "StarRating": "3",
                "Text": "Feynman's Lectures are considered to be one of the best introductory texts  by Nobel laureates, e.g. Pauling's General Chemisty and Samuelson's  Economics. However, the book is not appropriate as a freshman textbook. To  shorten it up to make another pop science book directed at more serious  readers was not a bad idea to begin with. But personally, I, too, like a  reviewer below, felt slightly bored while turing pages. I confess, for  practical insights, Epstein's Thinking Physics was much better."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RXMCUN2NM6NX"
                },
                "Date": "on May 14, 2009",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "My order was received in a timely manner and in good condition.  Thanks for making certain our gifts to our grads were here in time."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2O6KXXTOX1Y8Z"
                },
                "Date": "on August 4, 2010",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "The book by Richard Feynman was in perfect condition and delivered promptly.  The timeliness of the delivery was especially important to me."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 24, 1998",
                "Helpfulness": 0.43333333333333335,
                "StarRating": "3",
                "Text": "I admit from the onset that my review of this work is tainted by two  facts: (1) I'm an engineer and not a physicist and (2) I've received enough  lectures in physics to be utterly bored with almost the entire first half  of the book.  Don't get me wrong, Feynman is an utter genious.  I was just  bored with the book because it read like a Physics 101 class.  His careful  construction of our modern physical world piece by piece was interesting  but not very informative.  I wasn't impressed and it seemed to me that this  book was simply published so someone could make money off of Feynman's  lectures.  I didn't see much here to make me sit up and pay attention  instead I was busy mentally doodling while my eyes scanned the pages."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11S64FDELXBR8"
                },
                "Date": "on December 23, 2013",
                "Helpfulness": 0.2222222222222222,
                "StarRating": "1",
                "Text": "Nothing wrong with what Feynmann has written. The problem is the images or illustrations are not there or not legible. I cannot understand what Feynmann is talking about if I cannot see the illustrations. The problem is with kindle or wherever they sourced the text from."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CDB11A78ROO8"
                },
                "Date": "on July 13, 1999",
                "Helpfulness": 0.25,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A126KX6FVI4T66"
                },
                "Date": "on January 18, 2009",
                "Helpfulness": 0.08333333333333333,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NWEB098CQP75"
                },
                "Date": "on February 18, 2012",
                "Helpfulness": 0.19047619047619047,
                "StarRating": "2",
                "Text": "I wouldn't advise anybody to read this book. I'm positive Feynman is brilliant, but I think there are very few truly bright people who can write a suposedly simple book on physics. I'd read Brian Green, Krause, or maybe even Richard Dawkins (he writes on biology, however. Not physics). I've read all of Greene's books. They are wonderful."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZ2BKU26CVBCF"
                },
                "Date": "on January 21, 2012",
                "Helpfulness": 0.20512820512820512,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NZ3OBRUF13FA"
                },
                "Date": "on January 4, 2011",
                "Helpfulness": 0.1282051282051282,
                "StarRating": "2",
                "Text": "I'd never have guessed.  It was too short and slapdash to be all that useful.  I don't really know what one was supposed to get out of it.  If I had no formal physics training and this was all I read I don't think I'd be all that informed.  The major concepts the book covers have been covered better elsewhere.  As for modern physics, there are better ways to learn (Physics for the Rest of Us, Schroedinger's Kittens and the Search for Reality, Quantum:  A Guide for the Perplexed, even the book Einstein himself wrote as a primer for relativity--while flawed--was decent).  As for the classical stuff, there are simply too many primers better than this to really list."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Six-Easy-Pieces-Essentials-Explained/product-reviews/0465025277/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "142"
    },
    "Salesrank": "#17,441",
    "Timestamp": "2015-05-24 12:46:32.822460",
    "itemurl": "http://www.amazon.com/Six-Easy-Pieces-Essentials-Explained/dp/0465025277"
}
