{
    "Category": "in Books (",
    "ListPrice": "$15.95",
    "Name": [
        "The 4 Percent Universe: Dark Matter, Dark Energy, and the Race to Discover the Rest of Reality"
    ],
    "OfferPrice": "$5.98",
    "Reviews": {
        "AverageStarRating": "3.9 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AR1T36GLLAFFX"
                },
                "Date": "on December 23, 2010",
                "Helpfulness": 0.921875,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JHC8O59WDHFZ"
                },
                "Date": "on December 29, 2010",
                "Helpfulness": 0.8682634730538922,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJXNW815HTX5O"
                },
                "Date": "on December 27, 2010",
                "Helpfulness": 0.7967479674796748,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QH9BO3H3WYZA"
                },
                "Date": "on April 6, 2011",
                "Helpfulness": 0.875,
                "StarRating": "2",
                "Text": "I'll bet the publisher insisted on this title, while the author's submitted title was then demoted to the subtitle:  \"The race to discover...,\" etc.  More concerned with the details of the effort leading to discovery than to the actual discovery - and a soap-opera style accounting of the personalities involved - this work should please those interested in those aspects.  If the science is what intrigues you, look elsewhere.  This is not a science-for-the-public book like those written on Evolution by Richard Dawkins or on language by Steven Pinker."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KJ9UTP3TSDJW"
                },
                "Date": "on December 13, 2010",
                "Helpfulness": 0.8181818181818182,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A344YRMJNVSGPH"
                },
                "Date": "on May 16, 2011",
                "Helpfulness": 0.875,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NFL6R2CM1F6Y"
                },
                "Date": "on March 12, 2011",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2POWM4EBQXFLT"
                },
                "Date": "on August 12, 2011",
                "Helpfulness": 0.8888888888888888,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMKNPIDFLRFMP"
                },
                "Date": "on March 6, 2011",
                "Helpfulness": 0.875,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BYGMRVLKRQFK"
                },
                "Date": "on February 3, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AN89MYMWS3FI8"
                },
                "Date": "on May 21, 2012",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1J5HIF41ENSMZ"
                },
                "Date": "on March 13, 2012",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4JHEO7H330AF"
                },
                "Date": "on December 2, 2010",
                "Helpfulness": 0.7692307692307693,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36K2N527TXXJN"
                },
                "Date": "on February 28, 2013",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WU2GH2HFC7D2"
                },
                "Date": "on December 19, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKB3RVCGLW4TK"
                },
                "Date": "on June 23, 2012",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "2",
                "Text": "So many people are waiting for a breakthrough on what might be Dark Energy and Dark Matter. When this book came out I'm sure we all thought \"something new\" was finally out. You will not find something new in this book. What you will find is a history lesson about how the 4% was discovered. It is a good history lesson, but I feel played by the author. Knowing the subject is popular, let's see if we can get one more run at the audience. This is an author's retirement book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RW587355CMVA"
                },
                "Date": "on November 23, 2010",
                "Helpfulness": 0.75,
                "StarRating": "4",
                "Text": "Dark energy/matter is really quite a convoluted concept in theoretical physics, reading text books on this theory will make ones head spin and explode. The 4% Universe, on the other hand, took a complex and dry mathematical construct and turned it into an intriguing tale of mystery and awe. This book also made my head spin and nearly explode, but it's from truly grasping the difficult physics idea of dark energy in a decidedly non-mathematical manner. Bringing the beauty of science to non-scientist readers: mission accomplished!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36JK2BSXS0U43"
                },
                "Date": "on December 30, 2010",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AF3EWORDT15AU"
                },
                "Date": "on May 17, 2012",
                "Helpfulness": 0.8,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MX96YM4NT6HT"
                },
                "Date": "on August 20, 2011",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A222RXYPA6VZU1"
                },
                "Date": "on September 4, 2012",
                "Helpfulness": 0.8,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NAG5MZLFSIC2"
                },
                "Date": "on January 11, 2012",
                "Helpfulness": 0.8,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2L4ZGN7GZJ95T"
                },
                "Date": "on December 11, 2010",
                "Helpfulness": 0.7,
                "StarRating": "3",
                "Text": "This book is written by a skilled, experienced journalist.  It adds a dramatic flair to the developments in cosmology and astrophysics that have led to consensus views about the universe and the nature of reality.  The reader gets an insight into the personas of influential scientists and the political nature of scientific institutions.  The main drawback to this book is that it focuses on the shifting consensus in this field while failing to explore other ideas that challenge the dominant notions.  It ignores scientists who have exposed flaws in beliefs about red shift and the big bang and doesn't examine the ramifications of quantum theory and metaphysical ideas, which could offer better explanations for things that some attempt to address with dark matter and dark energy.  In science it's common for inaccurate assumptions to form the foundation of theorizing and research.  This book offers an engaging look at developments in these areas of investigation but it looks at only a small slice of ideas and evidence pertaining to the subject matter.  It doesn't question assumptions that truly do need to be questioned.  Thus, it may intrigue and stimulate the mind of the reader while leaving the reader still rather ignorant about what is being discovered about \"reality\" via multiple disciplines.  Thus, for style this book is a solid effort and a pleasant read, but I can't recommend it for those seeking a really advanced, more accurate understanding of the universe."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFN32PGTZ31MV"
                },
                "Date": "on July 15, 2011",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "The 4 Percent Universe begins as a very concise description of the problems and discoveries of earlier cosmology (how the cosmic background radiation was discovered, Einstein's cosmological constant, etc.) and then focuses on two teams that used different approaches to end up with the announcement of dark matter/dark energy.  The style is quick-paced and clear, highly informative and easy to follow without feeling overly dumbed down. It's a great example of popularized science.  My only personal quibbles with the book are that sometimes I thought it focused a bit too much on the scientist themselves to the detriment of the science (or if not to the detriment of the science to the detriment of the book's concision and efficiency) and that at times the listing of dueling press releases became a bit of a blur.  In other words, in the latter quarter or so I felt the book lost a bit of its focus on the science and wandered a bit too much in the forest of personalities of those trying to do the science.  I acknowledge, however, that some will find that such a choice humanizes the science more and makes the book more of an entertaining narrative.  But save for that small complaint, I found the book a great science read. It did a nice job of placing discoveries in scientific and historical context, was detailed without overloading the reader, explained issues clearly and concisely, and was nicely up to date.  Strongly recommended for the clarity and concision with a small complaint that it focused a bit too much on individual personalities toward the end."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A300QWOTEHGKRL"
                },
                "Date": "on February 4, 2011",
                "Helpfulness": 0.75,
                "StarRating": "4",
                "Text": "The 4% universe is part of a host of new books of physics, quantum physics, and the respective specialties that are within each discipline.  There are now many books dedicated to these specialized areas, but most have the typical summary of classical physics, the new physics, and then the author makes finally makes their point.  For example, the book Massive--a fantastic book--is dedicated to the Higgs Boson and Higgs field.  There are also many books, new and old, dedicated to the issues of 'dark matter' and 'dark energy.'  This book does have some of the typical background, which is a good thing which, including many clear examples such as descriptions of \"brane\" universes, the meaning of 'nothing' in physics and measuring cosmic distances.  I would have given this book 3-stars, but for the fact that it is well written, it has a logical flow, and there are many great examples of the new physics.  The problem, however, and this may be due to the fact that a Wikipedia article can summarize both topics in one article, is that the 4% universe is more about the people (or two main teams) behind the discovery that we can only see 4% of \"ordinary matter.  That is to say, given the extensive reviews above, the main complaint is that the book should have been labeled The Race to Discover the Rest of Reality, because there is an overemphasis on the teams involved in the race to reality.  In other words, the books main defect--and I am not the only one to notice--is that there is too much emphasis on what each team is doing, their respective competitions.  If you are a physicist, then you would want this book for your personal library as it deals with many of the people behind the scenes.  I read every page (there is much repetition, which is good for learning), but the emphasis was largely unpacked like a class action biography on many people and their respective teams.  There is enough knowledge to exhaust all there is to know about dark matter and dark energy, so you will not be wasting your money.  But, you could lose focus given the author's focus."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BIVEVYGM0BY4"
                },
                "Date": "on September 25, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "With amazement I read The 4 Percent Universe -- Dark matter, dark energy and the race to discover the rest of reality, a non-fiction book by science writer, Rickard Panek. He covers the race to discover reality between a group of physicists and astronomers, which in the process birthed the science of cosmology. Read the epilogue first. In there on page 242 Panek says, “In early 2010 . . . the results arrived bearing the latest refinements of the numbers that define our universe. It was 13.75 billion years old . . . . it was flat, consisting of 72.8 percent dark energy, 22.7 percent dark mater, and 4.56 percent baryonic matter (the stuff of us) – an exquisitely precise accounting of the depth of our ignorance. The astronomers who set out to write the final chapter in the history of the universe had to content themselves instead with a more modest conclusion: to be continued.” Isn't it amazing? We don't know what dark energy and dark matter are, and they compose most of our universe. Of course, we now have to think about parallel universes and multi-verses. Brian Greene's new book The Hidden Reality addresses these, and I recommend following up with it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21JEJ2EJJPO6I"
                },
                "Date": "on December 16, 2010",
                "Helpfulness": 0.6829268292682927,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VBXQKRM7A4JR"
                },
                "Date": "on December 14, 2010",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LD9WEWWH4WCP"
                },
                "Date": "on February 15, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Creates a few more questions but shows you what physicists and cosmologists are facing with recent discoveries and theories about the universe.."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DW86MO4H3OQL"
                },
                "Date": "on May 5, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Most science books I read talk about the views of the author, which is supported by a few details of previous discoveries.  It never really occurred to me before how the politics of science actually works.  This book is crammed full of that stuff to the point where you have wonder how the author would find such in depth detail.  It's great."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2F52JIWFJODQY"
                },
                "Date": "on March 29, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "The incredible advances made in understanding the universe in the past 30 years boggle the mind. Mr. Panek traces a line from Copernicus and Galileo to Einstein to Pearlmutter and Riese, et al and shows that while we have learned a lot, we are far from knowing everything about how the universe works, was formed and how (or if) it will end."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AR78XDXU4FG4U"
                },
                "Date": "on December 21, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This dramatic story brings us to the current best knowledge of how little of the universe we know. We are able to infer only 4% of known reality because Dark Matter and Dark Energy are unknowable with our current limits of perception, - - - in other words, with all known extensions of our senses thru telescopes, radio telescopes, the complete gamut of sensory extensions, we cannot know the substances that we now call Dark Matter and Dark Energy by any means currently available except thru reasoned inference about its volume, mass and effect. We know only that it exists -- but we can't perceive its substance. Like trying to explain color to a blind man, or music to a deaf man. It surrounds us, passes thru us and challenges our ingenuity to even sense it - but we're beginning to under special conditions. We are Galileo seeing the vast new realms of the unknown."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7EHUTSMS4X4K"
                },
                "Date": "on March 21, 2014",
                "Helpfulness": 0.75,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASU07CYNOMXUS"
                },
                "Date": "on December 16, 2013",
                "Helpfulness": 0.75,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LNXRY6SWM2QO"
                },
                "Date": "on April 10, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Devoured this book in a few short days.  Absolutely loved it.  Appreciated the very well written overview of cosmology in the last decade(s), as well as Mr. Panek's device of embedding within the story the human-animal stuff of competition, hierarchy, and the desire for recognition (paradoxical, illusory immortality!)."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UC941LY4MWQE"
                },
                "Date": "on September 23, 2014",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "I was hoping this would be more about physics of the universe. It was too much about the politics of who found what first. It was mostly the names of all the people who were studying universe. The astronomy, and the processes they were using to make discoveries were interesting."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15CQUYNFOF7OI"
                },
                "Date": "on March 1, 2011",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35QH0VO74WIKT"
                },
                "Date": "on February 16, 2011",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32T2H8150OJLU"
                },
                "Date": "on January 26, 2011",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJLW1DZSHOVGW"
                },
                "Date": "on January 15, 2011",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1U7LS93I03MFW"
                },
                "Date": "on December 21, 2010",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QGRSZ7VTV0SY"
                },
                "Date": "on December 5, 2010",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3U78OW4OO2Q8W"
                },
                "Date": "on December 31, 2010",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DHCHMROSBTKE"
                },
                "Date": "on March 25, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "While a physicist, I am not an astrophysicist. And, while a non-scientist would also enjoy and learn from this book, it is written at a level that can be well appreciated by scientists."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHAZF5JB2VNHR"
                },
                "Date": "on March 1, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANTGGAQYPSWHF"
                },
                "Date": "on January 3, 2011",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3H6NNGCINPLEC"
                },
                "Date": "on November 28, 2010",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1M85S3L9ROA17"
                },
                "Date": "on April 26, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JDOP7ASUNSER"
                },
                "Date": "on August 4, 2014",
                "Helpfulness": "",
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1F0SDSK7OHTRT"
                },
                "Date": "on January 24, 2011",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EN4GKH9UKRX0"
                },
                "Date": "on October 6, 2011",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "In his book the 4% Universe Richard Panek gives us the history behind the baffling concept of dark matter and dark energy. The book covers one of the greatest mysteries facing science today, the universe's missing mass. Modern cosmology has two groups of scientist working (the astronomers and the physicists) to solve this puzzle. Both are very different in how they work and how they think. But the answers that they hope to find will change the way we look at the universe forever! The book covers some very complex theories and concepts but Mr. Panek does a good job making the complex simpler to read and understand. I feel the book could have been improved by adding a few illustrations."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28JCEI2IKEJD0"
                },
                "Date": "on November 22, 2013",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IR9YVX9O927G"
                },
                "Date": "on May 5, 2013",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQMM3LNZUD3H4"
                },
                "Date": "on February 7, 2012",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3I54UTIZEPQI5"
                },
                "Date": "on February 5, 2011",
                "Helpfulness": 0.6363636363636364,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IR18OMDDTF38"
                },
                "Date": "on May 30, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VSKVJY54ACK"
                },
                "Date": "on May 20, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "An interesting history of what's truly new in the world of science.  Well worth reading.  Discoveries literally of a scale too hard to imagine.  I can't help thinking to myself:  what does this all mean and where is this leading us?  So many unanswered questions; so much to explore."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A49DXD4WVLSLL"
                },
                "Date": "on August 23, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZWWPJDV8T7G4"
                },
                "Date": "on August 17, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I have always been interested in physics, astronomy, and cosmology. This book explains much of what I have not understood about the whole concepts of dark matter and dark energy. I'm glad I bought it!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AYO03DF26O7X"
                },
                "Date": "on August 15, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I think this book is great. It presents the discovery of Black Holes in an interesting way and is done so that someone not familiar with science would understand how black holes were initially discovered."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YKIV3MCX5D4N"
                },
                "Date": "on July 22, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Not only does this book tell you what the advances have been, but the human story of how they were derived and why.  The insight into how science moves forward is illuminating."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOGEOT9OD1V9B"
                },
                "Date": "on July 17, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKQM58BHRSXC7"
                },
                "Date": "on July 7, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A288IFM1W1ATKV"
                },
                "Date": "on March 18, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This book follows a well-defined, and fairly carefully constrained, plan when describing the events and personalites involved in the recent history of dark energy (and dark matter). I'd say there's as much history/sociology coverage as science writing ... if you're interested in the group dynamics of astronomical researchers, or the balance between cooperation and competition in science, or the \"inner workings\" of how science really gets done in an environment of scarce resources (and when there's a Nobel prize on the line), this book is very interesting. If you're not very interested in delving into the personalities of some of the main actors in this drama, you may find this book a little too much of a character study, but I found it entirely enjoyable."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2E3M0NAK8E63J"
                },
                "Date": "on March 3, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PDJ93G0AFF02"
                },
                "Date": "on January 1, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "An interesting read! It was more about who did what than it was about Dark Energy and Dark Matter but it tells how far we have come in such a short time."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJGQX10XRJ7TD"
                },
                "Date": "on August 9, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The 4% Percent Universe is one which intrigues the reader to the end. I have heard a lot about dark mattter, but it is cool to read about dark energy as well and how the universe is a lot more varied than what we have originally imagined. There are so many things to still ponder about our marvelous universe."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKP3BL2OMH4V1"
                },
                "Date": "on July 22, 2011",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "A fascinating subject that is not done justice by the author.  Figuring out where or what is the missing matter in the universe is a complicated problem to say the least.  The author seems to enjoy the subject, but does not seem to have a firm grasp on the subject matter himself.  So he tends to add too much TV drama to the story in an attempt to make it more exciting.  The book ends up being rather boring as a result of this.  Math and graphs are necessary to make a story like this interesting.  And every profession has it's internal quarrels.  The reader can watch \"The Office\" for this sort of entertainment.  A great writer would take a complicated subject matter like this and add simple analogies to help the reader make sense of it all."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12O5SEIF162P8"
                },
                "Date": "on May 19, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I have had a lifelong interest in Astronomy.  One of the things I love about it is the constant appearance of new discoveries.  Dark energy and dark matter are two of the most amazing and basic discoveries in centuries.  This is a facinating book for anyone with any interest in the subject."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2X4AROUYH5L6N"
                },
                "Date": "on December 7, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book really illuminates the persons and personalities of the growth of modern cosmology. I wonder when we will figure out where all the missing matter in the universe is folded away."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADY7WVROHO9Q2"
                },
                "Date": "on November 14, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Extremely well researched and written.  It's understandable and deals with the search for dark matter and energy in an entertaining manner."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QWXSEBVP2ARK"
                },
                "Date": "on February 1, 2015",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "I thought it was pretty good, although I have read some recent books on cosmology Iliked better."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VAVWX7FQROFB"
                },
                "Date": "on December 11, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Recipient was very pleased with the book. Service was prompt as usual. Thank you very much."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TK4QWTTLA48H"
                },
                "Date": "on August 15, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great book. Read it from the library and wanted to own a copy for future reference."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1D1P9JQKWW8N"
                },
                "Date": "on October 31, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent all the way around. I would buy from them again. Very satisfied overall."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PD2DWHRQ9J1V"
                },
                "Date": "on March 6, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Good review of the work leading up to the current understanding of the universe."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NKPXKMDTF360"
                },
                "Date": "on January 11, 2013",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Our youngest son is a physics major and has applied to graduate school.  He is interested in particular physics and dark matter.  I heard a book review about this book and bought for him as a gift.  I was happy to find something current and relevant in his field of study outside of a University bookstore.  I got great service and will purchase more books from Amazon.com in the future."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20XQ75YQ7D2D4"
                },
                "Date": "on December 10, 2013",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANKE5AV5SDPY4"
                },
                "Date": "on February 1, 2013",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": "Richard tries to make The 4 Percent Universe a historical novel with many incidentals, and this works. I am about half-way through and he doesn't get crazy with the technical details - NO MATH! - but still explains some of the \"gee-whiz\" discoveries well enough that the reader is amazed and impressed. The discoveries are pretty crazy, but the scientists are wicked-smart, so you have to believe them."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMMBKKYZC88L5"
                },
                "Date": "on January 8, 2013",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": "My prior knowledge of cosmology was very basic. The 4 Percent Universe, provides an entertaining view of the history of cosmology and our present understanding of it. Is full of the characters that have developed the science of cosmology, their contribution, theri doubts, and their anectdots."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1G0DH7UQ4ILS6"
                },
                "Date": "on January 1, 2013",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28TEYUOFXAJCK"
                },
                "Date": "on December 28, 2012",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KB2W08B0FAKV"
                },
                "Date": "on January 19, 2012",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MHGA6BJJ7P27"
                },
                "Date": "on January 27, 2011",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AELS725C34F9Q"
                },
                "Date": "on January 22, 2011",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MTDY36YE0NJF"
                },
                "Date": "on October 19, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Very informative on how things came together."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30D1UMCCNBMLT"
                },
                "Date": "on June 26, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Item delivered on time, and was as described."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JU2UWORV69T2"
                },
                "Date": "on September 4, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Very interesting book and  well focused."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YXRT2XIJIO57"
                },
                "Date": "on December 1, 2010",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWP4YEDIS3B3S"
                },
                "Date": "on November 26, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Mind-blowing"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VFX417XDNWIU"
                },
                "Date": "on December 31, 2010",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALIP01LQPOIMC"
                },
                "Date": "on February 11, 2012",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Altogether i would say this book is a well written entry on the ideas of dark matter and dark energy. Anyone seeking to learn about these mysterious ideas should whole heartedly read this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AC1TE2HNEVP1Z"
                },
                "Date": "on July 20, 2014",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": "The author could have presented the readers with photos, graphs or other illustrations to help the reader understand what the author wants to convey especially to a lay reader.  As a lay man I am unable to imagine everything the author refers to."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Q8EO1713G5K"
                },
                "Date": "on October 5, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AN8BVKNIX37HY"
                },
                "Date": "on April 21, 2014",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "I missed the sub heading and had not planned on learning the history and back story here but I am glad of the happy error as I'd have not come across this else-wise."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATXIWW1H20KLA"
                },
                "Date": "on September 15, 2013",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31870QDB0U67Y"
                },
                "Date": "on July 12, 2013",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "3",
                "Text": "Book was probably too early as not enough hard facts are known yet.  Most of book was about inter squabbles between competing scientists.  I was looking for answers not gossip."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMNX9TCC6ST3R"
                },
                "Date": "on May 22, 2013",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "3",
                "Text": "I know this is real life, but I wanted a sense of wonder and excitement by following these developments. This story involved too many characters which were involved. Maybe it was just me, but the author could have simplified the story and increased the dramatic aspects of the discoveries.  I would also have enjoyed reading more about the technical challenges and the equipment to do the observations."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WV1HOP7HR2M2"
                },
                "Date": "on January 9, 2011",
                "Helpfulness": 0.4,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36S5QPUX3OATR"
                },
                "Date": "on December 23, 2010",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30IP5D5DLHRPA"
                },
                "Date": "on December 16, 2010",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AI2356QT6UV93"
                },
                "Date": "on December 16, 2010",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DKBKTJNRO56X"
                },
                "Date": "on February 20, 2011",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "2",
                "Text": "Since the book is about dark matter and dark energy, its title should be \"The 96% Universe\".  Anyway, the presentation of scientific facts is not very clear or organized. It is more of a collection of somewhat irrelevant anecdotes written in a somewhat pedantic style.  It also lacks graphics, pictures and a glossary. And perhaps it is not yet the time to write the history of the dark entities, they are still newborns."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A109JXYK2IN8DG"
                },
                "Date": "on March 3, 2011",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXH4AG4AU1SER"
                },
                "Date": "on March 10, 2011",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "This is a very great book. I highly recommend it. It covers a great many things and explains them as clearly as possible."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10YVLJ9INZ53R"
                },
                "Date": "on September 16, 2013",
                "Helpfulness": 0.2857142857142857,
                "StarRating": "1",
                "Text": "Just gossip; couldn't understand it.  Never really got a feel for the 96% of dard matter/energy.  The author just wanted to tell about the people involved."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4T02WCYLG2NQ"
                },
                "Date": "on March 21, 2011",
                "Helpfulness": 0.45454545454545453,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A124QJ7OQV7KVH"
                },
                "Date": "on November 4, 2013",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HW4M029I31C8"
                },
                "Date": "on February 28, 2014",
                "Helpfulness": 0.14285714285714285,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5M4Z9R4GI74S"
                },
                "Date": "on January 31, 2011",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "Einstein's cosmological constant unveiled dark matter/energy.  Does this book reveal anymore facts about the makeup of our Universe.  I have just started reading it.  To be continued."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABP0RCZCVMRRG"
                },
                "Date": "on March 5, 2011",
                "Helpfulness": 0.4186046511627907,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AY6WMDCJ6PMAH"
                },
                "Date": "on January 27, 2011",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "Subject matter was addressed in a manner way over my head.  Going to require a little more research and study to fully grasp."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Percent-Universe-Matter-Discover-Reality/product-reviews/0547577575/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "112"
    },
    "Salesrank": "#269,167",
    "Timestamp": "2015-05-24 13:37:45.529218",
    "itemurl": "http://www.amazon.com/Percent-Universe-Matter-Discover-Reality/dp/0547577575"
}
