{
    "Category": "in Books (",
    "ListPrice": "$37.95",
    "Name": [
        "Aristotle's Physics: A Guided Study (Masterworks of Discovery)"
    ],
    "OfferPrice": "$33.05",
    "Reviews": {
        "AverageStarRating": "4.0 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23YVNYC0V034"
                },
                "Date": "on August 29, 2006",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11616NZ7Y8TGS"
                },
                "Date": "on February 25, 2002",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on September 17, 1996",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on September 17, 1996",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2U34U00F7L3V9"
                },
                "Date": "on October 17, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This translation of Aristotle's Physics is really the best one available - and not simply because the others are terrible (some of them are not terrible), but because this one is extraordinary.  As some of the other reviewers may have suggested, it can be hard to read at times because of the unfamiliar phrasings.  However, I think this is irrelevant because (a) other translation are not easy reading either, (b) other translations are not as good at capturing Aristotle's meaning so that even if they were much easier to read they just make it that much easier for you to misunderstand Aristotle, (c) in fact the efforts required to follow the unfamiliar phrasings in this translation are themselves part of what makes this translation the most useful for anyone who wants to understand Aristotle, and (d) its really not all that hard to read.  (And the same points go for the other translations by Sachs.)  Sachs unpacks the richness of the Greek terms in his translation rather than covering it over with English terms that give you the illusion of understanding or force you to constantly adjust your thought about what the English words are supposed to mean in the context of Aristotle's philosophy.  For example, Sachs' translation of energeia as \"being-at-work\" as opposed to \"activity,\" and entelecheia as \"being-at-work-staying-itself\" as opposed to \"actualization.\"  Sachs' translations here really put the nuances of the Greek terms to the forefront, and they give you the opportunity to think through (and to think hard about) what Aristotle must mean in a beautiful way that makes reading this translation a real learning, eye-opening, awakening experience.  Also Sachs provides very useful glossary, introduction, and commentary. If you're just starting Aristotle or have been studying him for years, this translation is sure to do you right.  I've been studying Aristotle for about a decade and a half and I never cease to very greatly appreciate Sachs' translations.  --Michael Russo"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 24, 1999",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": "Sachs is king.  When will other translators realize that their writing is not better than masters like Aristotle.  Sachs is going to run those hacks out of business.  There is interpretation here (it's very good) but Sachs  has the decency to keep his thoughts to the side and out of Aristotle's  way. Thank you for introducing this genius to the English speaking world,  Mr. Sachs."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VYU5IAMTJ3R7"
                },
                "Date": "on July 1, 2006",
                "Helpfulness": 0.7272727272727273,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on August 7, 1998",
                "Helpfulness": 0.7777777777777778,
                "StarRating": "5",
                "Text": "This is a solid translation with valuable introductory material and glossary. We also hope to see Mr. Sachs' \"Metaphysics\" and \"De anima\" in print soon."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23DPNJ74GE5Z8"
                },
                "Date": "on November 12, 2009",
                "Helpfulness": 0.625,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2N34TG9RBYB19"
                },
                "Date": "on July 26, 2006",
                "Helpfulness": 0.6,
                "StarRating": "3",
                "Text": "I have used Sachs' translation of the Nichomachean ethics and found it helpful, so I will not criticize Sachs' translation technique here. Unfortunately though I could not use this edition of the physics for one simple reason. The line numbers are not in the margines but imbeded in the text, and not bolded. This made it very difficult to use in the semenar style discussions of St. John's College (ironically the college that Sach's is a professor at). So I stopped using it emediately and opted for the complete works version so I could participate in semenar discussions. I would like to give Sachs' translation of the physics a chance but the lack of clear line numbers in this edition is a serious problem for me."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Aristotles-Physics-Guided-Masterworks-Discovery/product-reviews/0813521920/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "10"
    },
    "Salesrank": "#388,086",
    "Timestamp": "2015-05-24 13:21:51.563799",
    "itemurl": "http://www.amazon.com/Aristotles-Physics-Guided-Masterworks-Discovery/dp/0813521920"
}
