{
    "Category": "in Books (",
    "ListPrice": "$64.95",
    "Name": [
        "CSET Physics 123, 127 Teacher Certification Test Prep Study Guide (XAM CSET)"
    ],
    "OfferPrice": "$44.65",
    "Reviews": {
        "AverageStarRating": "2.1 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11UPW1QRPNZLR"
                },
                "Date": "on July 13, 2010",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2I6J63L6K5TL0"
                },
                "Date": "on August 15, 2010",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "I came into the CSET as a physics major one quarter from graduation, and this book had value to me in pointing out what I had to review as well as brushing up on some things I had forgotten. While you should not expect to learn many new things from this text, when combined with a college general physics text it can give you a good way to fix weakpoints in your knowledge. It is also good for cramming. Given I was busy this summer, I had only 3 days to study for the test. In that period of time I was able to go through the book, take the practice test (which was helpful review)and go over a handful of things I wasn't confident about. It ended up working for me and I passed."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6WKXPFUWFE8F"
                },
                "Date": "on March 23, 2011",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "This book does hit on every section of the review however for someone who hasn't taken physics in quite sometime u defiantly need  additional material. Some of the simple equations are not listed here in this book and you will need to look elsewhere. I wish the publisher had put in 5 or 10 practice problems per section I think that would have been made this a much more useful review tool."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14AWWTA1VTEE5"
                },
                "Date": "on September 13, 2013",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": "I had purchased this Study Guide to see if it really would be a good review of all 4 years of Physics undergraduate courses.  I figured, if one is going to teach the material, better know the material as if you were planning for a graduate degree.  Unfortunately, I found that while the material is 'ok', to really prep for the test, much more understanding and familiarity with problem solving is required.  A better guide I've found is Schaum's \"3000 Solved Problems in Physics', by Halpern.  This Schaum's guide does a much much better job getting one primed for any test question that could be thrown at one.  Maybe I'm spolied, having gotten the MS in Physics 2 years ago, so I expect a much higher level of rigor in presenting the material.  The CSET Guide is good for getting down how teachers are thinking about major topics, but detailed thinking on specific Physics areas isn't really emphasized.  It appears that the CSET Guide is geared to just get one in the door, and leaves really getting a handle on the subject matter up to the 'new' teacher."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3R76AAHNBKVEC"
                },
                "Date": "on July 20, 2014",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": "This was a fairly unhelpful book. Where it should explain to you where equations were derived from, it just tells you what the equations are. It's the worst kind of science education, not showing you how to understand, more just giving you a list of equations it wants you to know. The problem extended to the explanations of the practice CSET within where the questions that I understood the least were also the least explained. If you have no other option, this will show you what the format of the test will be similar to and what sort of questions you might find on it, but you won't get much else here."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26GOE52089KKY"
                },
                "Date": "on June 8, 2011",
                "Helpfulness": "",
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2F7T10FNGMXZ5"
                },
                "Date": "on October 30, 2012",
                "Helpfulness": "",
                "StarRating": "1",
                "Text": "While I'm inclined to write reviews I will make an exception.  Don't buy this book.  The physics information is thin and poorly written, the california state information is just a regurgitation from the CSET site and the sample testing is very limited.  If I could get my money back I would."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31F2U8W4OFU67"
                },
                "Date": "on March 1, 2014",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": "If you already are a physics major and have to take the CSET this would probably be a great help. If you are not a physics major, you will probably need a lot more. This is definitely not physics for dummies."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Physics-Teacher-Certification-Study-Guide/product-reviews/1581972245/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "8"
    },
    "Salesrank": "#595,020",
    "Timestamp": "2015-05-24 13:35:07.915017",
    "itemurl": "http://www.amazon.com/Physics-Teacher-Certification-Study-Guide/dp/1581972245"
}
