{
    "Category": "in Books (",
    "ListPrice": "$16.00",
    "Name": [
        "Parallel Worlds: A Journey Through Creation, Higher Dimensions, and the Future of the Cosmos"
    ],
    "OfferPrice": "$10.25",
    "Reviews": {
        "AverageStarRating": "4.6 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A359U0JFFZ0Q04"
                },
                "Date": "on February 28, 2005",
                "Helpfulness": 0.9678714859437751,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUYBC6VC7TPDX"
                },
                "Date": "on August 28, 2005",
                "Helpfulness": 0.9761904761904762,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A912C7977MO6O"
                },
                "Date": "on June 21, 2006",
                "Helpfulness": 0.9459459459459459,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2W5TPXQYRLOCM"
                },
                "Date": "on February 16, 2005",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31JA40EVSJS64"
                },
                "Date": "on June 28, 2005",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23E9QQHJLNGUI"
                },
                "Date": "on July 2, 2006",
                "Helpfulness": 0.9032258064516129,
                "StarRating": "5",
                "Text": "I've read most, if not all, of the recent series of published books on this particularly interesting and complicated subject, and this is the one. The most understandable of them all. Clearly written with the non professional in mind. Michio Kaku presents all the information of what isn't the most easily understood of subjects in a fashion which allows for an enjoyable reading experience of the ever changing and sometimes reinvented theory that comes tantalizingly close to the much sought after Holy Grail Theory of Everything. (wow, wasn't that a long sentence.)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3L864XBDDMGML"
                },
                "Date": "on August 13, 2006",
                "Helpfulness": 0.9333333333333333,
                "StarRating": "4",
                "Text": "This is the first book I have read in this field and I was encouraged to read it when I overheard an NPR discussion with Kaku while washing the kitchen floor one day. For me the power of this book (and of the man himself) is its ability to excite the interest of the layman.  As a wannabe teacher, I find Kaku's presentation to be brilliant in terms of his ability to excite his audience and give them 'wow' moments.  Sure, maybe he doesn't present a totally complete and unbiased opinion of the subject matter (although I am not one to judge this), but he may spur the interest of a few of the next generation of comologists and to for me that is what is important - keeping people informed and turned-on to science so that they will pursue the subject and generate the next round of discoveries.  I recommend this to all who love to learn.  I only wish I could attend Kaku's lectures..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KDB0JCJT5BD7"
                },
                "Date": "on March 8, 2006",
                "Helpfulness": 0.7925925925925926,
                "StarRating": "2",
                "Text": "I usually don't bother writing reviews unless I find something particularly noteworthy or lacking.  In this case I have the unfortunate obligation to report that Michio Kaku has completely missed the mark.  I have read most of the available fare that covers theoretical Physics and actually requested this one from my family for a Christmas present.  Because of the author's credentials, the recent copyright date, and the title of the book, I expected to see some presentation in support or against worm holes based on the latest physics and mathematics.  What I found instead can be put into about three categories.  The first part of the book is nothing but a brief history of Cosmology.  The writing is entertaining but there is nothing new in the presentation and there is no indication before hand that this is a work of history.  The second part of the book is an attempt to cover string and M theory.  It is particularly light weight, and although he makes the statement that String Theory is the leading theory of  \"everything\",  he fails to present it in any detail.  Finally, the remainder of the book deteriorates into philosophical and Christian religious ponderings that have nothing to do with the subject of the book.  Will, the author wonders, there be concern over whether a clone has a soul?  He cites the work of numerous Science fiction authors, all of whom I enjoy but have no importance here.  Throughout the book he seems concerned with humanities' need to escape this universe for another as it cools over the next trillions of years, a point worthy of about 1 paragraph.  This anxiety alone raises deep concern over his ability to grasp the true scale and scope of what Cosmology really represents.  And, as far as \"Parallel Worlds\"  is concerned, there is nothing new or convincing.  The author says, \"This may sound like science fiction.\"  Indeed.  Two stars, only because there are probably still many who are looking for a beginning guide to Cosmology and a mixture of science, religion and philosophy.  Not to be considered a work of physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKYNIMNI8LOBP"
                },
                "Date": "on February 22, 2007",
                "Helpfulness": 0.8695652173913043,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2I478TDUACAHF"
                },
                "Date": "on December 10, 2005",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "This book is easy to understand and you really see the basics of cosmology without having to understand equations and the whole physics works. Its easy to read and it totally boggles your mind. It gives you definitions where you need them and it explains to you everything you need to know in the most simplist way. I recommend this book to any beginner or even just the typical reader who finds space and comsology interesting. I, myself, never read about cosmology ever in my life before. When I read this book, it was simple, logical, and really made you think. The author doesn't tell you what to think or believe, he opens your mind to a bunch of different possibilities so you can see the whole picture. He names all the theories and ideas and let's you draw your own conclusions. This book is just a source of interesting facts and info about cosmology without any scientific gibberish that is unpronouncable. It's truly great."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ERU005ES1IHT"
                },
                "Date": "on May 23, 2005",
                "Helpfulness": 0.9285714285714286,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2F3M93RRLFQNJ"
                },
                "Date": "on June 9, 2006",
                "Helpfulness": 0.9230769230769231,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KYVAF83LNE39"
                },
                "Date": "on July 3, 2005",
                "Helpfulness": 0.9230769230769231,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37XJAA18Y3WMQ"
                },
                "Date": "on June 29, 2005",
                "Helpfulness": 0.9166666666666666,
                "StarRating": "4",
                "Text": "What I really liked about this book is that it explained very advanced cutting edge theories of the universe, time and physics in such simple terms.  It is amazing how well this book is written.  It is said that a real genius appears to be a very common man because they can communicate on the most simplest of terms.  This writer is such a person.  If there is one book that you need to get to understand the nature of the universe, then this is that book.  It is amazing.  Just amazing."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26PC6A130JU4T"
                },
                "Date": "on November 6, 2006",
                "Helpfulness": 0.9090909090909091,
                "StarRating": "5",
                "Text": "This Author deserves praise for being one of those few science writers that really know how to divulge science to the layperson without oversimplfying it. I find this book rich in information, interresting speculations and intriguing hypotheses. There is also an honest unbiased appraisal of modern theories,from the famous and somewhat over-vaslued \"string theory\" to the most bizarre \"hologram\" theory.Carl Sagan and Isaac asimov would have  liked this book!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1D9Z20TCUH6ZX"
                },
                "Date": "on May 29, 2005",
                "Helpfulness": 0.9,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZFG0VDXXC8W9"
                },
                "Date": "on April 20, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AO6OFEFDBZG3R"
                },
                "Date": "on February 7, 2006",
                "Helpfulness": 0.9,
                "StarRating": "5",
                "Text": "Ihave enjoyed all of Kaku's excellent books on physics-he has an overwhelming enthusiasm for the subject that is very contageous. In Parallel worlds Kaku revisits many of the same topics he has in his other books, but with updated info from current scientific research, addressing controversies like the \"flatness problem\". He has an excellent chapter on black holes I really enjoyed, plus an excellent chapter on quantum theory and the many worlds interpretation. The end of the book is fascinating speculation on the types of advanced civilizations there could be in the universe. And of course he doesn't steer away from his favorite topic-string theory. Definitely read the book. If you get a chance to see Kaku on TV, don't miss it. One time he was profiled on \"Big Thinkers\" on TechTv and I was blown away by his charasmatic enthusiasm for physics. It would be really nice if there were more physics teachers like Kaku instead of the usual dull variety you find in school."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1V51M8M216Y69"
                },
                "Date": "on June 23, 2006",
                "Helpfulness": 0.9,
                "StarRating": "5",
                "Text": "Michio Kaku presents the world of physics and cosmology in a way that casual science fans can appreciate.  The primary theme of this book is the ultimate fate of the universe and whether intelligent life will be able to escape its fate.  The most interesting theory he proposes is that intelligent beings will be able to escape a dying universe by traveling to a parallel universe which is at a younger stage.  When you read this, you'll be really surprised to see that the world of physics is almost alien to the world of common sense.  To give an example, string theory proposes that all matter in the universe is  nothing but the vibration of strings or cosmic music.  I really recommend this for those who would like to get some insight into the world of physics and cosmology, but don't want to burn too many brain cells with the mathematics of the field."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Z1DOBASN3YZB"
                },
                "Date": "on May 20, 2005",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "First let me state that I am not a scientist and not even particularly well-versed in science.  In college I majored in English Literature; therefore, I need books that explain scientific things to me as a professor would in a lower level course.  Kaku does that - he takes it very slowly and explains history as well as the math so he doesn't lose people like me.  He explains mind bending ideas that a beginner might ask about.  Don't get me wrong, I certainly had to put a good bit of my brain into comprehending; but it was well worth it.  My favorite portion of the book is Part III where Kaku talks about possible science fiction scenarios and merges them with science.  Just be patient with the beginning of the book and before you know it, you will be so engrossed in reading it, it will haunt your thoughts while you are away from it.  If you are interested in string theory, but don't know where to begin, please try this book, it's superb!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3947NAH1FD5A7"
                },
                "Date": "on May 31, 2005",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "This book gives a better view of cosmology and the exploration of other \"worlds\". The reason I gave this book a 4-star rating is that it sometimes goes into a little too technical detail, which can be a little bit confusing for the beginning reader of cosmology books. For the most part, this book explained a lot about cosmology, and gave me a greater sense of the world we could really be living in."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LRMV9VKYV08D"
                },
                "Date": "on May 16, 2006",
                "Helpfulness": 0.9,
                "StarRating": "5",
                "Text": "Serious, scientific, up-to-date, well-written, well-priced, easy-to-read, humorous at times, great writing style for a scientist. Worthy of your time, bookshelf space and money. Kaku digs in very deep without getting tiring or confusing. Highly highly recommended."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AX3V82QQ1A6ZQ"
                },
                "Date": "on May 30, 2005",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUW8TCRK9EDQ6"
                },
                "Date": "on March 2, 2008",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Q9HRSTZEJY5B"
                },
                "Date": "on November 6, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XOHJLA16DPZT"
                },
                "Date": "on September 3, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ANNIRMIGPFKP"
                },
                "Date": "on April 17, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NC5BMF6QWC5B"
                },
                "Date": "on March 31, 2006",
                "Helpfulness": 0.875,
                "StarRating": "5",
                "Text": "Kaku's ability to deliver complex science to the casual reader is rivaled only by his enthusiasm for the topic. Kaku loves his work and it shows. He deftly explains lofty concepts like multiple dimensions, the bending of timespace and wormholes and in a way that can be grasped by those of us without PhDs. Physicists like Kaku are bringing cutting edge science to the masses and that is good for everyone. For me, it's inspiration. I referred to Kaku's work over and over while writing my novel \"The Pink Room,\" the story of a leading physicist who attempts to use the science of string theory to bring his daughter back from the dead."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AS6EPVW1IRRP5"
                },
                "Date": "on November 20, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Like its predecessor Hyperspace, PW is a fascinating tour of physics at the theoretical cutting edge.  MK is an ever lucid and entertaining guide.  Though he doesn't always succeed in making abstruse ideas completely intelligible, he does so for the most part.  And where he is less successful -- as PW progresses to M-theory and beyond -- he nonetheless spurs his readers' enthusiasm to read on.  It's hard to imagine 'headier' stuff than one finds between the covers of PW.  My thanks to MK for letting us non-physicists/cosmologists in on all the excitement!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5X1B2HBQUR3P"
                },
                "Date": "on June 27, 2007",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AI9EIHVBHFPC"
                },
                "Date": "on July 16, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQLKG5111HY85"
                },
                "Date": "on December 17, 2006",
                "Helpfulness": 0.7272727272727273,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XO4RMCJF99BM"
                },
                "Date": "on December 21, 2010",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANTGGAQYPSWHF"
                },
                "Date": "on April 27, 2005",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "5",
                "Text": "I read Michio Kaku's book _Hyperspace_ years ago, and was really impressed with his ability to explain things in a way that makes sense to most people.  Parallel Worlds seems almost like an extension to that book, detailing all the changes that have come about in the field since Hyperspace was published.  Kaku gives a really good overview of everything that is currently known, and the ensuing possibilities that are implied for the future."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NWS0JK0YQOQR"
                },
                "Date": "on August 12, 2007",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QGCTE7I99BMU"
                },
                "Date": "on June 13, 2010",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Overall a well written overview of current theories in physics. My one small complaint is the description near the end of an advanced civilization's attempts to escape a dying universe. The author seems to either deliberately ignore or be unaware of the predictions of the coming singularity and the migration of humans to software."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UO765ATJJ7AO"
                },
                "Date": "on September 29, 2005",
                "Helpfulness": 0.6976744186046512,
                "StarRating": "2",
                "Text": "I bought Michio Kaku's book thinking I would find new material and insights, given its 2004 publication date, compared to Brian Greene's 'Elegant Universe' from 2000.  In fact, Kaku's book seems to me less informative, less well explained, and covering less ground, than Greene's.  At some points it seems like you can feel the author giving up before the difficulty of explaining his material without maths."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IWAB0TG9WA4Y"
                },
                "Date": "on September 23, 2010",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HL4JYBSLRWTP"
                },
                "Date": "on June 19, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A66TFUQMPFWF0"
                },
                "Date": "on September 17, 2008",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "I don't have much physics backgroud but found this book very easy to comprehend and easy to read also. The information is astonishing."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DAG312SUWTMM"
                },
                "Date": "on May 10, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "This book is a science based review of alternate universes and their relevance to us. Michio Kaku moves into astrophysics and cosmology within this book; broadening approaches enormously. With simple explanations of strings, m-theory, and black holes there is also focus on the importance of electromagnetism. This book makes reference to the universe that we are not alone; and the possible travel connection to parallel universes. Michio Kaku makes an appealing presentation in science that connects to the everyday world. There is a list of contacts in the physicist community for other interesting reading."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SQJ5YT7T7SE9"
                },
                "Date": "on January 16, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "The man definitely know the topic of which he speaks. Don't be intimidated, as this book is written in an easy to read language and can be followed along with pedestrian knowledge. Perhaps it will take longer to read, but you'll be fascinated by Dr. Kaku's discussion of mythology, cosmology, theoretical physics, and the big bang theory. He talks about the possibility of space travel to neighboring universes in the future, the \"big freeze\" and many other interesting topics which will really keep you thinking, well after reading this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2K1VS37Z3CBVF"
                },
                "Date": "on April 8, 2006",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "I've read the entire book and could understand many of the topics of the theoretical physics"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VA08V3CKDZ2C"
                },
                "Date": "on May 13, 2005",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "Thank you Michio Kaku. What could be more uplifting than a guided tour of modern physics and an examination of the many possible outcomes of current theories? Exploring ideas is an enriching experience and I am grateful that you shared your understanding with all of us. It's clear that we still have much to discover about the universe we inhabit, but the scientific method has been, and continues to be, our most successful tool. For me, the search for justified belief gives meaning to our existence. Thanks again."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACN65RBBEJD6D"
                },
                "Date": "on June 11, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "You can't explain anything unless you understand it yourself, and while Kaku admits that there's more to understand about the origins of the universe than anyone knows, he does a great job of positing the existence of multiple universes in different dimensions. I didn't understand the mathematics but Kaku convinced me with his logic. A must read for anyone who asks the world's most important question - why are we here?."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DF9EXI37WT18"
                },
                "Date": "on January 25, 2009",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "This has to be the best book on this subject. After suffering thru a brief history of time and a briefer history of time this was what I was looking for the whole time I was about to give up on Cosmology as a Pseudoscience until picking this up.Mr. Kaku seems to understand and relate to people not just science a good writer and a good read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EMWVXH76EF3A"
                },
                "Date": "on June 7, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25QYSTWWWZUGU"
                },
                "Date": "on January 3, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GLL0HPDYDUEV"
                },
                "Date": "on June 3, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I have been a fan of Dr. Kaku for quite some time.  He has a great ability to educate without speaking over the heads of those who are not his peers in the world of theoretical physics.  Thank you Dr Kaku for yet another great read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1F2Z3HN5RXBMQ"
                },
                "Date": "on January 29, 2012",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "2",
                "Text": "I just got too annoyed with the book to go beyond about 2/3 way through. I am no physics doctoral student, but I do have a decent grounding in science. Despite this, I had to repeatedly go back to the beginning of sections to see where I missed the detailed explanation about the latest subject (spins, worm holes, string theory, parallel universes, etc, etc). But I kept finding that it wasn't me: the author repeatedly failed to elaborate and explain comprehensively many topics; his explanations of complicated subjects were utterly unconvincing (i.e. of their scientific credibility), and failed time & time again to show how they fit into a comprehensive narrative (i.e. how do strings relate to what is standard knowledge in physics?). It was as if it was a \"brief history of\" work written for fellow physicists who wanted to brush up on their history, but, importantly, didn't need too much help understanding complicated material. In addition, the material is jumpy, and many subjects suffer repetition. The \"notes\" section is poorly constructed, as there is no indication of what is extended in this section when you cover it in the main text. For so many topics, 360 pages is clearly far too short. Kaku should have taken more time & care in expanding his explanations of subjects, or written about fewer topics in 360 pages. Perhaps many of the plentiful positive reviewers of this book came from the sciences/scientific journalism, and thus failed to appreciate how the non-expert would perceive this book? Poor."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5X1B2HBQUR3P"
                },
                "Date": "on June 27, 2007",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AP19UYH2ITFAH"
                },
                "Date": "on May 12, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A69HULTACK1MR"
                },
                "Date": "on February 27, 2011",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADQG7NDDEATAX"
                },
                "Date": "on September 12, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Summary in a nutshell (or rather in a string): Kaku has the gift to put into words some of the most sophisticated theories of physics today.  He is the one who came up with the equation that summarizes the field theory of strings. The heart of the electron is a vibrating string, tinier than a proton. If we were to pluck the string, its vibrations would change it into any one of the known subatomic particles. Did you know that the 5th dimension is light? If Einstein had never discovered relativity, his theory might have been discovered as a by-product of string theory, because the lowest vibration is a quantum of gravity. All 11 parallel dimensions are probably encoded in these strings, and might be revealed sometime in our technological future. This book was published in 2005 but most of it still stands today in 2014. Perhaps some minor updates for the microwave data from the WMAP satellite (after more recent calculations, 26.8% rather than 23% of the universe is made up of dark matter) and there’s probably more updated information on the LISA antenna and the Large Hadron Collider which are mentioned in the book but were not yet built at the time of publication. Excellent ‘theory of everything’ book for everyone!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3U8YCPG7X71V8"
                },
                "Date": "on April 10, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HBR3AJ3VPAD4"
                },
                "Date": "on June 12, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYT7I9WYJSKH2"
                },
                "Date": "on March 10, 2008",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "Definitely, TWO THUMPS UP!!!  This is one of the best book for fun read among all books I have ever read for more than thirty years.  The topic is a hard-chew, but Michio Kaku made it so soft you can swallow as easily as milk.  It is not a surprise why so many complete physics lay persons read this book and all of a sudden became in the know about modern physics.  Yes, this book is that great, very easy to read and at the time very thorough!  But, more importantly, perhaps most importantly to me, the book is so much fun to read!!!  I have read many sci-fi books, but this book is probably much more fun than any sci-fi's that I know.  This is why I used to often read this book whenever I got some headache.  It gives very fresh refreshment like rural breeze.  I do not often recommend a book for a read to friends because they are just different from me in many points.  But, for this book I strongly recommend anybody to give it a try.  You will never get disappointed for sure."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9UJWQVNQ4W7H"
                },
                "Date": "on October 10, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This book is basically in three major sections: an intriguing and highly readable exposition of the ideas relating to the title; a more complex (for me, anyway) explication of the physics and math processes used to explore the concepts; and a grand blend of cosmology and exhilaration that reads almost metaphysically. The only reason I can't give this work five stars is that it is several years old and not quite current in the research (i.e., the hypothetical medium that may separate multiple universes is referred to as \"the bulk\" in newer work, but is not so named here.) I also was left with a question: Kaku discusses the idea that multiple universes may have physical laws totally alien to our experience, but later speculates about how, perhaps, we could cross the chasm. Would it be prudent even to try entering another universe, not knowing what to expect? Aside from this minor point, I found Kaku's enthusiasm infectious and, as his TV appearances prove, his communicative ability is impressive. Popular science's worthy successor to Asimov, perhaps?"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NMHXO19KKBJA"
                },
                "Date": "on August 18, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3H82HFEOADFGU"
                },
                "Date": "on April 6, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Having read this in 2006, Kaku was my first introduction to the \"parallel worlds\" hypothesis. It blew my mind. If you haven't yet heard, we live in a multiverse of infinite universes that exist all around us in hidden dimensions, and are constantly being created and destroyed by mini big bangs. The most entertaining is Kaku's chapter on futurism, where he makes predictions thousands of millennia into the future. He follows the model of categorizing civilizations based on energy use, from Type 0 civilizations which rely on dead plants for energy, to solar civs who harness atomic energy from their sun, to galactic civs who travel by wormholes and are able capture the energy of entire galaxies. This is wild stuff. If you have no background in theoretical physics, it will open a whole new door to understanding the universe and our place in it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A124PNSNY8MMXR"
                },
                "Date": "on March 2, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I think any deep-thinking person would enjoy this! All books by this author are excellent.  He does an excellent job."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A288IFM1W1ATKV"
                },
                "Date": "on March 18, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is probably the best book on this subject, mainly because of its unparalleled clarity. There's not much unnecessary information, coverage is fairly comprehensive, and subjects are mostly treated with great clarity (for which the reader should be very grateful considering some other books in this field) without suffering loss of understanding. In other words, the presentations are correct and self-contained, interesting, and enjoyable to read. There are few seemingly odd tangents that must be tolerated, and the author promotes himself a bit from time to time, but overall this book really stands out. Reading this book is like reading a dozen other longer books about more specific aspects of this subject yet receiving the same key information ... more bang for your buck! You don't need a science background to understand this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2B0TH66PNWT3K"
                },
                "Date": "on April 27, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "He writes his theories so clearly and backs them up by listing the latest research. Easy to read and to understand."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14D2QFI1JCODM"
                },
                "Date": "on March 8, 2006",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "Powerful, insightful and tremendously enlightening Parallel Words is an easy an entertaining read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A149DDQ6P04LUP"
                },
                "Date": "on April 8, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "He articulates concepts I've always wanted to learn in such a way any layman can grasp. This stuff is exciting!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AP57MKWNGJUIM"
                },
                "Date": "on August 6, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book is a great read for anyone who wants to dive into the colorful world of physics.  Michio Kaku's writing is simplistic and easy to understand, yet it bears mentioning that this is a book about physics, so only those who find science somewhat intriguing can truly appreciate its message.  Kaku offers a basic yet well summarized history of physics from Galileo to the Large Hadron Collider, and he takes those confusing numbers and equations to paint a dynamic masterpiece of the universe (of universes, *hint, hint* ).  Overall, I recommend this astounding book to any aspiring scientist wishing to analyze the puzzle of our strange universe(s)."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A68NBHKWJ1S2K"
                },
                "Date": "on December 14, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Once again Dr. Michio Kaku has written an excellent thought provoking book on various physics concepts and theories.  Dr. Kaku does an amazing job introducing the reader to complicated and often hard to grasp scientific concepts such as M-theory.  He then explains the background and thinking of these scientific theories so that the reader is able to comprehend just how profound and meaningful these concepts really are.  In all the reader is left thinking deeply about concepts that are foreign to most people but ultimately profound in the world of physics.  A great read especially for someone with an interest in physics and extraordinary topics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35X0RJ6I1VE7V"
                },
                "Date": "on September 3, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Michio Kaku wrote a great non-mathmatical synopsis of where the theory was in late 2005 on cosmology!  I suggest this book for any person interested in cosmology!  He does a great job of taking you thru the history and reasons for the logic that existed in the past and present.  I especially like his short (1/2 page to 3 pages)concise discussion on each particular subject.  The only issue I have with this book is the developments that are missing since 2005!  This is a GREAT book!  I hope that he creates a update!  This is the best written science book that I have ever read!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UFI1OJUY0WEY"
                },
                "Date": "on October 16, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Brilliant read for anyone who knows there is something more than just 'out there.' Comprehensive and easy to understand, people who enjoy space-time, imagination, quantum theory, Einstein, and cosmology will appreciate the perspective Michio Kaku brings to mind regarding the concepts of different theories of our existence. As a layperson in physics, but a lover of M-Theory, particles, waves, energy, the cosmos, and endless possibilities, I highly recommend this book to like-minds. I will be wearing my copy out passing it to friends."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATG3ITRCE6F10"
                },
                "Date": "on December 11, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Professor Michio Kaku shares his vast knowledge of General Relativity, Quantum Mechanics and the emergence of String theory and subsequent M- theory.  The possibility of multi-dimensional worlds and a grand designer of the universe. He presents his readers with cutting edge information from renowned Scientist( including Nobel laureates )and Institution from all around the world. it requires some knowledge or Physics and Mathematics. He does not use to much complex mathematical equations. A must read for students in physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32CPMVK9FMNHO"
                },
                "Date": "on September 28, 2010",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Parallel Worlds is a stellar book - very accessible from an intellectual standpoint by those that are not very familiar or conversant with modern physics and cosmology.  I loved the line \"reality is not common-sense, because our common-sense is not reality\".  Another way to say is the old proverb - \"a fish doesn't know it's wet\".  In order for us to perceive and understand the universe, we must trust in science and mathematics to let us conceptualize beyond what our senses let us intuitively understand."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GO4OA6C243ML"
                },
                "Date": "on March 28, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Wonderful and facinating - I love the 'magic' of physics, don't understand how it all works but Michi Kaku explains everything so well that even a novice like me can understand it.(well, most of it.) After you read this book you will never look at starts, space, planets, including earth without marvelilng at how they they were formed, you will take a look back at what happend billions of years ago, what is still happening today, and what will be happeing in the future ie: Time Travel? maybe!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TBTCPKDQDTZL"
                },
                "Date": "on November 8, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Z2JFJJZP3D7M"
                },
                "Date": "on April 7, 2011",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I38Z7M5C1SDP"
                },
                "Date": "on August 6, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Michio Kaku is one of my favorite physicists, because he is able to explain complex theories in a way that the layman can understand. Though this book was written some years ago, most of it still applies today in the world of physics. The multiuniverse theory is very possible, even probable, according to string theory and M theory. Understanding this subject is important to the possibilities of our future survival."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KPXMRO717RIK"
                },
                "Date": "on September 11, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I have thoroughly enjoyed Parallel Worlds - understand, I am No physicist!! but Michio Kaku has written an intriguing, easy to understand (at least Most of it) narrative about the progress of string theory, M theory and parallel universes and how it all works within the laws of physics.  It really makes you think about how small yet Significant we all are - I highly recommend this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMA94Z717YARB"
                },
                "Date": "on November 14, 2010",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I fell in love with Dr. Michio Kaku when I watched his live interview on CSPAN2 on October 3rd of this year.  I knew that I had to read all of his books and I began with \"PARALLEL WORLDS:  A Journey Through Creation, Higher Dimensions and the Future of the Cosmos\". It has been sheer joy for me to read this book and I am looking forward to his other works with great anticipation."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMBHC6X3PUYS2"
                },
                "Date": "on February 6, 2009",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "I bought this for my husband for Christmas. We've seen Michio Kaku on various \"The Universe\" shows on the History Channel and although I find it interesting, my husband really likes reading this stuff. he thought it was a very interesting book...it makes you think for sure! If you're a space geek, you'll love it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABZNRLXFQ6J13"
                },
                "Date": "on October 23, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQJN8DSMR4VYB"
                },
                "Date": "on November 18, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "If you're interested in quantum theory, and multiple worlds ideas, this is a pretty informative and interesting read. Michio Kaku is clever and engaging to read, but I will admit that this book took me some long periods of 'picking up and putting down' to get through. The material is not simple, but it is presented in relateable ways for the most part. Good stuff."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQ5PJBS7IZHS9"
                },
                "Date": "on March 1, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Great book and very complex subject matter, but when you are reading anything from Michio you have to expect that.  He's referenced many Nobel Prize winners here and has compiled a massive amount of data on the Universe and quantum physics and cosmology.  This is a great read and will keep you entertained if the Universe is a subject you enjoy.  If not, watch TV!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HKFPL8YOWXXQ"
                },
                "Date": "on September 10, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3V10T1LV7Z5R7"
                },
                "Date": "on June 20, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Wanna learn about Newton laws of motion, where Einstein got his idea from and why Quantum theory is strange? This is the perfect introduction to all those subjects and more. Michio Kaku writes in a style and languages that everyone can enjoy and understand. I highly recommend this book to all that have an interest in the universe in which we live."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABR1M9VWVPNRX"
                },
                "Date": "on February 1, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEDZES9W93AFD"
                },
                "Date": "on July 27, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Well kind of. At least he's come the closest of explaining both to me. His enthusiasm comes through each page and his explanations are technical yet grasp-able without being condescending. For someone who grew up on Sagan, Kaku does a good job of continuing the tradition of popularizing science without deprecating it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14MF6JVB9QML8"
                },
                "Date": "on February 15, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Michio does an excellent job of explaining concepts in terms the average person can understand. You don't need to know the complicated mathematical equations referenced to understand the concepts which they prove. Thank you for making a subject ive always been curious of easy to understand."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9L30ZZKB06MQ"
                },
                "Date": "on January 10, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RC31QKVPB1JU"
                },
                "Date": "on March 10, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Always entertaining Kaku does a great job of making sense of a lot of weird stuff. The string theory is a little thick but it was a great read never the less. If black holes, string theory, the future of the universe and the possible futures for us interest you give it a read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JP07AT7SZ3PF"
                },
                "Date": "on March 4, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Michio's Parallel Worlds is a fascinating book. It explains you with simple words how the cosmos began and how all these incredible things, such as Parallel universes, multiverse and black holes are. I suggest it without thinking to buy it, if you love science and physics too!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3R5WG84KIKON2"
                },
                "Date": "on January 8, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Rather strange for me to understand.  Wee bit above my head I must admit.  Only the highest minds can understand all this marvelous 'string-field theory'  Even good-old SciFi Magazine said it can be 'downright boggling\" at times.  Alas for we others!  Brittanica"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1R43YYTUJD8ST"
                },
                "Date": "on May 17, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Another masterpiece by this stellar author.  I own 4 of his books and am clamoring for more.  The knowledge and discovery and fascinating theories are spectacular.  I can't say enough about Michio Kaku...one of the great scientific minds of our time.  Get this book!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2B2FTNC6BWUOD"
                },
                "Date": "on January 26, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A wonderful book about quantum physics written by a man who writes for those of us who are math and science challenged. I very much appreciate that he weaves world history into the story of the development of this fascinating science. A great read for me."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OJ0OFMZ2L9IZ"
                },
                "Date": "on July 14, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I just love physics but I'm a layman on the subject. This book puts lot's of a complex subject into a simple perspective. Also, it's a recent work: something I praise due to the recent developments on the subject of cosmology and advanced physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NTUDJJ27TAXF"
                },
                "Date": "on June 18, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The new physics writers make physics understandable to lay people such as myself. I like Kaku, Tyson and Greene. They will take the baton from Hawking. Physics Lite made palatable for people who like astrophysics, but are not astrophysicists."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25J906M2T4G4Y"
                },
                "Date": "on February 29, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Over the years, I've been a great fan of Dr. Who (British SciFi) and Star Trek. What is amazing to me and those who have since borrowed my book, is that the science is there. It's amazing. Michio is easy to read and understand...good read!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AU5S5YAYT9EKC"
                },
                "Date": "on December 26, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Fantastic and full of meaning. The book is easy to understand for those who are new to physics, also some good points for the ones a bit further along. The ending of the book is rich and encouraging."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CFWFYASES5MG"
                },
                "Date": "on February 4, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Amazing book! Michio Kaku is very good at making the most complex things seem simple through excellent analogys and explanations. One of my favorite books! If you dont have this book, GET IT:)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3R4XPPED5EYK1"
                },
                "Date": "on September 2, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Having seen Michio Kaku on various science shows, I was very much looking forward to my first chance at reading one of his books. I was not let down! I may have to check out his other work."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A318EUY1KECR6F"
                },
                "Date": "on January 24, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book is great for the layman. I found it to be a really interesting read and I learned quite a bit from it. The material presented is compelling and very readable. Highly recommended."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2H4OFZ1MXWIYG"
                },
                "Date": "on February 2, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Just a great book. No need for a long review, Michio Kaku never disappoints. His examples and explanations are simple and easy for anyone to understand. I would absolutely recommend it"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37HQ931TDZNO5"
                },
                "Date": "on April 21, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20TQ9VAP0FRX3"
                },
                "Date": "on July 30, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Clear style, understandable language and step by step explanations. It is possible to learn something and even get inspired and awed by this crazy magnificent universe we all live in."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQBJMXRTFZYVR"
                },
                "Date": "on August 18, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Very interesting book for someone like me who is was not familiar with new theories in physics and cosmology. It is laid out in easy to understand, simple terms, and is a great read!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BNKQLRTR0K0G"
                },
                "Date": "on March 25, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great book he does a good job of describing the theory of having parallel universes. Well worth the read if you into different theorems and a touch of way out there kind of stuff."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19AURTWGUM7PG"
                },
                "Date": "on February 24, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A tremendously readable book, simultaneously complex yet understandable with or without an extensive grasp of advanced physics and mathematics.  The author is a genius."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3V33BZ3PRUJA"
                },
                "Date": "on September 10, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "You begin to see possibilities through string theory and M theory of the unknown.  Clearly explained by the author, don't miss this one.  His usual clarity and wisdom."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3N0EZGZQT294D"
                },
                "Date": "on June 3, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "For someone who's a beginner in the physics of the universe, its a great read with a ton of information. Its great to dive head first into a vast field, as a beginner."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11U6DQP3AP2JJ"
                },
                "Date": "on March 31, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "It's some trick to make a book on abstract physics readable, but Michio Kaku has done it.  I'll have to say that even so, it's a slow read for me, and yet a good one."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2D0SWEJ0JB41B"
                },
                "Date": "on February 4, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "What a great read. I'm actually a little depressed I'm finished with it. Michio Kaku shows you how the impossible is possible. He makes you believe in magic."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LMUGZHA5KXPW"
                },
                "Date": "on March 18, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Dr. Kaku is my hero.  He presents complicated information in an easy to understand manner.  He is a genius and I adore his enthusiasm.  This is a great book"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SHXWWTG1DKG3"
                },
                "Date": "on April 15, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Michio Kaku has a way of delving into the unknown and unknowable that can blow you away.  If you are into cosmology and the big bang, this is a must read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1N84XDQKWUSUG"
                },
                "Date": "on May 9, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "My son was thrilled to read it - highly recommend anybody, who is interest in this subject. Good language and easy to understand for mid-school kid"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SJF0I2RMTYT4"
                },
                "Date": "on April 30, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book certainly serve it's purpose in an entertaining and informative way. it is a great choice for anyone looking to learn about cosmology."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SY8SK1KIRU1B"
                },
                "Date": "on January 9, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Have always admired Michio Kaku's work. Detailed explanations of terms and activities within the cosmos that others fail to fully elaborate on."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RRGMLM9XI0UI"
                },
                "Date": "on November 6, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent review of historical and modern cosmological theories in layman's terms, making it easy to understand for the non technical reader."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JSUW5FF0MOT2"
                },
                "Date": "on April 1, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Speculations of a Scientist on what the future holds for humanity in the light of modern advances in physics.  An interesting viewpoint."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMBG7W3G8MWWK"
                },
                "Date": "on September 6, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I enjoyed the book, although the presentation of the different topics is somewhat jumbled about, as if written by different authors."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26UUK8D7H6JNA"
                },
                "Date": "on July 10, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Very easy to read and opens the world of physics to the lay person.  I recommend it to everyone.  What exciting times we live in."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YV1U7A4RZZ3J"
                },
                "Date": "on January 7, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Very informative and well written. Amazing conclusions. Opens a new vista for me. But it does require a rather different maniset."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1V1PYPFYRBAI"
                },
                "Date": "on December 24, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Read it twice and love it so much highly recommended if you have a wild imagination and love knowing more about the universe"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PTCHRG8P3KWJ"
                },
                "Date": "on May 14, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Michio Kaku has a gift of the ability to explain complex matters in understandable language.  I would highly recommend this."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1G2S8SWWT51H2"
                },
                "Date": "on January 23, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "It is great book and good for student. I bought it for my family member but I could stop reading it after received the book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YKLE6PQTBBRA"
                },
                "Date": "on December 10, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This has been one of the best written, most understandable books I have ever read on the subject.  Highly recommended"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3R39211MP714V"
                },
                "Date": "on November 28, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "The book is well written but I find that some of the more technical explanations are a bit too short and cryptic."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34ZNCPTXG5Z9I"
                },
                "Date": "on March 31, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Michio Kaku can write in a way that makes very complicated things understandable.  One of my favorite authors."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19DPT74H0JU72"
                },
                "Date": "on August 21, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Still unparalleled in the sciences. I will have read everything Mr. Kaku has written and look forward to more."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EFY3XXO335MZ"
                },
                "Date": "on January 14, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I get more than I expected. It's very good for me. I recommend the products in 100% for all that can get it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LMQZZOJ9U49J"
                },
                "Date": "on December 10, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Michio Kaku makes physics so reader friendly.  It reads more like science fiction than science, I loved it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35GRCHZWHDNTH"
                },
                "Date": "on April 28, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Just a mind-blowing book of the mind of Mr. Kaku. Very interesting if physics or cosmology is your gig."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ICAP5YR5WZST"
                },
                "Date": "on November 18, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Beautifully written by a brilliant mind...  I can't read enough Of Michio Kaku's work...  Fasinating."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5NCKHFTESJIY"
                },
                "Date": "on May 22, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I am building a library about people and healing and I thought this would be an excellent addition."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EOIBWYLWSO8L"
                },
                "Date": "on December 23, 2009",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "I found Michio Kaku's \"Parallel Worlds\" to be the best book that I have so far read on the subject of M-Theory/String Theory. The information is presented in an unusually readable format, and Kaku's writing style is enjoyable. This book also touches on more subjects related to the main theme than other books on the subject have, and seems to cover a broader range of ideas/possibilities/theories than some of the other books i am familiar with. If you're interested in theoretical cosmology, I think this is a great read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VHJQT07CK5GJ"
                },
                "Date": "on July 16, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "My son loves this book and has been reading it since I gave it to him. Michio Kaku is wonderful."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1R4SJB7EGHQPF"
                },
                "Date": "on January 29, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This is one of the best book of all \"space and time\". Once you start to read it you can't stop."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Y8OE6EG4Z0VZ"
                },
                "Date": "on September 15, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Mind-expanding and boggling at the same time.  Pick it up, strap yourself in, and hang on!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3S1A3T0P50LKG"
                },
                "Date": "on September 26, 2011",
                "Helpfulness": 0.5714285714285714,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LKWM6T94IIY6"
                },
                "Date": "on November 4, 2008",
                "Helpfulness": 0.6,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5DQRUWXFARY8"
                },
                "Date": "on September 16, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Quick service!  not the edition that is pictured but still awesome Thanks!!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SS9H5ANAS8FK"
                },
                "Date": "on August 30, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Wow, great book and he writes it in laymen's level of understanding!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10AG3YWMDA55F"
                },
                "Date": "on March 12, 2015",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "Good introduction to the topic of parallel worlds and string theory"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18O5UBNR5JV6J"
                },
                "Date": "on June 29, 2008",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Michio has done an excellent job at describing the current understanding of the Universe, based on the latest proven theories.  He has the ability to reach out to all skill levels.  This is simply the best book I have ever read regarding the Universe.  Thanks to my good friend and colleague, Neal Bailey, for recommending this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2M0O2M6LEXTZX"
                },
                "Date": "on April 6, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "A clear and concise read.I enjoyed the presentation of material."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HAA7E9OXT5HL"
                },
                "Date": "on August 27, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Even though it is a little complicated still a great book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1J2P0MCWGQDBD"
                },
                "Date": "on March 3, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Anyone interested in other worlds must have this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37B6WY4GPMDWZ"
                },
                "Date": "on February 25, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Very happy with the purchase and the service, thanks"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACV6CQNZRNYSD"
                },
                "Date": "on November 7, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Good book. Raises a lot of questions. Worth reading."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24318MLS4BHSJ"
                },
                "Date": "on December 13, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book was very interesting and well educated."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19H3KSFN9MD4D"
                },
                "Date": "on December 22, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "For me it is slow reading but very interesting."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YV0U6K46LJXF"
                },
                "Date": "on February 4, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Very clear and interesting. Its easy to read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1O3BSTUTM82LJ"
                },
                "Date": "on October 14, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Good guide to imagine the unimaginable."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2G0E1DVA3NQMD"
                },
                "Date": "on February 12, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Easy reading, real fun to read"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AT6FS6234MH5H"
                },
                "Date": "on March 2, 2008",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XYCSG3ROKDGR"
                },
                "Date": "on March 29, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great product and price!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FUMDIE0XSVI5"
                },
                "Date": "on October 9, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Everything went great!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27UYN8GJAO9BZ"
                },
                "Date": "on February 18, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A MUST HAVE!!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39M0HLK4OVH9K"
                },
                "Date": "on September 5, 2008",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Ranges further and is more accessible than Brian Greene's \"Elegant Universe.\" A must read for anyone who is interested in the _very big questions_."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31YSM3W0E0KJ7"
                },
                "Date": "on February 27, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I always enjoy listening & reading Mr. Kaku's insights. This book is well organized into introducing the reader to past physics and then brings the reader into the more up to date Theories of today. I bought it for a teen who wants to study Theoretical Physics to help encourage him in his future plans in life."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A360DPC534SN3C"
                },
                "Date": "on November 24, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I am still reading it, it is more for college students than for me; It is definitely not for entertainment.  But, it is interesting.  I am learning physics from Lisa, who's book clears up a lot in Michio's book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SPURZLPGBFXB"
                },
                "Date": "on July 8, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "like"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AS1RPAY2NAPAQ"
                },
                "Date": "on December 6, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "This is great for the astrophysicist-inclined. My grandson plans to major in that field, and he gave this high ratings!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQCT4I1KQ6FGG"
                },
                "Date": "on June 4, 2007",
                "Helpfulness": 0.25,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2J9FXJCL8O8Z6"
                },
                "Date": "on November 6, 2009",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32VNNKLUMRZN6"
                },
                "Date": "on January 23, 2008",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22VOCO2LWRUYC"
                },
                "Date": "on August 14, 2008",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "hello . this book is so facanating it is hard to belive. literly after you read about the quantum paralel worlds part you never ever look at the world in the same way.also i was ten when i read this book and still found it facanating and 100% comprehend able. because of this book and many others by michio ka ku i want to be a theoretical phisisist. i hope you buy this book. happy reading^_^"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HQWLVPYPXF3V"
                },
                "Date": "on February 3, 2008",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I am in the midst of reading this right now, and so far am finding it wonderfully accessible in ways that Hyperspace was not. I think Kaku has really found his voice for the lay person with this effort. I seem to be 'getting it' in ways that are very gratifying and rare. I had been rereading Hyperspace when this book arrived. How nice to feel I'm understanding some concepts very clearly!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11PNZVNZ91DSC"
                },
                "Date": "on August 17, 2008",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "this book is very good view of the physics of the new millenium..michio kaku really knows what he's talking about and im sure this isn't his last book on this topic"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MR73D23OO09I"
                },
                "Date": "on August 24, 2006",
                "Helpfulness": 0.45454545454545453,
                "StarRating": "5",
                "Text": "This is a book that follows the style of Carl Sagan, but it is not Carl Sagan ! Dr. Michio Kaku provide a path of light into the M theory. This is not a simple scientific book it is the main stone in the foundation of new knowledge."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RQS5Q4MGGYWA"
                },
                "Date": "on November 27, 2009",
                "Helpfulness": 0.25,
                "StarRating": "5",
                "Text": "Will read this book many times. Reading it for the second time already since there is so much in it to think about."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RXQGAHWF3V7Y"
                },
                "Date": "on February 6, 2005",
                "Helpfulness": 0.5432098765432098,
                "StarRating": "3",
                "Text": "Kaku presents an excellent account of conventional progress toward a unified theory of elementary particles and forces.  The educated reader will note his bias toward string theory and multiple dimensions as the basis for unification.  The author has produced graduate academic texts on string/M-theory which are also available online.  This makes him an expert on the leading edge of the conventional approach.  But the bias and almost religious dogmatic adherence to the probabilistic perspective makes the book mediocre.  For a truly balanced perspective, the author should have included references to works such as Space, Elastic and Impeding which outlines a semi-classical approach toward unification.  The author, in typical conventional style, ignores such attempts in Parallel Worlds - by omission, dismissing them as fringe or quackery.  For instance, Caroline Thompson, a British computer scientist, has basically proven that Aspect's conclusions about EPR are wrong.  The bottom line is that he ignores credible refutations of conventional perspectives.  This tendency in convention will only doom physics to become more and more detached from reality - as exemplified by invention of multiple dimensions to explain unification.  In my estimation, it is this and the concept of virtual particles which have derailed true progress in theoretical physics.  The unfortunate situation is that the physics community has not realized this derailment.  Kaku is brilliant in his treatment of the conventional understanding and its development.  His book is entirely readable by the average science-minded person.  But, be careful as you read to read between the lines - his omissions of contemporary refutations of conventional dogma."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJDND2H50H03P"
                },
                "Date": "on October 27, 2012",
                "Helpfulness": 0.2,
                "StarRating": "3",
                "Text": "Much of the science presented in the early parts of the book is watered down by the extensive time wasted discussing the strong anthropic principle. I found it disappointing that the author thought it necessary to present all of the \"but if\" arguments."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A235L4BMTHOOBB"
                },
                "Date": "on March 25, 2014",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "2",
                "Text": "I have read too little of the contents to evaluate it as a whole. I have recognized, however, that many subjects have been dealt with more professionally in other books on the same subject area. But I'm  not happy with the appearance: the text is too small and the quality of paper modest. With my poor eyes it is hard to read this type of text, no matter how classy it is."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A659O788KJE7M"
                },
                "Date": "on December 31, 2012",
                "Helpfulness": 0.42105263157894735,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NNSSFYY8WCPJ"
                },
                "Date": "on August 2, 2007",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Michio Kaku has created a scenario of possibilities in the evolution of this world. Kaku explores the potentials of parallel worlds and realities. In quantum physics anything is possible. Kudos for Kaku.  Bettye Johnson, award-winning author, Secrets of the Magdalene Scrolls."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28Q6I0C3HV1RF"
                },
                "Date": "on January 30, 2014",
                "Helpfulness": 0.2727272727272727,
                "StarRating": "2",
                "Text": "Like Richard Dawkins this guy writes the same book over and over.  Strikes me as a bit unethical.  At some point I'm hoping people will wise up and stop funding Kaku's retirement fund and use their hard earned money to support more original, though lesser known, authors on the subject."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VT6WHD0WBZTQ"
                },
                "Date": "on December 2, 2014",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OVP1BY549B3C"
                },
                "Date": "on October 10, 2009",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GJBG15HTH9M"
                },
                "Date": "on November 27, 2013",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "WAY too \"logistical\" for me to understand!  Just not a logistics person. I still believe that God crated the universe."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALEFV2SBOVEE0"
                },
                "Date": "on August 23, 2007",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZNQVW6SG21ER"
                },
                "Date": "on September 16, 2005",
                "Helpfulness": 0.3225806451612903,
                "StarRating": "4",
                "Text": "Yo! Michio... Whachu smokin' booooy?  An'...where can we get some?  Okay, seriously:  this does remind me of those wild late night conversations we used to engage in at university back in the day... typically after too many bong hits. These are some mind-stretching ideas, and yes ancient Hindu (Dravidic?) mystics tried to record all this for us in an earlier iteration. But the language they used in their explanations was perhaps too poetic, too mystical and  too symbolic to survive the centuries and  translation (both language and cross-cultural translation).  A good companion to this book would perhaps be Ervin Laszlo's \"Science and the Akashic Field\" or \"The Whispering Pond\" by the same author. Never-the-less we do owe Kaku (and Laszlo, and others:  Fred Alan Wolf, Michael Talbot?) our gratitude for even attempting to make this bizarre subject  accessible to those of us who have not the benefits of  higher education or mystical experience! A fair amount of \"suspension of disbelief\" is required here. Kaku does this particularly well because he tries to employ \"everyday language.\""
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KBMR6H4WCARW"
                },
                "Date": "on March 16, 2009",
                "Helpfulness": 0.1111111111111111,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CV4AOSB2S5D2"
                },
                "Date": "on January 16, 2007",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Book was in good condition and delivery was quick. I recommend this seller"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AF4UNE0QA34HG"
                },
                "Date": "on October 28, 2008",
                "Helpfulness": 0.14814814814814814,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HAFKV9MXOMFN"
                },
                "Date": "on August 16, 2007",
                "Helpfulness": 0.046511627906976744,
                "StarRating": "3",
                "Text": "This book is actually to be a Christmas gift, so I haven't opened it.  It arrived very quickly and in good condition.  Thank you for expediting it."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Parallel-Worlds-Journey-Creation-Dimensions/product-reviews/1400033721/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "183"
    },
    "Salesrank": "#13,647",
    "Timestamp": "2015-05-24 12:29:41.361503",
    "itemurl": "http://www.amazon.com/Parallel-Worlds-Journey-Creation-Dimensions/dp/1400033721"
}
