{
    "Category": "in Books (",
    "ListPrice": "$15.95",
    "Name": [
        "Quantum Enigma: Physics Encounters Consciousness"
    ],
    "OfferPrice": "$10.60",
    "Reviews": {
        "AverageStarRating": "4.5 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3K3DERKF6Z8SV"
                },
                "Date": "on August 9, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I am a theoretical physicist but I must admit I did not fully appreciate the Quantum Enigma until I read the first edition of this book a few years ago.  I first learned quantum mechanics over 40 years ago and have actively practiced it. That is, I used it to calculate theoretical predictions. It was only in the last 10 years or so that I asked myself, \"What is the electron actually doing when light is emitted from an hydrogen atom?\"  After reading this book I realized the answer is, \"Nobody has the slightest idea!\"  Fully appreciating the vast gap between the \"classical\" world we live in and the \"quantum world\" took some time for me. That kind of profound ignorance takes time to appreciate. I now better understand what I have read in biographical books about Bohr, Einstein, Heisenberg, and Schrodinger. As the realization slowly set in as to what quantum mechanics was saying, these men and other physicists struggled with each other in an almost religious battle. Now over 80 years later we know no more than we did then. In the end, everyone has to come to appreciate the profound ignorance we have at this point in history. For any interested layman or scientist, the Quantum Enigma is a must-read item."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALRQYRWQ7LRQ3"
                },
                "Date": "on February 7, 2012",
                "Helpfulness": 0.901060070671378,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LBWSV8CLVUMR"
                },
                "Date": "on October 23, 2011",
                "Helpfulness": 0.8846153846153846,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMRZ5G7HF7I03"
                },
                "Date": "on July 27, 2011",
                "Helpfulness": 0.8554216867469879,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CLWXGQTVVV6Y"
                },
                "Date": "on June 12, 2012",
                "Helpfulness": 0.9166666666666666,
                "StarRating": "5",
                "Text": "This is by far the best non-mathematical book explaining the excitement of quantum discoveries available today. It is clearly (and cleverly) written in an enjoyable style but it is also clear that these guys know their stuff, and have (somewhat amazingly) gotten precisely what is going on today in the quantum physics community down in a readable form for the non-specialist. There are plenty of books involving some wild speculations about quantum physics, but if you are a non-specialist and want to know what physicists themselves are really thinking, this is the book for you. I, frankly, have to give it seven stars."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ALHU1NTYPGBE"
                },
                "Date": "on August 29, 2011",
                "Helpfulness": 0.7796610169491526,
                "StarRating": "5",
                "Text": "This is always a fascinating topic, and these two co-authors / physicists tackle it without any magic wands or silly new-age garbage.  This isn't light reading, so be prepared to get involved.  But don't expect the book to offer any real answers either, and who should expect it ?  After all, the title says it:  Enigma.  But if you ever want to feel a little more educated on something so mysterious that what happened yesterday and is going to happen tomorrow is happening right now (or something like that), then this book is for you!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3B699FKE2ZBYK"
                },
                "Date": "on September 11, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABK2GJAHAO89Q"
                },
                "Date": "on August 3, 2011",
                "Helpfulness": 0.7575757575757576,
                "StarRating": "5",
                "Text": "Quantum Enigma is an outstanding informative and well written book. The very thorny and intricate quantum physics is approached with carefully used words and expressions. The topic goes step by step, like you being in a classroom learning quantum physics from highly qualified teachers. The real quantum enigma is approached in a very simple way, making you feel the core of the problem,though difficult, is also available to your understanding. The approach to consciousness is really well explained and utterly comprehensible for anybody."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AX563AU3AJ6CO"
                },
                "Date": "on April 29, 2012",
                "Helpfulness": 0.76,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13BBQGIMERMWO"
                },
                "Date": "on May 3, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "An introductory text written for non-scientists that explains the difficult problems in interpreting the role of consciousness in quantum physics. The book is not mysticism and does not attempt to relate the findings of quantum physics to religious thought. Instead it presents how non-intuitive quantum physics is to our commonsense understandings of time, and the independence or lack of independence of reality from consciousness. (Which are major themes in mystical thought.) The book argues that future progress in physics requires an explicit consideration of consciousness, which has been avoided over the past 80 years. It also briefly reviews recent philosophical thought about consciousness, although discussion is very terse. It does an excellent job (in my layperson opinion) of explaining the key experiments in quantum physics that raised these questions of consciousness and reality."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WTPROKWH18TF"
                },
                "Date": "on July 23, 2011",
                "Helpfulness": 0.7083333333333334,
                "StarRating": "5",
                "Text": "By far the best choice for the non-scientist interested in Quantum Theory and its implications in consciousness. Updated to the beginning of 2011. Enjoyable reading, and no math. I suggest looking at online demonstrations of the Double Slit Experiment when beginning that chapter. Animations illuminate these experiments better than printed text."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2P4OONJ85803I"
                },
                "Date": "on January 25, 2014",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HO83G1ORV7SK"
                },
                "Date": "on October 3, 2012",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YTWU8PZWZ39C"
                },
                "Date": "on October 30, 2011",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "I read this right after James Gleick's \"Chaos,\" and while the level of the prose in \"Quantum Enigma\" isn't up to Gleick's, this is a fascinating book. QE deals head-on with the weirdness of quantum mechanics that a lot of books seem to intentionally avoid. The authors explore the possible relationship of quantum mechanics to consciousness, but are very careful not to make any grandiose claims (and they trash the pseudoscientific \"quantum\" nonsense found in pop culture drivel like \"What the [bleep] do we know?\" Highly recommended."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ERU005ES1IHT"
                },
                "Date": "on December 29, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKTHCV8BTL00Q"
                },
                "Date": "on December 26, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I love this book, I have owned several but always loan them out or give them away. This is my all time favorite book and really changed my perspective on things."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IMVUPYZM1BSC"
                },
                "Date": "on September 2, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Makes Quantum theory easily understood. Hopefully the authors will write a book about understanding women."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BN7GLKN2OE2S"
                },
                "Date": "on August 22, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "OK I've read the first edition -- and frankly forgot most of it over time. I found the first edition to be written in very clear, understandable and even very enjoyable manner. This is true of this edition as well.  Covers much of the history and basics of quantum theory without the math -- but with such clarity. As I don't recollect the first edition -- all I can say is this is a great read. The subject of \"consciousness\" (sp?) and this being an integral part of reality is amazing. Still a big question, and so fascinating. This is such a good book I even have been reading it out loud to my wife and she hasn't killed me yet."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A330FTZTW57U32"
                },
                "Date": "on February 13, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14Q1666672TR1"
                },
                "Date": "on December 30, 2012",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "For those people interested in consciousness and the mysteries of the quantum world, this is an amazing book and I encourage everyone to read it, even if you do not agree with everything it postulates."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXIWPD7FAJ7G4"
                },
                "Date": "on December 16, 2012",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "The authors provide a solid, deeply knowledgeable and lucid account of the topic, making it clear why it is so controversial and giving a quite fair and reasonable sketch of where it may be leading us. I would have given it five stars if they hadn't displayed the orthodox paranoia about a 'slippery slope' if we get too 'mystical' about the implications of quantum theory. As they point out, it is the most solid of solid science, and if it takes us to places which are well beyond what we thought of as 'common sense' before, so be it!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LHYSCK9WXEJ8"
                },
                "Date": "on December 12, 2012",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "This is a fascinating exploration of the inherent weirdness of quantum physics, but also of the institutional barriers that have been erected by the physics community against exploring some of the potential consequences of this theory."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJ7T1U5S16S61"
                },
                "Date": "on December 11, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I could not put this book down. The author clearly explains a complex topic such as quantum theory so that anyone can understand the basics. I have a whole new way of thinking about everything after reading this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1O5J5ZEYNMRJT"
                },
                "Date": "on October 30, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I found the book to be unique. Unlike some other books, (written for the non-scientist), that tend to overdo the mystical side of quantum mechanics, this book carefully presents facts, experiments and the viewpoints of highly regarded physicists and then encourages the reader to draw his or her own conclusions.  The authors make a strong case that quantum mechanics is the \"skeleton in the closet\" of modern science. The concluding chapters present an excellent discussion concerning the relationship between reality and consciousness. The last page of the book contains a quote from Shakespeare's Hamlet; \"There are more things in heaven and earth, Horatio, than are dreamt of in your philosophy.\"  The authors support this notion with widely accepted scientific facts and do so in a way that most anyone can understand."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUMX6D7S9W7KJ"
                },
                "Date": "on September 26, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I have have been working as an engineer for 20 years. I went out of my way to deal with a book that explained quantum physics in physical terms. It was  brushed over during my education.  My professors never explained the meaning behind light's  \"particle/wave\" properties, we just worked with the associated equations.  I was always baffled by The implications of these equations.  I guess Einstein was too.  This book does a good job explaining the controversy and history behind quantum physics.  Nicely done!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YYNSRD8AU4MJ"
                },
                "Date": "on September 6, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21ATVN2BJC01J"
                },
                "Date": "on February 2, 2014",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AO6GZU2MWQ8YG"
                },
                "Date": "on December 8, 2011",
                "Helpfulness": 0.7,
                "StarRating": "5",
                "Text": "Quantum Theory is one of the more difficult concepts that can be tackled by one not skilled in the mathematics of PhD level physicists.  This book is not necessarily an \"easy\" read, but it is by far more understandable than many of the other non-mathematical books on the subject.  The authors walk the reader through the fascinating concepts of superposition, entanglement, wave/particle duality, etc., and do so in a way that, if you take the time to concentrate on what they are saying, these otherwise impossible concepts actually become understandable.  For someone with no real math background who wants to understand the world of the \"very small\", this book is outstanding.  The authors have done an superb job of introducing the subject and its history, as well as describing exactly what quantum theory is and how it is at the core of much of the techology we have developed since the early 20th century."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AO4DCL8SLCJB"
                },
                "Date": "on March 29, 2015",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3R7IPSC0P6XZ9"
                },
                "Date": "on March 7, 2015",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Quantum Enigma tackles a very complex subject in language can be understood by a layman.  Science has not progressed far enough to fully explain how conscience appears to become entangled with quantum matter, but it is fascinating to contemplate."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32GB392MKY0C5"
                },
                "Date": "on February 11, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "My interest in this topic started with the film \"what the bleep\". And I have been looking for a book that can explain it further without any prerequisite knowledge on physics. This is the one."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Y7C491Q8R9PG"
                },
                "Date": "on November 6, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1O4E06LGJ1ZUO"
                },
                "Date": "on May 10, 2012",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "I was in the middle of \"A Clash of Swords\" when a friend recommended this book to me, and I immediately ordered it and put the Martin on hold. Quantum Enigma ended up being as riveting as Martin, and I plowed through it in a couple days. It's very clearly written, and you don't have to know any science going into it. It starts out, like most books in this field, with a brief overview of the history of QM. Which is actually great, cause I forget the details all the time. But the marrow is in the middle chapters, which they go over a couple times, and with good reason. It's pretty profound, and and stuff worth thinking over more than once. And then they wrap up with reactions and ramifications to the enigma, and the latest experiments related to it. The big thing to watch out for with this kind of book is pseudoscience, like the movie \"What the Bleep?\" -- which was somewhat painful to watch -- but these guys are about real science, and even make a point of distancing themselves from that movie at one point. Highly recommend it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AV3CZBGT4TG2I"
                },
                "Date": "on May 10, 2012",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3U6AGLHUF303N"
                },
                "Date": "on September 7, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "It's a bit of a struggle to completely understand all the minute details of each of the concepts that are both directly and indirectly described in the read of this book that frames the concepts of consciousness and quantum physics. It's a historical tale of how we humans continue to try and understand ourselves and the why's of the universe in some way that is more revealing than just \"spooky actions\". The Devil may be in the details but God may be everywhere else."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1M6D4RPSG88JQ"
                },
                "Date": "on November 12, 2012",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1L9QOYAQRUARC"
                },
                "Date": "on June 25, 2012",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "I was looking for a book to explain several paradoxical experimental results in quantum mechanics, especially the interference (\"two slit\") experiment. This book did the trick."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFQMFAGF06VLB"
                },
                "Date": "on June 27, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent discussion of quantum paradox without becoming cloying or overly pedantic. Interesting, readable, entertaining.  Written by physicists, not mystics, they do a great job with both the science and the softer analysis. Highly recommended."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DO5XO7EDV8LQ"
                },
                "Date": "on December 24, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I enjoyed this book and have a computer science background, not physics.  I thought he used the 'box pair' analogy a little too much but otherwise a good read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XVZHZ8LLIPN"
                },
                "Date": "on December 23, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "We non-scientists need books like this to help us grasp the significance of what those with the brains for this stuff are doing."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VM3GGEE72I0D"
                },
                "Date": "on December 19, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The book is written for the average person, who has some knowledge of physics. It is readable, logical flow, and excellent examples used to make a point. The sentences are short, crisp, and to the point. A minimal amount of background material is presented and is presented in a logical sequence. The authors explain who is speaking at certain points, which is extremely helpful and gives the reader the impression of being in a seminar, rather than a passive reader! This is the best book I have read on the issue."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2D18P24C7IW05"
                },
                "Date": "on November 30, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "The book postulates a link between the quantum world and our alleged ability as sentient beings to create our own reality.  It's actually a pretty good book for someone that doesn't know everything and actively seeks to further their ignorance."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3I0BDCMWSUJ8F"
                },
                "Date": "on November 3, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "interesting.  At times maybe redundant to drive the points home. How ever it is clearly written for the average reader."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACLZ1SI2MQ29M"
                },
                "Date": "on November 2, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I want to study (understand) Quantum Theory and this book is as close to practical implications of this theory as I have found so far."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35I76QNMOOULY"
                },
                "Date": "on November 1, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PGC2LHT6GQD9"
                },
                "Date": "on October 29, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "GREAT BOOK ! Well documented and most interesting ! Brings into focus the latest discoveries in Quantum Physics. Very enjoyable reading."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KBV0G9ULFG7V"
                },
                "Date": "on September 6, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VH7S5WJ62USB"
                },
                "Date": "on August 21, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "It explains a very difficult subject with common words and has the expertise to let you find a link between the physical world that we know and the world that is still to be discovered"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AD9C1CFTTBXU7"
                },
                "Date": "on August 20, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Quantum Enigma provides a concise history of the development and history of quantum mechanics and theory.  Best of all, author Bruce Rosenblum dares to stretch out into the empirically-risky realms of cosmology and future implications.  Leaves the reader with the right questions, and offers a short-but-helpful list of further reading recommendations.  Highly-recommended for those seriously interested in the link between quantum theory and broader implications."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A345M2XGCI9AAN"
                },
                "Date": "on July 25, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The truth is nobody knows for sure how the universe is structured and where we are in relation to it.  This book gives a more conservative look at the problem.  The authors label movies like \"What the BLEEP do we know\" as pseudo-science but do not give a clear argument of where it missed the boat.  The book is very easy to read but gives a nice overview of how the relationship between the quantum mechanics and reality has been an ongoing question in physics for close to one hundred years.  Many different perspectives are presented, and overall I would highly recommend it.  Very well-researched and very scientific work that still is very interesting and a fresh read"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SP1ELN2RYDWN"
                },
                "Date": "on July 1, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3V10T1LV7Z5R7"
                },
                "Date": "on June 20, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "The concept discuss in the this book is one of the most mind-blowing in all of science, namely that the matter around us relies on observation in order to be in one state rather than another. It is Schrodinger's cat all over again. Read the book and try and wrap your head around the concepts and then read it again. It is mind boggling."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12XS85MU6YO11"
                },
                "Date": "on June 19, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I found that this book continues to unravel the mystery of quantum physics and how consciousness affects everything in our world."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GNY7BZH8FX9V"
                },
                "Date": "on May 18, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "What a great overall explanation of the quantum enigma. I found this book by accident and it sounded interesting. What a mind opening experience.  The authors give a thorough background followed up with possible implications. It makes you wish you focused more in high school physics as the implications can make most other areas of life seem less consequential.  It was written to a fairly simple level given the subject matter but I still found myself going back over chapters andnI still only feel like I can talk in great generalities which is why I will read over, probably several times."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQI99YS01RMPQ"
                },
                "Date": "on May 2, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book forthrightly addresses a subject that makes the physics community uncomfortable.  It centers around quantum physics, free-will, relativity, and consciousness.  The authors are accomplished physicists, not new age crystal gazers, with the talent to clearly explain the “quantum enigma” to everyone.  For me, empirical data regarding Bell’s Inequality was the core of the issue.  I won’t give the startling punch line away; read the book!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XNMAWSZ08O93"
                },
                "Date": "on April 15, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book finally lays out in laymen's terms what I have been trying to understand for years! I love it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQAWEKIGZADJG"
                },
                "Date": "on March 16, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I have I have long been curious about quantum mechanics. This book is an excellent introduction to the quantum enigma. I highly recommend it for the layperson or even a student familiar with elementary particle physics as it provides a good survey of the problem of observation in quantum mechanics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1130F4HNWMJMX"
                },
                "Date": "on March 12, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book explains the problem ignored by so many physicists. It makes a compelling argument that the universe depends on the observer and somehow the universe may not be real or fit into the reality people are used to thinking about. I'm not through the whole book yet and I'm sure I'll want to re-read it, but it has me questioning if we really exist and even if we do exist, that the universe is nothing like people think. I have reached the part about Bells Theorem and this is the nitty gritty of the book I think. Highly recommended since it treats not just the quantum physics realities but how we people are an integral part of the reality we encounter in quantum mechanics that makes you question what existance really is."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SULAMEJFGR1Y"
                },
                "Date": "on March 10, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This was a good read, liked the way arguments were presented; obviously there are no solutions to the enigma but it stokes the fire to learn more, and that is crucial."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1L4NWD5QVT0MM"
                },
                "Date": "on March 8, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "It is fascinating to have obvious truths shown to be incorrect -- to have to confront the fact that our whole common sense view of the world and the nature of matter is mistaken.  It's also fascinating to observe the physics community's reaction to these discoveries...sort of like Gallileo and the Church all over again.  One ends up having, for the first time, a little understanding of the Church's discomfort.  I'm reading it a second time."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DA800MVBSCSC"
                },
                "Date": "on February 1, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I'm not a scientist, so it was not very easy to read and understand, but after all I succeeded in finishing. Amazing things are happening in this world, as is demonstrated by the authors and discovering how they work must have been great fun for all those people who are constructing such clever experiments."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AO2OTUB4TZRD"
                },
                "Date": "on January 27, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GGR8353YB8RD"
                },
                "Date": "on January 11, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I'm really into quantum physics for non-scientists.  This book brings up the very interesting problem of consciousness.  Where does it fit in, and why do physicists prefer to ignore it?  Is it biologically based, or is there something else?  I love this stuff and Rosenblum knows of which he speaks.  A number of other writers on the subject do not."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AT989M662K6W9"
                },
                "Date": "on January 5, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "As one with a BSc in Physics and Mathematics, I enjoyed this ebook very much. It was educational for me since a lot has transpired since I got my degree. Mind you a lot about consciousness is still speculation and there is a lot we just don't know yet. This ebook does a great job explaining these speculations."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27L34IEYUAGWC"
                },
                "Date": "on November 7, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10SH0U1FXQA6Q"
                },
                "Date": "on October 7, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The authors introduce you to quantum physics and its weirdness. A must read if you are interested in the very small universe of particles."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A224KSSV408FM6"
                },
                "Date": "on September 16, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8WFS5YCOBLSL"
                },
                "Date": "on September 10, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WEK45ZFI3SN9"
                },
                "Date": "on July 29, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I like to refer back to this book often. The topic of quantum-jumping, Plank's constant and thermal radiation are fascinating to me. Very good book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RG2BK7WUS76T"
                },
                "Date": "on March 16, 2015",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": "This book is dry, not for the general public interested in how quantum physics relates to consciousness. It will appeal more to those with physics background and education. Much better for the layperson on how quantum physics relates to consciousness, even spirituality, is \"The Quantum Se;f\" by Danah Zohar."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4YN494ZZU12O"
                },
                "Date": "on July 24, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is a rare topic and this book does credit to the subject.  And this recommendation does not simply apply to science geeks like me. Stuff like this opens a scientific peep hole on other things that might seem unrelated such as life after death consciousness and other topics of the same type."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QJU4FEN8PQSZ"
                },
                "Date": "on September 3, 2014",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2H5ZIKWE7DP4X"
                },
                "Date": "on August 9, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Good read for layman.  While there is much comprehensible explanation of the Enigma, there could be more treatment, even grounded speculation, on what the role of human consciousness is or might be in the ultimate understanding of the Enigma."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3O9N8BQRJA5VJ"
                },
                "Date": "on September 1, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Thought provoking, clear, and yes even fun to read. It isn't so heavy that you need to be a physics student to understand the concepts outlined in the book. It certainly isn't a light read either, but we'll written and well presented."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1G1ZRK4FFS3YA"
                },
                "Date": "on December 30, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MZHYNZ9X9EI5"
                },
                "Date": "on March 12, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A book that will challenge all you have learned or thought to date. An excellent thought provoking book. As a student of physics and philosophy, I wish this had been part of the required reading."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LUOMEY0T1MH1"
                },
                "Date": "on April 13, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book is really interesting. I haven't finished it yet, but I'm already intrigued. Definitely written well so that it's able to be absorbed by a non-physicist."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CJJRKT01MGUS"
                },
                "Date": "on January 20, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Rosenblatt and Kuttner have provided a wonderful and accessible pathway into the world of quantum physics for the mystic, and don't diminish mystery itself."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27GQZTUDK7NWK"
                },
                "Date": "on November 2, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "With Prime, this came in two days. It's a great little book. For those who want a cogent, clear explanation of the basics of QM, this is the book for you."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VLEBQ3B6RDWV"
                },
                "Date": "on November 20, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Really enjoyed reading this. I'm not a physicist, so I appreciate the style in which to book was written. Truly accessible to everyone."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVSYQ4WKWL82V"
                },
                "Date": "on May 31, 2014",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9EFUDGI3RVBG"
                },
                "Date": "on August 28, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The most reader friendly popularization of  the historic and contemporary research into quantum physics/mechanics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EGTR87ZBGO5G"
                },
                "Date": "on October 2, 2013",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": "Plenty of useful information on quantum mechanics here and it makes an easy read. Thus us challenging stuff, sure, and you will find yourself stopping to think from time to time. I did feel, however, a little miffed that the authors didn't seem too inclined to jump more than ankle-deep into the who enigma aspect, just hinting that there is something weird going on at the quantum level. If you're already a student of this subject, there is really nothing new here. It'd make for a good intro if you're just becoming curious about the truly strange implications of the most successful scientific theory."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3A5HHRB6I9F15"
                },
                "Date": "on July 29, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I am so interested in Quantum Physics and this was another great revelation for me."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13TNEHSBKOHGK"
                },
                "Date": "on May 1, 2014",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YHQ21P1CQ1YW"
                },
                "Date": "on April 26, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "This is a well written account of how the quantum enigma has been handled by the great minds through the years. We don`t know if the enigma will ever be solved, but it is for sure that if we do not try it definetly won`t be. So for now we must just be astounded by the development of the myraid of new prducts that quantum mechanics is giving us."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2D0E8OPH0EHOC"
                },
                "Date": "on April 23, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "I really enjoyed this book.  I also found it somewhat humorous that the general physics community and any other scientific field whose profession it is to determine how everything works finds it difficult to swallow the notion that at a fundamental level, we have no idea how anything works.  It is unusually satisfying to know that the smug professors and arrogant academicians who taught me in college, who presented everything as universal fact either had no idea what they were talking about or simply chose to ignore presenting the known complexities of the Quantum Enigma.  They never once said anything like, \"Now in Newtonian physics, things work like this.......  but in Quantum physics things work like this....\"  Shame on them and their arrogance and/or closed mindedness.  It turns out creation is still an enigma to us mere mortals and all we are really doing is scratching the surface."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A382HL6S0S29VE"
                },
                "Date": "on April 7, 2014",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20NSLYU4MUF8D"
                },
                "Date": "on February 14, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12AU17TZ5I2W9"
                },
                "Date": "on January 21, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "What do you expect with a title like Quantum Enigma!  Most people don't read books that require them to check the dictionary before they open the cover of the book.  But if you do, this semi-laymen's view of quantum mechanics will literally open dimensions of a NEW WORLD for you.  Existence as a result of observation, parrallel universes, objects being in two places at the same time and the impact of God on our world are a few of the ideas discussed.  Not for the 'faint of heart' but truly an experience in a New World."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A121KXLT6YNMVD"
                },
                "Date": "on January 5, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "I've read this book several times -- first edition and second. It's not really hard to understand at all. The authors have a clear and to-the-point writing style--unusually entertaining for a non-fiction idea-oriented book of this sort. It IS hard to accept. What it is says is so disturbing to the prevailing world-view that I'm sure many people just shut it out by saying, \"Oh this is too hard to understand.\" That means they've probably understood it. Other readers may say, \"This is all old hat stuff. Nothing new here -- it's boring.\" That's probably someone who doesn't understand what the book is saying. The quantum experiments are about as simple (in principle) as it's possible to be (though some of them may require some awfully hi-tech equipment to conduct). While a knowledge of advanced mathematics  is needed to interpret the experimental results, you don't need much if any math to understand this book. It's more about the implications of the experiments. What kind of world is this? Is it real? What does \"real\" mean? Do things have any separate existence? How can things that have no known physical connection still be connected in some weird mysterious way? Hmmmn. I won't promise that you will find the answers to such questions in this book. But I think you may learn what the questions are and how to ask them. Knowing how to ask a question is, I believe, a large part of finding the answer."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BPYF2Y92SKL0"
                },
                "Date": "on March 15, 2013",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1H8L4JXIAILSR"
                },
                "Date": "on December 21, 2012",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A51RRZTJA2QD1"
                },
                "Date": "on June 15, 2012",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": "This book is exactly what I was looking for, the most scientific approach at philosophically challenging the nature of reality. As both side are my passion this book is written very well and therefore made it possible for my mind to ponder either side and tickle my imagination and stance on the subject for hours on end."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QL9B7WPCPSGS"
                },
                "Date": "on March 31, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "It's getting there .....a great beginning to a journey of hope"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACGT9USTYH3PT"
                },
                "Date": "on December 23, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Easy read for average people with an interest in the sciences."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NVWB6JT4TCMS"
                },
                "Date": "on January 14, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent Item and Fast Shipping! Thanks!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACLAJC1OOHETB"
                },
                "Date": "on September 16, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "I am intensely interested in Quantum Theory.  This book is, by far, the best I have read on the subject.  It out strips the others and leaves its closest contender in the dust."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALJJU7TLH5SD6"
                },
                "Date": "on January 5, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Good value; good buying experience!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AC3HMD7FIVQCP"
                },
                "Date": "on December 28, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "In layman's terms, fascinating."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GAMHS9NLJUMN"
                },
                "Date": "on May 9, 2012",
                "Helpfulness": 0.5714285714285714,
                "StarRating": "4",
                "Text": "The authors make it possible to learn something about this very interesting issue, even for those of us who do not have multiple degrees in advanced physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGDGW7UEF4P57"
                },
                "Date": "on January 23, 2012",
                "Helpfulness": 0.5714285714285714,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUS8QOL33K3MB"
                },
                "Date": "on March 18, 2013",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": "it was helpful and honest about the challenges that people who study quantum physics face and maybe the limits of current methodology."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUW7QLZN5SHR"
                },
                "Date": "on January 5, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Very interesting reading."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1A3YI31FESSPL"
                },
                "Date": "on May 10, 2012",
                "Helpfulness": 0.6216216216216216,
                "StarRating": "1",
                "Text": "\"Rosenblum and Kuttner therefore turn to exploring consciousness itself\" This is from the book description. This is untrue. They do not explore consciousness, at all. As a matter of fact, they severely limit it, as they really only mention free will as it relates to quantum experiments. They do not go any deeper into this topic than stating that if there isn't free will then we are all just deterministic robots with the illusion of free will, as this can't be scientifically tested they stop there. I thought this book being written by academics would be a benefit as it would stay away from new age-y, pseudoscience interpretations of quantum physics and consciousness, unfortunately the fact that they were academics was a mark against it. This book reads like a college course taught by someone who has spent too much time with academics and is therefore indoctrinated and unable to relate to non-specialists. They stress points that are simple to understand (There are three chapters that explain the quantum enigma, two by way of analogy. This is completely unnecessarily. Unfortunately, this is only one stark example of how they were pointlessly repetitive.) while just brushing over complicated concepts on the other hand that probably would have benefited from more explanation or the anecdotes or analogies that were mentioned in the description, which by the way, were generally not particularly good, nor well integrated into the content. They spend a lot of time talking about how physicists want to ignore the \"meaurement problem\" and how they go about doing so, which I really do not care about. How is this relevant? They mention experiments and articles that are being done on the subject of the quantum enigma but don't really go into any details about the goals, results and implications of these experiments, just that younger physicists have a lot of interest in it. Thanks. Again, not why I bought the book. There is one chapter that covers possible interpretations of the quantum enigma. I was hoping this chapter would make up for all the sludge I had to waddle through to get there, but, no. Disappointing. Most of them are cop-outs for how scientists get around the enigma (like quantum logic which changes the rules of logic so that there is no enigma, lame). The book mentions psychology a little bit, but mainly in a typical materialist way where consciousness is expected to be completely explained by brain activity... If I was you, I would not buy this book. Buy a book on introductory quantum physics and do some google searchs, you will get the same thing with less clutter. Their editor should be fired."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AK9NUO61H5QF9"
                },
                "Date": "on December 2, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Very interesting info."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3I4M19GZR6MGS"
                },
                "Date": "on October 9, 2014",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2X6R419617LYS"
                },
                "Date": "on May 30, 2013",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": "I've been a student of Theoretical Physics for 40+ years.  While the book is well written and covers a lot of current thinking regarding quantum mechanics it fails to add much to the current conversation.  It's value is for introducing  new people to the quantum enigma."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1658XH2NU1ONE"
                },
                "Date": "on April 12, 2012",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Very, very well written by two men who are real authorities in physics and quantum mechanics in particular. The book quickly sets modern physics against the background of Aristotle and Newton."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1T9L2NPX70UTW"
                },
                "Date": "on April 11, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Well presented."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AU0R1Y27SL1N"
                },
                "Date": "on February 20, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent Read"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1B9U0OKEV4LQ5"
                },
                "Date": "on September 14, 2014",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "Great beginning for a non specialist.  The physics aspect is readable and fully explained.  Authors rather vague on the philisophical aspects.  But, hay, this is not their field.  As they explain with remarkable frankness, philosophy and especially religion is disdained in acedemic science.  Apparently tenure is at stake, and one of the authors was untenured.  The other was beyond reach, a full professor emeritous (ie., retired).  I'm looking for a philosophy of science discussion that is within my humble reading ability."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOE17HCQ3Q9EN"
                },
                "Date": "on June 10, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "This is the ideal prelude to making a 'quantum leap' in our understanding of Quantum Physics.  All that's missing, as I see it, is the realization that space is a discrete network where cellular transmissions are like neural impulses in a brain, with sub-quantal 'priming' radiating outward in distributed waves and quantal decisions being executed in sequential.impulses.  And of course there's all that sub-conscious dark matter and dark energy in our 'hind-brain'!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1H02WER78CT75"
                },
                "Date": "on March 19, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Excellent book with very clear explanations of fairly complex quantum phenomenon. Raises very interesting questions regarding the role of conciousness in the quantum world"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DIQBFE0CA4BX"
                },
                "Date": "on March 18, 2014",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "It talks a great deal about Phylosophy of Physics but doesn't go in depth dealing with Spirituality connection. The author could have gone in detail about the of role empty space (Dark matter and Dark Energy) as a force in the Universe and how the same energy of empty space plays a major role in our consciousness."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANK5N3LVBZ7KF"
                },
                "Date": "on March 7, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "This book is very well written, with descriptions that are clear and concise.  The author takes you through the history and thought processes regarding quantum physics and the philosophical issues associated with it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30INWNXK8WJJG"
                },
                "Date": "on February 14, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "It covers and explains a lot of connections that I have wondered about since I became interested in the Nova shows years ago."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJ46M79F86QJX"
                },
                "Date": "on January 1, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "A great book for non-physicists. The writing is clear and the concepts make the enigmatic aspects of Quantum Mechanics accessible without the mathematics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26550UKAZUUCK"
                },
                "Date": "on June 26, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "This book is easy to understand on a very perplexing but nevertheless vital matter. One cannot claim to be educated unless he/she can have a basic understanding of quantum physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YS9MDZP93857"
                },
                "Date": "on June 22, 2013",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IWWVF2ZMCGA3"
                },
                "Date": "on September 24, 2012",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "I've been trying to understand the quantum enigma for 30 years.  This book is well written and fairly easy to understand.  But the authors don't understand the quantum enigma so it's not likely I will either.  But I'll keep on trying."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJBGXJ5QCFV9C"
                },
                "Date": "on December 8, 2011",
                "Helpfulness": 0.6090909090909091,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GCTFOIMKYXI7"
                },
                "Date": "on May 23, 2014",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DTR3DXN354PM"
                },
                "Date": "on November 7, 2013",
                "Helpfulness": 0.5555555555555556,
                "StarRating": "2",
                "Text": "This book seems to just ramble on and on and on.  I think it could be condensed into about 20 pages.  Terribly disappointed"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFOTDQCYCH2H0"
                },
                "Date": "on August 14, 2013",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "3",
                "Text": "This is an interesting book that brings the discussion of quantum physics into the arena of the non-scientist. But it doesn't clear up the enigma. The authors said they weren't going to and they didn't. But then, that's because no one seems to really know what the role of consciousness or observation is in the micro or the macro world. Again, interesting, but a lot of repetition. It left me with two questions: In what ways will solving the enigma change the world? Does it really take a 287 page book to tell us it hasn't been solved?"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SHB3YXJO8K19"
                },
                "Date": "on October 17, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "An excellent read of the problem confronting materialistic science when running into the metaphysical."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZGUQZE0VTC8"
                },
                "Date": "on April 23, 2012",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A221LVF3PZ3DR9"
                },
                "Date": "on March 14, 2012",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": "This book was very well written. Makes a crazy subject somewhat easy to understand. I am still hoping that someone will write a book that includes and explains some of the math."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I3U97KUPQB7M"
                },
                "Date": "on June 8, 2013",
                "Helpfulness": 0.4,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8BIXFRGO1H9N"
                },
                "Date": "on September 24, 2012",
                "Helpfulness": 0.4,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACFA872HOOG43"
                },
                "Date": "on September 10, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "great qualities , shipped really on time!!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IIMHUHXWQFZD"
                },
                "Date": "on October 23, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I loved it, it  was a  Great book!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XTR0MSQ0275D"
                },
                "Date": "on December 30, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9CJYACJJNP98"
                },
                "Date": "on September 9, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Exactly as described."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GMOM625FZ9OJ"
                },
                "Date": "on September 9, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Interesting theory"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A382AAN5ZN5BCX"
                },
                "Date": "on July 1, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Excellent book"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AE0IBRUEC2LQ"
                },
                "Date": "on August 4, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I bought this book on a whim. After reading the description, I regretted the purchase because it sounded like What the Bleep?! pseudoscience hogwash. However, I was quickly reassured that it actually was about the philosophical inquiry into the implications of quantum theory. If you love philosophy as much as you love physics, this book is for you. You need not fear the presence of ridiculously advanced math and vocabulary. This is for us laymen."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWQABT2QMQBL9"
                },
                "Date": "on March 27, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "This book is pretty amazing.  This book also is about getting into the first steps of the enigma.  Most people should just start with this book and see where it goes from there.  Hell, most people cannot grasp the basic concepts of where this book is attempting to take them.  Most people need not know or understand what this book attempts to explain."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQA8WLYYNWONM"
                },
                "Date": "on January 29, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15OMXNT5EPVZW"
                },
                "Date": "on January 27, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "recommend! if you are into science and the little world we don't see everyday. A must read. Loving every min!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JIZJ516HPYHA"
                },
                "Date": "on September 26, 2013",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "If you have the patience to wade through the interminable and maddening self-contradictions in this book, you'll discover a whole new world with profound implications for cosmology and religion. Don't expect conclusions, however. Just a murky, rudimentary introduction to the world of quantum mechanics. In other words, I'd look elsewhere."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACE8JFORXQZMM"
                },
                "Date": "on October 12, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "thank you"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SMCW4L6O6VLU"
                },
                "Date": "on July 2, 2012",
                "Helpfulness": 0.45454545454545453,
                "StarRating": "2",
                "Text": "I first read \"simply einstein: theory of relativity demystified\". It was so well written and I enjoyed it so much that I bought 2 copies for my parents and myself ( I got the book from my library ) I got so interested in all the topics that were presented in that book, that I picked up this book as my next read from the library. What a mistake ! If it wasnt for the other book, I would have returned this after reading a few pages. These are physics professors ? the language is so bad.. at many places it is more as if the authors are talking to you rather than writing a book ( if you know what i mean ) Unless you know what they are talking about, you cannot clearly understand what they are trying to get at. And so many typos and other grammtical mistakes and hard to read english. I am really disappointed. All the important points are glossed over ( they could have gone a little more into detail about what the physics ). I will not recommend this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZJJPCVCWZ839"
                },
                "Date": "on January 7, 2013",
                "Helpfulness": 0.5476190476190477,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1X42YVCKIQHM8"
                },
                "Date": "on September 26, 2014",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GRO1D6BHZ3W4"
                },
                "Date": "on December 19, 2012",
                "Helpfulness": 0.42857142857142855,
                "StarRating": "2",
                "Text": "Frankly by the time I had read the first fifty or so pages I was beginning to lose consciousness. Can't recommend it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12LFVCEAI8XFC"
                },
                "Date": "on March 2, 2012",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A235L4BMTHOOBB"
                },
                "Date": "on June 23, 2014",
                "Helpfulness": 0.4,
                "StarRating": "1",
                "Text": "A book containing the quantum mystery explained again and again about 20 times and on each round an unjustified always louder claim that this is a proof of mysterious consciousness in about everything. Pity that the authors did not select religion as their work."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2I9XZCVBNPHBN"
                },
                "Date": "on July 17, 2014",
                "Helpfulness": 0.14285714285714285,
                "StarRating": "3",
                "Text": "Interesting...but the bottom line leaves the unknown attributable to religion.  Supposed to be a science book but I guess religion sells."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Y139UJMI6RT2"
                },
                "Date": "on October 31, 2014",
                "Helpfulness": 0.2222222222222222,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HFQ405AKX4IW"
                },
                "Date": "on October 1, 2011",
                "Helpfulness": 0.16666666666666666,
                "StarRating": "5",
                "Text": null
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Quantum-Enigma-Physics-Encounters-Consciousness/product-reviews/0199753814/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "151"
    },
    "Salesrank": "#14,451",
    "Timestamp": "2015-05-24 13:11:28.926797",
    "itemurl": "http://www.amazon.com/Quantum-Enigma-Physics-Encounters-Consciousness/dp/0199753814"
}
