{
    "Category": "in Books (",
    "ListPrice": "",
    "Name": [
        "What Is Quantum Mechanics?: A Physics Adventure"
    ],
    "OfferPrice": "$12.99",
    "Reviews": {
        "AverageStarRating": "4.2 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32OFT71S3TAQ8"
                },
                "Date": "on January 23, 2001",
                "Helpfulness": 0.9767441860465116,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on November 26, 2003",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7LTJK044JKWV"
                },
                "Date": "on October 27, 2001",
                "Helpfulness": 0.875,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A960S218F07C1"
                },
                "Date": "on March 10, 1999",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "It's refreshing to find a physics book that takes the reader through the derivations step-by-step without making any \"quantum leaps\" that the reader is assumed to follow implicitly.  I also liked  the \"what  we've learned so far\" summaries at the beginning of each chapter.  The  book is very valuable for these reasons alone.  Although the stories about  the people and history of quantum theory were great to have, I was somewhat  annoyed by all the silly conversations and digressions of the students -  the book could have been a lot shorter without these.  Also, I think the  book could have used more diagrams of wave propagation in order to help the  reader develop an intuitive feeling (if that is really possible in QM)."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VET0MDJOW55H"
                },
                "Date": "on August 25, 2003",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RRWO3TNE8II1"
                },
                "Date": "on August 14, 2003",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "I was disheartened to see all the negative reviews.  I suppose if you expect a standard physics textbook, or a discriptive book for the hobbist you'd be disappointed.  From an educational standpoint, it's a facinating experiment.  How COULD anyone document the learning process of a more-or-less random group of people, from young children to grandparents?  In terms of material difficulty level, it is sort of designed for people who have gotten through Who Is Fourier.  The book bravely dives in explaining calculus concepts, and wave mechanics from scratch - sometimes with a bit of childish humor.  Is that so wrong?"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEXU6RYKLW0Z0"
                },
                "Date": "on July 4, 2005",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "For the really intelligent layman, this is far and away the best book on Quantum Mechanics.  Most of the math is algebra or just a bit beyond, so don't be too afraid; the reward is a real understanding of how and why quantum mechanics developed and why it's so important.  This -- along with all other Lexx Books -- is an absolute masterpiece of explanation and is worth every hour of your time.  Pay NO attention to reviews whining about the presentation as those portions of the book are less than one percent of the entire work.  An excellent, excellent book... for the fairly bright!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16W8HTCIWYDZ6"
                },
                "Date": "on January 8, 2002",
                "Helpfulness": 0.875,
                "StarRating": "4",
                "Text": "After three attempts over the past two years I finally finished this book.  The text is an excellent introduction to Quantum Mechanics but DOES require some mathematical ability.  Often I would get lost in the derivations.  However, on the second and third attempts things begin to make sense.  The text does show all the steps involved in the derivations and that helps.  You could skip the math but then the book loses it's value and you will not get much out of the text.  If you are formally trained in Quantum mechanics this book will serve as a review.  However, if you, are just curious, this text is great.  Be prepared for a tough read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LEJ94FJI9GEX"
                },
                "Date": "on May 30, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "As a professor (of management science) I can really appreciate a book is sound pedagogically. This book is a brilliantly developed introduction to quantum mechanics. All you need to understand is basic algebra. THe authors  never skip a step!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQTOMWIZ9MT5J"
                },
                "Date": "on October 17, 2006",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXY6VP7X1V3GA"
                },
                "Date": "on June 11, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on December 16, 1997",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": "This is a very good and unusual book about Quantum Mechanics that appears to be aimed at a fairly young audience.  The book does not gloss over difficult topics. It explains the difficult mathematics step by step rather than playing that age-old game of, \"I'll write my book so that I can impress my colleagues with its abstruseness\", which happens on occasion.  It is Japanese in origin and almost has the feel of Manga (popular graphic novels), however, it covers the topic well.  This would be a great book for \"anyone\" who really wants to be lead step by step through the historical development of Quantum Mechanics as well as the fundamental mathematics involved.  If you are the type of person that really would like to understand the basis of this important subject, buy this book.  If you are the type of person that wants to look \"smart\", and spend an extra several years trying to wade through many books that aren't as clearly presented, by all means, skip this one."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2L5C1Q27W5AXL"
                },
                "Date": "on March 8, 2001",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "A book that will fascinate any reader who is interested in the subject, whether the person is a physicist or not. The expository style of writing takes reader into a  journey to discover quantum physics. You'd wish that other sophisticated science subject would also have a similar book like this one. I'd recommend this book to be a supplementary reading for any student currently taking a course in quantum physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1A6QTSV7VFFTV"
                },
                "Date": "on January 23, 2004",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MPUE8I7QKN9O"
                },
                "Date": "on March 16, 2005",
                "Helpfulness": 0.7777777777777778,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QTW6MT872EZP"
                },
                "Date": "on March 29, 2006",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is an amazing book for all, specifically, physics students.  Every body would have pleasure of reading this book and could gain enough detail knowledge of Quantum Mechanics, a subject which scared expert and non-expert equally.  One of the beauti of this book is that you do not have to have vast knowledge of mathematics to read and understand this book."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 23, 2003",
                "Helpfulness": 0.7058823529411765,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RFXU3P0XKKF4"
                },
                "Date": "on March 4, 2008",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MAY0BETPV5ST"
                },
                "Date": "on November 19, 1998",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Just by chance I got hold of this book and started looking into the much talked about wave-particle duality of light. It enticed me into the exciting world of quantum mechanics. The style is very lucid and makes  interesting  reading. The reader is not scared away by unnecessarily  complicated analysis and at the same time it doesn't lose touch with the  core concept. It guides the reader very smoothly and even instils  confidence in their minds.  I have seriously taken up the task of  understanding quantum mechanics.  \"LEX\" should continue this  effort and write on various topics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Z50VGE50RHRX"
                },
                "Date": "on August 10, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book is a gem I purchased it in 1998 and I always go back to it. A must have ! You can brush up on your QM over lunch with this one. An easy read !"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ON0F2V09VW63"
                },
                "Date": "on November 1, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Love this book. Unfolding physics a layer at a time."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARU11BG1ER1H5"
                },
                "Date": "on November 25, 2002",
                "Helpfulness": 0.5555555555555556,
                "StarRating": "3",
                "Text": "I was very disappointed with this book.  While the philosophy outlined in the introduction about learning languages is very enlightened and applies equally well to physics and math, the book itself is not very different from standard text-books on the subject in either format or content.  The chief difference is the addition of little cartoons which, instead of being informative and amusing, are just annoying.  As another reviewer pointed out, the material is too advanced for an un-educated reader, while more advanced topics are omitted."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3K0TYOXGYGUXL"
                },
                "Date": "on July 16, 2002",
                "Helpfulness": 0.5,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 11, 2001",
                "Helpfulness": 0.25,
                "StarRating": "1",
                "Text": "I think I'm sticking with Cohen-Tannoudji. The garish, overdone, self-indulgent comic-book approach in this book is so jarring that I can't handle it. The \"Transnational College\", by the way, is an unaccredited operation of some flyspeck chowder and marching society (\"the Hippo Family\") operating out of a house in Japan. This book was written by its \"students\"."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/What-Quantum-Mechanics-Physics-Adventure/product-reviews/0964350416/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "24"
    },
    "Salesrank": "#1,230,338",
    "Timestamp": "2015-05-24 13:19:03.853575",
    "itemurl": "http://www.amazon.com/What-Quantum-Mechanics-Physics-Adventure/dp/0964350416"
}
