{
    "Category": "in Books (",
    "ListPrice": "$16.00",
    "Name": [
        "The Evolution of Physics"
    ],
    "OfferPrice": "$13.82",
    "Reviews": {
        "AverageStarRating": "4.8 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D7XC7USJ9X7J"
                },
                "Date": "on May 20, 2000",
                "Helpfulness": 0.978494623655914,
                "StarRating": "5",
                "Text": "This is an inspiring book. I know quite a bunch of people who decided to become physicists after reading it. Two interesting aspects should be mentioned. First, it was really written by Infeld, though thoroughly  discussed, in a daily basis, with Einstein.(Infeld was a refugee under  Einstein's protection, and thought he had to justify his temporary shelter  at Princeton by writing something, which would also provide some income!).  Another book by Infeld, \"Quest\", an autobiography, is the source  of this and of many other interesting things about that period. Second,  this book introduces very clearly a revolutionary contribution of  Einstein's which is rarely recognized: a new method in physics which  consists in obtaining knowledge from the comparison of observations of the  same physical system obtained by two different observers. Though this had  been done before (by Mach, for instance), it was Einstein who transformed  it into a new tool for science. Physics was transformed by that, and  quantum mechanics could then go even further, in the role given to the  observer. This story is wonderfully told in this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARH9IQEMFKR6M"
                },
                "Date": "on January 3, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DET8JZRKSF2P"
                },
                "Date": "on August 7, 2001",
                "Helpfulness": 0.9516129032258065,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KJO5VP4K3CHU"
                },
                "Date": "on September 18, 2007",
                "Helpfulness": 0.9629629629629629,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A383746LFAIRWM"
                },
                "Date": "on October 16, 2001",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book provides a still useful account, from 'the horses' mouths', of what Alfred Korzybski called the Newtonian and non-Newtonian views in physics. As Korzybski noted, all human beings form a view of so-called 'reality'. Understanding how scientists do this can have value for the rest of us. In this excellent book, the authors emphasize general formulations and a non-mathematical approach: \"Most of the fundamental ideas of science are essentially simple, and may, as a rule, be expressed in a language comprehensible to everyone\" (29). The book includes chapters on \"The Rise of the Mechanical View,\" \"The Decline of the Mechanical View,\" \"Field, Relativity,\" and \"Quanta.\" Readers will be rewarded with clear explanations of some potentially forbidding notions. These are interspersed with useful comments on physico-mathematical method, theory and the goals of science. Einstein's and Infeld's discussion demonstrates their view that \"Science is not just a collection of laws, a catalogue of unrelated facts. It is a creation of the human mind, with its freely invented ideas and concepts. Physical theories try to form a picture of reality and to establish its connection with the wide world of sense impressions. Thus the only justification for our mental structures is whether and in what way our theories form such a link\" (310)."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2W8L0BA7I7Z1R"
                },
                "Date": "on December 6, 2000",
                "Helpfulness": 0.9333333333333333,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AP3J2Q04ROAV8"
                },
                "Date": "on May 13, 2000",
                "Helpfulness": 0.9230769230769231,
                "StarRating": "5",
                "Text": "Written by Albet Einstein you would expect this book to be too complecated and boring, think agian. He makes a point of simplifying concepts. If you aren't familiar with Einstein's work, it is really interesting. One thing  he gets into that I find interesting is the question of what light is. Is  it a substance, a wave, both? Another thing, is that the speed of light is  a \"universal speed limit\". As matter moves it shrinks and at the  speed of light it disappears. He goes over relativity and quanta too. Read  this book. Don't look at it and think it is too complicated. I am 14 and it  makes perfect sense. Thank you an happy reading!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2B1I7LSW0GM6E"
                },
                "Date": "on May 9, 2012",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "A novice or a layman would marvel the book for its simplicity in the presentation of the complicated physical phenomenon. This book is definitely a masterpiece for a beginner who is learning physics. As Einstein himself followed the science of deduction so has he approaced the same in the presentation of the physical facts in this book. You will see a glimpse of it as you read through this book. The book would turn out to be not so gripping if you're already familiar with some of the physical facts. But I would defintely recommend this book to others."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on December 23, 1998",
                "Helpfulness": 0.875,
                "StarRating": "5",
                "Text": "It has been two years since I read this book - but it impressed me so that I recommend it highly. It is quite readable without being condescending. It uses clear text and simple but essential diagrams to explain how physics  evolved from Newton's work through to Einstein's.  Only very basic  mathematics is used (Can you add,subtract, multiply, and divide?) so the  book is approachable by any reader who has at least a vague rememberance of  physics. It's the best book of its type I have read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TDI2N4CDIJV8"
                },
                "Date": "on July 23, 2001",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30QA7HMWZH0N0"
                },
                "Date": "on April 24, 2006",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Outstanding book to understand the way of thinking which resulted in introducing the various concepts associated with Physics. Though  written for general audience, this book needs to be read with care, and constant attention to see the remarkable connection between seemingly unrelated concepts like light, heat, electricity. Read this along with the book \"Einstein's Heros by Arianrhod\" to enjoy a different aspect of Physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASW77A8J0I068"
                },
                "Date": "on July 28, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OJW07GQRNJUT"
                },
                "Date": "on June 12, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IZRHH2VTL02P"
                },
                "Date": "on July 2, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10W82J8TSJTPV"
                },
                "Date": "on January 18, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14U8I2K67CE69"
                },
                "Date": "on March 20, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "When Einstein published his General Theory of Relativity, only a small fraction of physicists understood his work. One of the most remarkable aspects of this book, written for the curious non-physicist, is that special relativity, then general relativity, is unfolded for the lay reader in such a way that the reaction is, \"Of course!\", as if the universe could not be any other way. I now understand better Einstein's purported statement to a journalist when asked how he would have felt if the bending of starlight around the sun during a solar eclipse had NOT confirmed predictions of the General Theory. Einstein purportedly said, \"Then I would have felt sorry for God.\" Amazing book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A313913V8X7PMS"
                },
                "Date": "on August 20, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book contains a very broad introduction to the discovery of physical sciences as told by Einstein and recorded by his colleague. This book can be great for anyone interested in learning more about Einstein's thought process and perspective of simple natural concepts like heat, light, and energy."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on August 16, 1999",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QOVWRV63CI5V"
                },
                "Date": "on October 8, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Best part is the Prologue...love how the author's voice reaches across time and tells the reader exactly how the book is meant to be read. So intentional and wonderful to have thought of his future pupils. ;)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FVQFA7X5RHUR"
                },
                "Date": "on August 21, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3R14NXHI4KVCS"
                },
                "Date": "on December 17, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18IVOYKEE1GOP"
                },
                "Date": "on March 2, 2015",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "I bought this book mainly because of its citation value for the statement on page 92 about the importance of framing inquiry and research parameters before developing \"the answer.\"  Since grad school, I have privately questioned the cliche that \"the questions are more important than the answers,\" which struck me as essentially nonsense.  But Einstein's basic statement of this concept is so much more nuanced and sensible.  Beyond page 92, I discovered a very readable and enjoyable book -- I only wish Hawkings was as transparent!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PJ4B9FE1T6F2"
                },
                "Date": "on October 16, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is a wonderful book ultimately leading to a discussion of relativity.  Even so, the style of exposition is unusually good. I suspect Professor Infield wrote the book, albeit in collaboration with Professor Einstein. I feel his ability to make complex concepts relatively easy to understand rivals the teaching style of the beloved physicist and educator, Richard Feynman. Anyone interested in physics needs to read this book, not only for the invaluable content, but also as an example of a communication style which is only rarely encountered."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGBWNH7ELP369"
                },
                "Date": "on September 14, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book is a great stroll back through history. You can see how we have the theories and understanding today by studying the process of discovery as you look back to the theories (and their challenges) we had before."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CFBQ4M1OSS74"
                },
                "Date": "on January 17, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AT08KLGV2HSU7"
                },
                "Date": "on February 25, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I like that he can explain the physics to folks who don't have any interest in learning the math."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6TNEEN47B73Z"
                },
                "Date": "on May 2, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AS14ANEH5XQX1"
                },
                "Date": "on April 3, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Its a simple look at the development of physics through a historical perspective."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKS7MN9G515L5"
                },
                "Date": "on November 17, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "The most engrossing and best executed account of basic physics I have ever read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22J26RPRXM187"
                },
                "Date": "on September 9, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "I will recommend this product to any one interested."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CRLC7VYEM1ZO"
                },
                "Date": "on April 9, 2007",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAFI4N3QKPBOD"
                },
                "Date": "on April 11, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Everybody insterested in physics shall read this book. Somebebody should make a version with simpler lenguage drawings for interested teenagers and introductory university level as a must read book. This will solve the question: \"How come I am studying this s***?\"."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19VUEJIFFO9AK"
                },
                "Date": "on August 26, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Tough reading, but useful"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1W2ROGB0G0YRL"
                },
                "Date": "on December 28, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Worth reading."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4UIAGVDHJ4ZF"
                },
                "Date": "on July 10, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Yeah, it came on time. The text font seems easy for mine eyes. The content concurs with the title. The authors are internationally both recognized. It seems understandable."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5XK00L3K4LEG"
                },
                "Date": "on April 11, 2012",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I do not know if these words upon the back of my book, held with tape so fragile, were placed there post production intentionally, or if serendipity has played a role in my life once again. But that tiny little excerpt of HÖLDERLIN: The Death of Empedocles pasted to the back at my book has rung a bell of how life is so...human. Thank you."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2N2IQ5QM0CA96"
                },
                "Date": "on October 29, 2011",
                "Helpfulness": 0.5909090909090909,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 24, 1999",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Even though I haven't studied half of the things in the book, with the vivid explanations that were given I understood it all completely."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DUQRVQUCLB16"
                },
                "Date": "on November 25, 2012",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "it is a great book.  It is easy to follow and understande without a deep knowledge of physics or mathenatics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JP2S5JRME44A"
                },
                "Date": "on November 1, 1999",
                "Helpfulness": 0.42857142857142855,
                "StarRating": "5",
                "Text": "He's the best mind to lead you around the block again and again. The garden paths he strolls along are varied, but he will keep pointing out to  you the different ways to smell the flowers and each time, the fragrance is  richer. You don't need to be into math, but abstractions."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8B3W5790ZD5S"
                },
                "Date": "on February 23, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I love this book.  It was so clearly written that I now know exactly how the universe works.  I fear I may be a danger to myself or others.  Should I be trusted with this knowledge?  Am I responsible enough to use it wisely?  Are you?"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQL3NKRE37KKT"
                },
                "Date": "on August 13, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "important book in physics history by great physicist Albert Einstein. those book discuss large area of physics that drive this world ."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GVZTME71QXTW"
                },
                "Date": "on March 8, 2013",
                "Helpfulness": 0.2,
                "StarRating": "3",
                "Text": "The book is a bit elementary and lacks the transcendence Einstein was noted for.  The most fun is the reason for its being written in the first place.  We fail to realize how poorly, economically, the brilliant are rewarded.  It would be a good book for middle school science students and their teachers.  Real scientists are not the nerds society tends to make them."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Evolution-Physics-Albert-Einstein/product-reviews/0671201565/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "43"
    },
    "Salesrank": "#103,686",
    "Timestamp": "2015-05-24 12:28:13.985756",
    "itemurl": "http://www.amazon.com/Evolution-Physics-Albert-Einstein/dp/0671201565"
}
