{
    "Category": "in Books (",
    "ListPrice": "$19.95",
    "Name": [
        "Fighting Science: The Laws of Physics for Martial Artists"
    ],
    "OfferPrice": "$17.96",
    "Reviews": {
        "AverageStarRating": "3.5 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on January 11, 2003",
                "Helpfulness": 0.9,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3E3GD3TABXKU1"
                },
                "Date": "on October 7, 2002",
                "Helpfulness": 0.7931034482758621,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TB33RFHW3DO9"
                },
                "Date": "on June 28, 2002",
                "Helpfulness": 0.7857142857142857,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IO1ESNSIAXG3"
                },
                "Date": "on January 4, 2005",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VZBSQYLPSVE9"
                },
                "Date": "on December 12, 2002",
                "Helpfulness": 0.72,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32G54N8U4BLTS"
                },
                "Date": "on January 13, 2010",
                "Helpfulness": 0.75,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2M28KPHJQVPUM"
                },
                "Date": "on November 11, 2004",
                "Helpfulness": 0.7,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RCO6J0I8JNV1"
                },
                "Date": "on December 27, 2004",
                "Helpfulness": 0.6875,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33DWT2APDBNX6"
                },
                "Date": "on November 13, 2007",
                "Helpfulness": 0.7,
                "StarRating": "1",
                "Text": "The title is deceiving. There are no explanations of levers, planes, moments  of inertia, etc. In a nutshell, all throws are based on the principle of the moment of a couple, that is, initiating rotation about some point by applying equal and opposite forces; there is no science behind the writing in this book. There are excellent judo books which show sound principles of throws and sweeps, such as \"Street Stoppers\" and \"effective combat throws\"!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 24, 2003",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1G3QC7Y1JCYU2"
                },
                "Date": "on April 16, 2003",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "Fighting Science has helped me understand why some techniques work and others don't. Understanding the physics behind the techniques takes a lot of the guesswork and experimentation out of my training. I used to wonder why my instructor insisted on doing some techniques a certain and now I know. I also know that there are better ways of doing a couple of things than what I learned in class. This book is an excellent investment for anyone who wants to know not only what works and what doesn't but why."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1F1DDN4YSR95Z"
                },
                "Date": "on June 20, 2002",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "It is great to see a book actually apply the science of physics to the martial arts. Many books attempt to claim they do by citing a couple of equations and formulas but fail to apply them to the movements and techniques demonstrated or examined. Martina Sprague has done a great job of applying the basics of physics to both striking and grappling styles. I would highly recommend this book to anyone looking for the a western scientific approach to understanding their style."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20QZJMJW856FT"
                },
                "Date": "on August 25, 2014",
                "Helpfulness": "",
                "StarRating": "1",
                "Text": "An attempt to explain the physics of martial arts from someone who clearly has no idea how the physics of martial arts works. It reads like the author had one semester of physics, forgot half of it, and then forgot that reality is complicated."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATXARB8ZZ3ROU"
                },
                "Date": "on September 26, 2003",
                "Helpfulness": 0.625,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 27, 2002",
                "Helpfulness": 0.625,
                "StarRating": "5",
                "Text": "This is an amazing book!  Very inspiring,thorough, and one of the best Martial Arts books on the market! The directions/illustrations are easy to understand and apply.  The correlation between physics and martial arts is guaranteed to improve your skills.  I would recommend this book, as the author has definitely stumbled onto something!  I've been applying the principles in my training.  It works!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on September 20, 2002",
                "Helpfulness": 0.6,
                "StarRating": "5",
                "Text": "If you're one of those guys who wasn't exactly thrilled with high school science, you might want to give it another try. Not the same class you took back then, but \"Fighting Science: The Laws of Physics for Martial Artists.\" This 269-page book by Martina Sprague is reader-friendly and covers such topics as an introduction to fighting concepts, balance, momentum, direction, impulse, rotational speed and kinetic energy. Check it out. It's fun and you may just learn a thing or two."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALDOF4Y2U9290"
                },
                "Date": "on October 2, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "as a science teacher - I enjoy knowing the science behind martial arts to make it more relevant.  offers more understanding"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1F1DDN4YSR95Z"
                },
                "Date": "on June 20, 2002",
                "Helpfulness": 0.6,
                "StarRating": "5",
                "Text": "It is great to see a book actually apply the science of physics to the martial arts. Many books attempt to claim they do by citing a couple of equations and formulas but fail to apply them to the movements and techniques demonstrated or examined. Martina Sprague has done a great job of applying the basics of physics to both striking and grappling styles. I would highly recommend this book to anyone looking for the a western scientific approach to understanding their style."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMBACRLFE6GPI"
                },
                "Date": "on April 14, 2008",
                "Helpfulness": 0.5555555555555556,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8X2QG0FN70XR"
                },
                "Date": "on January 3, 2008",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "This book did not meet my expectations. I do not know what I was expecting but do know this was not it. The book covers some good but basic points and may even be a refresher or helpful reference for some. But ultimately if you have any \"fighting\" skills from some sort of formal training, then you are already familiar with much of this information. I do have to say I always read the reviews on books before I buy them, just to have an idea of what the product will be like. But will still buy a title with not so good reviews, much like when you hear about a bad movie but want to see it for yourself to judge it on your own standards. Well I wish I listened to some of the reviews on this book. I also bought another book by the author that has not been released yet called \"Norse Warfare: Unconventional Battle strategies of the Ancient Viking.\" I really hope this book is going to be better. I gave the book four stars, because I think it could be of help to the novice fighter. Also I would like to add, I am a knuckle-dragger not a scientist and can only say what I know of science and what I read in the book made sense to me (for the most part). If there were major errors in the science and theory presented in this book, then I missed the errors and if there were minor subtle error I really for sure missed them! So the bottom line is to take my review for what it is worth to you."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on January 29, 2003",
                "Helpfulness": 0.5,
                "StarRating": "1",
                "Text": "A little disappointed in the information: the book has a very basicaly approach of the scientific explainations of the martial arts techniques. If you are involved a longuer time in MA, then this book cannot help you a lot."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZEYGPCPIUTE8"
                },
                "Date": "on December 27, 2003",
                "Helpfulness": 0.2857142857142857,
                "StarRating": "1",
                "Text": "I thought \"hey... this should be good if it's well done...\" but it's not... I paid money for this and wish I hadn't... I could have bought lunch... I certainly didn't finish reading this book, but I slogged through more of it than necessary to \"give it a chance\"... You'd be better off with \"Physics for Dummies\" and a beginners class in boxing or wrestling..."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Fighting-Science-Physics-Martial-Artists/product-reviews/1880336723/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "22"
    },
    "Salesrank": "#974,914",
    "Timestamp": "2015-05-24 13:35:13.190073",
    "itemurl": "http://www.amazon.com/Fighting-Science-Physics-Martial-Artists/dp/1880336723"
}
