{
    "Category": "in Books (",
    "ListPrice": "$20.00",
    "Name": [
        "Physics Demystified, 2nd Edition"
    ],
    "OfferPrice": "$14.49",
    "Reviews": {
        "AverageStarRating": "3.6 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASMZIU9H3L49Z"
                },
                "Date": "on August 10, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is a really great overview and exploration of the fundamentals of physics, what makes our universe work. Stan's writing, as always, is super clear, and the bottom line is that he can make some really complex subjects readily accessible. I liked his section on electronics. It gave me some new insights into material that I was somewhat familiar with -- stretched me farther than I had been previously --  and for that I am grateful. I look forward to reading more of his works. Judging from the Amazon listing, it seems he is quite prolific and coming out with new books all the time.  I plan on reading more of his works, and recommend them very highly."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AA3GC9QKX6UOB"
                },
                "Date": "on January 6, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "This book is perfect for slight beginners.  I use the word slight because if you are an absolute beginner and just want to learn the very basics of Physics by doing only some light reading re an intro book, this book may not be for you.  If you want to learn basic Physics and are prepared to put some work into it than this book is for you.  I have another book by Stan Gibilisco so I know he does a good job...and he did with this one.  This book is best for someone who either really wants to learn DEEPLY all about the basics of Physics, or is taking a course and would like a good supplement to go along with the course."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20EEWWSFMZ1PN"
                },
                "Date": "on January 13, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23QCS3OZ1C1DD"
                },
                "Date": "on December 26, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "If it's been a while since you took Physics, or are just getting into it, this book is easy to read and understand."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADGHHRMBG731L"
                },
                "Date": "on July 22, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "A good primer or book to be used for review, The layout and table of contents allow one to survey the topics of interest."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10AT9H6H4KMIN"
                },
                "Date": "on October 23, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "It's a good way to make sense of Physics if you've never taken a course like this before."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1S8MJ71Y7M9U9"
                },
                "Date": "on December 4, 2012",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": "YOU HAVE ONE OF THE MOST DIFFICULT PROFESSORS TEACHING COLLEGE PHYSICS (NONPHYSICS MAJORS). I wanted an extra study guide to help me solve difficult problems found in my quizzes and exams. This was not helpful. I got basic definitions that I would've gotten from the internet. Tried it because the Demystified for OChem really helped."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RUV0IPEJZF4N"
                },
                "Date": "on March 16, 2014",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": "I should add right off the bat that I have the first edition of this book from 2002, and that I cracked it open a decade after leaving college. That said, I couldn't pass the first quiz in chapter one because this author's explanations of vectors was nonexistent. We were supposed to know how to determine how to add and multiply vectors literally without him giving a single example with actual numbers. Sorry, but I graduated college with honors. I wasn't a science or math student, but if I can't pass the first quiz then I'm not going to waste any more time with this book. Supposedly the Physics for Dummies book is a lot better."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AR81VT1RMKSNU"
                },
                "Date": "on January 14, 2013",
                "Helpfulness": 0.5384615384615384,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVPX4OBAM9VK7"
                },
                "Date": "on January 23, 2013",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "good book and I paid $6.00 it was used and good condition and not in bad condition. i like it"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZSYZYVK5BOP7"
                },
                "Date": "on August 11, 2013",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "So what can I write in this review except that I've looked at other books by the same author and they seem to be something I can stomach reading so I thought I'd give this book a try and maybe learn a little physics in the process."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Physics-Demystified-2nd-Stan-Gibilisco/product-reviews/0071744509/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "11"
    },
    "Salesrank": "#80,361",
    "Timestamp": "2015-05-24 12:42:57.105498",
    "itemurl": "http://www.amazon.com/Physics-Demystified-2nd-Stan-Gibilisco/dp/0071744509"
}
