{
    "Category": "in Books (",
    "ListPrice": "$16.00",
    "Name": [
        "The Physics of Nascar: The Science Behind the Speed"
    ],
    "OfferPrice": "$13.40",
    "Reviews": {
        "AverageStarRating": "4.5 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZB1PM6HU7UM6"
                },
                "Date": "on February 23, 2008",
                "Helpfulness": 0.9444444444444444,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VX6A9UZBLEPI"
                },
                "Date": "on April 4, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I'm not a NASCAR fan by any stretch of the imagination. But this book's title intrigued me. Browsing through it and seeing all the interesting diagrams convinced me that I should buy it and read it. I did and I was not disappointed. The author, a physicist, is a gifted expositor of scientific principles at a level ideal for the general reader. She explains, using many useful analogies (and no mathematics), the finer points involved in building an automobile suitable for racing the NASCAR circuits. The book could just as easily have been entitled \"The Science of NASCAR\" since sciences other than physics are also involved and explained, e.g., chemistry, metallurgy, aerodynamics, engineering, biology, etc. In addition to the science, the author gives a fascinating overview of some of the dedicated people who are involved in building and racing a potentially winning car as they do their work before, during and after a race. The writing style is clear, authoritative, very accessible and quite engaging. Based on the way this book is written, it can be enjoyed by absolutely anyone, not only science buffs or NASCAR fans."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XKBRUUEIP252"
                },
                "Date": "on February 25, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book would translate nicely into a Discovery Channel series. You know, high-interest, science-to-the-masses kind of stuff. Give it a year; it's going to happen! I am a fan of \"The Physics Of..\" books, and some disappoint: they can be so thorough [read hyper-mathematic] as to resemble homework; or they can be so simplified they read like a children's book. Most land somewhere in between. Take, for instance,Adair's book on the Physics of Baseball: it's fantastic, but I wouldn't recommend it to just anyone. It contains more mathematics than the average Joe (or Jane) is equipped to handle. But this book, The Physics of NASCAR, follows the Goldilocks Principle: it's just right. Not too pithy, not too watered down. High interest, easy access, entertaining insights. If you like popular science, you'll enjoy this book. Personally, I love the way the author pulls in characters from the NASCAR family. It gives the book personality! She does a great job with the science as well. There were a couple of bobbles here and there, but she covered a LOT of ground. This book is really a text in applied physics (and biology and chemistry), sans the quantitative rigor. I would love to adapt it to my high school curriculum--it would certainly grab my students' attention. If you teach physics at the high school or college level, this book is the perfect supplement to a course on physics for non-majors, or simply a means to raise the interest/relevance level for the concepts you teach. Buy it. If it doesn't work out, then re-sell it on Amazon's Marketplace. Now there's a win-win situation! Hope that helps..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9UGTN2WM72IF"
                },
                "Date": "on May 29, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PEOIOFLAX69W"
                },
                "Date": "on August 29, 2011",
                "Helpfulness": 1.0,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IUTYIY6PW8DU"
                },
                "Date": "on April 1, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IEC372RS8CHF"
                },
                "Date": "on July 19, 2008",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1K1JW1C5CUSUZ"
                },
                "Date": "on March 17, 2008",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22MD20DOYW3D8"
                },
                "Date": "on April 5, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I'm a forty-something, female, liberal arts graduate who works in healthcare marketing, but I felt like the book was written just for me.  It was entertaining and educational; and now I have a new appreciation for a sport I've barely noticed.  But my new heros aren't Jeff Gordon or Dale Jr....it's the hundreds of men (and the occasional woman) to design, build, and manage the cars."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVGROVWIE1RRL"
                },
                "Date": "on June 27, 2008",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24505CR98NLLV"
                },
                "Date": "on May 9, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TZV5SXQ8F6ST"
                },
                "Date": "on June 28, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PU13Q1N4Z2IX"
                },
                "Date": "on March 15, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is an interesting book on the science involved in NASCAR racing.  I'm fascinated by both physics and racing and so I couldn't pass up this book.  Although some of the discussion seemed basic, I realize that not everyone has been reading about what makes cars go fast for as long as I have.  Despite this, I still learned quite a bit from this book.  The one thing that struck me as a little odd is that the author is a woman and uses examples drawn from her experience as a woman.  This isn't bad.  Her examples make good points, but it's certainly different being exposed to a female perspective the sciences -- much less in the racing."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AC3RV0HGBCBMO"
                },
                "Date": "on March 24, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QKNZY9K6P4PY"
                },
                "Date": "on March 7, 2010",
                "Helpfulness": 0.75,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11HHF5NYWT4HG"
                },
                "Date": "on March 29, 2008",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "The author, obviously knowledgeable and a good teacher, shares her experiences hanging with a NASCAR team.  Lots of technical details and explanations of the physics involved. And it is an easy read; while engineers will love it, you don't need to be one to understand it and enjoy it.  Highly recommended to all racing enthusiasts."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A208XOXQ8KL31Y"
                },
                "Date": "on August 25, 2009",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PQ3K5RKNJYA1"
                },
                "Date": "on August 4, 2008",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A55TIG28KT545"
                },
                "Date": "on February 24, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "If your other half is a NASCAR lover then this is a great book for them. I got this book for my hubby as a gift....he loved it so much that he read the entire book in one day."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1G7TD3OFYEIQ7"
                },
                "Date": "on February 11, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Dr. Leslie-Pelecky has written a book with a combined sense of personal curiosity and a mission to enhance physics education to the younger generation by linking it with applications to racing. She unravels the mysteries of NASCAR and chapter by chapter takes you from what it involves - materials, paint, power production, cam profiles, downforce, tire grip and race track dynamics in a simple way without getting bogged down too much in the details. Hardcore NASCAR fans who have been associated many years with the sport will be disappointed to not find the level of technical detail they seek. In support of another reviewer, the book leaves a bit to be desired in the photos category. Bright photos and better illustrations always enhance a book but then I'm not sure know what compromises had to be made by the author and publisher to sell this book at an attractive price.  On her first book however, she has accomplished much. She continues this curiosity and passion to write through her personal blog, which I also read from time to time."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JQJ339HF257S"
                },
                "Date": "on August 1, 2008",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JFDCLA9PZGQ0"
                },
                "Date": "on June 18, 2008",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "As a Yurpeen, my knowledge of NASCAR racing, prior to reading this book, consisted of the knowledge that it exists. However, as someone who has worked all his life in professional science, I've always been interested in the interaction of science with everyday life. I found this book fascinating. Professor Leslie-Pelecky covers a vast amount of ground, ranging from the nature and structure of materials to the physical forces operating on a racecar. At times the explanations are too simplistic, and she occasionally gets things wrong, but these are minor quibbles in an otherwise very entertaining and informative book, which hopefully will encourage people to consider science not as something remote, done only in laboratories, but as having relevance to the world around us."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LCUICLN3EJ9H"
                },
                "Date": "on March 18, 2008",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BYAPLYU92ZXO"
                },
                "Date": "on May 8, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOYM80FE58KHH"
                },
                "Date": "on March 31, 2008",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASSQFXJ4D656A"
                },
                "Date": "on September 16, 2008",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "A physics teacher gives us some remedial physics lessons in \"The Physics of NASCAR\".  She covers areas that you would expect, such as force and intertia, but goes on to cover the color spectrum and even some baxic metallurgy.  The physics lessons are fairly simple.  I did get some reminders of things I had forgotten and even some new information but I also learned a lot about how NASCAR works too.  The book is very interesting on both fronts.  Nothing too challenging.  A very enjoyable read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PHJMJY36JCX"
                },
                "Date": "on March 25, 2008",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "I bought this book for my husband, and knowing how much I thought he'd like it, I didn't even wait until his birthday to give.  He's a go-go-go type who rarely has time for a book, tho he fills up bigtime on magazine articles.  But this one he never put down once he opened it up.  I don't think I've seen him sit so still for so long.  He said that it was JUST what he wanted to know!  GREAT book!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OGM207Z5HL37"
                },
                "Date": "on November 3, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This book explains the science of nascar from the metallurgy in the frames and engines to how the cars move on the track.  It is totally science oriented and not so much a story but if you want to understand nascar(unlike most of the idiots who call in to Nascar radio with uneducated opinions) this is the book for you.  You do not need a science background to read this.  It is like she takes you from first grade through college science, all as it pertains to Nascar."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30T6O9K4QIUNI"
                },
                "Date": "on July 19, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Bought this for my husband, who is a recent fan of NASCAR and had a lot of questions.  If you're curious as to how the engines are modified to allow for such high speeds, or wonder what's going on in the pit, for example, this is the book for you.  It covers all sorts of topics without being textbook-like. It's an easy read which leaves the reader with a healthy respect for the sport."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAXHBTL2ZTMPU"
                },
                "Date": "on March 2, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I have watched NASCAR races over the years but never with much enthusiasm.  Reading this book changed that.  Dr. Leslie-Pelecky has written a fascinating book about all we can't see on TV.  Don't be intimidated by \"Physics\".  She keeps it simple.  If you have a loved one who loves NASCAR but you don't quite know why, this book just might help."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11XAE7XIUS8ZV"
                },
                "Date": "on March 29, 2008",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This is a good book for those who like BOTH science and cars or NASCAR. It is written on a High School Physics level. If someone has had college physics it is very good at filling in gaps. For everyone else it is on target. It is a science book so if you like science it is good enjoyable reading otherwise a little dry."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYKZW7SN7P4GS"
                },
                "Date": "on September 10, 2008",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Very readable, but as a racing fan and a physics teacher of 30+ years, I thought it could have been done better.  I'm going to give it to my son, and NASCAR buff / one year of physics, to see what he thinks of it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1L17Z0CTTVME9"
                },
                "Date": "on March 18, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I would recommend this boo to anyone who wants to understand racing on a deeper leve.  It is written in an entertaining fashion that could inform a fan or enlighten a science person."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACBAFWEFCJJWN"
                },
                "Date": "on April 10, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Me and my fiancee ordered this for his cousin for Christmas  who is very into nascar and we recently asked him if he liked the book and he said he enjoyed it very much."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A238GBEWFQQ74P"
                },
                "Date": "on August 8, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great book!  Goes into every scientific detail about building and driving a NASCAR car!  Easy read too, which is nice, considering it is written by a technical person."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FEMUBISA7081"
                },
                "Date": "on January 9, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I love this book  for its contents! It so informative and probably the most interesting book I have read in a while! It also arrived on time and in great condition!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1V4FXSNXJN8CD"
                },
                "Date": "on January 15, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Watching the cars go around and around is not much of a thrill; however, what makes them go around and around greatly enriches the thrill."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WPAXJL8I097A"
                },
                "Date": "on March 19, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEDUCE1HXI8J7"
                },
                "Date": "on March 11, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I ordered this book as a gift.  I was told it was one of the best gifts he received. Thanks"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KXSV5AS5PEWW"
                },
                "Date": "on April 6, 2008",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25VE1PDVO0AUR"
                },
                "Date": "on November 5, 2009",
                "Helpfulness": 0.4444444444444444,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33SJOJMA35U77"
                },
                "Date": "on March 1, 2011",
                "Helpfulness": 0.25,
                "StarRating": "2",
                "Text": "I'm a software engineer and a car enthusiast, so I know a bit of physics, chemistry, and basic car dynamics. I feel like this author is speaking to a high school audience. Her choice of vocabulary is more basic than newspaper and magazines. She provide few insights about NASCAR that you can't find else where already. But I think it boils down to this: this book does not engender excitement, rather it bores me with lengthy explanation of basic chemistry and physics. For example, while the effects of higher octane fuel is a confusing topic to the general public, it is well understood by almost every car guy, and a deeper discussion can be found in many car owner forums."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AREQFZ7UWEHY"
                },
                "Date": "on March 3, 2010",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "the book was a very well written book on the technial aspect of nascar racing. the writer did a lot of research to develop this project.she is very intelligent."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Physics-Nascar-Science-Behind-Speed/product-reviews/0452290228/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "43"
    },
    "Salesrank": "#416,179",
    "Timestamp": "2015-05-24 12:42:17.341238",
    "itemurl": "http://www.amazon.com/Physics-Nascar-Science-Behind-Speed/dp/0452290228"
}
