{
    "Category": "in Books (",
    "ListPrice": "",
    "Name": [
        "The Handy Physics Answer Book (The Handy Answer Book Series)"
    ],
    "OfferPrice": "$4.00",
    "Reviews": {
        "AverageStarRating": "4.1 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1P0ZB4YAA312R"
                },
                "Date": "on May 23, 2002",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31KL3P9AH2MTJ"
                },
                "Date": "on January 17, 2002",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I have three of these books now and I continue to not be disappointed. These books help answer questions that you may not think about but as soon as you read them you end up saying to yourself \"hmmm that's a good question\"! This book is very cool to read and if you have any interest what so ever in Physics it will keep your attention for hours if you let it. Definitely not the type of book you would read cover to cover, it's more useful as a reference guide. I don't see why any college or high school student or anyone for that matter with an interest in Physics wouldn't have this book. It's a great buy and fun to read!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACQSQ0IQZMO10"
                },
                "Date": "on September 14, 2005",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I am a high school student interested in pursuing physics as a career. Since I participate in many clubs and classes regarding science, I find myself needing to do a lot of studying. However, after reading this book, I realized that I had been able to cover enough information to impress my team mates and keep my A in physics! This book covers everything: from motion and forces to sound, history to light, modern physics to magnetism, and heat to electricity. It is easy to read and written as though it is a friend who is simply informing you, not a genius who's lecturing you! Perfect for the beginning student interested in learning about the world around them, or even the intermediate or advanced one who is looking for some interesting facts and a handy reference guide. I recommend this book 100%!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PWF2AQ5XYALW"
                },
                "Date": "on May 8, 2005",
                "Helpfulness": 0.9,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on December 24, 1998",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I have no background in physics--never took a class--and can barely spell it.  But I LOVED this book!  I have always had a strong interest in how things around us work and have wondered \"why\" on many occasions.  The problem I found with other books which tried to explain these basic  laws is they were much too technical to fully appreciate what was being  said.  The \"Handy Physics Answer Book\" is written totally in  non-technical language (NO MATH!!!!!!).  Because of all the topics covered  and how well it was written I found it hard to put this book down.  Thanks  to the \"Handy Physics Answer Book\" I can't wait until my next  game of \"Trivia Pursuit!\""
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UK3JCMOB5KJW"
                },
                "Date": "on October 15, 2001",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book is a great one to refer back to find quick answers for rather complex subjects. It is easy to use, very user friendly, and written in a non-technical way. A great book to have on hand."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AE2JVMHQPDSHE"
                },
                "Date": "on February 3, 1999",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "5",
                "Text": "I took physics in high school (circa 1980) and its real-world relevance was not emphasized with the mathematics of problem solving...but I knew there was an answer out there.  P. Erik Gundersen has done a fantastic job  of making physics understandable to the layman and very fun by stressing  its relevance to the real world.  As he discusses the great physicists of  the world and their discoveries, you can easily see how we have reached our  current technological state.  After reading this book I really understand a  great deal more of how and why the world works.  It has given me a great  appreciation for the study of physics and I most definitely want to learn  more!  I always thought I liked chemistry the best, but this book has  changed my mind!  I recommend this book to anyone who wants to challenge  their mind and to understand better the world in which we live.  I read the  book everyday while commuting to work on the Metro and I could not put it  down!  P. Erik Gundersen is a talented writer and teacher.  I hope that he  plans to write many more books on physics...I will be eagerly awaiting."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FX1JRI7UB89J"
                },
                "Date": "on February 27, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book is essential for learning facts about Physics. It anserws a lot of your usual questions. I truly reccomend it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SM9P7USBWPGF"
                },
                "Date": "on November 8, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This book is in fact handy for someone that is wanting themselves or their children to learn more about the fascinating world of physics. While this isn't handy to have if you're heavy into math or engineering, this would be a great book to have for the average person who might need an above average answer about psychics problems."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14XM0M69T6J6D"
                },
                "Date": "on May 2, 2000",
                "Helpfulness": 0.6,
                "StarRating": "5",
                "Text": "Yes, that's right, P. Erik Gundersen is the Nordic God of physics (he sounds like a Swedish guy...or maybe Norwegian...ah it's all the swame!)  The Handy Physics Answer Book is hands down the #1 physics guide around.  Brian Greene, look out.  From his mesmerizing discussion of light, to his  earth shattering look into the Big Bang, P. Erik Gundersen makes physics  phun!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I9PPL8QMBK4I"
                },
                "Date": "on December 4, 1998",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "I've taken 2 years of physics. One year in high school and one year in college. It seemed the main important concepts were never stressed(the real life relevances) while the difficult mathematical parts were. This book is  the first to give me the BIG picture of why things were in my two years of  study. I recommend this book to anyone who has had basic physics and to  parents who can't(and feel reluctant to admit) answer some of the most  basic questions in physics to their kids. E.g., Why is the sky blue?"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HJJLS5L71EC0"
                },
                "Date": "on September 25, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Got this for my daughter as well, just not interested."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12T6Y9L64Y63Q"
                },
                "Date": "on March 5, 2015",
                "Helpfulness": "",
                "StarRating": "1",
                "Text": "Didn't meet my expectation"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25SYQOOVGON23"
                },
                "Date": "on February 23, 2009",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 18, 2003",
                "Helpfulness": 0.4166666666666667,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2N09R30R450JF"
                },
                "Date": "on July 4, 2007",
                "Helpfulness": 0.07142857142857142,
                "StarRating": "1",
                "Text": null
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Handy-Physics-Answer-Book/product-reviews/1578590582/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "16"
    },
    "Salesrank": "#1,794,109",
    "Timestamp": "2015-05-24 12:41:39.868429",
    "itemurl": "http://www.amazon.com/Handy-Physics-Answer-Book/dp/1578590582"
}
