{
    "Category": "in Books (",
    "ListPrice": "$16.00",
    "Name": [
        "The Future of the Mind: The Scientific Quest to Understand, Enhance, and Empower the Mind"
    ],
    "OfferPrice": "$11.40",
    "Reviews": {
        "AverageStarRating": "4.4 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12JARSR16QM21"
                },
                "Date": "on December 28, 2013",
                "Helpfulness": 0.9528301886792453,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A63A35RBSL9IN"
                },
                "Date": "on November 24, 2014",
                "Helpfulness": 0.9651162790697675,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2F6NONFUDB6UK"
                },
                "Date": "on December 30, 2013",
                "Helpfulness": 0.9629629629629629,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASF0R1CMSF26F"
                },
                "Date": "on February 1, 2014",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EHE7M69JB346"
                },
                "Date": "on April 9, 2014",
                "Helpfulness": 0.8809523809523809,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33UZDO4KB4S0H"
                },
                "Date": "on January 13, 2014",
                "Helpfulness": 0.9444444444444444,
                "StarRating": "5",
                "Text": "Whoa!  What a book to read if you want a glimpse of where science is taking us in the future!  This highly interesting read does a great job of explaining current and future possiblities of tracking, improving and studying the human brain.  From current research of creating prosthetics which can be controlled from thought to 'helmet' scanners which can read your thoughts to portable body scanners like \"Doc\" from Star Trek used - the future possibilities are amazing.  There is so much work being done in creating ways to actually read one's mind - which would be of enormous benefit for some people stricken with disease...to implants in the brain to stimulate thought, movement, recovery from stroke or traumatic brain injury.  The book lightly touches on the downside of such technology - could police use some of these devices which are currently in development to read your mind? could the government?  What are the ethical implications of this technology?  How could it be controlled once it's on the open market?  The author did a great job of presenting the information in an easy to read, understandable format - I almost read the book in one sitting the concepts were so interesting.  The book touches on the amount of research being done by private companies as well as DARPA, and it left me feeling that  futuristic science fiction movie plots aren't really that far away from becomming a  reality."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A122SFGLAHQLSJ"
                },
                "Date": "on February 19, 2014",
                "Helpfulness": 0.9333333333333333,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AB17Y03366TV4"
                },
                "Date": "on February 28, 2014",
                "Helpfulness": 0.8823529411764706,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1H7Y5XKPGT0OS"
                },
                "Date": "on January 24, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YAVTVOHJ66OB"
                },
                "Date": "on April 28, 2014",
                "Helpfulness": 1.0,
                "StarRating": "2",
                "Text": "This is my first reading from this author and was expecting much more because I really enjoy him whenever I see him on the screen. However, this book I thought had a whole lot of 'fill' in it and really didn't seem to address the title of the book. Rather boring reading, nothing really exciting new stuff in the making, just seemed to fill pages with 'stuff'."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15DEKAR06YSBF"
                },
                "Date": "on November 25, 2014",
                "Helpfulness": 1.0,
                "StarRating": "2",
                "Text": "Skip this book if you are a psychologist or have a background or training in cognitive science or the study of consciousness. The book will frustrate you, because Kaku gets his facts wrong so often--which is surprising given that Kaku is a scientist. For example, his theory of consciousness is not a theory of consciousness at all. It is sort of a theory of one kind of mental function, but certainly not a theory that has any chance of explaining why we need to have subjective experience (qualia). One could easily argue that Kaku's concept of consciousness, which centers on the mental function of making mental models of the future, could conceivably have nothing to do with conscious experience, since it may well be possible to create such models unconsciously. By the way, Kaku uses the term \"subconscious\" instead of \"unconscious,\" a term that carries its own misleading implications. And Kaku completely misconstrues David Chalmers' \"hard problem,\" among many other errors. Finally, Kaku tends to go on and on with long passages in which he ruminates about issues that he imagines might come up in the future, such as which children robots should be programmed to rescue in a disaster. With all that said, however, if you don't know anything about theories of consciousness or cognitive science, you might enjoy the book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1V7Z8Q0V8AWVR"
                },
                "Date": "on December 26, 2014",
                "Helpfulness": 0.875,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PBMCBT1R8TTL"
                },
                "Date": "on February 3, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "If you haven't read Michio Kaku before, you are missing out.  He is one of the most compelling writers and commentators on the world of science and coming innovations.  The future of the mind explores the amazing developments in neuroscience and the future possibilities with the \"gee whiz\" enthusiasm of a kid in a science museum.  Great reading."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QE8968EGBHTH"
                },
                "Date": "on April 15, 2014",
                "Helpfulness": 0.9,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2F2S1L61X1LA9"
                },
                "Date": "on February 20, 2014",
                "Helpfulness": 0.8888888888888888,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6YG9JGCMM52V"
                },
                "Date": "on November 7, 2014",
                "Helpfulness": 0.875,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASL2U0EP77BJX"
                },
                "Date": "on March 16, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27E44IWS3B7VD"
                },
                "Date": "on February 20, 2014",
                "Helpfulness": 0.875,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TJQ4MGHNFCR5"
                },
                "Date": "on April 12, 2014",
                "Helpfulness": 0.875,
                "StarRating": "2",
                "Text": "If this is your first book on mind and brain, you may enjoy. But having read intense books from Dr. VS Ramachandran and others on mind and consciousness, this book by Dr Kaku was a disappointment. It is a hodgepodge of quotes from various books. What irritated me the most of reference to all sci-fi movies in every page. Liked aspects of categorizing animal and plant kingdom by levels of consciousness, but beyond that you will read quotes from many pchycologists, neurosurgeons, references to movies like avatar and matrix, open questions about religion and god.....for an average reader, you've already heard it all and seen it all!!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2K1VS37Z3CBVF"
                },
                "Date": "on October 31, 2014",
                "Helpfulness": 1.0,
                "StarRating": "2",
                "Text": "I'm a little disappointed after reading Michio Kaku's book \"The future of the mind\". I'm clear that curiosity moved myself to do it, because others books I've previously read from him that I feel satisfied after complete the reading. However, the issues presented in the book are shallow, and the theory about consciousness is very questionable. Maybe someone could say that is a divulgation book, but anyway in my opinion it is half way. I hope that Micho Kaku will go back to write about Physics that is his core subject."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PZY7RHPMT1G0"
                },
                "Date": "on July 9, 2014",
                "Helpfulness": 1.0,
                "StarRating": "2",
                "Text": "Kind of interesting, but really just a bunch of disjointed, somewhat repetitious speculation about things that might or might not happen in the future.  A somewhat more analytical (and a little bit more skeptical) approach would have been much more interesting, because it would have let the reader actually think about the likelihood of some of these things happening.  Plus, the author seems hopelessly naive about the ability of our politics and government to control some of the rather frightening scenarios envisioned."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12BL8PMLAG5HX"
                },
                "Date": "on February 21, 2014",
                "Helpfulness": 0.7857142857142857,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2I5XCJSSQYWAC"
                },
                "Date": "on June 23, 2014",
                "Helpfulness": 1.0,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GHO6BR5J0NHX"
                },
                "Date": "on April 17, 2014",
                "Helpfulness": 0.8,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3F3B1JPACN215"
                },
                "Date": "on February 18, 2014",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JM8ICCQZI67H"
                },
                "Date": "on March 12, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I am an average person, and ordinarily I would be intimidated by the subject and the author. But I went to hear Dr. Kaku speak recently, and his lecture was stunning in the breadth of ideas (and he's an entertaining guy). So I bought his book as soon as it came out, and I have not been disappointed. He writes in a manner that is easily understood even by those of us who are not scientists. The current brain research being done is amazing in scope, and the hope that ways to fix brain illnesses or irregularities, which affect all of us in some way, will  be found. Startling fact: half of our population over 80 will develop Alzheimer's, a human catastrophe that is slowly unfolding. Then there's Parkinson's, ADHD, depression, autism, and on and on. What scientific research could be more important to the fate of mankind than knowing more about our brains? But the book is about much more than just what's happening now. As the title implies, it's about the future and what is/is not possible. I loved it and intend to read some of the chapters again. I really enjoy a book that opens my mind to other possibilities."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VYFEJM12ZP11"
                },
                "Date": "on January 5, 2014",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12OSBVN11PFVJ"
                },
                "Date": "on March 12, 2014",
                "Helpfulness": 0.712,
                "StarRating": "1",
                "Text": "Well informed cognitive scientists recognize that they have no consensual definition of consciousness, that they can't measure the presence of consciousness scientifically, and that the nature of mind-brain correlations remains a mystery. But the author of this book, who has no qualifications as a cognitive scientist, brushes all those concerns aside and simply declares, as if with papal infallibility, that the mind is nothing more than what the brain does. His assertion is treated as a self-evident fact, so no empirical evidence or compelling reasoning is offered in support of this hypothesis. A scientific hypnosis, unlike a philosophical theory or religious belief, must lend itself to empirical validation or refutation, but this reductionist hypothesis does not. Nevertheless, Kaku presents it as a scientific fact. This is pseudoscience at its worst.  As the historian Daniel Boorstin pointed out, the greatest obstacle to discovery is not ignorance, but the illusion of knowledge. By presenting the illusion of knowledge that the nature of consciousness and it's role in nature is already known scientifically, Kaku obstructs open-minded inquiry into this aspect of reality that has so far eluded scientific discovery."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2U6GHU2EMC5M5"
                },
                "Date": "on February 18, 2014",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "5",
                "Text": "A Physicist’s take on the human mind, and where the latest science is and future possibilities on consciousness, the possibilities of telepathy, the possibility of telekinesis or just moving things by using your minds.  A chapter on the possibility of implanted memories.  A chapter on talk of enhancing human intelligence, so that we can all be as smart as Einstein.  A chapter on dreams, and creating dreams and thoughts.  The latest on mind control and altered states of consciousness.  Where computer scientists are on with artificial intelligence, and then chapters on existence as just energy and possible alien minds.  Overall a fascinating summary of all things in modern science relating to the human mind.  While I realize most of the information is probably gathered by researchers Dr. Kaku provides his take on all of the subject and brings in his own projections for what is possible for the human mind and civilization as a whole.  Just a fascinating book with tons of information, but still an easy read for the lay person.  Highly recommended, if you have a question feel free to leave a comment below and I will try to answer it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RT22SDG1UQBY"
                },
                "Date": "on March 31, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A185QFJRTB5W93"
                },
                "Date": "on February 15, 2014",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "5",
                "Text": "An amazing book from an amazing mind. Kaku often presents complex issues in a way that is easy t understand (but he does expect you to have a rudimentary understanding of the world around you). In this book, Kaku goes beyond physics and explores the human mind with the same style, grace, and presentation that flows throughout all his works. if you are a fan or familiar with Kaku, you are sure to be enthralled by his latest book. Kaku is more than a teacher, he is a guide down a mysterious path that only brings us better understanding of our true selfs and our place in the universe."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASKZ7HRJOYNS3"
                },
                "Date": "on September 1, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVKERKK3WJ6VO"
                },
                "Date": "on August 30, 2014",
                "Helpfulness": 1.0,
                "StarRating": "2",
                "Text": "I liked everyone of his other books (though even then must say he was out of his comfort zone when speaking of socio economic topics).  With this one though it made me think here is a guy that is extremely smart and well spoken on some topics (technology, cosmology) but left me really wondering on others.  The first was with the definition of consciousness.  Kaku summarizes  consciousness as the ability to perceive the outside world and formulate models of it into the future.  The first few times he uses this definition I thought he may be planning to expand on it but instead he repeats endlessly.  To casually make this assessment on what is a topic that could take up several books was bothersome to say the least.  To add to this he talks of advancements to the mind only in terms of our current socio economic predicaments.  For instance he speaks of  a sort of telepathy that could be used on the battlefield overlooking that 1)future wars may not have human ground troops 2)if we could have telepathy we may find better ways of solving problems than shooting chunks of metal at eachother.  But more frustrating was the lack of discussion of the spiritual aspect of the human brain.  He talks about how we can be smarter and happier but not nicer (ie less psychotic).  This would be a controversial discussion no doubt and I hear you on the fear of a borg/bravenewworld scenario . Yet still with all the fascination of the brain of Einstein why not some mention of the brain of Ghandi, King, Gotama?  On the one hand you have the supposed techie nerds wanting to build HAL or Lawnmower Man and on the other are the supposed hippie granola types that appear to think humanity would be better off plowing fields and destroying all our gadgets. I have been looking for a book that is not aligned in either camp but sees the value in both.  Other than Ray Kurzweil not much out there.  On a personal note I am more bitter with the neo hippies that dont see the value in adding their voice to the AI/Mind Enhancement topic.  I have been a fan of Mr. Kaku from his other books but was disappointed in his ability to step outside of the technerd box."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQQBS3F0XW3GC"
                },
                "Date": "on February 11, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1W5VQS4IT3AK9"
                },
                "Date": "on February 11, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFJFXN42RZ3G2"
                },
                "Date": "on February 9, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KJO5VP4K3CHU"
                },
                "Date": "on February 1, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGZNIYIUQGKK1"
                },
                "Date": "on February 23, 2015",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQ63U5NNV9HMF"
                },
                "Date": "on February 26, 2014",
                "Helpfulness": 0.7777777777777778,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GCZ07XRJX858"
                },
                "Date": "on February 6, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15PV8J0IYVDNH"
                },
                "Date": "on February 6, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14638TGYH7GD9"
                },
                "Date": "on February 9, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2THPPP782CUP4"
                },
                "Date": "on June 17, 2014",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AO9UNKQG83BUP"
                },
                "Date": "on February 17, 2014",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LKOIZXPQ9VG0"
                },
                "Date": "on February 13, 2014",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1D9Z20TCUH6ZX"
                },
                "Date": "on January 11, 2014",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CG6YLYZJXQG4"
                },
                "Date": "on January 29, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A127BQD3XGN1Y8"
                },
                "Date": "on December 28, 2014",
                "Helpfulness": 1.0,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HJHV83O2U8BL"
                },
                "Date": "on January 25, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Neuroscience research has been exploding and this book will take you to the cutting edge of recent developments. No one explains science to the layman like Dr. Kaku.  He continues his high quality output with this new book which captures your interest immediately and keeps it right to the end. I found it to be a quick read that I did not want to put down. The author takes you on a tour of the brain by starting with the physical, moving to the mind, then consciousness, then leaving the body altogether with speculation of how consciousness may exist independently.  Fascinating treatment of current events, and recommended for everyone who has a brain. Science is moving quickly these days -don't get left behind. Read this book!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1APNR15UXR4JT"
                },
                "Date": "on April 18, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Einstein once said: \"If a scientist can't explain a new concept in a way that is easily understandable to the average person ... he probably does not understand the concept very well himself.\" This is the third book I have read by Kaku. As one of the world's leading theoretical physicists it is abundantly clear from his books that the author understands the subjects he writes about extremely well. Reading his books are a joy. The subject of \"consciousness\" is one I have been extremely interested in and have accordingly read several books on over the last few years. This book is by far, the best I have read on the subject. Fascinating and easy to understand."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1M0OSCFOAMAZO"
                },
                "Date": "on January 13, 2014",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": "I love this book. It's like mind porn. It takes a complex topic and makes it wildly interesting, understandable, and sexy. So much of what we see and believe is based on outdated science. It's time the general public got caught up on what's going on in the labs and pushed to make that reality for all of us. Let's take off the training wheels and blast through limiting beliefs! Even the technologies that are available today are seen as \"experimental\" and \"new age\" because of old, crusty, \"rational\" thinking. More people need to be aware of what is out there. This book provides a way to access that information. Read it!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2V0NXLTYHP7V9"
                },
                "Date": "on April 1, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A361W8EJ70FMM6"
                },
                "Date": "on March 25, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UW23DBF2KHWC"
                },
                "Date": "on March 12, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHD101501WCN1"
                },
                "Date": "on March 9, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3T4KN9XO3PIXG"
                },
                "Date": "on October 4, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33RQ9HL46S639"
                },
                "Date": "on August 31, 2014",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1S66YT491XJV6"
                },
                "Date": "on August 17, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TAIY7AITO1M5"
                },
                "Date": "on April 29, 2014",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IQLIBIZURKWS"
                },
                "Date": "on April 4, 2014",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUITG1DJ3QUGK"
                },
                "Date": "on February 11, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A04234322PZGZJRNO7M09"
                },
                "Date": "on March 30, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book is about more than just the future of the mind.  It's about how the brain works and the research that's going on to now to understand how the brain works.  Once you understand how the brain works, you can work on things to improve your own brain."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SWIN7UAAO9B8"
                },
                "Date": "on March 11, 2015",
                "Helpfulness": 0.8,
                "StarRating": "1",
                "Text": "First 1/4 of the book is interesting stuff about current research and technology in the study of the mind. The rest seems to be blue sky idle speculation about what might happen. Most is so far out that it is just fantasy. I couldn't even finish it. I was pretty disappointed given how much I have enjoyed some of this TED talks."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27VAPW9LSI9RS"
                },
                "Date": "on July 22, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7XUM8VT5N9J0"
                },
                "Date": "on January 18, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FW6NVKN9B9VH"
                },
                "Date": "on July 1, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FXT4UPI30K7S"
                },
                "Date": "on January 17, 2014",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A317HMX9I10C09"
                },
                "Date": "on January 17, 2014",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VBABRY2CI3LI"
                },
                "Date": "on February 21, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EPNJ5ZFCJNUQ"
                },
                "Date": "on February 16, 2014",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWOENK6Q1WJ70"
                },
                "Date": "on January 24, 2014",
                "Helpfulness": 0.6923076923076923,
                "StarRating": "4",
                "Text": "I was raving about this book when I first started reading it, but then found it somewhat disappointing. Perhaps my expectations were a bit too high, because I loved Kaku's other books so much. Kaku's books on far-out physics-- superstring theory, wormholes, and other dimensions--are simply extraordinary, but in this new book about the mind, he's not accurately informed about a number of scientific studies in parapsychology, cognitive enhancement, near-death experience research, psychedelic drugs, etc., and simply parrots the mainstream \"scientific\" opinion, sometimes even getting the facts wrong. Nonetheless, the book is filled with lots of wonderful information about the brain, new technologies, and bold speculation about the future that I really enjoyed reading."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20Y0J8D6E74PZ"
                },
                "Date": "on February 20, 2014",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LQQW50YNZ2V8"
                },
                "Date": "on June 21, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I've always enjoyed the writings of Michio Kaku.  He has the amazing gift of taking his significant understanding of complex topics and translating them into easily digestible language for ordinary human beings.  This book is an ever so slight bend from his usual topics (although not as far from them as I originally thought it might be) by focusing on the mind.  He leverages all of his theoretical physics knowledge, coupled with his extensive conversations with neuroscientists, to put a unique perspective to the potential that lies within each one of us - in \"The Future of the Mind.\"  I highly recommend this book to all who are curious about what the future may hold."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FZA04N27DQX7"
                },
                "Date": "on May 19, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "I rate this book highly because it is informative and also easy to relate to. He covers the subject well without using a lot of technical terms. He directs his book for the average person who wants to learn about the mind without going into boring details . This book is directed for the curious without requiring a huge background in neurology. Michio is a great scientist and one of my favorites.  I love his TV shows on the Science Channel."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A297DF75ASMSTU"
                },
                "Date": "on May 7, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23MRE54TH7CFY"
                },
                "Date": "on April 29, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VERZIDX22FY0"
                },
                "Date": "on April 14, 2014",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "Interesting material but presented in an elementary and sometimes repetitive manner as a way to get his point across. Anyone reading a book on physics,  for the most part, are going to be a bit more sophisticated and will understand the material or have more familiarity with it. The chapter prognosticating on the future of bionics and the evolution of robots got a bit weary early on."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A276UYN5XPZ41B"
                },
                "Date": "on April 6, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22171NA26HUJQ"
                },
                "Date": "on April 1, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "An easy read and very informative.  Dr. Kaku has a writing style that's easy to follow and explains the subject matter well.  I found his references to science fiction stories refreshing and his futuristic mind set is evident;  Makes me wish I could be in his class."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VWEG54SQHJWC"
                },
                "Date": "on March 31, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book is very enlightening and fascinating! I highly recommend this book to anyone interested in understanding your own mind and/or to better understand what the future of mindful technology holds. : )"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19M2M6JQBOA1H"
                },
                "Date": "on March 30, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Great way to understand the latest in brain research as well as the latest in the laws of physics. Dr Kaku's theory of consciousnesses is very rational and very well explained. Sometimes the ideas on future seem too far fetched but are mostly relevant in the context of what is possible with the current state and direction of the research."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACQCD07I7W5W"
                },
                "Date": "on March 30, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Michio Kaku has done it yet again. His exploration of the scientific advances related to the understanding of the human brain is a fascinating journey. And the implications for the future of humanity are mind boggling. a must read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NL4GW72MGY46"
                },
                "Date": "on March 27, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33N97ZMB64Y"
                },
                "Date": "on March 25, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "I really liked the explanation of how the mind machine works.  The speculation about future technology did occasionally read like science fiction, but was very well grounded in real science and was very plausible.  The idea that we can actually see dreams on a monitor screen seems fantastic, but Kaku explains how it already is happening."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WU8DUDTALKJL"
                },
                "Date": "on April 1, 2014",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "It is an entertaining read, but the conclusions seem superficially cheerful and tidy. It reminds me a bit of the videos from grade school in the 1960s in which atomic energy was portrayed as the wonderful future for solving all our energy problems, our future travel would be by jet-propelled backpacks and machines would cook and serve our food."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BVNVJOFXGZUB"
                },
                "Date": "on February 5, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I started with Visions, and Hyperspace, and I so appreciated the way Dr. Kaku could bring some serious concepts in science into understandable bites that I could digest.  This book set him a similar task for neuroscience, and I think he has done a good job.  Yes, there is speculation toward the end, but isn't that how all science begins?"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GXDOLQ63ZODP"
                },
                "Date": "on April 16, 2014",
                "Helpfulness": 0.75,
                "StarRating": "2",
                "Text": "Michio Kaku is a specialist in Physics, not mind research. Much of the book is speculation, there is so much going on in this area I would look for something written by a current researcher like the recent article in National Geographic Feb 2014."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RAXVVNQ93T7Y"
                },
                "Date": "on May 10, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MKAT3275HZ71"
                },
                "Date": "on April 20, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VF4BV5ONRSL6"
                },
                "Date": "on February 11, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AN89MYMWS3FI8"
                },
                "Date": "on October 10, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AW97LPKXQUJIF"
                },
                "Date": "on March 26, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CWIYIETNBAK3"
                },
                "Date": "on February 9, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RBL7GO82OU70"
                },
                "Date": "on May 18, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A268L4V31ZZBMP"
                },
                "Date": "on May 13, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IR9YVX9O927G"
                },
                "Date": "on May 16, 2015",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RJNSSL0C90WV"
                },
                "Date": "on March 28, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZHH7AK83JB5G"
                },
                "Date": "on January 20, 2014",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12NV9CSNDRWAR"
                },
                "Date": "on August 9, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This encyclopedic snapshot of a wide range of scientific research relates to just two newly revealed mother lodes of source material: the human brain and outer space. Dr. Michio Kaku, a theoretical physics professor at the City College and City University of New York, describes his boyhood fascination with both subjects and his facility in discussing what would appear to be very distant but some-how related answers to exciting new discoveries that get little mention in the popular press. Bu Kaki and his colleagues have given rise to a plethora of movies and TV series focused on the misuse or outright evil cooked up by the world's bad guys to take advantage of super or telepathic brains, brain networks and intelligent robots. Then Kaku switches over to the vastly more complicated subject of aliens from outer space. Even though we have not yet to find one, Kaku dives in these soon-to-be-charted waters. The professor provides much interesting speculation on the consciousness and intelligence of these creatures who may be trillions of years ahead of us and as interested in us as we are in fruit flies. More than a popularizer, Kaku interviews many of the science protagonists mentioned in his book. And he he seems to know just what questions to ask the not-always-communicative scientists. Definitely worth a read or a listen (14 CDs) to anyone who cares to know what the pointy heads are up to these days. With a strong voice, Feodor Chin, a professional actor, keeps a steady pace, in his reading."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36MN7I90RD18N"
                },
                "Date": "on November 13, 2014",
                "Helpfulness": 1.0,
                "StarRating": "2",
                "Text": "We read this for book club and while I liked some of the information and discussion at the meeting, I found myself skim reading this book because it read like a college textbook.  It was easy to read, just boring."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27O610LSXURBW"
                },
                "Date": "on March 31, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This work was very well researched and very informative. I would recommend this book for anyone looking to see and understand the milestones being achieved in Neurology. Mind blowing what has been accomplished."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YUZYKSXHPGMU"
                },
                "Date": "on August 24, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Prof. Kaku hits another one out of the park! It's incalculable the good he's done in kick-starting an interest in science among youth (and maintaining enthusiasm amongst oldsters like yours truly)! Bravo!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A48BGMHIXDDZA"
                },
                "Date": "on April 1, 2014",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "I really enjoyed the book at first, but the last third of the book seemed to be just a bunch of wild speculation; speculation based mostly on science, but speculation just the same."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26OPNLJ0JYHPH"
                },
                "Date": "on January 24, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SNVPENOSD27G"
                },
                "Date": "on March 5, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A279MFRCE0CLRU"
                },
                "Date": "on August 29, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23E9QQHJLNGUI"
                },
                "Date": "on January 14, 2014",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NWA0WG94OCP4"
                },
                "Date": "on March 31, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AL82W746X3MDP"
                },
                "Date": "on August 3, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HJICVB464X8R"
                },
                "Date": "on August 10, 2014",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "Nothing really new or earth shaking - I kept reading, hoping it would get better.  Editing got especially sloppy during the last quarter of the book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A100ZQDV7L8PVV"
                },
                "Date": "on February 10, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22F1YL8C5B0Q3"
                },
                "Date": "on June 22, 2014",
                "Helpfulness": 0.75,
                "StarRating": "2",
                "Text": "While reading this, I felt as if Michio Kaku wrote it for children, or to be narrated for a fluffy Leaning Channel documentary."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3158BRUFUPPVQ"
                },
                "Date": "on September 12, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1K6AA9Q9XF77P"
                },
                "Date": "on September 9, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Kaku's overview of neuroscience at the dawn of the 21st century is an important read for anyone seriously interest in the basic trajectories of research that impact our ideas about intelligence, mental health and identity. This is a well-organized mixture of scientific summary and basic philosophical speculation that help to integrate even the most non-scientific reader into the central problems hovering around neuroscience today. Because Kaku is a physicist, the work displays some surprising cameos from physicists and their perspective on the human mind, though these ultimately benefit the reader without mystifying the work's biological/chemical center of study. Kaku is a very balanced thinking and remains constantly aware of the need for a scientific defense of his claims. I am interested to read his other works: he is exceptionally gifted as a popular science writer, though I admit that he is also shamelessly self promoting."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6NQYTVOBISJ5"
                },
                "Date": "on December 12, 2014",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "1",
                "Text": "This mildly entertaining book is so riddled with inaccuracies and misunderstandings that it is worse than useless.  The author relies on his laurels as a Theoretical Physicist to sell what is essentially a piece of really bad scientific journalism on a field with which he is only cursorily familiar.  The writing style and arguments are sophomoric.  Vacuous generalities are offered without substantiation.  He seems to fail to realize that some of his definitions and explanations are circular.  In a number of areas where I am familiar enough with the science to judge, the author proffers statements and explanations that are flat out wrong.  A slightly precocious, well-read humanities undergraduate could have written a better book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2R6RKNT1SNL53"
                },
                "Date": "on February 14, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "A book that will keep you thinking long after you've finished it...you'll never look at the future quite the same again."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PIVU2EYRVY6F"
                },
                "Date": "on February 5, 2015",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": "This is a fascinating topic, but it may have been better represented by a neuroscientist than a theoretical physicist.  I have thoroughly enjoyed Kaku's treatment of physical concepts through his other works, as he does an exceptional job of relating complex physical concepts in an accessible manner.  However, I found that The Future of the Mind was a bit incoherent.  Topics seemed to ramble and bleed together without appropriate segues and the author seems to go off on tangents.  For example, the lengthy section on robotics is an interesting topic, but it's correlation to neurology is so loose that it seems like it would've been better treated in a different book altogether.  Kaku does an extensive amount of research. He visits labs and interviews scientists all over the world, but I didn't get a sense that his notes were well organized in the end product."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UR9I3QSTN4G3"
                },
                "Date": "on February 7, 2014",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6U9U61OEQG75"
                },
                "Date": "on August 4, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Michio Kaku has always been a most interesting lecturer and writer, and his current work does not change this opinion. Future of the Mind in some respects reminds me of the early editions of Popular Science magazine, which, when I read them as a young lad, made me want to hurry onto the future for all the wonders to behold. In this case, however, Professor Kaku provides a way to understand what the brain may be able to accomplish through technology, based on somewhat of what is being accomplished today. For we laymen who are not particularly familiar with the brain and the way it operates, Future of the Mind provides some insight into the way this complex, powerful, and magnificent structure works. For those who may believe that someday we will reach the singularity, the book may provide some hope."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWGM5VOLZAFAS"
                },
                "Date": "on January 19, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Another great book from Kaku who never fails to excite you about the potential of the future!  Loved it!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9XIXYCUR1X1G"
                },
                "Date": "on March 17, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This should be a must read in schools. The author really knows the working of the brain. It is awesome!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CPTD6FX76LFL"
                },
                "Date": "on July 20, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I think a better title might be \"The Future and the Mind\". In his readable, comprehensive style, Kaku goes somewhat too far with speculation instead of science. It's fine that he has seen so much of the future in sci-fi writing and movies, but linking plot points to \"someday we may, it is possible, perhaps they will ...\" was too frequently an easy way out of the realm of science fact. In addition, he glosses over many important issues of values and ethics raised by the research and hypotheticals he explores. That said, I found this book well worth reading because it weaves knowns in current neurological research with physics and discusses the implications of both these fields on our future as a society and a species."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KFV92KY3FU58"
                },
                "Date": "on October 6, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "The book is an interesting read for those who like psychology, neurology, and physics. I particularly enjoyed the chapter on consciousness as an energy state. The book seems to be directed to an audience that is more familiar with psychology, and less familiar with physics (as you might expect from a physics author who is able to write at length about physics principles, but is less familiar with psychology, or neuroscience). Nonetheless, I thoroughly enjoyed the book. I would have given it a full five stars had it not been for a few sections that felt repetitive, a few chapters that felt disjointed, and a few glaring grammatical errors. Overall, I would recommend the book to those whose leisure reading includes non-fiction."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A128QFVF5WLB6J"
                },
                "Date": "on September 12, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "While I cannot agree with his conclusions concerning Moore's law (due to his insistence of applying it to only one scientific discipline) the book is filled with good information.  Sadly, the professor does not explore the obvious implications of extending the Brain Computer Interface to an external memory and computational device accessible via miniature WiFi antenna, which of course could be installed on a chip.  Imagine a diplomat speaking any foreign language required ...fluently..simply by tapping into a translation device the size of a ring they wear.  Or learning to play piano like a concert master...by slipping on a watch.  The future of the mind extends beyond the limits of biology, and its only a matter of time."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AF8DM6NWL9API"
                },
                "Date": "on January 28, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CO0VFAQHZ61C"
                },
                "Date": "on December 23, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "After reading the first 110 pages I thought it was Michio Kaku's worst book but it gets incredibly good afterwards.  What a masterpiece!  The reason the beginning was bad is because it gives you a basic intro into how the brain works and being that I do research in this area, it was boring for me.  But this guy is a genius, the stuff you learn after the first 110 or 120 pages is incredible.  I can't believe that a theoretical physicist like Michio Kaku can create a book better than that of any neuroscience.  It's like a baseball player coming out and beating the heavy weight boxing champion of the world in his first fight.  Michio Kaku is the greatest ambassador or science or all time, hands down!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AWLF0LFXBE54"
                },
                "Date": "on April 15, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PCXPPJDXXAUU"
                },
                "Date": "on March 16, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A grounded, accessible overview of neuroscience filled with exciting ideas about the near and long term potential of our minds. I found the back half of the book more interesting than the historical survey in the beginning. You'll learn an awful lot about how we'll be able to use our noggins in the future after reading this book. What I always appreciate about this Michio Kaku's work is that just about anyone can pick it up and understand what he's talking about, whereas others leave their readers behind in a maze of jargon. I also salute his appreciation of entrepreneurs and market forces first rather than being a government knows best guy."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZTDQY6GWXCNE"
                },
                "Date": "on May 6, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Was introduced to the extraordinary Dr.Kaku on CBS MORNING. As a consultant he is often called upon to explain the events of earthquakes, threatening climate outcomes and such. He explains these principles with such clarity. When his latest book, \"The Future of The Mind\" was mentioned on the air, thought I'd try this one. Am only starting to get into it's reading, but I am most assuredly not at all disappointed. Only wish he had been around when I was dogging the taking of Physics. Maybe I would have pursued my first interest in the Sciences rather than Languages. Looking forward to reading some of Dr. Kaku's other works."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2H7NMVY2ATEWC"
                },
                "Date": "on August 12, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AL3KPUJUF4OXZ"
                },
                "Date": "on May 3, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Michio Kaku is a theoretical physicist by profession, but has always been fascinated by the mysteries of the human mind.  He covers everything from telepathy, telekinesis, mind control attempts, artificial intelligence, etc.  I particularly enjoyed his way of referencing popular movies that delved into the many areas of the Mind.  Either confirming or denying their possibilities.  With detailed descriptions of the physical anatomy of the brain to the affects of mental illnesses or drugs, this is a fantastic book.  I recommend this to anyone who has any interest in how or why the mind reacts the way it does."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6GBAJ02EM32V"
                },
                "Date": "on March 15, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "If there is a scientist: considering myself as one, who could do the mind justice; more appropriately than this writer:  I've not heard of them.  But this great writing is about more than that, because that subjects too small for this genius; Dr. Kaku doesn't stand alone in this field, rather he admits the giant shoulders that got him here...and that surround him, but don't let that scare you- we're fundamentally changing as Naisbitt and others, Toffler i.e., told us decades back; would take place- now this brilliant mechanic will help you use the right oil with your hybrid!  An amazing tool."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALYZ8E024ZFTA"
                },
                "Date": "on March 17, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Although I have seen this author on TV and listened to him on the radio, this is my first book of his.  Not disappointed!  I read things with a little skepticism when I first begin.  I really gained credibility for the information with him listing the Acknowledgements- many pages- before the introduction. The first chapter offers illustrations & history to remind the reader of the brain, it's bits, and function translations. Less than 350 pages but packed with be unafraid of mind science. I am not in any science field, just interested in how the body's control center works and could evolve."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHYQBQVCWY3J2"
                },
                "Date": "on July 17, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Although we are at the beginning, we're now just starting to be able to map the brain and understanding it. We have a very long way to go, but to our help we have technologies such as the mri-scan and many others that are getting cheaper, less intrusive, and more accurate at a exponential pace. I'm a fan of Michio Kaku and have red both Physics of the Future and Physics of the Impossible. Here he leaves his normal domain of Physics in order to meet with some of the greatest brain scientists. As in his other books, he explains complicated things in a entertaining and easy to understand way."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39W5NFQZSHNZI"
                },
                "Date": "on March 21, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WJGJETCWF99K"
                },
                "Date": "on April 27, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Dr. Kaku's writing is clear and concise.  It is also clear that he is on the cutting edge of science not only in the U.S. but the world. He has access to the world's top researchers.  He does an excellent job of differentiating between what is clearly possible and even probable in the future and what is merely speculative at this point in time.  In any case I found it to be entertaining and informative.  I would highly recommend it to anyone who wishes to have a peak into what the future holds for the human race."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19DPT74H0JU72"
                },
                "Date": "on August 21, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I am glad to have read this book. What a visionary. can't get enough."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADMNE0MNYIOV5"
                },
                "Date": "on September 30, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "A must read for an futurist or person interested in the human mind.  Upon reading it I immediately sent it to a grandson who will enjoy the adventure outlined in the book.  Yes, it is a book for young people who are interested in science and how technology has advanced since WWII.  It is also a book for others who appreciate science and are fascinated by our brains.  We know so little, yet our brain controls us and the future of humanity.  Read it and pass it on.  More people should read this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LZQT30U99HO7"
                },
                "Date": "on June 3, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "I found much of the information presented in this book quite interesting.  Michio does his best to present ideas in a manner that many can relate to, often using movie and television references.  However, there is far too much repetition in this book.  I found myself skimming through sections because it was simply a re-introduction of ideas presented just pages before.  Overall I feel like this book could have, and should have, been half the length that it is had it been written more to-the-point."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MG2JVQ6WHCR1"
                },
                "Date": "on April 19, 2014",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "2",
                "Text": "In principle, it’s interesting to read it as sort of a fiction book because Mr. Kaku didn’t try to consider any factors which might influence science development and creation of new technologies, e.g. how our society will develop, how we exploit our environment, etc. Additionally, he repeats some things from his previous books and it’s really annoying."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FUEMZBQ48V28"
                },
                "Date": "on August 3, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Fascinating exploration of what the future may hold for study of the brain and a good recap of our five senses and how magical our bodies and minds are. Later chapters about ESP and aliens were rather lame and belonged in a different book, in my opinion, which is why he lost a star. I hope I'm around when science creates a computer that rivals the speed and efficiency of the human brain, and our technology advances to the point where such deadly diseases such as Alzheimer's may be eradicated."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3I2B4Q0E1ZT54"
                },
                "Date": "on May 20, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The physicist, Michio Kaku’s The Future of the Mind may be the best book ever written about consciousness and the brain.  It is carefully researched.  It contains summaries of the experiments and speculations of a variety of scientists in a variety of disciplines.  It combines hard facts with possibilities.  For example, he details a lot of state of the art brain research and its conclusions.  But he also discusses what robotic and alien brains and consciousnesses might be like."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KAJT1A79DH7G"
                },
                "Date": "on September 4, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVAL1T27UJ5HD"
                },
                "Date": "on February 7, 2014",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "This is an overview of what Science knows and has concluded thus far about the mind. Perhaps it is more about the brain but the two words brain and mind are usually used interchangeably. This is a very interesting report on the development of science in its quest to understand the human mind. This could remove our massive ignorance about something which we are which is mind. It is good reading."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UEA0TA06N1E6"
                },
                "Date": "on July 21, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Michio Kaku has this way of bringing vast concepts and complex theories down to earth for the average curious person to understand.  Seeing the future possibility of currently developing science and technology, Kaku theorizes what society may do with these advances.  This book is perfect for exploring many different ideas relating to the mind through hard physical science and doing what conscious minds do best, trying to project into the future to see what comes next."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZVLZ2LQOWUAD"
                },
                "Date": "on April 20, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4IROU6B2Y51Q"
                },
                "Date": "on April 14, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HKFD4190OZA8"
                },
                "Date": "on December 26, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VXKSMCXKIID8"
                },
                "Date": "on May 13, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "For once in his many writings - Michio Kaku has escaped his typical obfuscating style and written a focused foundation on how physics defines the functioning of the brain. Most of all he puts a great deal of perspective on how far scientist and the medical world have come in understanding the brain. It is written at a basic, not complicated level and is a very good reference to this strategic organ and how it will evolve."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQRZ5FY4CCCP3"
                },
                "Date": "on December 13, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Professor MIshio Kaku takes you thru the evolution of the physical development of the brain, points out all the functions of different parts relating to our thoughts,parts causing various mental problems and possible solutions. You will find his information comes from thorough research, consulting top minds in the field, including advances in machines tracking the brain as it works. Refreshing and well worth the read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AQSWYEJNG0G0"
                },
                "Date": "on December 12, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "For a reader like me who's perpetually intrigued by neuroscience and cognitive science, this book proves to be a bona fide delight.  Unlike obscure textbooks, Kaku's book facilitates reading by constantly drawing up analogies to pop culture.  There are some grammatical errors, such as misplaced prepositions after preposition phrases.  So, Michio Kaku may need to read Steven Pinker's \"The Sense of Style\" :)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24NA0QU331JMR"
                },
                "Date": "on August 9, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I think anything Kaku produces is of great benefit to us all. As a prophet of science and artist of imagination he has very few rivals intellectually. Future generations will appreciate his genius far more than its one and he is a historical figure beyond what people perceive him to be today. If we could all be so lucky to just have a faction of his insight the world would be a better place. Slade Grantham."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33KBAPW71D180"
                },
                "Date": "on July 1, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "It was thought provoking book on the future of the mind.  I am a molecular biologist and was perturbed by the completely wrong description of the function of ribosome.  His information is based on interviews with experts(?) outside of his field, and there may be other things wrong with it, but I am provoked by the possibility  of the mind of the future.  I was motivated and led the discussions on the book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TJNVXEHCANNT"
                },
                "Date": "on April 10, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Kaku breaks it down for the simple and unscientific but interesting geeks among us.  I have a much more appreciative view of SciFi geeks.  A lot of science begins in the imaginative minds of these SCIFI authors.  A Fascinating book, I will read this over and over and over again.  I've been telling my friends all about it.  Resonate of Universe in a Nutshell due to its simple and complete explanations."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33SIEOTW6L1SK"
                },
                "Date": "on July 27, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XBJ1EBOUHQ2E"
                },
                "Date": "on July 14, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Though I've only read Book 1 in this three part book, I cannot put it down. It's a bit like an accident, you don't want to look but can't stop. I'm learning things I'm not sure I want to know but it's absolutely riveting. It's also written in a \"friendly\" way making the information easy to digest without being dumbed down. So if you'll excuse me, I need to get back to the book!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2J3F6VICYU00C"
                },
                "Date": "on May 5, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Solid recap of where science is in understanding the mind and brain. Only a slight criticism with is overall rosy view of the future. Either you are amazed by the book or completely terrified by the possibilities. The author repeatedly states that laws will have to be written to stop the bad guys from doing horrible things with this new technology. I'm not sure that will be enough."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DK61MHWK7Y8L"
                },
                "Date": "on May 21, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YFKG9UMYT722"
                },
                "Date": "on July 25, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This is an interesting romp though the many cutting edges of neuroscience and neurotechnology.  I was happy to have read it, though I find the contents highly speculative in many areas, and heavier on exuberance and optimism and  lighter on skepticism and practicalities than I would have hoped.  Of course, predictions are hard to make, especially about the future (Yogi Berra?)."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GXLAH09LO8OQ"
                },
                "Date": "on March 25, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Loved it"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A126EH9RVK4YGA"
                },
                "Date": "on July 15, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Finishing up this book.  So far, love it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2G7EIGWC9YKNW"
                },
                "Date": "on July 10, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Overall good read - at times a bit over zealous in the world of possibilities"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ATGOV2QUB5WC"
                },
                "Date": "on July 8, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "A fast trip through some of the newer findings about \"the mind.\" A little scattershot, superficial, and from the hip but does give an over of recent developments and speculation about the future."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1W90HBR7L0933"
                },
                "Date": "on July 7, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Extremely interesting concepts especially related to what could be in store for generations to come. Of course this is speculation at this point but Kaku  leaves one with the feeling that you would like to be around in the future. The brain and the mind require so much more insight and investigation so its complicated functions can be understood. A very interesting book ."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OF5CXMGLA45T"
                },
                "Date": "on July 7, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I'm reading it. it is interesting for me. everythng is new."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJNRVHYXU5QW1"
                },
                "Date": "on July 5, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Such a wonderful look to the future from this genius."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CKIH0MS3KO7J"
                },
                "Date": "on July 2, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TRD8M3G8DB8R"
                },
                "Date": "on June 30, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "great read"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A136CNTX6AETTP"
                },
                "Date": "on June 25, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3M4E6LTD8VC4H"
                },
                "Date": "on June 21, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3G94BHU534VK8"
                },
                "Date": "on June 18, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Kaku's book offered lots of theories on the evolution of the mind and consciousness.  I came away with a deeper appreciation of the brain and the mysteries stored within."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AS1XN5V2TU4YL"
                },
                "Date": "on June 12, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I am still digesting this book, having finished it only a few days ago.  I found it fascinating, hopeful and thought provoking.  What more can you ask for in a book?"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HJYB90UJC1FT"
                },
                "Date": "on June 11, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is a fabulous, well written book with a lot of very interesting information about the minds of monkeys, people and robots. As for future of robots, wondering if people may desire to marry a robot instead of having a human spouse."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13A9TDQ1UCV3S"
                },
                "Date": "on June 10, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACSB3BIWRTSID"
                },
                "Date": "on June 8, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "What would it be like to achieve a Vulcan Mind Meld a la Mr. Spock? If there is anyone on the planet who could do that, my wish would be that Dr. Michio Kaku be that person. How I would love to know what he knows! Talk about a transcendant experience! Unfortunately, science isn't quite there. Yet. But that hasn't stopped Dr.Kaku from taking us \"one step beyond\" in his exploration of what the present state of physics suggests might be possible in the not too distant future. If you have a literal mind, this is not a book for you. Dr. Kaku's speciality is theoretical physics not material science so he does what theorists are supposed to do: extrapolate from what we know and have the equipment to measure or observe right now to the furthest edge of possibility. It can be argued that we are only in the very early stages of \"brain science\" but the rate of discovery in the field is progressing exponentially. Almost daily researchers publish new - and often unexpected - findings on how the physical brain functions. We are beginning to be able to see the path of a thought as it travels the neuro-circuits of the physical brain. But thought itself cannot be seen, weighed, or measured in any way. It is invisible and leaves only the faintest temporary imprint for us to observe. Dr. Kaku wrestles with the problem of consciousness in his quest to understand the MIND. Our minds use our brains to record and communicate thought. But is Mind identical with Brain? This is the question that must ultimately be asked and answered. What IS consciousness and where does it come from? Is it dependent on the brain or does it exist in the quantum universe and express itself through conscious creatures in the form of thought? And, if so, does that mean that pure consciousness really does exist and that it has intention and will? Dr. Kaku is one of our planet's most enquiring minds and he'd like to know. So would I. I think I'll stick around and wait to see what he does next."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MNE7BP9APG4I"
                },
                "Date": "on June 6, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Started Reading the Book, it offers interesting perspectives.  Although I have not finished reading it, i highly recommend this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CEMH6VXVTVRH"
                },
                "Date": "on June 2, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Written on a level that everyone can understand.  He creates as many questions as he does to answer questions already asked.  Great insight on the brain and where we are heading.  I highly recommend this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1V6GOS2IJSGNP"
                },
                "Date": "on June 1, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I really enjoy reading this book! It is very easy to read and he explains things so well! It is fascinating to learn what scientists are able to do right now and what they will be able to do in the future! I'm amazed at what is happening right now in my lifetime. It is a very interesting, educational, and entertaining book! Just fantastic!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1APOIHPT3TOSL"
                },
                "Date": "on May 29, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Makes the complex easier to understand and explains a lot about what makes us tick. Take the book slow nd enjoy the trip."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34UC0EN6RSBBV"
                },
                "Date": "on May 28, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book delved into many of.the questions I have had all of my life, like, will there be a cure for Alzheimer's and Parkinson's in my lifetime?  How big is the universe?  Can we achieve immortality?  Can mental illness be cured?  Michio Kaku touched on all of these and much more.  I enjoyed this book immensely."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34XD8B6GAN183"
                },
                "Date": "on May 28, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "As a physician, it is easy for me to grasp the concepts explained in this enjoyable book, still it should be an eye opener for all the readers to know where physics and neuroscience are taking us. Unfolding the mysteries of brain and mind will help understand the causation and cure of mental illness. Hope the Robots will continue to serve the humanity and not overtake it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BNRTDIZAQT7U"
                },
                "Date": "on May 27, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEPQFLMVZ7P5N"
                },
                "Date": "on May 24, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3L5Z63W6D5QG5"
                },
                "Date": "on May 23, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Good reading, a lot af questions and some fine answers. Of course, no such book can fathom all of our future,;neither the author nor we can do better than guess. Sometimes, I think, the author gives us guesses disguised in such a way, maybe he or we have to think these guesses are the real answers. That should be better, clearer, but nevertheless, a very good book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASVKCW92CZ54K"
                },
                "Date": "on May 18, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Complicated subject written in very easy to understand way. Including robotic, intergalactic travel, aliens and how our mind works. I really like Michio since Imhave read his \" Hyperspace\""
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8CL9QTIJQLN"
                },
                "Date": "on May 18, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I really enjoyed this book.  I have read quite a few books about the mind ( brain ) but the perspective of a physicist was so much fun to read.  A totally different twist.  Despite the  complicated subject matter it was easy to read.  I am no scientist or scholar just someone fascinated by different subjects."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SDQWTB6VSDQ9"
                },
                "Date": "on May 16, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Though provoking a must read. Although you can't take this as an absolute,  so many unforseened- developments and break thoughts can change our would virtually over night."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SS9H5ANAS8FK"
                },
                "Date": "on May 16, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "It is so well written and easy to understand! I enjoyed learning what has be developed and where it will lead too! Some futuristic ideas really made me pause and think whether or not I would want to live in the distance future!  It is a positive book full of ideas that may help people physically and perhaps mentally. A fIght against diseases of today to the possibly of totally eradicate many of them. From communications to conscientiousness and how it will change in the future! I loved this book!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CINJRSUXR3QH"
                },
                "Date": "on May 16, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Michio Kaku hasn't failed to deliver imaginative and futuristic insight, ever, and this book is no exception. I recommend it to everyone who can read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKY2FUPC506LT"
                },
                "Date": "on May 15, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I had the chance to meet Dr. Kaku and hear his lecture on this book.  The book is quite insightful, and despite having few moments to myself during the day to read, I breezed through it quickly.  As with his other books, Dr. Kaku demonstrated, once again, his brilliant ability to convey normally complex concepts in an easy manner."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AU9VKV8I823J7"
                },
                "Date": "on May 15, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is an excellent book. If you are into knowing what future technologies will be like in the near future, you will like knowing what will be in store for the human mind."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Y9ZU8BH9LEHB"
                },
                "Date": "on May 14, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "40% as the Matt Drudge of science and 60% Jules Verne/Isaac Asimov/Ray Bradbury. Personal preference for the Matt Drudge perspective on scientific research. Very stimulating and thought provoking."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EFZVAR3MS8PS"
                },
                "Date": "on May 14, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A stunner of a book. Easy to read and understand. I could not put it down and am almost ready to read it for a second time. Well done Michio!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YFADMAN5E71H"
                },
                "Date": "on May 13, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Michio Kaku talks a lot about future prospects of brain science, as he promised. I also liked the part where he mentions the moral part of brain science, since that's what modern science has to deal with in order to make itself familiarize with the public. However, it was at the same time too informative, I think, and was little bit hard to get immersed. Overall, good book I you want to know where science is headed regarding mind."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BAFI4NUWRTRW"
                },
                "Date": "on May 13, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "The author is unquestionably one of the leading authorities in the field of theoretical physics. While this book primarily  deals with the human mind and the future of man, Michio Kaku  provides extensive  research data from the leading medical researchers, past and present, and explains  in detail what makes up the brain and what the future holds for man here and throughout the universe."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14HPFK5IO093G"
                },
                "Date": "on May 13, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "After watching and listening to Michio Kaku often on the CBS morning show, I just had to venture into purchasing a couple of his books, this one and the one about Einstein.  My thoughts that I might find his ideas way above my comprehension ( especially if  his work was geared to students of physics) but I was greatly surprised with the ease which I was able to understand his concepts.  I highly recommend this book to anyone who wants to think more deeply about the future of humanity and our place in the universe.  I look forward to ordering another of his books after I finish the one about Einstein."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1A4VKPHNIDTSU"
                },
                "Date": "on May 12, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MLIW5RHLW4T"
                },
                "Date": "on May 8, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "quite revealing in the progress that has been made in neuroscience. Michio Kaku ties physics and neuroscience together brilliantly. I was disappointed in the lack of progress medical science has made on the brain but it turns out that it either has not been communicated or at least not communicated well. This book will get you up to speed quickly. Fascinating!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CN4TXHWXA06P"
                },
                "Date": "on May 6, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Clear, comprehensive, up to the minute state of the art Neuroscience News! Physicist Michio Kaku explores in depth the brain-mind technologies unfolding today and the real and potential costs and consequences. Brain wave-machine interfaces, Deep Brain Implants, video taping dreams, and the consciousness of machines are just a few of the fascinating areas he touches upon as he shows how science has deconstructed the brain, only to discover the Mind--Consciousness itself. Deeply philosophical--without meaning to be--Michio Kaku probes into possible futures that might spring from today's scientific discoveries. I enjoyed it, but I took it in small chunks/chapters at a time to let the material digest."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVYGCUV8UAO4G"
                },
                "Date": "on May 6, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book is a particularly interesting take on the past, present, and future of the brain. It is difficult to comprehend just how complicated the brain is, but Dr. Kaku makes it possible and even interesting to learn about this. The juxtaposition of scientific fact and hypothetical future technology could confuse the two for some readers,  but it is worth the read anyway."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2O1UF83PY1GM1"
                },
                "Date": "on May 6, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is the best book I have ever read about modern advances in mind research.  It covers the gamut in contemporary developments and poses some amazing and scary predictions for the near and distant future.  I wasn't even aware of how far we've come regarding helping challenged people such as Steven Hawking.  Every chapter contains new revelations and the work itself goes very well and complements the new Cosmos series."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9BLWFU7S9LT7"
                },
                "Date": "on May 5, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is a fascinating book.  I will have to re-read several times, I think, to absorb all of the informaiton"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1F867WL27KGBN"
                },
                "Date": "on May 4, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Exploring the possible by utilizing sci-fi themes of movies made in the last thirty years (e.g., Star Wars, Star Trek, 2001, X-Men and The Matrix), the author tackles complex issues,  develops and provides context to possible futures deriving from the human mind.  The book requires a careful read to grasp the possible outcomes of tomorrow's advances."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2K5B4CMS0JBMY"
                },
                "Date": "on April 21, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Written for all readers to clarify the structure and function of the brain based on current research. Science fiction movies are used to illustrates extreme ideas about brain power that are not supported by science. Questions of future possibilities are well presented on scales from possible to unrealistic. The potential use for new information and planned research are identified to include mental and physical diseases. It is a book based on science and includes philosophical questions related to the future use of brain knowledge."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AA4GG23YVRFFD"
                },
                "Date": "on April 13, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Help for all brain related pathologies is just around the corner. Read all about here!  Kaku gave only passing mention to Roger Penrose's Quantum Brain Theory at the end of the book. Everyone should understand that Penrose's Quantum Brain Theory is now proven and will accelerate all applications of technology relating to consciousness exponentially!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANGG4J0SDHRB4"
                },
                "Date": "on April 13, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This book covers the history and progress in understanding the Mind.  It is written in a conversational style that is easy to read and (mostly) to understand.  I most enjoyed the last few chapters that discuss ideas about the future of intelligence and its possible expansion across the universe at the speed of light."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A254MIUGC0F6C3"
                },
                "Date": "on April 12, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent book about the merging of physics, computer science, and the human brain. Readable and entertaining. A very esoteric subject made understandable."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALVOW0ASDEBNM"
                },
                "Date": "on April 12, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This a good collection of information.  If you read science news every day, you will see some concepts that you spotted already.  If you don't read science news every day, then you will enjoy this book.  You'll gain a perspective on how fast ideas are approaching your everyday reality.  Good Survey."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1V258ONMBV2XY"
                },
                "Date": "on April 11, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "The book is long, and it goes into unexpected territory on AI and life among the stars. I found his take on aliens visiting earth very interesting…maybe we are so simplistic compared to any civilization that had the ability for space travel that they wouldn't even bother to contact us…"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APQ0PMHFERO78"
                },
                "Date": "on April 10, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The story line is well orchestrated, and easy to read.  I found the subject so interesting that I could not put the book down"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PYENI6JBBBH6"
                },
                "Date": "on April 9, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABXEQAOP21RWJ"
                },
                "Date": "on April 7, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Michio goes to great lengths to help make the adventure of the mind easily understood. plenty of reference's and illustration's"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZZBD3THDUXG3"
                },
                "Date": "on April 6, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Michio Kaku not only knows his subject, but knows how to communicate difficult concepts in an entertaining way. This book covers the science of the mind and our technological extensions of the mind that will change life on earth forever."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YGUUWJK0EJWG"
                },
                "Date": "on April 5, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is a really wonderful book, written in a very readable fashion, about all that is currently known about the brain, the mind and consciousness. It goes on to follow all the different avenues research is following and it's implications for the future. Really a must read for anyone interested in science and it's impact on our daily lives."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RJ13236LRV1F"
                },
                "Date": "on March 28, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "An amazing book from an amazing man!  The most precious thing about mankind is our curiosity and ability to learn.  I think this book rivets that home. I would recommend reading this if you, too, have an insatiable appetite for knowledge and want glimpses into a possible future.  Truly inspirational."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MYR0HEKG8JQW"
                },
                "Date": "on March 28, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I'm only half way through but it is a great read, full of facts we all want to know and never knew where to look!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RHH4Y0RF2CYI"
                },
                "Date": "on March 27, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book explains the mind is such a way that you will believe you have a PhD I when done."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9VPQ9B014DEL"
                },
                "Date": "on March 26, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Book lays a foundation for non-physicist in entertaining way then rapidly moves to latest developments on topic. Author does excellent job on neuroscience, use of nano technologies, robotics but gets weak when discussing philosophical. His vision of future possibilities amid downsides was very informative and worth price of admission. Section on aliens was simply a fun read mixed with science fiction. He achieved his goal - the potential of the human brain / mind."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A289RPAAXMPSNE"
                },
                "Date": "on March 26, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "awsome. Would reccomend for readers of all ages. He explains everything completly but in a non complex way. I as a teen can understand and enjoy this book the same way an adult would"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2538O8OBGHORQ"
                },
                "Date": "on March 25, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book opens up the brain to better understanding of the mind. You don't have to be a brain surgeon to get this book. Adding this to your book shelf will make you a better person."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1E89KFAL768PX"
                },
                "Date": "on March 19, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I just loved this book it was very helpful, and it helped me do good on a science test, 99 A"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3P4Y1JYDFCU22"
                },
                "Date": "on December 10, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "despite the fact that the book is clearly written for layman, very interesting points were made and explained. when reading other book on the same subject, i did find that it only touches on the tip of the iceberg, but then it is a thin book. so if you just want to know a fast summary of what this subject is about. it's well worth its money"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXGGCCYXA71O8"
                },
                "Date": "on May 12, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "As usual, Michio Kaku takes a dry and complex subject and has formed it into the popular science equivalent of a page turner. The book looks daunting at first glance but Dr. Kaku guides the reader through all aspects of what modern science knows about the mind and our human brains and the fascinating possibilities the future holds for us."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JB405VRAERCS"
                },
                "Date": "on January 5, 2014",
                "Helpfulness": 0.6,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A250XU4W3L5QYM"
                },
                "Date": "on January 3, 2015",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "There's just something about this book that is kinda hard to follow along with.  I like all his books but this one talks a lot about machines the first four or so chapters.  Its that the average person might have difficulties reading this without at least some background knowledge and he doesn't know how hard he is really making it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VYNDFOYFTP5D"
                },
                "Date": "on December 18, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Very interesting; one of the best books I read in this area.  The book provides great background on progress in research related to the function of brain and gives detail information on the future expectation of research in this are including detail analysis of the likelihood of those achievements and their pros and cons."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D2OXX0PT7GJC"
                },
                "Date": "on December 15, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "All of Dr Kaku's books have been insightful, fascinating and well written. This book is no exception. It examines the cutting edge research on the brain and where that is likely to take us in coming years, much as he did for physics in Physics of the Future. Also a brilliant discussion of how robots will affect our lives."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GV8FG13Y93JF"
                },
                "Date": "on August 26, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Michio Kaku did it again. This book was amazing. It tells you about things you thought you knew and some things you never dreamed of. The workings of the human mind are interesting and complex, and Dr. Kaku covers it all. You will want to know what may wait for the human race in the future: you wont believe it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CVXEQC87BV74"
                },
                "Date": "on October 15, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This book gives a real in depth look at the brain and how it works. Michio has an excited and optimistic outlook for the future sciences of the mind and does a great  job of passing that excitement on to the reader. I personally enjoyed the sci-fi references throughout the book.  Over all an interesting read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QI0NAAN77NU2"
                },
                "Date": "on May 7, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZXFIKINB9G0F"
                },
                "Date": "on April 19, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Is a very good read. I love Kaku his way od explaining things keeps you interested while explaing his findings. Found it very easy to understand while challenging my current perception on how the mind works. Will def rocomend this to others.  Also keep them coming i look forward to his next publication"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24GNENM8HBH41"
                },
                "Date": "on February 28, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "For the layman, even more amazing than Dr. Kaku's mastery of the subject -- be it theoretical physics or the future of the mind -- is the way he breaks it down and explains it in a language and style the average reader can no only understand, but also love. That is a rare gift. It is much appreciated."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CBEKRAN6P50I"
                },
                "Date": "on December 27, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I am graduate student in neuroscience area and i have to confess even me was astonished by the abroad background knowledge by Dr Kaku. I sincerely recommend this book to everyone who willing to spend only 1-2 weeks to get a bird's eye view on history and latest progress made by those talent scientist."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1N2JPPMROI7IO"
                },
                "Date": "on September 24, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A broad overview of progress in understanding the mind: how it \"works\", can it be \"read\", can it be \"programmed\".  The chapters are fairly independent and can be read in any order.  Up to date, lots of references for further reading.  An delightful, informative, and easy read!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AI7HMBKVJS99O"
                },
                "Date": "on July 13, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Michio Kaku is a genius. He makes the mind and the universe, the two most mysterious and fascinating frontiers known to science, personal. Simply and with great depth of understanding, he shows us what the Ancients have always known; these frontiers are our own inner potential waiting to be awakened."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36WBI20OEHU6U"
                },
                "Date": "on May 14, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The science is now, the explanations and research are clear and easy to follow. There is hope for those with dementia and Alzheimer's based on ongoing research. We may be able to archive our memories in the future.  The mysteries of the brain are slowly being revealed and this book is very exciting."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AT78W298Z9XB7"
                },
                "Date": "on December 16, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book is amazing! I could understand the updated brain science and future perspective of science. I really recommend this to anyone, students and adults. As reading this book, I was happy to imagine that I'll live forever in the new-born-cloned body with transfered my memory or consciousness."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29OXA04W0EVTY"
                },
                "Date": "on May 8, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book furthered my ideas about evolution, neurobiology, upcoming technologies, and about how far we've come with understanding consciousness. Kaku did a great job appealing the the novice but keeps the attention of those a little more informed. I'd definitely suggest this book to others."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UEMDEM06M6O3"
                },
                "Date": "on January 8, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great book that stimulates thinking, pardon the pun, about the potential for human existence.  Concepts on space travel to cures for the scourge of Parkinson's disease, Alzheimers, and ALS.  The possibilities for mind control of computers and robots were described in fascinating ways."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LMUGZHA5KXPW"
                },
                "Date": "on January 20, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Dr. Kaku is a totally amazing teacher.  So.o.o.o.o grateful that he shares his incredible intelligence and knowledge. VAST amount of information and subject matter in this book.  Such fun because Dr. Kaku always introduces ideas and information that would never have occurred to us."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BPLGKR62IWCS"
                },
                "Date": "on December 2, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I loved Kaku's almost child like enthusiasm throughout the book. He frequently uses movies and popular culture as examples to get his ideas across which I also loved. His theory on the hierarchy of conscience seems as good definition as I've ever heard. I enjoyed reading this."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AK3387CNZ5C1O"
                },
                "Date": "on January 6, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Absolutely amazing! This overview of the latest discoveries about the brain and how incredibly complex and wondrous it is certainly humbles this old electronics hardware engineer. Michio's speculation about the future should be required reading in every student's curriculum."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KC4SZ9D43N1H"
                },
                "Date": "on October 27, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I like the different perspective and also the way Michio Kaku explains things, thanks to his books I am familair with the horizons in the quantic physics and the general realtivity theory....now this is a subject I deal with and I am familiar and he did an excellent work."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUVR9UCE1EGLZ"
                },
                "Date": "on December 25, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Such a well written and easy to understand book. Michio Kaku at his best! It helps us understand our own brains as well as those of family and friends. It is a great read, a great reference, and entertainment all together in a wonderful book you will surely enjoy."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BWXVUGX6066Y"
                },
                "Date": "on March 2, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3R8S58R30XC7Y"
                },
                "Date": "on September 16, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANZ5Z04PJHMPS"
                },
                "Date": "on April 9, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "My husband loves the author's writing and enjoys reading Michio Kaku. I have purchased most of his books since a person interested to learn about the Future of Brian functions is really fascinating.  I will recommend this book to everyone to purchase."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A178F0762R9F04"
                },
                "Date": "on March 11, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Just Started reading it but Dr Kaku and his editors do a good job to keep the science at a reasonable level.  I am fully comprehending the material without reading his other books.  I can't believe someone so smart can speak and write at my level."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OX2V9X5HNKJX"
                },
                "Date": "on March 6, 2015",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": "Too much speculation about subjects that are just starting to be researched. Dr. Kaku is a great writer and I love his other books, but this one just had too much wishful thinking. Also I met him today and he didn't say hi back to me so.... yeah."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BGDA14FB0FXA"
                },
                "Date": "on December 12, 2014",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "Reader's digest of neuroscience"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CVPCGUY2Q2S7"
                },
                "Date": "on November 6, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Very good read to understand modern day concepts of the brain and how it functions. Even better, Kaku offers the latest theories on the future applications for specific parts of our nugget, even psychic perception and communication."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4L8BYHN87LUD"
                },
                "Date": "on December 11, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "My, my, my our children and grandchildren will see a whole new world.  I worry about the consequences of some of these discoveries but marvel at others.  Complex topics are broken down in an understandable way by the author."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EE7CLWZEO4MH"
                },
                "Date": "on October 30, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "While I dislike the concept of robotic customer service, I am realistic enough to know that it will come. Bummer! Technology allows flexibility for interaction, but person to person is still my preferred means of existing."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FVV0QJ1OPVBE"
                },
                "Date": "on July 3, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is a great book that shows you the scientific advances in the understand the human mind. An excellent bedrock of knowledge and entertaining. Also check out America Séance in the realm of logic. Good books this year."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NU1NMLU2PR2X"
                },
                "Date": "on March 25, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Interesting, as all of Kaku's books tend to be.  Some of it was rather repetition of information I already knew, but keep in \"mind\" if you'll pardon the pun, that the author is a physicist, not a neurologist."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1J9EN9DJHWXGG"
                },
                "Date": "on April 5, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Very heady stuff. Pun intended. Kind of dry at times, but almost every page has a significant learning that you would like to be able to remember. Maybe when I have finished the book I will be able to do that!."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29OGL73KXZDSX"
                },
                "Date": "on July 30, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Very interesting it is a scientific identification of what metaphysics is saying, it gives you a celluar understanding of what goes on in the brain when creating your life as opposed to the spiritual version."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33HY6TX4R2B7N"
                },
                "Date": "on June 29, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is an in depth study of the advances made in the area of mind control, telepathy, and other related subjects that is written so a layman can understand the theories and the possibilities of the future."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27REDPELZ14PV"
                },
                "Date": "on April 14, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This very inquisitive and complete book follows through a methodical and detailed explanation of the physical brain as well as the individual. It's a must-read for those that are fascinated with the mind."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3R8DM1EZYCE5V"
                },
                "Date": "on March 10, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3G9L75QSORIU6"
                },
                "Date": "on May 23, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is one of the very best brain book I have yet read. It is tremendously thorough in each explanation and wide in the selection of topics. I'm not even halfway through, but really impressed so far."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36S4NRULJHNUO"
                },
                "Date": "on October 20, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Really loved every page of this book...changed how I thought about things daily. Kaku is brilliant and easy to follow. A great introduction to theoretical physics and how the human mind works."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMFXR6EU1MGRP"
                },
                "Date": "on August 16, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I wish that I were going to be here for all of these ideas to come to fruition.  Very readable and totally understandable even for non-scientists.  I have started on his other books as well."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WFXYRDB5A0N5"
                },
                "Date": "on February 25, 2014",
                "Helpfulness": 0.625,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DX6BSFDRH3MM"
                },
                "Date": "on April 26, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Dreams, time travel, memory, love, conscience...It has it all and more. One of the most futuristic books I've read that made me want to live longer to see all these happening. Recommended!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34SFM61EIFNWV"
                },
                "Date": "on July 13, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "fantastic-------everybody should read this instead of playing on the iPhones, texting and playing computer games, young people, get busy and start reading true books instead of fantasies"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZBI8IL75ZJ8T"
                },
                "Date": "on June 20, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "My father loved this book and he is hard to please, being a published writer himself. He felt the author's style of writing explained difficult concepts easily. This book is a keeper."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18ACJOQ6C3F5I"
                },
                "Date": "on September 16, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Dr. Michio Kaku has an amazing ability to describe difficult concepts using simple vocabulary, it is fascinating to know all the topics associated to the brain, the mind and physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Q494IYH2ZAS5"
                },
                "Date": "on June 24, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Insightful, profound, but not too difficult to digest! I'm obsessed with this and have already substantially increased my understanding of the brain and the future of neuroscience."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CC4MKYJ9FSB5"
                },
                "Date": "on May 3, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Extremely interesting.  It summarizes in an objective and clear manner the ongoing research on the workings of the mind and the implications of these developments for our species."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13IF458NMAX3W"
                },
                "Date": "on November 30, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Michio is captivating and even read his own stuff for the audio-book versions, I just wish he would write more sci-fi, Its been a long time since we have had a sci-fi legend!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A369R4MUZCUI3D"
                },
                "Date": "on January 12, 2014",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23WO8W8CNI8I"
                },
                "Date": "on April 25, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "OK . . . I really like Kaku's books. But this one is worthy of Stephen King. And that's just in the Introduction. Kaku's fascination with the mind is also very scary!!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A398CCYZWJ9W3P"
                },
                "Date": "on March 30, 2014",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "The perfect gift for my brilliant husband!! He loved it! What are computers doing to our brains? Michio Kaku tells all!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AL5UJ1XXYLB74"
                },
                "Date": "on April 13, 2015",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "Fascinating subject, indeed. Kaku's style is a bit too verbose for me. I would prefer more science, facts, and less of a popular TV presentation. Cliff notes, perhaps?"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18N8ITWFPRART"
                },
                "Date": "on May 20, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "LOVED this book!  My favorite quotes/paraphrasings are on Goodreads and some have been tweeted already. Thanks, Michio. Makes me want to go read your other books, now!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CG7REMZH7JEZ"
                },
                "Date": "on February 20, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Brings together most complete digest of factors happening right now. Fair and inclusive to all views and cultures. Sensitive and warm expressions to massive raw data."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32JCHQTNBVJ64"
                },
                "Date": "on February 4, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "For anyone desiring a more thorough understanding of the mind and its relationship to current and future technology, look no further; this book is a must read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RMCTBJH0NWB2"
                },
                "Date": "on December 5, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A challenge to anyone with a curious mind. Not subject to speed reading advocates. Took longer to digest than most of my books. Nevertheless worth the effort."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3U8YCPG7X71V8"
                },
                "Date": "on April 16, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MEL9TLO72SD3"
                },
                "Date": "on September 27, 2014",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "3",
                "Text": "I'm a clinical psychologist. What he says is not wrong, but he does not understand what he is writing about."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2US4TYMA567ZZ"
                },
                "Date": "on March 21, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Gotta love the Kaku"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MW4ML74RBJ5T"
                },
                "Date": "on January 16, 2015",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": "Some interesting scientific information on current neurology from other sources but often goes into scenarios that are more fantasy than hard science."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGD3PX24S9ODU"
                },
                "Date": "on August 1, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book really makes you wonder what life could be like if we could collectively work together on all the issues that confront us on a global scale."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32FVX8UQ4TOJS"
                },
                "Date": "on October 1, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Gave me a good understanding of the human mind and conscienceness. He introduces some crazy out there concepts that gave me something to think about."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1G8C94A0Z65UD"
                },
                "Date": "on May 7, 2015",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "First half of the book is excellent, highlighting what is happening and might someday happen in neurotech. The last third is off base in my opinion."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZBGGVHEZQVDN"
                },
                "Date": "on September 4, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "It's a great book ! It will give you overall understanding about :studies, historical facts and the direction of the current research for our brain"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FVUDM10CUYRL"
                },
                "Date": "on April 6, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Interesting, although I think science will soon prove that many humans as well as computers are sensitive enough to pick things up telepathically."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WV8Y608V90IJ"
                },
                "Date": "on June 1, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3E79XMTBJXOQI"
                },
                "Date": "on May 5, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I purchased this book on the recommendation of friend.  I opened the book and read a few paragraphs and I was hooked.  This is a fascinating read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2J43TFRFZZJRH"
                },
                "Date": "on July 22, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Huge fan of Dr. Kaku! He writes in a way that is interesting; yet easy to understand. Love watching his documentaries as well. Highly recommend."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TQLO42I80LD2"
                },
                "Date": "on March 2, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37OHI7MCH17JC"
                },
                "Date": "on August 26, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Everyone should read thisbook to widen the horizon of thinking. It opens floodgates of possibilities in the next 100 years. Simply Compelling !"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6M44KYWQXS9V"
                },
                "Date": "on March 17, 2015",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "Cute, but shallow."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IHTI3XEO8TAQ"
                },
                "Date": "on May 31, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book was extensively researched and clearly presented.  I do not know physics and I did understand Michio Kaku.  The future looks bright."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5EB22JPJSZWC"
                },
                "Date": "on April 28, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "as a complete layman i love this book. i have read it twice because i learn more each time i read it! i heard about this book on Public Radio."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LN74J57LGGLH"
                },
                "Date": "on November 13, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Loved it. I've ready nearly every one of Michio Kaku's books. And will keep going until I've read them all. Pure inspiration and joy to read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZ8JJC4XC0ZL"
                },
                "Date": "on September 26, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Mind boggling (pun) - and very interesting.  The guy is brilliant and a little egotistical - but probably doesn't know it.  Great book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UW06B2UF19AY"
                },
                "Date": "on December 30, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "An excellent book. I have gained such a vast amount of knowkedge. I give five stars for this outstanding work done by dr michio kaku."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17CD2UX7Z54IS"
                },
                "Date": "on May 18, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great book! The best and coolest book written by Michio Kaku. I am very interested in aliens, and this book talks about alien brains."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALKSESD5PJD13"
                },
                "Date": "on September 19, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Amazing  book!! Michio Kaku did an excellent job describing the mind and his vision of what to expect in the future. Amazing book!!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XF8SHMV0KPYK"
                },
                "Date": "on October 26, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is one of the best books I have ever read. The writing is clear and easy to read. I learned a lot about myself and the world."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANZLTGA7AXI0G"
                },
                "Date": "on April 27, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Some just touched upon.  Some leaving more questions to add research of your own.  Entertaining an informative. Thanks, the end."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADYJSGXH7YVCD"
                },
                "Date": "on June 24, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Good book for a clear understating of the working of the mind.  Bit hard to plow through at times but interesting despite.."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DUQ2KN1XXAFY"
                },
                "Date": "on March 26, 2014",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YPB5IVA16YY7"
                },
                "Date": "on August 13, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great fuel for the mind. Reviews significant topics of the mind and brain, and suggestions of where they are leading us."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18RHJBMVYMJLY"
                },
                "Date": "on July 4, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "One of my favorite recent reads!. Great thought provoking book written by a brilliant man but in an understandable text."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACS2SAQ4ZI2N8"
                },
                "Date": "on March 1, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Dr Kaku, writes so very well.  However I need to re-read some of the chapters again to help my mind fill in the blanks."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A133NF5GBVP8DK"
                },
                "Date": "on September 19, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "loved this book absolutely it made me change the way I look at things all around me  I would highly recommend this book"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23RQKB7LDHFW3"
                },
                "Date": "on December 5, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Need to read it again to get more out of it.  I recommend this book to serious thinkers with plenty of time available."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1B6ELXHNRSXXN"
                },
                "Date": "on May 16, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Awesome read, sheds light on the brain and amazing things ones mind is capable of. I definitely recommends this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQW1BIYQ25PEN"
                },
                "Date": "on June 7, 2014",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1B22QZP7PAGOI"
                },
                "Date": "on July 12, 2014",
                "Helpfulness": 0.631578947368421,
                "StarRating": "1",
                "Text": "Mr. Kaku's analysis of consciousness is remedial. He states that relatively little research has been done on animal consciousness, but then goes on to categorize their neurological complexity based on what I can only assume to be his own chauvinistic conjecture.His callous discussion of experimentation on primates also bothered me. This book serves as an interesting survey for some of the more recent innovations in neuroscience, but little more. Hopefully his books on physics are better."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKNAORC5L6D5Y"
                },
                "Date": "on June 28, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent book ..easy fro a non scientist to read. I enjoyed the inofmation and his style of writing . Check it out"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A132OSYOL0TDJK"
                },
                "Date": "on May 6, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I had the pleasure of seeing Dr. Kaku give a lecture about this book. A great read for both scientists and layman."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VS0SV9HDTRLU"
                },
                "Date": "on March 24, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is an interesting book, and I have learned so much about how our brain really works, and it is an eye opener."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A190SHP2P1F0ZT"
                },
                "Date": "on October 17, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "well written. Recommend it highly as an excellent book tor reading to help understand about the brain processes.."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8QWR6H44TM98"
                },
                "Date": "on October 13, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Absolutely stunning. One of the few books I've read that has truly changed the way I look at the world around me."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EROQZ4HBUZ91"
                },
                "Date": "on March 5, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Enjoyed one of his lectures and had to read his newest book.  His depth of knowledge grows throughout the book"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19P5ME3DZ4GVA"
                },
                "Date": "on April 3, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1A2T5N8FRF6R6"
                },
                "Date": "on January 10, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Want to know where we are at technologically with understanding our most important organ.........read it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2C519QDSLP3C6"
                },
                "Date": "on October 13, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Verrrrry interesting; but a mechanical view of the human brain which lacks warmth for the sake of acumen."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AN5213FUUH6IE"
                },
                "Date": "on May 18, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AK5UENA8UCT8Z"
                },
                "Date": "on February 27, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Great book. I'm a little more poetic than scientific so at times it's been a dry read. Still, very good."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20F66VB42H9C5"
                },
                "Date": "on September 8, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "abslolutelly great education..Many of my friends love it to0 as I recommended them immediately.Thank you"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZV8YJALOKMUW"
                },
                "Date": "on March 30, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Well written. Very clear despite the depth of the subject. Very clearly written for all the understand."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SF0VAQXK53V8"
                },
                "Date": "on September 4, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Very interesting book on the ideas for future superior human and artificial intelligence for the brain!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3I0J6PQQKCOWG"
                },
                "Date": "on September 14, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Item was delivered on time and without any damage. Item was correctly  described in the description."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UZC3L1JMW7MW"
                },
                "Date": "on April 15, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Michio Kaku is a wonderful writer and I have always enjoyed his books.  This book is no different."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GD04WWV2CUJW"
                },
                "Date": "on December 25, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I gave it as a gift to another Physicist & was told, best gift ever. He really enjoyed reading it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23QQ59MZB1NPO"
                },
                "Date": "on December 17, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Interesting but as a neurologist, I think several of his projections for the future are Jetsonian."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14QV7JNXXEUHS"
                },
                "Date": "on April 26, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Fantastic. I'm an engineer. Keeps me motivated. No math required to read. Just have an open mind."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TMOKHOJOF2YR"
                },
                "Date": "on March 17, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Mind twisting book. I like it very much as it is informative, thought provoking and challenging!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANYS3MXAVW751"
                },
                "Date": "on July 8, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Michio Kaku has a unique talent for making complicated scientific information easily understood."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CVVOOJZO98BH"
                },
                "Date": "on March 16, 2015",
                "Helpfulness": 0.5,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZSEHCPRENXJU"
                },
                "Date": "on April 26, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "As a scientific work it is great. I miss a discussion on the transcend side of things as well."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5NCKHFTESJIY"
                },
                "Date": "on March 11, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I am building a library and absolutely know this book would be a great addition to my library."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37XHUV1XP4MAE"
                },
                "Date": "on August 9, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Fascinating! Written for the lay person, so you don't have to be a scientist to understand it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VQCW2E1DLTRT"
                },
                "Date": "on March 26, 2015",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": "Too much beating round the bush and not enough actual meaningful content. Wouldn't recommend."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EQHKOGCQ7VZD"
                },
                "Date": "on February 11, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Just finished as I would be meeting the author!  Good recap and some thought provoking ideas!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AY8L766IZTIUT"
                },
                "Date": "on September 10, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Very thought provoking but goes off the deep end in the realm of plausibility at the end."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32NVE6MXDLDDM"
                },
                "Date": "on March 29, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Fantastic book -- must read for anyone interested in how our minds work and our future."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LNPSFF0SF6ZF"
                },
                "Date": "on April 30, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A very bold exploration of where the human mind/race may be headed - very provocative."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IR2T4V54KAN"
                },
                "Date": "on March 13, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Even if you do not always agree with the author this is an outstanding piece of work."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Q4R1II48NL3I"
                },
                "Date": "on January 28, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Bought this for my husband -- it's very interesting -- he's always quoting from it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7F7DSNUUMN9U"
                },
                "Date": "on September 29, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31HW12SE8F5XV"
                },
                "Date": "on April 9, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Wonderful book written by a fantastic thinker... one of the best of our age."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EEW13I2A4166"
                },
                "Date": "on June 7, 2014",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": "I purchased the book because I admire Dr. Kaku's brilliance, thus expecting some extremely deep insights into the workings of the mind.  While I did get some interesting info out of it, most of what I lerned is that Dr. Kaku likes movies quite a bit, and has extreme recollection of the plots of the movies.  Overall, it was an easy read with a little bit of information, but what I expected."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14EKCSB8UH3N7"
                },
                "Date": "on April 4, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I would have given it five stars but there was too much evolution in there."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AD4FIFB7Y7IVG"
                },
                "Date": "on August 9, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Well written and informative. The science is explained in everyday language"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QNRT3UU6MROJ"
                },
                "Date": "on November 3, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Watched this author on C-span.  He's easy to read and very informative"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3E7YNTSDME6O"
                },
                "Date": "on July 23, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "It bridged the gap between science and psychology and neuroscience."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARA1G3371L2FW"
                },
                "Date": "on October 22, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "arrived before stated date and as described. i enjoyed this author"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15UKLJMFB1B0K"
                },
                "Date": "on December 29, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Kaku is always thought provoking and interesting.  Love his work"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JVAYE0SNZDPQ"
                },
                "Date": "on April 5, 2015",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": "More hype and science fiction than empircaly-validated science."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GWLFY346LCQR"
                },
                "Date": "on July 17, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "One of the most important books I read in the recent few years."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14B2UCICDYQ85"
                },
                "Date": "on July 22, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This some interesting thoughts concerning man and the future."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QWIWVFX3S28H"
                },
                "Date": "on September 13, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PW154WB9U3XT"
                },
                "Date": "on August 13, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Fantastic book, gives us all hope for great things to come."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3P0NX5NHDN0YZ"
                },
                "Date": "on March 29, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Tough reading but enjoyable.... well worth the price......"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EF8RI5N5XYD8"
                },
                "Date": "on March 29, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Mind bending! Took me out of my comfort zone,but worth it!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKT64UJBVQ8JL"
                },
                "Date": "on August 28, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Fanstastic - a thrilling look into the future of the mind"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3V33BZ3PRUJA"
                },
                "Date": "on September 10, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A must read for the 21st century.  Outstanding author."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IZB368BG43JS"
                },
                "Date": "on July 11, 2014",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": "Had a really hard time getting into this book. Frankly I was put off by the writers intro where he detailed how smart he is based on grade school and high school experiences. I didn't buy the book for that- Also maybe it was just me but it was way too textbookie."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFCD2VYPAWKNG"
                },
                "Date": "on April 6, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGV3PPHY1R6HQ"
                },
                "Date": "on April 19, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great reading -- takes time to consider what he says"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PPHCBD6XX3CP"
                },
                "Date": "on May 10, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "the deliver was faster, and its quality is awesome."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEI955XH78ZHM"
                },
                "Date": "on December 13, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent report on the state of current research."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMIKMUQEIWVWD"
                },
                "Date": "on September 9, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Not for the faint of heart.  Truly mind blowing."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26KBN602ESEKU"
                },
                "Date": "on December 31, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "Okay but somehow out of his depth in Psychology"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2I4OV42LQPCZU"
                },
                "Date": "on December 10, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Wow! What an insight into our greatest asset!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATIIP8CC4VZG"
                },
                "Date": "on October 20, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Good stuff. Easy to read. Logical. Organized."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39LL20R2SV6SJ"
                },
                "Date": "on August 11, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great book. I plan to read more of his books."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12PT5KYOC8G5I"
                },
                "Date": "on February 17, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This was a gift for my son. He loves it :)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6Y9OCR2GAW8H"
                },
                "Date": "on October 1, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent book well written and reseached."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3H1YK5X5URUAE"
                },
                "Date": "on March 4, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Everything that I had expected, and more!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A693SAHWHT8BB"
                },
                "Date": "on April 26, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great book and everyone should read it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FOYIJOUQXAND"
                },
                "Date": "on April 24, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Very interesting. A bit of a slow read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1J3GG6KCZKPUX"
                },
                "Date": "on November 8, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Wonderful, I couldn't put it down!!!!!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OSGUPK30E8W7"
                },
                "Date": "on July 29, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great book!  Technical but fascinating."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UYM7EE8L7DSS"
                },
                "Date": "on April 3, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Michio is the Carl Sagan of our generation and he's done it again- inspiring enthusiam and passion for science in a very well written and exciting narrative. Would absolutely recommend."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23IWMKRJKJ93L"
                },
                "Date": "on January 4, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A fascinating and mind expanding read!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZC6JHVEDEY7T"
                },
                "Date": "on June 26, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Love this man and his genius works...."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5NSTZIMSI41F"
                },
                "Date": "on March 31, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Professor Kaku's books are excellent."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3S4N8J8CD32HP"
                },
                "Date": "on March 11, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Interesting, reads like a text book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OQJHAHGV6ZNP"
                },
                "Date": "on March 17, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "I like how Michio Kaku can explain complex ideas in simple enough terms that someone like me can understand easily.  I definitely will be ordering some of his other books!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ALT6K9P0MBYF"
                },
                "Date": "on December 24, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "One of the great minds of the day."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NHF3BDYIGLQC"
                },
                "Date": "on August 31, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I thought the book was facinating!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UA781X6OAA0I"
                },
                "Date": "on March 5, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Michio Kaku always makes me think"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MTW1ZAZQF32A"
                },
                "Date": "on December 9, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Real mind opening book Great Read"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24WBY9E5DZ3BW"
                },
                "Date": "on March 25, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great read, foll of information."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JJ3M5VGNXH57"
                },
                "Date": "on November 23, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent book as all of Michio!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PYZJF80GV77D"
                },
                "Date": "on January 15, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent...highly recommended!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FWRGZH2D2Q82"
                },
                "Date": "on December 26, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent book for the layman"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11VZJRIOETAGI"
                },
                "Date": "on December 23, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Well written and insightful."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24318MLS4BHSJ"
                },
                "Date": "on October 10, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "THIS BOOK WAS WELL EDUCATED."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A102IBR8SGO5N0"
                },
                "Date": "on March 27, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great product, great price!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1J3D08PJ3O92W"
                },
                "Date": "on June 30, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Written for the lay person."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASVE9V6FUTKJK"
                },
                "Date": "on March 3, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Love it, fascinating book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1T8DBNY6YBCU1"
                },
                "Date": "on October 22, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Heady talk by a physicist."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALGQGBBMOQZKQ"
                },
                "Date": "on May 29, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A183M9XE3IKG9A"
                },
                "Date": "on March 2, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Very interesting reading."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38NATQPH8E87C"
                },
                "Date": "on July 20, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Best mind of modern time."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PV05RRR8LGD0"
                },
                "Date": "on March 31, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Michio Kaku's research on the future of the mind is insightful and a must read for all scientists and educators."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AH687Z694PFGV"
                },
                "Date": "on August 4, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "wow! It boggles the Mind"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FPYSPNFA9CSO"
                },
                "Date": "on April 21, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "great read for everyone"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A386E8HC4Y22WM"
                },
                "Date": "on January 23, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "great item and service"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CV39BJEAYBHU"
                },
                "Date": "on November 12, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Wonderful book, thanks"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XPH68OABWU5P"
                },
                "Date": "on October 29, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Simply a great book!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AHDKGM508ZTO"
                },
                "Date": "on April 24, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I love this book :)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4K0W4LR9VS8O"
                },
                "Date": "on March 3, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "super interesting !"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AF5QGBXJ3Q3LA"
                },
                "Date": "on December 13, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "heavy readingfor me"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34SMZQURFMNGN"
                },
                "Date": "on September 17, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Fascinating stuff!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2C3AWVDT8GSQI"
                },
                "Date": "on February 27, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2398J9EQN6NLU"
                },
                "Date": "on April 15, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Very informative."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KJJFEO3B9TWY"
                },
                "Date": "on March 15, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Perfect condition"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1E1RQK80KS1YL"
                },
                "Date": "on September 29, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Daughter loved it"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EZ3XZUFW78GU"
                },
                "Date": "on April 15, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Very interesting"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1D7OA6FWOY1NX"
                },
                "Date": "on September 2, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3I48DYIJXSSWF"
                },
                "Date": "on November 20, 2014",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "An interesting read overall but compared to other works of his this book is weakened by pages of what can best be described as speculation from ignorance. To be clear the ignorance is not the authors so much as the lack of data in this new field of science, and he certainly does his best to wrap his brilliant mind around the current lack of knowledge about brain and mind. What we get is a book with some rehashed themes from his earlier books, all well grounded in physics mixed with a good overview of the current state of neurologic. Its good but not great."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AU51HI7K82KKR"
                },
                "Date": "on May 8, 2014",
                "Helpfulness": 0.5714285714285714,
                "StarRating": "2",
                "Text": "The book was boring and uninteresting. Much of the knowledge was pretty common sense. Wish I can return it. But I guess its too late now."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8BJC97DMFW3E"
                },
                "Date": "on March 17, 2014",
                "Helpfulness": 0.5714285714285714,
                "StarRating": "2",
                "Text": "too much speculation and hollywood fantasy muddies the picture of brain science present and future. did not even finish half of the book"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A257E7CAXQ5KFB"
                },
                "Date": "on March 29, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Life altering."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OKVLQVMKRPRW"
                },
                "Date": "on February 13, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Good Product ."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CC6U6F5FACPT"
                },
                "Date": "on January 10, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "As advertised."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21K5UBNHKI6NP"
                },
                "Date": "on July 28, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "WONDERFUL BOOK"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NS5V5F2H68FA"
                },
                "Date": "on March 23, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great book!!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3J04AKZJB0WOU"
                },
                "Date": "on December 9, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Amazing book!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PVHT3BF4K1L4"
                },
                "Date": "on July 5, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Amazing Book!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Z1YFC8Q0K2RE"
                },
                "Date": "on May 26, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "An amazing look at the brain and how it works from the view of a physicist. It examines the brain as an organ without the nonsense promoted by organized religion, yet it provides a corollary of the soul as it might exist in an organic form. Kaku examines concepts such as mind control, hypnotism, brainwashing, and telepathy as they relate to physics, dispelling many of the common myths about the brain. I was disappointed that Kaku didn't narrate the entire book, but the narration was well done."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AI0RR6SGS01W"
                },
                "Date": "on June 7, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABOMN292Q3OOI"
                },
                "Date": "on May 21, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Greata book!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A355CNF5IWY8WR"
                },
                "Date": "on March 19, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "interesting."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24IPP8IMT4LVR"
                },
                "Date": "on May 11, 2014",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "The book was well-researched and well-documented.  Kaku has tapped the thinking of the in the  fields of brain research, AI, and robotics. He goes beyond the current state of knowledge and explores essential questions of human/robot relationships, consciousness, extra-intelligent life, telepathy, telekinesis, and \"what ifs\", providing reasoned analysis of the possibilities each represents and the threats/benefits posed by each advance."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1M550TVS4KL5J"
                },
                "Date": "on May 8, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Interesting"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAU7MUUFOGIZQ"
                },
                "Date": "on March 29, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Incredible."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3P1URIBM1155P"
                },
                "Date": "on March 11, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Great book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KC9UQLVXJ8WJ"
                },
                "Date": "on February 2, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Interesting"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AEC8UMSZ4TFD"
                },
                "Date": "on January 12, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Fantastic!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5QUHOIYKNG8T"
                },
                "Date": "on December 30, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great book!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIRSMYEEFJ5QD"
                },
                "Date": "on December 1, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great Book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MZT3TRCW2HR4"
                },
                "Date": "on February 15, 2015",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "Dr. Kaku  has written a book that is nothing less than amazing. To really appreciate all the information presented, one must read the book and then begin again and read a second time. Although much of the information may sound like science-fiction, it details the startling discoveries  being made during our very lives. I highly recommend this book to anyone who is curious about science and the astonishing human brain."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NSAV80TLKZ2N"
                },
                "Date": "on April 30, 2014",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "This book is the \"deepest\" think I've had in a long while.  Many of the \"upcoming\" concepts he mentions and dissects are still beyond the average American reader, but Dr.Kaku's look at the \"cutting edge\" of brain science points each of us in a new direction for the events about to unfold before us.  Get this book and think - hard - about where we should next proceed."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20TYILZ1NTXN5"
                },
                "Date": "on April 11, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Must read!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KHNF04EM7C0G"
                },
                "Date": "on March 15, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "great book"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GZJCSARGHYDK"
                },
                "Date": "on December 1, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Awesome!!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DONBMVMFYDQ5"
                },
                "Date": "on November 1, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "insightful"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TB7084BX3KXH"
                },
                "Date": "on October 19, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great book"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Q2ZV2EX2VPH2"
                },
                "Date": "on August 23, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great book"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUUH363K6RHXO"
                },
                "Date": "on May 2, 2014",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AP7XGVR61GOIA"
                },
                "Date": "on June 9, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "This took the reader on a magical tour of the mind and how, in the near and possible future, it might be expanded, modified, controlled, traveled, recorded, etc.  Quite mind blowing and a good read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQ9PTTID9904U"
                },
                "Date": "on March 19, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "A lot of it was pretty familiar to me so I wasn't as enthused as with his last book (Physics of the Future). But the appendix on quantum consciousness was very refreshing and lays out some of his personal opinions which were quite intriguing."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A277ZN80TKK4US"
                },
                "Date": "on March 12, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "must read"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AW69DDZ8YIT93"
                },
                "Date": "on July 27, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JB8VC421BPXA"
                },
                "Date": "on May 10, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "My boyfriend was very happy to get this book as a gift from me.  He read it right away and loved what all Michio Kaku had to say and the way he explained it in the book......I made a mistake in my review of the book by Michio Kaku above titled\"Visions\"  It was older and all the information was dated...disappointed in it.."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASP64O0UDV7H8"
                },
                "Date": "on August 30, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "amazing!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28T49F8XOV7JS"
                },
                "Date": "on May 17, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Awesome"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AI00EGDEDW0X4"
                },
                "Date": "on December 26, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Awesome"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AI1H80LGGZVLS"
                },
                "Date": "on April 19, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Dr. Kaku is treasure.  For a similar take on what is transpiring, I recommend \"Pardon the Disruption.  The Future You Never Saw Coming\".  A trial lawyer explains modern science in a way that anyone can understand.  The parallels with Dr. Kaku are amazing."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADPQWEMTFD2HH"
                },
                "Date": "on April 24, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I loved this book.  It is an enlightening education about neuroscience and a great overview of what is in store for the human mind.  After reading it, I became a big fan of Dr. Kaku.  I have given this book as gifts and also recommended it to many others."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RHH60S10N3E5"
                },
                "Date": "on May 14, 2015",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "I thought Michio Kaku was a great scientist, he is common to say the least. He doesnt believe in the potential of the Soul and the Spirit. Remember that all peer reviewed journal articles are owned by a few companies of elites, with their own agendas."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A336QP8OSSLZ5V"
                },
                "Date": "on May 2, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "As a fan who came to know Michio Kaku through science channel shows I thoroughly enjoyed this book. It was written well enough that even someone with very little scientific experiece can understand and think critically about the concepts presented."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QP7YDCN3V6HQ"
                },
                "Date": "on May 9, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I had the opportunity to see Michio Kaku on Book TV (Cspan) - that encouraged me to purchase the book.  Dr. Kaku writes as well as he speaks and has an extremely fertile mind, and expresses his thoughts concisely and often times humorously"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHAZWGJZQAQ16"
                },
                "Date": "on January 1, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "thanks"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3V9BHNGP9UOP7"
                },
                "Date": "on April 27, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQ19PSHT740IW"
                },
                "Date": "on March 5, 2015",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "Prof. Kaku is not a neurologist or an expert on brain research.  He says so himself early on in the book and he is right.  Why in the world he is covering this subject is a mystery to me."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KMLCD6DU9XWI"
                },
                "Date": "on April 21, 2014",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "A very informative read - you have to take time to absorb and understand the concepts. To a certain point it asked as many questions as it answers. Not for the casual reader."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AQR3ZH0NVHGY"
                },
                "Date": "on May 9, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I have read all his books. They are very informative and I recommend them to all my friends. He has a great mind and knows how to put the information into plain language."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TJWA326OQYF3"
                },
                "Date": "on June 4, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Fascinating book with a great balance of science and well-sourced speculation. I enjoyed not only the content but his writing style. I have to read more of his work!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HS8L8SHTG9YC"
                },
                "Date": "on May 1, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Electronic book was purchased, downloaded and consumed exactly as described. Not a single hitch!!  Pricing was directly in line with hardcopy of book.  Thanks!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EMKV2FCLT9A1"
                },
                "Date": "on April 30, 2014",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "Very well written, with a good round up of everything happening in the science of the brain. Some scenarios stretch the imagination, but all in all a fun read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FJZ733QQXLG5"
                },
                "Date": "on April 8, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "This is a great book. It is easy to  understand and is very imformative. I truely enjoyed reading this material. I would recommend it to my friends and family."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TG0Z1E4PSWIW"
                },
                "Date": "on March 27, 2014",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "The book was very interesting in that it opened my mind to all the latest research that is being conducted to discover possibilities to expand thinking."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36WGB3RRRRPGT"
                },
                "Date": "on May 3, 2014",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "Well researched and logically presented. I would recommend this book to anyone Interested in expanding their understanding of the universe we inhabit."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A375PQBEIDKFJM"
                },
                "Date": "on April 29, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "It breaks the mind open, and explains in layperson's language how it works now, and will in the future. I have turned a number of people on to it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KFDHS1J8ZB0B"
                },
                "Date": "on April 7, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I got this for my husband and he loves it.  The book is so very interesting and the reading is well done.  I would recommend this purchase!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A361R2NM0WAU1Q"
                },
                "Date": "on April 17, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "This book provides a great overview from a theoretical perspective of how the mind works.  It's amazing!  Great book full of knowledge!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMUKE5VH441M4"
                },
                "Date": "on May 9, 2014",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "Michio Kaku uses layman's language and everyday analogies to make what could be rather difficult subject material an interesting read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1N84XDQKWUSUG"
                },
                "Date": "on March 17, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Bought it for my son - he's basically slept with it for a week. Highly recommend it for anybody interested in brain work and physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1B1CKA88XH7LP"
                },
                "Date": "on April 29, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Great reading - makes you think and stretch.  Look into the mind and look into the future.  Wonder where we are going as a species?"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GXPS8807B33N"
                },
                "Date": "on April 27, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "This was purchased to be given to a high school library, but I had to read it first.  It was easy to follow and thought-provoking."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10FL6H5CSDO1R"
                },
                "Date": "on May 24, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "top notch,  Amazing his research  to come up with all of this information. re the mind and brain. Uses physics to a grreat degree"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NKYFNYRZ1VQZ"
                },
                "Date": "on April 9, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUOYPU89LCSUW"
                },
                "Date": "on December 1, 2014",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "I thought it would be more of a page turner.  flow better.  I am only 1/2 way through.  May have to re-read it this winter."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RGLHY0ORXCY2"
                },
                "Date": "on April 16, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I haven't finished reading it yet, but have already learned so many medical and scientific things that I call it excellant!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1W83BB89AW23Q"
                },
                "Date": "on March 27, 2014",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "This was a well written book with lots of information in an easy to follow flow. A defiantly m ate re-read at a later date."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2U7DO1M4S6YSZ"
                },
                "Date": "on April 20, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Very interesting and thought provoking.  Loved it and will read it again next year.  Will probably try his other books."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZM8AO5UX32GS"
                },
                "Date": "on April 28, 2014",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "Amazing information. Read this if you want to know the potential of the human brain. Makes me want to be a scientist."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3K906926PLDTW"
                },
                "Date": "on April 20, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AL2OSJ5PF3K6E"
                },
                "Date": "on March 14, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I purchased this for my 13 year old son who is a science buff. He asked for the book & enjoys reading it!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2B40G800VX9FB"
                },
                "Date": "on May 26, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "a must read book, that will blow your mind for how we can be who we would love to be"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Y1C8K6SYPKFJ"
                },
                "Date": "on April 30, 2014",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "3",
                "Text": "A lot of this was very interesting and gave a good summary of research that is going on that might be cutting edge.  However, a lot of it seemed conjecture and it darted back and forth to irrelevant topics such as aliens from outer space and physics that had nothing to do with the mind."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVNWPKI4MEEZ2"
                },
                "Date": "on October 13, 2014",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "Well written and easy for a lay person to understand."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A386DOTOR4MSP"
                },
                "Date": "on July 9, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "A great book. need more.  Thank you Santo"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APGHEZ71395F8"
                },
                "Date": "on February 22, 2015",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": "Stopped reading it half way. Boring"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23KQI4VC2UPEJ"
                },
                "Date": "on August 24, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUDSM2CTLLW1Q"
                },
                "Date": "on February 12, 2014",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3G8QY0MC6CUPL"
                },
                "Date": "on October 13, 2014",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "Kaku is an extremely clear writer. Yet he can't know everything. He is a physicist writing about the brain, animal behaviour and animal brain anatomy.  He constantly make incorrect statements about how humans are unique or superior to all other animals. It is a rather old-fashioned Christian view. His book needs a fact checker for each of the wide-ranging topics it covers."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VWV3OS8KSYE5"
                },
                "Date": "on April 12, 2014",
                "Helpfulness": 0.5517241379310345,
                "StarRating": "1",
                "Text": "Kaku totally forgets half of the brain, glia cells, which control the neural part. MRI devices can't see glia cell."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABF0ARHORHUUC"
                },
                "Date": "on February 13, 2014",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3H4PQ70KL07X7"
                },
                "Date": "on March 25, 2014",
                "Helpfulness": 0.25,
                "StarRating": "2",
                "Text": "I love the author but this book is very difficult to get through. Kaku can make your imagination soar but I found this book to be a chore to get through . I hope he sticks to physics in the future ."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DB5RXW4J247S"
                },
                "Date": "on March 15, 2014",
                "Helpfulness": 0.45454545454545453,
                "StarRating": "2",
                "Text": "Except for adding some interesting information the book is a pretentious display of the author's putative knowledge. Particularly annoying is the adjustment of the definition of consciousness to make it accessible to the author's approach."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KJN3D7382O0"
                },
                "Date": "on March 6, 2014",
                "Helpfulness": 0.5454545454545454,
                "StarRating": "1",
                "Text": "the author presents scant review of anatomical brain features and imaging machines that are never integrated into future possible wonders of what brains may be able to do. this is old readily available filler.  there is little real science used to support the possibilities he envisions.  it is at best titilating popularism like science based tv entertainment."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NC2SVIBLO54U"
                },
                "Date": "on March 20, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EUSNRAYEQBA8"
                },
                "Date": "on April 11, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Love love love this pale punk lip color. Avocado oil makes it very moisturising on lips easy to apply also"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AN9SI3FGT5XWN"
                },
                "Date": "on October 29, 2014",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "oretty deep"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TZ8FR8HFVKPS"
                },
                "Date": "on March 7, 2014",
                "Helpfulness": 0.48,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22RY8N8CNDF3A"
                },
                "Date": "on February 27, 2014",
                "Helpfulness": 0.2727272727272727,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36UN0MOIZXA8B"
                },
                "Date": "on March 10, 2015",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": "Blah.  Blah.  Blah."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEW050OQBWJO2"
                },
                "Date": "on July 11, 2014",
                "Helpfulness": 0.25,
                "StarRating": "1",
                "Text": "Reminiscent of Bill Cosby's monolog \"Why Is There Air\" only not nearly as interesting or informative."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36WHIZPOEHU2C"
                },
                "Date": "on April 15, 2014",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFWE4AMQWDJSM"
                },
                "Date": "on February 27, 2014",
                "Helpfulness": 0.40476190476190477,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20FAK4PMJAMOT"
                },
                "Date": "on April 6, 2014",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "1",
                "Text": "Little new, too much quoting of science fiction literature and other verbal padding.  The Amazon review guidelines are stupid -- why to I have to put in a minimum number of words -- to waste peoples time!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12Q440YETJCMQ"
                },
                "Date": "on March 8, 2014",
                "Helpfulness": 0.09090909090909091,
                "StarRating": "2",
                "Text": "There were interesting parts, but for most of the book it concerned the future and the possabilities. The point is--I won't be here, so why should I care?"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BMH096MZQRLL"
                },
                "Date": "on March 1, 2014",
                "Helpfulness": 0.35,
                "StarRating": "1",
                "Text": "This book does not really investigate mind and consciousness...just one human mind. It looks at other minds through a human centric lense. Kaku presents such a contrived hierarchical structure to consciousness that it would make me laugh, except speciesism is no laughing matter, and this book is clearly a step back for evolution."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A160TR1XHM5WX8"
                },
                "Date": "on May 20, 2014",
                "Helpfulness": 0.2,
                "StarRating": "1",
                "Text": "Kaku needs to stick to science fiction (which he seems very fond of) I guess there will never be another Sagan or Bronowski."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RPGWF6I86FRS"
                },
                "Date": "on February 26, 2014",
                "Helpfulness": 0.3008130081300813,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHU7MK015R6XN"
                },
                "Date": "on April 6, 2014",
                "Helpfulness": 0.17777777777777778,
                "StarRating": "1",
                "Text": "The most critical knowledge is to be able to know what creates mental illness (ie heavy metals) and how to cure it with heavy metal chelation therapy. The fact that this frustrating individual goes to say there is no cure and people get it wearing pots on their head is insane. And, it is frustrating to see this authors popularity which encourages unsuspecting consumers too have dangerously incorrect knowledge. When the public holds someone who is unknowledgeable at a high state of respect then the masses become stupid. I think it is time for humans to accept that these heavy metals all around us are causing insanity, psychosis, mood swings, halucinations. This is a known fact that doctors refuse to allow you to know (how? they have a high regard in the community)(Why do they not tell you? #1 Money-they can make a lot of money selling drugs from glaxo smith klein who had a 3 billion dollar fine 2 years ago due to corruption. Im so sad that Americans are allowed to get sick, forced to live a low quality of life, forced to stay out of work and rely on big government. As Reagan said \"we are not the solution, we are the problem. Someone needs to let the consumers understand where psychosis comes from and how to get rid of it ie chelation chlorella alfalfa cilantro nac apple pectin onions garlic etc etc vit c. Dont be a victim to corruption all around us."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Future-Mind-Scientific-Understand-Enhance/product-reviews/0307473341/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "518"
    },
    "Salesrank": "#3,991",
    "Timestamp": "2015-05-24 12:28:50.081574",
    "itemurl": "http://www.amazon.com/Future-Mind-Scientific-Understand-Enhance/dp/0307473341"
}
