{
    "Category": "in Books (",
    "ListPrice": "$16.00",
    "Name": [
        "Genesis and the Big Bang: The Discovery Of Harmony Between Modern Science And The Bible"
    ],
    "OfferPrice": "$13.97",
    "Reviews": {
        "AverageStarRating": "4.3 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALPWKGUY9H1K6"
                },
                "Date": "on August 22, 2001",
                "Helpfulness": 0.9642857142857143,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AZ7VA51PUG5G"
                },
                "Date": "on April 12, 2000",
                "Helpfulness": 0.9272727272727272,
                "StarRating": "5",
                "Text": "Schroeder's insight helps to bridge the gap between science and the bible (particularly Genesis). After the first days of creation, the bible very much follows the geological and historical record, so why is Genesis so  seemingly out of alignment? (for me, this has always been a tough nut to  crack) This book presents a viable explanation of the reconciliation of the  two opposing viewpoints, utilizing astrophysics, the Theory of Relativity,  and the theory of the Big Bang to hypothesize a secular model that might  overlay on the traditional theistic belief of the six days of creation. I  urge people to weigh the reviews here carefully because there are several  negative reviews here that might have caused me to skip over this book.  Some seem to suggest incompetence on the part of the author and/or  mistakes, but none offers any substantial explanation. I am not a Ph.D.,  but I have a decent background in physics and while this book may be based  on principals and equations that are not for the layman, Schroeder does an  excellent job of presenting the case for a marriage of the secular and  theistic viewpoints that anyone can easily grasp. He is also an  unquestionable authority in his field, with an impeccable reputation."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FS66MS8FRSXI"
                },
                "Date": "on February 22, 2001",
                "Helpfulness": 0.953125,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AK81WLVD5KGUX"
                },
                "Date": "on April 10, 2000",
                "Helpfulness": 0.9310344827586207,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on November 22, 1998",
                "Helpfulness": 0.9310344827586207,
                "StarRating": "5",
                "Text": "Dr. Schroeders book explains that the Biblical story of creation and the scientific theory of the Big Bang are in agreement; the world was created in 6 days AND 15 billion years, simultaneously. Using relativity,  experimental and theoretical science, physics and the Jewish sages, he  shows how science and religion are compatible. It is easier to read if you  have a basic background in physics and math, but I think he has done a  wonderful job of simplifying the theories to a level that someone without  this knowledge can still easily read and understand this book.  Highly  recommended!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWJVPLC8FJAXE"
                },
                "Date": "on October 28, 2005",
                "Helpfulness": 0.9411764705882353,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IB64VAW6B28J"
                },
                "Date": "on May 30, 2000",
                "Helpfulness": 0.875,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2T4Y8DAMG5F5Y"
                },
                "Date": "on January 24, 2000",
                "Helpfulness": 0.8666666666666667,
                "StarRating": "3",
                "Text": "This is definately a book worth reading and particularly comparing to the books by Hugh Ross.  I found some of the arguments to be unique and well  thought out. WARNINGS: if you would like to better undertand the theory of  relativity, Hawking does the best job of explaining it, so it may be a good  idea to read 'A Brief History of Time' in order to fully understand what  Schroeder is proposing.  ALSO: check out his theological statements with a  good concordance handy, and if you are a Christian, understand that some of  the traditional Jewish methods of understanding scripture are not used by  serious Christian Theologians.  Overall this book is good, it has some new  interesting ideas, and if read with the above in mind, is very enjoyable,  and is a book worth reading."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18GC50PQOBTCR"
                },
                "Date": "on August 3, 2001",
                "Helpfulness": 0.9090909090909091,
                "StarRating": "5",
                "Text": "This book brings intuitive notions into full view. The beauty of  Schroeder's idea is how simple and harmonious  the connection between observed reality and biblical revelation can be. That the two seemingly incongruent viewpoints of faith in science and faith in god can be reconciled seamlessly is a worthy investigation even for the most skeptical among us (including the author himself). Highly recommended for those who find themselves on either side of the debate."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JQJ339HF257S"
                },
                "Date": "on August 1, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NKOHTV2VYGY9"
                },
                "Date": "on October 29, 2000",
                "Helpfulness": 0.8888888888888888,
                "StarRating": "5",
                "Text": "I am a big fan of Gerald Schroeder and I thoroughly enjoyed this book. I would recommend you also read \"The Science of God\" if you are interested in creation theology and God from a physicists point of view. I am glad someone is finally going in the right direction with creationism! Schroeder carefully examines the scientific facts that help prove and explain creationism. This book is a must read for those Christians who are interested in learning more about the Bible from a modern viewpoint. Another standing ovation to Dr. Schroeder."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGKSHUO5VT2GJ"
                },
                "Date": "on February 17, 2004",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": "This was one of the best books on the subject of Science and Religion and the support each gives to the other, I have ever read.  Many insights supported beliefs I already harbored, some provoked new thoughts or touched base on what had not occured to me and definitely inspired me to read more.  I have now read all three of Gerald Schroeder's books each one as inspiring as the last. And never once did I feel that there was any conflict with the traditional Biblical account I learned through years of church influenced study. I highly recommend all of Mr. Schroeder's books to anyone who is seeking personal growth and understanding of their beliefs."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALDRY40BPNY09"
                },
                "Date": "on February 2, 2006",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": "This book has enlightened me, but not convinced me on the literal meaning of the bible.  If my understanding is correct he believes in \"punctuated equilibrium\" through God's hand.  Interpreting the first book of the Torah through the english language can be problematic.  If one is to behold Genesis through Hebrew a whole new meaning can be derived.  There are a couple statements he has made that I question.  There are also some areas that he did not cover, leaving holes.  Other creation books, such as Morris should be added to the reading.  We all need to realize though, there are some things that are unknowable.  Overall, an extraordinary book.  He flows information from the previous chapters in to the next very well.  The probability that life erupted by pure chance is so astronomical it might as well be 0.  For those of you who believe in a literal bible, this book will give you new insight.  For the atheist, you may need to rethink.  For those of you somewhere in between, this books for you."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33INPC3M8DFQ0"
                },
                "Date": "on February 8, 2008",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "I have long believed that Man's endowment with a soul by God was the \"beginning.\" It was exciting to read and follow the logic Dr Schroeder presented that confirmed, in my mind at least, what I had come to believe. Anyone who wants to believe that the age of the universe as computed from the Bible and by science can be the same should read this book."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on April 8, 1997",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34QGZBQIG3U0E"
                },
                "Date": "on October 27, 2006",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "4",
                "Text": "Dr. Schroeder enlightens readers with easily understandable wording of complex cosmological concepts.  He shows that the biblical account in Genesis is in no way out of harmony with modern science.  According to Galileo, the Bible has never been out of harmony with science: \"The Bible teaches us how to go to heaven, not how the heavens go.\"  Many of Schroeder's books deal with physics and God; this is a good introduction to his work.  I also recommend following up with \"The Hidden Face of God\" and \"The Science of God.\""
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 5, 1997",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I continually return to this book as I begin to understand bits and pieces of physics and cosmological theory more thoroughly. It is fascinating to ponder the source of medievil inspiration which led philosophers like Nahmanides to propose theories identical with those of modern cosmologists for the origin of our universe. Gerald Schroeder's explanation of difficult (for me) relativity and quantum mechanic theories were especially enlightening. Read together with other popular physics explanatory texts, such as Stephen Hawkings \"A Brief History of Time\" and Richard Feynman's \"Six Easy Pieces\", my understanding of our universe is starting to come together, and the whole process infuses my mundane reality with wonder and appreciation"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SODXMJL0JGID"
                },
                "Date": "on February 26, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2X2QPHVQJ6OO"
                },
                "Date": "on March 12, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book has a lot of interesting things in it. I was especially intrigued by the suggestion that the difference between modern humans and humanoids (human like creatures that existed during pre-Adam era) is ability to understand and keep time. That allowed humans to play role of, what Albert Einstein called, an \"Observer\", thus making the Earth another reference point. This is what makes us God-like and provides possible explanation of biblical time line."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AE8LL9S715YTE"
                },
                "Date": "on September 25, 2007",
                "Helpfulness": 0.8,
                "StarRating": "4",
                "Text": "Recently I have begun to study books that deal with the combination of theology and science.  The reason for this is that, as I go through my seminary training, I realize that it is vitally important that I understand (as best as I can) God's creation that surrounds me.  Especially when dealing with the bridge between Genesis and science.  Thus when I found this book that explores the subtle nuances between Genesis 1 and 2 and science, such as the cosmology and theology of the Big Bang, God's relation to the science of relativity, among other points to ponder, I was quite happy.  While I understand some of the math behind cosmology and theoretical physics, this book is easy for both the scholar of theology and science or the mere layman who wishes to understand the balance between God and science.  Schroeder's work is easy to understand, comprehend, but has so much depth that you are often left breathless by the possibilities found herein the book.  Schroeder is engaging, friendly, so you feel like you are sitting with him drinking a cup of tea while talking.  The book is not a large book, doesn't have to be, and he doesn't waste words.  You are not going to get a lot of fluff theology or science, Schroeder takes his time and makes each point poignant.  I highly recommend that students of theology and/or science to pick this book up and see where it leads you-but be warned, you must have an open-mind when reading this book.  If you are coming to this book with either a set presupposition (theologically speaking or scientifically speaking), then you are not going to allow yourself to learn.  The only problem is that the book needs to be updated--I would like to see information on dark matter, I would like to see information on cosmic black holes, I would like to see information on the many-worlds theory.  Still, a great and timely book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KO42HZ7IWJNU"
                },
                "Date": "on August 31, 2009",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VQVQU2O8JC1Q"
                },
                "Date": "on January 15, 2006",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 7, 1999",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": "Dr.Schroeder's book is clear and concise, aligning a Biblically based explanation with up to date scientific discoveries. It will appeal to the average layman while satisfying the intellectual cravings of those familiar  with Relativity, Cosmology and Quantum Mechanics. The books goes into  adequate detail to show that the modern understanding of Cosmology was  understood by those who knew the revelation in the Hebrew Bible much  earlier. It firmly establishes a rational foundation for belief in a God of  creation, the God of the Bible."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KJO5VP4K3CHU"
                },
                "Date": "on December 14, 2009",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LVDYPSMWV4ST"
                },
                "Date": "on September 7, 1999",
                "Helpfulness": 0.7272727272727273,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3U071HT2M7Q6P"
                },
                "Date": "on January 11, 2014",
                "Helpfulness": 0.75,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A150CAM545UHDC"
                },
                "Date": "on October 27, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This was my first exposure to Gerald Schroeder and what a fabulous book it was. As an MIT physicist and a Jewish theologian, he is uniquely position to bring the Bible and science into conformity. Many people reject the Genesis account because of the \"seven days.\" How can we reconcile that with a geologic history that tells us the earth is millions of years old. Without ever compromising his scientific credentials or his Jewish faith, Schroeder bridges that gap and explains the seemingly unexplainable."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A282OQNXH7QFC7"
                },
                "Date": "on July 14, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "the harmony of God and the physical universe has never been a question in my mind. this book shows some of the ways that the way genesis is written may be in more harmony with science than most people may have thought. some of the \"young-earthers\" should read this. if albert einstein was here to read it, i wonder what his thoughts on it would be... for he once said:\"..i want to know God's thoughts...\"."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LQHDWGFS3IYV"
                },
                "Date": "on March 7, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Schroeder helps us see the connection between science and theology.  A highly MIT educated scientist who helps us see his \"evolution\" from atheist to a believer in the Bible and the story of Genesis and its agreement with the secular story of Creation and the Big Bang.  There are times when trying to understand the Math is tough going but well worth the effort."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KMURDIGM1UE6"
                },
                "Date": "on October 25, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I'd read this book years ago and was pleased to find it again. As a lifelong Christian, it reconciled my feelings that faith and science did not need to be exclusive regarding creation. I can only 5-10 pages at a time as it really causes me to think and digest the material."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FRIOPRVZF00N"
                },
                "Date": "on August 7, 2013",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2A7V2XCA052LN"
                },
                "Date": "on February 10, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QVFNB1IUFURN"
                },
                "Date": "on October 2, 2008",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "The author presents a difficult and interesting topic that includes the theory of relativity, E=MC2, etc that is easy (or at least more easy) to understand than other books on the same topic."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEDQ8XK98CDX7"
                },
                "Date": "on August 22, 2003",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "4",
                "Text": "The author goes to great lengths in this work to bridge the gap between science and the bible (particularly Genesis) calling upon astrophysics, the Theory of Relativity, and the theory of the Big Bang. But if you do not have a background in physics or math then you might find `God, Science and the Cosmic Jigsaw', by Jonathan Kingsley, an easier read. The latter covers the same ground, but in a very different way, and one in which any reader can get to grips with by the simple application of logic. Kingsley's hypothesis is that there was a two-phase creation - evolution followed by divine intercession as part of God's overall plan - and Genesis is shown to agree with this very well. Thankfully, he also debunks Erich von Daniken's theories about us being descended from spacemen, as fall-out from his own theory, by providing the evidence that Adam (son of God) was God's divine creation from the `dust of the earth' - in fact, divinely created using the genetic blueprint of evolutionary man - and that the Fall of Man resulted from interbreeding between the divine and evolutionary races. Heady - but interesting - stuff. So you may care to read both these books - but don't overlook Kingsley's, if this is an area that intrigues you!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2G9FELU06TPAH"
                },
                "Date": "on February 17, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "An insightful evaluation of how the big bang fits into science and scripture. I must read for anyone who wants to understand the creation of the world from the viewpoint of a scientist."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SM1WJQ76UTVM"
                },
                "Date": "on May 3, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "It's one of the precious few cases for God's method of cosmic creation . . . an authoritative voice crying in the barren wilderness of scientific speculation."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10GLSAKL9O6AG"
                },
                "Date": "on April 16, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "A great read, full of interesting, thought provoking statements as well as capturing key ideas in a very readable and understandable phrasing."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A278SZCPM9C1FP"
                },
                "Date": "on February 5, 2011",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1J0VB53851INB"
                },
                "Date": "on August 26, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is a fascinating explanation of how a literal interpretation of the first chapter of Genesis and the evidence which is actually in science can be reconciled.  I am almost finished with the book (only 186 pages) and am then going to read it a second time.  I know that I will get so much more from it doing that.  This is a must reading for anyone who has thought that a person has to be either in the Bible camp or in the science camp.  My favorite part was how Adam and Eve could be the first humans of our species but not be part of mankind that was created on the sixth day.  Oh, another good part is the relativity of time and how 15 billion years and 6 days could be speaking of the same period of creation.  And then, learning the actual meanings of various Hebrew words is good.  And then, how the scientific world ignores the fossil record that supports special creation.  Oh well, I'll stop there."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A287Q2ZUJHBJVA"
                },
                "Date": "on January 7, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAOW5P55K16L5"
                },
                "Date": "on September 20, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16ZJUY82YZO5Z"
                },
                "Date": "on December 23, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Watching him turn my understanding of the Bible's account of creation, into his MIT physics-professorial-big bang understanding, was the intellectual equivalent of watching a magic show! I can't claim I followed along with all the math and science, but I definitely was shocked at where he ended up with it. He has given me the tools necessary to be a bible toting big banger, an invaluable resource to being fervently religious, & devoutly scientific. My new motto: If you think that science doesn't concur with God given wisdom, either you aren't all knowing in science, or you aren't all knowing in God-Wisdom. A premise I think is wonderfully apt to most situations."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACUHL3VC0GI8H"
                },
                "Date": "on June 28, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YA14UAWOHUH8"
                },
                "Date": "on January 8, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Although I don't agree with his end conclusion about pre/post Breath of Life man, I definitely enjoyed his explanation of Genesis in the context of Physics.  Overall, I would call this a reference book with a permanent spot reserved for it on the bookshelf.  It got a little dry in places and I had to force myself to continue, but his viewpoint was very intriguing and made a good read.  Definitely a book I would recommend for anyone interested in the Creation/Evolution debate."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1F0CDY5GA9H6N"
                },
                "Date": "on December 1, 2009",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQK0MQFRBADJ1"
                },
                "Date": "on November 19, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "An excellent read! (Two Jews got arguing and a book happened...... [read the intro!]) Mr Schroeder conveys difficult topics well; understandable, intriguing, and with touch of humor that I found most amusing. {...\"would make an agnostic say, \"God Forbid!\"\") The historical sources quoted are indeed thought provoking. A 'rocket scientist' and a Rabbi??? Yep. Strange 'bed-fellows' perhaps, but a catalyst for a new perspective."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZFT5P4DKDJ14"
                },
                "Date": "on August 4, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Gave it to my husband as a gift after parts of the book were referenced in our Sunday School class. Definitely generated lots of discussion by class members! I haven't read the book yet, but my husband said it was good, just not an easy read. Included many references to principles of physics and required that the reader \"pay attention\" as the concepts are explored."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAG0HOT8NI4XB"
                },
                "Date": "on January 30, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Anyone who wonders how 15 billion years of creation could fit into 6 days needs to read this book.  The two time periods are actually the same depending on which inertial frame of reference you are using.  He does an excellent job of explaining that."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Z8OLSNBLS4T4"
                },
                "Date": "on December 20, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I ordered this book and two others as supplemental material for my grandson's sixth grade Earth Science, and next year's seventh grade Life Science. I was not disappointed."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QH6BZEHG9SOM"
                },
                "Date": "on November 22, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A difficult read for anyone not well versed in science. It is worth the effort though to understand the relationship between science and the Judeo-Christian religion."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38GDZTTE6LKUI"
                },
                "Date": "on September 30, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A must read for anyone, especially one who doubts the veracity of the Bible.  Its great value lies in its treatment of both science and the Bible."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IFVCZO46CM5O"
                },
                "Date": "on October 4, 2012",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "I found this book to be extremely difficult to understand. I stayed with it as long as I could hoping that I would reach a point where it would begin to make sense but a quarter of the way through I had to surrender to defeat and move it to archives in my kindle. Very disapointing as many reviews made it seem to be one of the more easy to understand books on this topic, no so for Me !!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2949OGCSNHA7B"
                },
                "Date": "on January 6, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Loved the book; it was quite meaty and difficult to read but the most important issue for me was to have an informed postion about this very difficult issue of creationism and evolutionary theory. I came away wanted to learn more about something I had never delved into. I thank my son for leading me onto a path of learning more in a balanced way."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RM5AON7FU64Y"
                },
                "Date": "on November 30, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This book has reconciled both my faith in G.od and my curiosity in the scientific version of the world. Now I can see that the Bible has indeed all the pre-requisite to a modern understanding of the creation. This is a book which I hope many people, believers or non-believers, will read. It will explain what nations of old knew all the time."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQLKQ2B37EUNE"
                },
                "Date": "on July 2, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "If you want to learn about the universe from the first few nano-seconds until about now - how it developed from almost nothing - and get it in plain English - that even I could understand mostly - this is the book - I have read it about 4 times and I'll start it again when I finish it - it is just so great - and so much information -"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EH5MMR4NN8JN"
                },
                "Date": "on June 12, 2006",
                "Helpfulness": 0.625,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AXPR4D5GZ7DA"
                },
                "Date": "on March 20, 2010",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATO7RJQYBUXJK"
                },
                "Date": "on April 4, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "What an eye opener ... no, what a mind expander! So, an infinite number of monkeys on an infinite number of keyboards cannot write a poem. Instead, you end up with an infinite number of monkeys beating each other over their heads with keyboards. They also defecate on them. They do not randomly create a universe."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2G777Q71U2RLP"
                },
                "Date": "on February 9, 2010",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The author reviews the apparent discrepancies between the story of the Creation in Genesis and the Big Bang Theory and resolves all conflicts. The author is a superb Bible scholar and witnessed the Atom Bomb test at Alamogardo, NM in 1945 as a contributing scientist. Superb read and full of facts."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LP03H0UAOENB"
                },
                "Date": "on June 14, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I love the insight by Dr. Schroeder in that Genesis does indeed agree with science discoveries, in that what we have discovered so far in science. How he surmises the understanding of Einstein's theory of relativity and the understanding from G-D's perspective in telling how creation happened."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A302NAWYASGHQ1"
                },
                "Date": "on October 22, 2012",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUCU7LORZWQVA"
                },
                "Date": "on December 6, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great book that explains alignment between science and the Bible. I am shocked that the church hasn't embraced this book and made it a classic.!!!  The knowledge given to Einstein allows a multiple billion year old earth to be made in six Biblical days."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOECSE1Z7XDY8"
                },
                "Date": "on February 26, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1R9AFG6TL9YJN"
                },
                "Date": "on January 7, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "As a Christian who knows our roots are in Judaism this volume helps to bridge the perceived but false difference between current scientific thought and our shared faith in the Creator.  He is an excellent and credentialed apologist.  Devour his works!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WTSH3COK9EBF"
                },
                "Date": "on August 20, 1999",
                "Helpfulness": 0.625,
                "StarRating": "5",
                "Text": "Dr. Schroeder has demonstrated that our understanding of science has progressed to a point which can reconcile two seemingly exclusive positions.  When Einstein showed the world that time was relative, he  simply caught up to something clearly declared in Psalm 90.  It has taken  the better part of a century for someone to make a case which, in  hindsight, is quite obvious.  This is not to say that Dr. Scroeder should  not be accorded every credit.  For sometimes, true genius is evident when  someone sees something new in the familiar as opposed to something new in  the never seen.  Schroeder skillfully combines a scientists critical  thinking and a keen cosmological awareness with the the surprisingly astute  observations of the kabalists of the Middle Ages.  A must read for the  skeptic!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AB1K94PN7BR68"
                },
                "Date": "on March 15, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The Bible and science. Science and the Bible. There's no reason to choose, as they dovetail seamlessly, as this book posits and proves. This is a great read for someone who really wants answers."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1H4EXG48SN94S"
                },
                "Date": "on August 10, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The book allows us to really understand the Genesis as it deconstructs the literal interpretation paradigm. Besides, the author's writing style makes the reading flow very easily."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANQP47QMWA9OM"
                },
                "Date": "on August 2, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A great book for the inquisitive believer that wants to know how the cosmos and Genesis meld perfectly together. I have read it a few times and quoted it endlessly. Enjoy."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NE1VAGEOJDFC"
                },
                "Date": "on October 22, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I'm happy to have found Mr. Schroeder's books. His views on the compatibility of Science and Theology are presented on a foundation of wisdom and education."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A174DKZY6ZBZL2"
                },
                "Date": "on September 29, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I enjoyed this book.  It was well written and very informative.  It makes sense, utilizing the biblical explanation as well as the scientific explanation."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BXKZK233H8FE"
                },
                "Date": "on March 7, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book along with the author's book on \"The Science of God\"  does physics of the evolution of the universe a great compliment."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJ1DNC0M94CUN"
                },
                "Date": "on July 25, 2010",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A very lucid and easy to understand explanation on the big bang from an author who believes in God. I really enjoyed reading the book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23HLHU7W60S4B"
                },
                "Date": "on July 19, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Really gives you something to think about.  Makes perfect sense.  I did not agree with the last part about living things though."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EHBLN7H53P94"
                },
                "Date": "on August 6, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I have ordered this book for some of my friends.  It approches creation in a scientifc manner.  I keeps God in the equation."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15EVINMP9H70E"
                },
                "Date": "on October 30, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 16, 1997",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Dr. Schroeder's book is an excellent, enlightening book that works wonders in the reconciliation of Judeo-Christian Creationist tradition with modern astronomy, comsmology, and biology.  I recommend this book to all"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAT6DFR1B7JJQ"
                },
                "Date": "on February 22, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent, logically reasoned and explained"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1578WQR3CDEA"
                },
                "Date": "on March 11, 2015",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "difficult to read, small typography"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2X4HEQLEUYHMD"
                },
                "Date": "on December 30, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Excellent presentation and exposure"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3L2GA7ZGW0G0N"
                },
                "Date": "on April 9, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "appreciated the punctuality"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39SJGCFMD6V21"
                },
                "Date": "on June 21, 2002",
                "Helpfulness": 0.6111111111111112,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SG5S0HB2G7C"
                },
                "Date": "on March 14, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Wow- must read!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8JZUGRRXOQCR"
                },
                "Date": "on August 31, 2009",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "fabulous book, well written and convincing,gives clear lucid answers to the perplexing and glaring discrepancies between the eternal bible and modern scientific discoveries."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3U4DK07B1YSAQ"
                },
                "Date": "on February 22, 2006",
                "Helpfulness": 0.375,
                "StarRating": "5",
                "Text": "I am currently finishing one of his other books.  In all I have read 3.  I think Dr. Schroeder aproach is very good.  I do not have a back ground in physics but I am thinking of maybe taking some classes to continue on what I have read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LJ9HW5OH88IY"
                },
                "Date": "on October 10, 2014",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": "A fascinating book!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Y8CLNTCLR04O"
                },
                "Date": "on August 25, 2001",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": "While some attempt to refute the bible with science, others attempt harmonisation. _Genesis and the Big Bang_ is one such example. Gerald Schroeder is described as being an applied physicist and theologian. It is my belief that the latter rather than the former is the victor when it comes to Schroeder's belief system. He is a very clever man that has a dream to reconcile those ever persistent foes: religion and science. If you don't have a very scientific background and you believe in a God (whatever form, shape and name you care to ascribe to him/her/it), then you will love this book. Schroeder carefully assembles a set of arguments using scripture and scientific discovery to convince the reader that the universe which is billions of years old and the account in Genesis (Six days of creation) are the same. He uses Einteinian physics to declare that from God's perspective the creation took 6 days, however from our perspective it took billions of years. He harmonises the two by briefly(!!) going through the theory of general relativity and explaining how this could be so. There is unfortunately a large flaw in his argument. His theory will hold as long as science doesn't change its mind as to the age of the universe. Already it has been reported that the universe is indeed slightly older, and therefore Schroeder's theory comes tumbling down. In my opinion this book is basically for those readers that would like to explain away the discrepancies between Science and Reigion using 21st century scientific technology. This is an insult to anyone who knows better. I personally am of the mind that religion and science should remain in their separate domains. Unfortunately, when they are brought together, feathers fly when analysing all the inconsistencies. Another important point that I might mention is that Schroeder lectures in Israel, to would-be orthodox Jews and attempts to fill their young impressionable brains with his theories to comfort them as they swim in a world of science. What might be shocking to some of the more conservative amongst his readers is that he fully acknowledges the concept of biological macro-evolution. Usually in orthodox circles this is a no-no. However he interestingly integrates the concept of prehistoric man in his theory claiming they were one of the animal varieties in the garden of eden that Adam didn't want a relationship with. This is an interesting twist to the theory, however as with many of the apologetics that ooze from the mouths of theologians with an agenda, it is pure speculation and has no factual basis. Furthermore, if one looks hard enough in the Bible or post-biblical writings, one can find a proof or justification for virtually anything. Unfortunately, for every point of view that you find justifying your position, you can find two that contradict it. Overall, I must admit that I enjoyed reading the book, unfortunately Schroeder was unable to convince me that his theory was anything more than a product of a very vivid imagination. I do recommend that people read the book and come to their own conclusions. Jewish readers may find this book more relevant to them as it cites many post-biblical Jewish sages, however it is written in such a way that it can be relevant for any type of audience."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1M8NEGBOGRO11"
                },
                "Date": "on October 11, 2005",
                "Helpfulness": 0.25,
                "StarRating": "5",
                "Text": "Good service, fast delivery and book was in excellent condition and most interesting."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39BY6USJ8VRNY"
                },
                "Date": "on January 11, 2004",
                "Helpfulness": 0.2222222222222222,
                "StarRating": "5",
                "Text": "I just bought this book. Just by reading few paragraphs it dawn on me why this two theorie are important to most people, especialy me and the author. He got great explaination on both side. I myself have a lots of question about the begining of mankind. Science and religion don't answere my questions. I wonder wish came first science or religion or vise-versa. For anybody who is interisted in this two theory here a great start."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 23, 2001",
                "Helpfulness": 0.4358974358974359,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 13, 2000",
                "Helpfulness": 0.125,
                "StarRating": "5",
                "Text": "One person from New Joisey is most definately clueless!!!  But of course that is his opinion. Thank the very God of the Genesis for free speech rights. There are some folks that do KNOW the Truth. Hooray to Mr. Schroeder."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 18, 2000",
                "Helpfulness": 0.3924050632911392,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on May 13, 2000",
                "Helpfulness": 0.23376623376623376,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38QF7JBTNQ983"
                },
                "Date": "on August 14, 2000",
                "Helpfulness": 0.21621621621621623,
                "StarRating": "1",
                "Text": "I love a good midrash, but this is not one of them. Schroeder's attempt to  mesh science and theology is to say the least a real stretcher. For comic  effect (comic, not cosmic), though, it is amusing and I laughed out loud at  several passages wondering if Schroeder was writing a parody of creationist  \"science\". He's not. This book will convince no one who is not  already convinced of the creationist credo, or has no capacity to think  criticially."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HRUW583WV2U"
                },
                "Date": "on October 15, 1999",
                "Helpfulness": 0.20987654320987653,
                "StarRating": "1",
                "Text": "I have read all those reviews highly praising G. Schroeder's book and completely disagree with them. G. Schroeder set out on an ambitious and commendable road to prove that science and the Bible are fully compatible.  He failed.  His considerations are mostly unfounded and contain a number of  erroneous statements. Some of the errors could hardly be expected from a  PhD in Physics, as an undergraduate student would get an F for such  statements."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UD0M8935Q7RP"
                },
                "Date": "on December 19, 2005",
                "Helpfulness": 0.168,
                "StarRating": "1",
                "Text": null
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Genesis-Big-Bang-Discovery-Harmony/product-reviews/0553354132/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "95"
    },
    "Salesrank": "#67,725",
    "Timestamp": "2015-05-24 13:27:07.335031",
    "itemurl": "http://www.amazon.com/Genesis-Big-Bang-Discovery-Harmony/dp/0553354132"
}
