{
    "Category": "in Books (",
    "ListPrice": "$16.99",
    "Name": [
        "How to Teach Relativity to Your Dog"
    ],
    "OfferPrice": "$14.81",
    "Reviews": {
        "AverageStarRating": "4.2 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KYRD5VUNR211"
                },
                "Date": "on March 27, 2012",
                "Helpfulness": 0.9473684210526315,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJ2F2NP4MXH1G"
                },
                "Date": "on June 18, 2012",
                "Helpfulness": 0.8888888888888888,
                "StarRating": "4",
                "Text": "A pretty good introduction to relativity, including special and general relativity.  The conversations with the dog are cute at first, but rapidly got annoying and you can just skip past them.  The explanations are very clear.  Worth reading if you're interested in the gist of Einstein without the math."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QPK8CFFY9OA9"
                },
                "Date": "on November 16, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I thoroughly enjoyed this book.  The author did a great job of providing the big picture of relativity without having to resort to very much math.  I'm an engineer and so have taken several high school and university-level physics courses; I believe that I (and my fellow students) would have benefited from first reading this book, before the big picture was, if not lost, then obscured by the oft times difficult math associated with relativity.  Teaching relativity through conversations with Emmy the dog was very cleaver and effective!  I would recommend this book to high school and beginning college students who are about to take physics and anyone who is interested in relativity without wanting to wade through the gory math details."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33J95UU28KB1N"
                },
                "Date": "on March 23, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "If you are interested in relativity at all or just enjoy physics you need to read this book. It is a fantastic introduction to the complex and dense ideas of the theory of relativity. Every time i read a chapter i would learning something new and it would blow my mind and shatter preconceived notions on how the world works. When i was picking up this book i was worried  a little bit about the title. I thought that this was another book that was trying to trick you into liking physics. This is not the case and the dog throughout the whole books plays a vital part in the learning process."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACGXQN7J6599J"
                },
                "Date": "on April 26, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37X6POX9VOWDJ"
                },
                "Date": "on December 19, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZTWKQN8B7LHV"
                },
                "Date": "on December 25, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "As a physicist in another field, I thought this was a great conceptual review of the main ideas of relatively.  However, I don't think one has to be a physicist to understand!  The last chapter was a particularly good summary of the standard model and four forces - all explained in an entertaining, easy to read package."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QR90PB31WTH2"
                },
                "Date": "on October 1, 2012",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "This book is fun to read and easy to understand. Though you don't have a good background on Physics or Maths, the texts and the diagrams help you to understand quite clearly. Also, I find this book describe way better well than my Physics professor."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9Z48TN0NYBO8"
                },
                "Date": "on March 13, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I'm loving it so far... It has nice little historical detours and very nice humor and some simple math equations... Friends and spouses not interested in physics still can enjoy the charming writing style when I read to them."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3O9F6TNG5T63E"
                },
                "Date": "on December 1, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book provides an excellent non-mathematical description of Relativity. Easy to understand."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWLKAH7B5ARBY"
                },
                "Date": "on December 29, 2012",
                "Helpfulness": 0.045454545454545456,
                "StarRating": "1",
                "Text": "This book is for children. If that's what you are looking for then o.k. I was very dissapointed. This is really a dumb book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GGOC6ZPX694"
                },
                "Date": "on July 1, 2012",
                "Helpfulness": 0.09090909090909091,
                "StarRating": "1",
                "Text": "I sympathise with the premise of this book. However the 'talking dog' conversation is offensive. I regret buying this book now."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/How-Teach-Relativity-Your-Dog/product-reviews/0465023312/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "12"
    },
    "Salesrank": "#125,285",
    "Timestamp": "2015-05-24 13:31:22.094066",
    "itemurl": "http://www.amazon.com/How-Teach-Relativity-Your-Dog/dp/0465023312"
}
