{
    "Category": "in Books (",
    "ListPrice": "",
    "Name": [
        "Thinking Physics: Understandable Practical Reality (English Edition)"
    ],
    "OfferPrice": "",
    "Reviews": {
        "AverageStarRating": "4.7 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXDLJ701AFPVD"
                },
                "Date": "on September 22, 2009",
                "Helpfulness": 0.9583333333333334,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YTYYTYSGLO98"
                },
                "Date": "on April 10, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I love this book. I bought this book in 2002 and it has been wonderful, useful, entertaining and worth every penny. At first I used it as a way to prep myself during my internship teaching high school physics. Now I have a 7 year old and a 9 year old, and I use this book to help me explain the world around us. Sadly (or wonderfully) I want to reference this book more frequently that I remember to bring it with me. Although I love the printed version, I need a kindle version too, :), and I would gladly pay the original cover price all over again..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A380AYJU2TOW96"
                },
                "Date": "on February 6, 2008",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ETQXW47N3FG4"
                },
                "Date": "on August 9, 2008",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2A7HO31Y0B3DW"
                },
                "Date": "on September 15, 2005",
                "Helpfulness": 0.7272727272727273,
                "StarRating": "5",
                "Text": "Epstein presents a bunch of physics problems, and solves them all -- almost without any math -- with clear, insightful, elegant solutions. A brilliant book useful from grade 10 to grad school."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11LQTDYZSYAZP"
                },
                "Date": "on March 3, 2010",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "I first got hooked on the problems in this book during my undergraduate study.  The author does an excellent job of slowly building your analytical skills as you progress through the book.  The material is presented in such a way that you can relate what you're learning to the everyday world around you.  Truly a top notch resource.  I have purchased multiple copies as gifts for friends and family."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AL1B6LCHDE4C9"
                },
                "Date": "on March 20, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "A systematic teaching of physics it is not.  But it is a great series of bite sized lessons grouped under various headings.  I and my grandchildren are enjoying this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AK0WYVZYT8ZB1"
                },
                "Date": "on March 2, 2008",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "An excellent low-math book that covers many everyday concepts in physics, allows anyone to think through everyday problems and gain experience in thinking without doing calculations or sitting through endless ball-rolling-down-ramp labs. It shows ways that physicists and scientifically literate people think about physics problems in general terms. I've seen it on many shelves-  grad students, postdocs and professors,  teaching or not,  since my undergrad days  25 years ago , alongside  Art of Electronics, Jackson,  Halliday/Resnik , and a book of integrals. Fine for junior- and high school students, and even younger with parental guidance. Many kids have sensible questions about why e.g. a bike stays up or who you really wouldn't want to run into on a football field, and the answers to them, and nice sketches too."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2K1WWN8VC9FIS"
                },
                "Date": "on January 16, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Just a wonderful book for engineers and English majors alike.  This is one of those texts that teaches you how to think; in this case like a physicist.  We see that what so often seems simple and obvious is not.  It looks at problems conceptually and makes us reduce a problem to the bare bones.  Very little math required.  the concepts of work, force, energy, velocity, acceleration, weight, mass, inertia, impulse, momentum and time are explored in a lucid and playful manner using ordinary language.  My girlfriend and I discussed a problem for five hours as we drove to San Francisco.  The time flew.  I can't recommend it enough.  Truly profound."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FFKLHDCHQUS8"
                },
                "Date": "on September 12, 2009",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3H8PLWKKCNST2"
                },
                "Date": "on July 28, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Good book. Some of the explanations need re-writing as a few are not explained well enough. But overall, a good book to begin to understand physics for any beginner, or young learner. It has a lot of interesting physics examples. I didn't give it 5 stars because of several reasons. One is the authors attitude throughout the book which bleeds through a bit too much. Another reason is that some of the example situations could have been better, and a few had poor explanations which were lacking. But there is so much god here that these negatives are minor enough."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WK5P4AE19KWY"
                },
                "Date": "on January 10, 2007",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "Think you know physics?  The simple questions posed in this book will show you if you do.  It is approachable enough for a lay person to pick it up and take a crack at it.  The solutions give great insight for the seasoned physicists and newbies."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1S1IYQLQ98R0T"
                },
                "Date": "on October 15, 2012",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "I read this book twice...or maybe 3 times.  It is the greatest book I have ever read and the best book on explaining physics.  It is the only one of over 200 physics books in my library that I did NOT give away!  Why?  Because I have to read it again and this time not cheat on the questions."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATQKYIGE7EJXR"
                },
                "Date": "on November 30, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2K3LSIA41QYTJ"
                },
                "Date": "on October 29, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Sure it may be a little sexist and politically charged, but it's actually a great book for physics concepts. I wouldn't recommend to someone who is interested in learning physics formulas, but it's great for people who just want to get a feel for physics. I guarantee you will find stuff in here that will stump and entertain you!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMI1CIOSA6ZCT"
                },
                "Date": "on July 14, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I am a physics teacher and this book is amazing. It has so many great examples and conceptual questions in it that I practically use it everyday. The explanations are for the most part easy to understand and well reasoned. The author is....a bit of a sexist so some of the questions are to be avoided lol"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MOK7E7BZ1NMF"
                },
                "Date": "on April 21, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I strongly recommend this for students of physics of all levels. Topics well arranged and presented in a manner that encourages thinking, questioning and assimilation of concepts. I wish an Indian edition or low cost editionof this book is published for students in Asia"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26SS0H5L09V9H"
                },
                "Date": "on September 19, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CBS6N6KKSKHH"
                },
                "Date": "on July 15, 2007",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "Simple, but non trivial, conceptual problems with clear, insightful, elegant solutions without math. For everyday use to challenge students' minds."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZEZ1Z6U2JMRJ"
                },
                "Date": "on February 17, 2011",
                "Helpfulness": 0.6,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGQ13JI5QW4MF"
                },
                "Date": "on May 25, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Written in a very simple way that makes physics accessible to \"regular\" people.  I highly recommend it for parents and kids who would like a better understanding of physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Q223CZ4QGKR8"
                },
                "Date": "on May 10, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "i believe this book captures the essence of what entices a physicist. it presents common everyday phenomena and forces you to actually think about. a very enrichening read!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FSHGR18V1M0P"
                },
                "Date": "on February 16, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This belongs in the library of every student and teacher of physics.  When I misplaced my copy I immediately bought another one."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AA0X4MC6BE5DJ"
                },
                "Date": "on January 6, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great book for anyone who loves Physics!!! You don't need any kind of Mathematical background to go through this book"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19WYH2WGH2373"
                },
                "Date": "on August 24, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A very good series of questions on physics that emphasizes scientific intuition rather than mathatical knowledge."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on May 14, 2004",
                "Helpfulness": 0.6,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AV1HIQ5E01CIK"
                },
                "Date": "on June 30, 2008",
                "Helpfulness": 0.62,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1U0JBQ4ZFU6PX"
                },
                "Date": "on June 26, 2009",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D38BOZLKAYX6"
                },
                "Date": "on January 13, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AK829Q1XXC718"
                },
                "Date": "on May 18, 2008",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "I love the way Epstein explains things in everyday language and examples.  He uses simple drawings and does not use mathematical formulas!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YJP24S7S34UI"
                },
                "Date": "on December 19, 2010",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": "I have just received this book and wow!! very good provocative questions (many with lengthy answers) that challenge your basic physics understanding.  Very good for classes (I teach university level thermo, fluid mechanics and heat transfer) to help students evaluate by themselves their understanding..  I do recommend it.  I am having lots of fun."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KTWUXXB8KKC7"
                },
                "Date": "on October 20, 2008",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3E6J9TNFY0DUB"
                },
                "Date": "on December 1, 2003",
                "Helpfulness": 0.4,
                "StarRating": "5",
                "Text": "It's amazing the capability of being clear and to get to the right point. Ingeneous! I recommend for every one who search for learn physics, even those who already studied it!"
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Thinking-Physics-Understandable-Practical-Reality/product-reviews/0935218084/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "33"
    },
    "Salesrank": "#286,478",
    "Timestamp": "2015-05-24 12:57:35.619167",
    "itemurl": "http://www.amazon.com/Thinking-Physics-Understandable-Practical-Reality/dp/0935218084"
}
