{
    "Category": "in Books (",
    "ListPrice": "$18.95",
    "Name": [
        "The Complete Idiot's Guide to String Theory (Complete Idiot's Guides (Lifestyle Paperback))"
    ],
    "OfferPrice": "$15.27",
    "Reviews": {
        "AverageStarRating": "4.1 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18GJRUNMGT4OM"
                },
                "Date": "on July 23, 2008",
                "Helpfulness": 0.978021978021978,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZDT5BP48KQ1B"
                },
                "Date": "on November 18, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARNDT5Y0LRWI3"
                },
                "Date": "on August 25, 2008",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARYP65ZHST8U3"
                },
                "Date": "on November 30, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is an extremely good introduction to a very complicated subject that will be of great use to those with limited knowledge of string theory and, more generally, high-energy physics.  The book successfully gives a conceptual description of a somewhat esoteric area of physics without the requirement of a mathematical background.  Readers of the book will come away with a good understanding of cutting-edge physics, including Relativity, Quantum Mechanics, the Standard Model, Grand Unified Theories and Supersymmetry, all of which are relevant to experiments currently being performed at the Large Hadron Collider.  Readers will also learn how these topics are related to string theory and how everything fits together.  The book does a good job of presenting information in a pedagogical manner building from the simpler concepts up to the discussion of string theory.  Thus, the reader gains a clear picture of where our current knowledge stands and the problems that still need to be addressed.  The book accomplishes this without getting lost in a discussion of rather exotic things like parallel universes and extra dimensions, although the reader will see how such concepts arise in string theory.  The book also gives a discussion of the current 'controversy' over string theory which has played out in popular books and blogs in recent years.  Overall, this is an excellent starter book for anyone who wants to get a basic picture of string theory.  If one wants to gain a deeper understanding, one can move on from this book to one of the more technical treatments available."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SKHR52UNO648"
                },
                "Date": "on December 16, 2008",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1D0TFYHA8LMIE"
                },
                "Date": "on May 31, 2009",
                "Helpfulness": 0.875,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AB0N1MRG2G7X8"
                },
                "Date": "on September 22, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I give it my highest rating. The title is misleading because it is more about the connection of relativity, quantum mechanics and string theory. For those who have read Brian Greene's books, this is a excellent supplement. It is a must read if Greene's books may have left you wanting more explanations and examples."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A373ZCB1AYOZC"
                },
                "Date": "on October 4, 2008",
                "Helpfulness": 0.7894736842105263,
                "StarRating": "5",
                "Text": "..as a part of a title. Idiots do not read such books. I may say, you will like this easy to follow review of relativity, QM, the Standard Model, the possibility of time travel, and more. Then explore alternatives to string theory. All this conveyed in everyday, even breezy, language. The next few years will be critical for string theory. LHC  will begin to smash particles into bits to see what they are made of and give new types a chance to form. But finishing the job will probably require new conceptual input , as author indicates. Good quick read ..from micro to large scale cosmology."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IU9VPCBKZPE8"
                },
                "Date": "on January 31, 2012",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHIXYRNMWT8V5"
                },
                "Date": "on September 28, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This audacious little book has earned a place on my nightstand as a joy to re-read. The clever examples and illustrations reflect a passion for conveying the broad shape of physics concepts as rightly as is possible without mathematical detail.  These concepts are wrapped in an engaging narrative which frames their historical development.  If you have room on your nightstand for some string theory (and don't mind the title) you won't be disappointed.  I have enjoyed re-reading this book again and again."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30M15A2QGA3TT"
                },
                "Date": "on August 12, 2008",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39GJOZXEU88DB"
                },
                "Date": "on August 4, 2008",
                "Helpfulness": 0.7,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VYXTG41ALG9X"
                },
                "Date": "on February 6, 2009",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "This is the ideal book for anyone (layman!) reading the popular literature about current ideas in physics.  There are many good books out there, but this one is the smoothist, most evenly-paced I've come across.  It keeps you turning pages to see what comes next.  It almost reads like a novel.  The title may be a bit deceptive because there is a long run-up of the physics that leads up to string theory - almost half the book - but it's appropriate and worth it.  Read it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARYUI91EWGUUK"
                },
                "Date": "on October 17, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "It's about a theory people, not written for a Ph.D, gives a great general view over a whole range of topics leading up to String Theory"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1M9G8XXCLUJBO"
                },
                "Date": "on January 31, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Very easy to understand for those of us who have very little knowledge of Physics. Most enlightening. Recomended..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HNLJGBLFBJIA"
                },
                "Date": "on April 28, 2010",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYXE8RIZJJFY9"
                },
                "Date": "on January 16, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I confess I'm still slogging through the first half. So much new Information. A very good feature, is how this writer refers you to other parts of the book both material already covered and material in later chapters. I really appreciate the short glossary in Appendix A which I usually ignored in the past. Also some good follow up info in Appendix B. Especially the information about Cosmology. This author also maintains a web site for errata plus some more  resource links. When I finish George Musser's book I think I'll be prepared enough to tackle Brian Greene's \"The Elegant Universe\" next. Maybe even dig out my old Hawkings book that I never finished."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1U1I4K73P4Q4Q"
                },
                "Date": "on March 21, 2013",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "not enough math for me. i've studied ordinary quantum field theory and although it's too difficult for me to do anything with, at least i can see how it works. with string theory i can't get past the different language.  after all, suppose someone gave you a children's bedtime story written in sanskrit. it wouldn't matter how easy it was... you still wouldn't understand it.  i'm looking for the incomplete idiot's guide."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UDHD67YHBP90"
                },
                "Date": "on September 24, 2008",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZQ2HE1QFV8ZL"
                },
                "Date": "on May 5, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31K9YLTTR5EKO"
                },
                "Date": "on January 13, 2012",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "2",
                "Text": "I found the book disappointing, I had hoped it would simplify some of the more complex ideas of string theory, but felt it was so general it really had little to teach so Im not sure I could recommend it to any level idiot"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JY7SQ9TIOK4T"
                },
                "Date": "on August 1, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is a well-organized and clear exposition of the current approaches to developing a theory of quantum gravity that reconciles General Relatively and quantum mechanics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ENJ7D3YX53RZ"
                },
                "Date": "on January 29, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Easy to understand. The author was very sucesseful in changhing a very difficult subjet in a readble and intriguing book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17VUNG96CF9FL"
                },
                "Date": "on May 15, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I love this book.  String theory is fun now!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MECNOQLISTGF"
                },
                "Date": "on February 8, 2014",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Q2ZFI1U9CKA3"
                },
                "Date": "on February 14, 2009",
                "Helpfulness": 0.5909090909090909,
                "StarRating": "2",
                "Text": "There is some interesting information in this book, but the reader has to wade through juvenile metaphors and condescending verbage to find it.  If you have even heard of string theory before, skip this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2R6EONWUV2QWP"
                },
                "Date": "on September 21, 2009",
                "Helpfulness": 0.4,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9KAMUB8E4WCU"
                },
                "Date": "on September 9, 2009",
                "Helpfulness": 0.37037037037037035,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9QS5S6YN5KKA"
                },
                "Date": "on October 26, 2010",
                "Helpfulness": 0.17647058823529413,
                "StarRating": "2",
                "Text": "My rating of this book is not based on having bought and read it.  My rating is based on the higher price for the Kindle edition.  I doubt I can grasp String Theory when I cannot understand why an electronic edition of a book is more expensive than the paper edition."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Complete-Idiots-String-Lifestyle-Paperback/product-reviews/1592577024/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "29"
    },
    "Salesrank": "#685,160",
    "Timestamp": "2015-05-24 12:45:47.774128",
    "itemurl": "http://www.amazon.com/Complete-Idiots-String-Lifestyle-Paperback/dp/1592577024"
}
