{
    "Category": "in Books (",
    "ListPrice": "$17.95",
    "Name": [
        "Dreams of a Final Theory: The Scientist's Search for the Ultimate Laws of Nature"
    ],
    "OfferPrice": "$14.93",
    "Reviews": {
        "AverageStarRating": "3.7 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4720ULNWTXZV"
                },
                "Date": "on September 19, 2002",
                "Helpfulness": 0.9285714285714286,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UE1QI5GJLUO3"
                },
                "Date": "on August 23, 2001",
                "Helpfulness": 0.8863636363636364,
                "StarRating": "4",
                "Text": "A seedy book by a Nobel laureate (I guess I couldn't have  avoided this) over which readers often violently divide. The reasons are as follows: for physicists, Weinberg expounds good, but (to them) already known physics (quantum mechanics,  chunks of cosmology) overladen with amateurish musings on philosophy and metaphysics (even aesthetics). For lay(wo)men (no pun intended) the book is sometimes heavy going (lots of names, abstract concepts, frequently scholastic dilemmas). On the strong side: I would highly recommend this work to the interested amateur as a historical tour through the elementary particles physics (bits of cosmology added). During this voyage, a reader will become well acquanited with virtually all that matters in contemporary high energy physics. Although not a basic read, it is completely non-mathematical. Just- it requires persistence to absorb and \"digest\" a multitude of interrelated concepts in this historical narrative on the unfoldment of modern physicist's \"worldview\". On the weak side: Weinberg's frequent forays into philosophy, theology and politics are not too rewarding, or enlightening (except as an intriguing exposure of modern scientistic mind).  Nevertheless: this absorbing story of  20th century physical ideas and controversies leaves one with a good feeling: \" That's how modern physics was made and how it casts spell over its inammoratos\"."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10O98CWTJQTYQ"
                },
                "Date": "on August 5, 2008",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHEW91ZUQDSKR"
                },
                "Date": "on April 8, 2005",
                "Helpfulness": 0.8666666666666667,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36K2N527TXXJN"
                },
                "Date": "on September 28, 2009",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVH4ELYR4SAKT"
                },
                "Date": "on March 28, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "It seems to me that many reviewers have missed the point of this book. The author does not intend to give an intro to physics and its concepts, but rather to use physical science and its examples to offer perspective on what scientific theorizing is all about and where physicists find themselves on the path to an ultimate theory. His discussions of symmetry, elegance, or theoretical beauty are not intended to simply tell people what laws of physics are symmetric, etc. but rather he explains this property as a fundamental (and philosophical) component to an ultimately unifying final theory. He uses physical examples to explain how modern and beautiful theories (relativity, his electro-weak theory) unite other theories which seem disparate. Its a (practical, example-based) philosophy of theorizing, not an introduction to physics. It's an important read. I'm a theoretical biologist and if you're into theory, you'll find some of Weinberg's statements very revealing and incredibly insightful. One can read into some of the passages as offering a 'structure of unification'. It's about what a final theory HAS TO look like. The book is not about the examples."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OJW07GQRNJUT"
                },
                "Date": "on May 28, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35YWA2V4QHOJ3"
                },
                "Date": "on August 13, 2012",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28BEC89467FC4"
                },
                "Date": "on December 20, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Excellent book!! I heard theoretical physicist Nima-Arkani Hamed (Particle Fever) recommend this book as one of the few which gave a fair introduction to the questions of fundamental physics. Although slightly outdated (this book went to press, according to the author, on October 1993, right when the Superconducting Super Collider project in Texas was stopped, and therefore before the LHC was built and the Higgs particle discovered), it was really exciting to read the insights from Dr. Weinberg and his views on topics such as electroweak theory... by one of his creators. Great insights also on topics such as philosophy, the search for beauty in physics/mathematics, or even God! To get the most out of this book, I recommend having a background on topics such as quantum mechanics or Einstein's theory or relativity, but that's a physicists opinion (me), so if you're interested in understanding the physicists' search for the fundamental laws of Nature, just go ahead and read it!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36K2N527TXXJN"
                },
                "Date": "on June 2, 2011",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DQ2JYETDQJN8"
                },
                "Date": "on July 14, 2010",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AN4AGO2FCTRSY"
                },
                "Date": "on February 2, 1999",
                "Helpfulness": 0.65,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UWR964FG47AJ"
                },
                "Date": "on February 3, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is to alert the reader to the fact that Amazon is mistakenly attributing this book to the wrong writer.  The author of \"Dreams of a Final Theory\" is, of course, Steven Weinberg (no middle initial), who is also the author of the recent \"Lake Views\" and \"Facing Up,\" as well as the earlier book for the general public, \"The First Three Minutes.\"  Weinberg has also authored the recent treatise, \"Cosmology,\" and the three-volume treatise on \"The Quantum Theory of Fields.\"  Perhaps in reviewing this comment Amazon will correct the error."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6OXBGSDRTDNN"
                },
                "Date": "on November 15, 2003",
                "Helpfulness": 0.625,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3P3GEIPYK0GT9"
                },
                "Date": "on October 24, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "excellent"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YJPOIEB51F3O"
                },
                "Date": "on March 3, 2015",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20IQBBG5Y973X"
                },
                "Date": "on January 9, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Recommended by Nima Arkani-Hamed this is a smart and funny man's search for the truth. it's as good as it gets"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A97O687SLD9UT"
                },
                "Date": "on June 12, 1998",
                "Helpfulness": 0.5454545454545454,
                "StarRating": "2",
                "Text": "This is an easy to read but uneven book. Some discussions are pretty clearly exposed, mainly the technical ones. But it's not a balanced view of quantum field theory. E.g.,the author deservedly bashes some philosophers of physics but then puts everybody in the same basket. He keeps hamming in the quest for unification which is a research program with deep philosophical roots. The argument for a \"final theory\" is not convincing; in fact one wonders if it makes any sense at all. In fact it is not discussed in a critical way.  Also, there's no comments about the work of the mathematical physicists concerning the axiomatic or constructive point of view of the theory, which, it seems, is not very encouraging. But, for those who feel that canceling infinities is all right, as long that it works, no problemo..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6KSLTMEGFQX7"
                },
                "Date": "on October 1, 2005",
                "Helpfulness": 0.4666666666666667,
                "StarRating": "4",
                "Text": "The view of the author that the current theories are the right path to the final theory is unrealistic. This approach implies that the final theory is some kind of complex mix of previous theories. The final theory requires new fundamental objects in which terms to obtain the modern knowledge as this is done in Eugene Savov’s book Theory of Interaction. The final theory has to be stunningly simple."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Z6E25AAHMN8P"
                },
                "Date": "on December 18, 2013",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "Book was \"ok\"..no way ha th quality of content of \"The first three minutes\" Starts out ptetty good but loss steam from middle to end"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7HI4A78OEJJ2"
                },
                "Date": "on August 3, 2001",
                "Helpfulness": 0.3125,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EGYNOQP43299"
                },
                "Date": "on March 27, 2000",
                "Helpfulness": 0.42857142857142855,
                "StarRating": "2",
                "Text": "As far as the Physics itself is concerned this book seems quite up to the job. After all what else do you expect from a Nobel Prize winner? I enjoyed Weinberg's descriptions of general relativity, quantum mechanics, quantum  field theory etc and the importance of symmetry principles in all of these  things. But when it came to more philosophical topics such as why  mathematics seems to be so well suited describing nature he says little of  significance. He just keeps harping on how our sense of \"beauty\"  or whatever guides us to mathematical theories. The discussion is so vague  that it would have been better if had stuck to the purely physical  questions. I don't think Weinberg addresses philosophical questions very  well. I guess that is not surprising since he had one chapter devoted  solely to showing that philosophy is mostly useless in the practice of  Physics. That may well be true mostly but consider Einstein's theories of  relativity. In such cases there is not much difference between Physics and  Philosophy. One has to be good at both. Unfortunately Weinberg seriously  lacks ability in the latter."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2T2OVNIRFWS4R"
                },
                "Date": "on January 19, 2009",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": "I really could only stand two chapters: Against Philosophy and What about God? The rest of the book was really dull, if you're not a physics buff. Oh, and the chapter on the Super Collider was about as boring as you would expect, especially reading it a decade later."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6CNBI5EI7FMH"
                },
                "Date": "on January 22, 2013",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1C4Q73QXSO3RO"
                },
                "Date": "on November 24, 2005",
                "Helpfulness": 0.22033898305084745,
                "StarRating": "1",
                "Text": "Although I have little to no education in physics, chemistry or mathematics, I have an IQ of 140, a degree in law and I have read (and even written some) philosophy, so I don't usually have problems with conceptualizing. Having said that as background, as a layman, I found this book to be completely incomprehensible. Although not religious, it is as if Weinberg is speaking in tounges, droning on and on about every physics and chemistry concept and theory from antiquity to present, without ever pausing for a single moment to actually explain any of them. I dare anyone who does not have at least a basic grounding in physics to explain anything Weinberg has said about physics in this book. Weinberg makes much of the \"whys\" of science, but to me, the greatest unexplained \"why\" of this book is why was it published."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A126KX6FVI4T66"
                },
                "Date": "on December 29, 2006",
                "Helpfulness": 0.07407407407407407,
                "StarRating": "2",
                "Text": null
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Dreams-Final-Theory-Scientists-Ultimate/product-reviews/0679744088/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "26"
    },
    "Salesrank": "#200,578",
    "Timestamp": "2015-05-24 13:30:54.375602",
    "itemurl": "http://www.amazon.com/Dreams-Final-Theory-Scientists-Ultimate/dp/0679744088"
}
