{
    "Category": "in Books (",
    "ListPrice": "$16.99",
    "Name": [
        "Love and Math: The Heart of Hidden Reality"
    ],
    "OfferPrice": "$13.59",
    "Reviews": {
        "AverageStarRating": "4.2 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AW1493ZQTQ2ET"
                },
                "Date": "on December 20, 2013",
                "Helpfulness": 0.9558823529411765,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2F7XU97CYFHDY"
                },
                "Date": "on September 26, 2013",
                "Helpfulness": 0.9278846153846154,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36UVA2I9YAAZ9"
                },
                "Date": "on September 30, 2013",
                "Helpfulness": 0.8714285714285714,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CHSU1QZHYBYW"
                },
                "Date": "on November 27, 2013",
                "Helpfulness": 0.9565217391304348,
                "StarRating": "4",
                "Text": "Although much of the Mathematics (especially in the endnotes) is beyond my capability (even though I have a graduate degree in Math) the story of how this man fell in love with Math, overcame the anti-semitism in the Soviet educational system to become a Mathematician, and sought connections both within Mathematics and between Mathematics and Physics is fascinating and vividly told.  My advice to the reader-- just skip what you don't understand.  There is enough here without that to make for interesting reading."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADNDAN7B1M7QS"
                },
                "Date": "on January 5, 2014",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMCK0P264V45P"
                },
                "Date": "on December 22, 2013",
                "Helpfulness": 0.8518518518518519,
                "StarRating": "5",
                "Text": "A boy who grew up in a town closer to Moscow became interested in quantum physics. Plenty of popular science books were easy for him to find to read. His parents were engineers and were quick to recognize boy's talents. A mathematics professor of the only college in the town who is also a friend of the family took the boy under his wings. The professor asked him if he knew about the group SU(3). This conversation made the boy realize that he had to learn math to answer many questions he had by reading popular science books. Thus began the journey of this boy becoming one of the premier mathematicians of today. He was introduced to great mathemati- cians from the beginning. Mathematicians gave him problems to solve. He solved his first problem on Braid groups as a freshman. He attended Israel Gelfand’s legendary seminars at Moscow State University. He was offered a visiting professorship at Harvard even before he received his bachelor’s degree. To get a permanent job he needed a degree. He enrolled in the Harvard PhD program and received his PhD in one year. He first heard about the Langlands Program at Harvard. Since then until today he has been working on the Lang- lands Program. Langlands program is like a Rosetta stone revealing similarities in three apparently unrelated fields; namely, Number the- ory & curves/finite fields, Riemann surfaces and Quantum Physics. The book \"Love and Math\" is Edward Frenkel’s autobiography. He has done a masterful job of trying to bring hard mathematics that he has been working on to a level of an average reader by inter-vowing it with his fascinating life experiences. It is hard not to get excited about the math that you know practically nothing about. \"Love and Math\" makes you wanting to read more and get to know more about this fascinating mathematics. Frenkel has included many references for an interested reader to follow through as notes at the end of the book. \"Love and Math\" is a must read for young and old alike."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BLG0VYIYOENX"
                },
                "Date": "on January 11, 2014",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YBL0VO791S0V"
                },
                "Date": "on July 14, 2014",
                "Helpfulness": 0.8,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GDD1NSA3CASO"
                },
                "Date": "on December 11, 2013",
                "Helpfulness": 0.8235294117647058,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3E5GY7K9GGYD0"
                },
                "Date": "on December 31, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I expected this book to be yet another popular mathematics book explaining some fascinating mathematical subject at a level that most readers can partially understand. But this book is different. It does try to communicate the ideas in the Langlands Program, but for most readers, including me (a mathematically trained computer scientist), that material remains inaccessible. That is OK. The real subject of this book is the love and passion of mathematicians and the wonder of the profound connection between mathematics and the natural world.  I appreciate the fact that the author does not strain to simplify the deepest material down to my level.  I get great pleasure out of getting the flavor of material that is over my head, and understanding in that indirect way how vastly more mathematics is known to the specialists than I will ever know, and yet how much more there is that none of them even knows."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RMCTBZT4A4WH"
                },
                "Date": "on February 10, 2014",
                "Helpfulness": 0.875,
                "StarRating": "5",
                "Text": "My wife bought this book for me, and handed it to me with some apprehension, because I am a serious scientist with a very strong background in mathematics, physics and computing, now a retired professor of biomedical informatics.  She knows I have little patience for popularizations of math, physics and computing.  This book is very different.  It has something for everyone.  If you have no math background, you won't get everything, but so what?  If you go to an ice hockey game and have never played you will not see or appreciate everything that is happening.  Still, you can appreciate the flow, the beauty, the greatness of the game.  We don't get to watch mathematicians at work like watching ice hockey, but Frenkel's book gives you a view.  The personal stories, like the interviews of ice hockey players, help give a personal perspective to what it is to be a mathematician.  This book will help you appreciate the beauty and greatness of mathematics.  It is an honest exposition.  The explanations are the real thing, not silly metaphors that don't really convey the truth.  I learned real math (theory of groups, topology, symmetry, transfinite numbers, etc.) from books like Courant and Robbins's classic, \"What is Mathematics\", and yes, in school I also had to learn arithmetic, algebra, calculus, etc., but the fun stuff is not much taught in schools.  It should be.  I hope this book will stir people to make some changes in the way math is taught.  Math is for everyone, not so they can become professionals, but so that they can enjoy it, and feel more comfortable in a world that is and always has been mathematical to the core, now more than ever.  Frenkel's book belongs with Courant and Robbins and likely also will become a classic.  Mathematics is a mind boggling adventure, as exciting and spectacular as mountain climbing, but a lot safer.  So play safe, take the advice of the ancient Greek philosopher Plato, study mathematics and enjoy the trip of a lifetime."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2U0XHQB7MMH0E"
                },
                "Date": "on November 10, 2013",
                "Helpfulness": 0.7424242424242424,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39SL2LPQVPNR1"
                },
                "Date": "on March 9, 2014",
                "Helpfulness": 0.8181818181818182,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YJE1LQ3CVJRU"
                },
                "Date": "on January 7, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28TISMDIP5B97"
                },
                "Date": "on October 21, 2013",
                "Helpfulness": 0.76,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2E3GFHUDNPYDH"
                },
                "Date": "on August 21, 2014",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NOMTGCFT5XBA"
                },
                "Date": "on June 16, 2014",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXVYYOELXFTUS"
                },
                "Date": "on October 14, 2013",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVM1WBV7N7VSG"
                },
                "Date": "on January 17, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2J37SWVUYQ544"
                },
                "Date": "on January 29, 2014",
                "Helpfulness": 0.7857142857142857,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AV7L4UNOYRS69"
                },
                "Date": "on December 23, 2013",
                "Helpfulness": 0.75,
                "StarRating": "2",
                "Text": "I was lost immediately when the author wrote anything about math. It was as if he said, \"I'm going to teach you the wonders of Spanish, while assuming you already know Spanish.\" Most readers like myself do not already possess the vocabulary to understand what he is talking about. And I presumed that I was the kind of person he is writing for. I think he knows this stuff so well that he cannot see how a difficult it is to a no-math person like me. I really wanted to understand, but didn't, couldn't. I quit at chapter six."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JSXU71A42LDL"
                },
                "Date": "on November 8, 2013",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWS8YATOI87VM"
                },
                "Date": "on April 21, 2014",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAC2SDRWWSBUW"
                },
                "Date": "on December 28, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VO5RZ4RQWQ3E"
                },
                "Date": "on December 15, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23WO8W8CNI8I"
                },
                "Date": "on September 23, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Have spent a lot of time trying to figure out why I didn't connect with math the way I should have. Then I saw Frankel's book and wondered it I might find the answer there. I DID!!!! Right at the start he said 'what if your introduction to art was just having to draw a garage.\" We connected immediately. That's exactly what my introduction to art was: we had to walk through the field behind the school, sit down, and draw the garage on the other side of the fence. AWFUL!  As I read through (this was a while ago), he began to explain a point using a round table. I thought, Phooey! this is the kind of stupid stuff I always got in geometry. But I found myself thinking about what Frankel said over the next few days, went back and reread the section, and I got it! Fantastic. Then I remembered my CalcII prof, a strange yet fascinating guy. One day he walked into class, drew a backward L on the board and marked point A on the horizontal line and B on the vertical. His question: what was the shortest distance between the two points. The class groaned & tuned out. Two of us listened fascinated while he 'proved' it was a line composed of tiny incremental steps. A great lesson in thinking. Wish I could have had him for more classes. Thank you Edward Frankel for getting me thinking again."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JHQW4UI9011L"
                },
                "Date": "on December 14, 2013",
                "Helpfulness": 0.7777777777777778,
                "StarRating": "5",
                "Text": "Except for three Great Courses in mathematics, my education about numbers and forms, and the patterns in both, ended in high school.  This book tells of a level of mathematical insight I could not have achieved in two life-times, but it also provides at least an intuition of a wonder-filled world, one that leads to feelings of discovery so intense  they can not be told without recourse to poetry..  The life story told here in parallel with its math story makes for an engaging and unforgettable read.."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JAM8ZKXNB03J"
                },
                "Date": "on May 9, 2014",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AP9UGC67NXTCY"
                },
                "Date": "on February 14, 2014",
                "Helpfulness": 0.7777777777777778,
                "StarRating": "3",
                "Text": "The early parts of this autobiography are interesting, but the later explanations of the math research the author did are fairly opaque.  He tries to defend the Langlands program without generating much enthusiasm for the average reader, and the transcripts of dialog among participants don't seem to further any purpose."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2V6JU48LITP7B"
                },
                "Date": "on January 1, 2014",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADY7WVROHO9Q2"
                },
                "Date": "on March 27, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I enjoyed this book.  It's not for the mathematically faint of heart.  If you didn't like math in school, this book will not make you love math.  If you have some math background, say at least through calculus, you will get it and see the love. A love of physics will help also as it deals with some connections between mathematics and quantum physics.  Some of the good part is the autobiographical history of the author. You can skip many of the difficult-to-grasp footnotes (I didn't).  They take up a good portion of the total text.  Skipping them keeps you out of some of the hard-to-reach  mathematical depths."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GDFYTEUIQB88"
                },
                "Date": "on September 6, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Brilliant book by a brilliant man.  He covers the history of his life related to a certain mathmatical project that I am incapable of spelling, along with thorough explanations and examples of concepts intergal to the project.  He presents everything in terms that assume you don't have any background in math beyond high school, and yet doesn't hold back from rigerously showing nearly every detail related to each example."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATK7M4IEXB07T"
                },
                "Date": "on February 17, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "I enjoyed this book.  My son, who is a math major, recommended it, and though I was pretty well lost when reading the math \"stuff\", I did emerge with a much better understanding of what pursuing a career in math is really all about, for those who truly love the subject.  Parts of the book were drudgery, parts were poetry-  and the poetry won out.  Good job, Mr. Frenkel.  You are invited to dinner anytime!  :)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DVA28U3U9DEX"
                },
                "Date": "on January 29, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "....was the most valuable part of this book, together with the author's story of how he contended with the anti-Semitism of the educational system in the former Soviet Union. I had hoped the book would accomplish its stated task of uncovering the beauty of mathematics in order to entice reluctant non-mathematical people into studying it, but I am afraid that it will likely lose its intended audience of non-mathematicians because the subject matter becomes too complicated. I have a background in mathematics -- a master's degree -- but I still had difficulty toward the end of the book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18NLT74FOIBJ1"
                },
                "Date": "on August 11, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I wish I could read this book when I was mid school student. I believe this book can educate the reader a lot regarding what real math  really is. I think it also could eliminate widely spread misconceptions that the math is dry, not interesting, etc. It might encourage reader to look deeper and possibly find his/her own real interest in math."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TH2EN45BVN4O"
                },
                "Date": "on July 11, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is the fascinating story of a brilliant man who tries very hard to make complex mathematical concepts accessible to the general public.  The book is very difficult to read; the mathematics can be very opaque; but the quality of the story and the enthusiasm with which it is told makes the effort worthwhile."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VLHYFMXBFK0K"
                },
                "Date": "on March 11, 2014",
                "Helpfulness": 0.8,
                "StarRating": "3",
                "Text": "Book had some excellent stories of the challenges Edward faced in his quest to become a mathematician. That said, I have a masters in comp sci and all the mathematical concepts discussed where so far over my head I became lost.  I think I was expecting a connection between a different level of math and the physical world. At least now I can say I've heard of a Lie Group before.  I just have no clue what it is."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQ6ASX860V2W0"
                },
                "Date": "on March 11, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1G1U0IWIENA1Z"
                },
                "Date": "on October 3, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KFKD29DVD2OQ"
                },
                "Date": "on July 29, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SLGA33N9GVO4"
                },
                "Date": "on April 11, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Wow!  I didn't put in the effort that would have been required to \"learn\" all he relates.  But I became acquainted with huge areas of math that were new to me.  I also learned alot about how serious math is done.  It was an extremely interesting book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HFQ8LHEE2FV9"
                },
                "Date": "on October 26, 2013",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": "One of the best Math books for the layman I have read in the last 10 years.  The description of the Moscow State entrance examination process is very informative and historical.  The advanced Math concepts are presented in ways sure to be helpful for any Mathematician or non Mathematician that wants a basic understanding of the concepts."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAQ9NJ480N9W5"
                },
                "Date": "on March 11, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Renowned mathematician, Berkeley math professor and Russian émigré Edward Frenkel has written a book about his passion for math that has driven into the heart of some of our current deepest math problems. He weaves his own life through his voyage of discovery of mathematical reality. He starts with his early life and describes how an early family friend hooked him on math and then his struggles with anti-Semitism and Soviet era bureaucracy with a riveting story how Frenkel, his friends, colleagues and mentors were able to thwart the Soviet Bureaucracy in their pursuit of math.  Throughout he attempts to clearly explain the math issues that drove him and his cohorts. Not having had a math class since the 9th grade, I can’t say I understood everything he explains but he is clear enough to allow the lay reader to follow the general outlines. This excellent book opens the door on how mathematicians and scientists work together at very high levels and helps the lay reader understand the passions that keep them going. Their passion, tenacity, and creativity are inspiring. The book also emphasizes the utter stupidity of anti-Semitism and other forms of prejudice. An important part of Frenkel’s story describes how the anti-Semitism of the Soviet and Russian system drove some of the most brilliant mathematical minds of our times from Russia to the universities of the west. The professional mathematician may dismiss this book as Frenkel’s personal story while the lay reader may find the math off-putting. To let the math get in the way, in some sense, misses the whole point of the book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MQ2QSX3GRBF4"
                },
                "Date": "on December 28, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DAURJO4GY3SK"
                },
                "Date": "on February 16, 2014",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LBJTG5V14P7H"
                },
                "Date": "on February 12, 2014",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I8SIV1TD4XGI"
                },
                "Date": "on November 29, 2013",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CCLGSQQ9BROO"
                },
                "Date": "on July 20, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book is pretty good! The math in here can be a little difficult, but even if you don't fully understand what Frenkel is talking about, he explains it in such a way that you can grasp it a little bit. Being able to fully understand the things he is explaining in the book will require you to study group theory and riemannian geometry, which is pretty high level math; still this book is the most accessible book I have seen to the lay person trying to describe these concepts. This book has something for everyone though, its not just a math book, it is a a memoir as well and it reads like an adventure book. If the math confuses you, the story will captivate you. The characters that appear in the book are interesting and lively; many of them break the stereotype that mathematicians are anti-social nerds. The book math to places that you thought it wouldn't pop up. A memorable scene in the book is when Frenkel is working with a physician and using math to try and develop a method for diagnosing people of certain illnesses and when they should operate and when they should not."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ASPBG5ZH4TLM"
                },
                "Date": "on December 24, 2013",
                "Helpfulness": 0.7,
                "StarRating": "2",
                "Text": "I guess this book explains what mathematics is but, in my case at least, it also explains why I have always been and always will be totally uninterested in it.  I probably bought it with the vague hope that I had misunderstood the discipline and this would drop the scales from my eyes and lead me to the wondrous sunlit uplands of the subject.  Alas, no such luck.  Not only incomprehensible, but  boringly so.  I can't help but think that the gushing newspaper review of this book which drew me into purchase was written by a poseur anxious to burnish his intellectual reputation.  If he could understand it I'll eat my hat."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AB8SDXUCD4SYP"
                },
                "Date": "on March 20, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "I enjoyed the book, but had to skim over some parts which I couldn't understand. I may re-read, or read some other books on these advanced math topics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WD73R98U5LO1"
                },
                "Date": "on February 4, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Math was my father's favourite subject He advised me to learn math by heart I became an electrical engineer and love math all my life Good read"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GHMY46F1XBS"
                },
                "Date": "on December 8, 2013",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KPL9O0NNEMBY"
                },
                "Date": "on May 17, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Tells a great personal story and provides some of the flavor of the highest levels of pure mathematics. A very gifted high school student might be inspired to pursue mathematics. I doubt whether many \"math haters\" will be converted or even find it very interesting. A motivated reader might be able to follow the mathematical parts in some detail for about the first half of the book. Personally, I enjoyed getting some limited understanding of some topics I have heard about but never studied. After about half way through, 90% of readers, even those with some mathematical background, will mostly just get the flavor rather than any real understanding. At this point, I began skimming the mathematical sections of the text. Unfortunately it is also around this point that Frenkel gets pretty sketchy about relating much of his personal life as well."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APX9CT1F3MV65"
                },
                "Date": "on March 31, 2014",
                "Helpfulness": 0.75,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33Q3CD348P2YB"
                },
                "Date": "on August 3, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is a very entertaining book for one who likes to read about math geniuses - but not for everybody.  If you never heard of the Langlands Program, you might be at a disadvantage.  Frenkel's description of his struggle with Russian antisemitism is easier for the layman to understand than his struggle with braid groups, but his ultimate triumph is gratifying.  Frenkel writes gracefully, and he does a pretty good job of dropping famous names.  I read it straight through - but i like math gossip."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AV992KCXO8FQZ"
                },
                "Date": "on August 4, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I'd recommend this book to anyone with an interest in higher mathematics.  Frenkel is not afraid to show readers advanced concepts that are usually insulated and isolated by thick layers of experience and jargon.  I learned more about modern mathematics in reading this book than I have in quite some time.  The book also tells a human story of overcoming adversity in the face of unfair authority.  This book is a quick read and provides a great deal of food for thought on what to learn next."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28SB2PR7TLIKU"
                },
                "Date": "on May 13, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Well Professor Frenkel, as you were in the past in Kerosinka, I am a \"prikladnik\" and really I appreciate your book because we have almost the same situation (even I have to say that mine is more confortable compared to yours)!!! I have even even to say that you became an inspiration for me. Спасибо огромно для того чтобы вы писали эту книгу (Извенитие если я писал с ошибкой я только начнию учиться русский)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2N9PWWN2CXVYP"
                },
                "Date": "on December 14, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "The first half of the book is a fascinating tale of growing up in the old Soviet mathematical system. The second half describes the area of the mathematics that Frenkel now works in.  I'd have like more details of how Langlands duality works in mathematics however.  It seems to be more than the (still very non-trivial) Montonen-Olive Seiberg-Witten duality that the author  describes."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LLU5WCQ6TGP4"
                },
                "Date": "on December 3, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Fascinating and convincing essay on what makes mathematics a beautiful and addictive subject. I would have given the book five stars except that it got a little slow in a few places."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADEISKJ0BGGG2"
                },
                "Date": "on August 27, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I liked the anecdotes from Frenkel's Russian period and his discovery of mathematics as a source of universal truth and beauty. I support his mission to make math a part of culture just like art or music, by teaching it with love and respect for its aesthetic qualities, not as rigid drudgery which turns off so many young people."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQ9HGMT2WO6HS"
                },
                "Date": "on March 10, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "This young man is so passionate about math he goes a little overboard trying to share its intricacies with the reader; although I was a math major many years ago, I found my eyes glaze over in places. Still, you have to admire his talent and dedication, and he makes his personal experiences endearing and interesting."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2W8EKKZOTU29J"
                },
                "Date": "on March 12, 2014",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "3",
                "Text": "A book that is a memoir and a primer for those wanting to tackle contemporary higher mathematics.  I liked the memoir part and enjoyed the author's tales of mathematicians, but I slogged through the theory with much suffering and impatience.  I can see a person who loves mathematics would find it very engaging--for the rest of us, not so much."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EAPOERIH44P3"
                },
                "Date": "on January 15, 2014",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EX9HGY895E1D"
                },
                "Date": "on February 10, 2014",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SMHPIU7X9L9V"
                },
                "Date": "on July 9, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "The autobiography of a boy whose love for math took him from rural Russia to a professorship at Harvard, despite being denied access to Moscow's best school because of his Jewish ancestry. Revealing, moving, enthralling."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BU87JHSACCUQ"
                },
                "Date": "on October 5, 2013",
                "Helpfulness": 0.6818181818181818,
                "StarRating": "5",
                "Text": "Okay I am a math teacher and have never thought about all the history and relationships of math. This book brought a new thought about how I teach and why people don't like math"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FFVSCXPSX1MJ"
                },
                "Date": "on January 27, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Compelling personal story and journey.  Whether academician, mathematician, lay-person or student there is inspiration, hope and truth to be discovered and enjoyed.  Thank you Dr. Frenkel."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FX3LFJEP7O6V"
                },
                "Date": "on December 28, 2013",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GIBQBUS5PKNF"
                },
                "Date": "on December 2, 2013",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OWLFAUUY7OBX"
                },
                "Date": "on December 3, 2013",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "I haven't prepared a special review for this book, but I feel obligated to both Amazon and the author, Edward Frenkel, to acknowledge this wonderful work.  Although there are a few technical sections, there is something inspiring here for everyone.  A central theme is a variation of the Cinderella story.  Here we have a true story of a bright young man, born with profound abilities to understand and influence mathematics, who was purposely isolated physically and socially by the Communist regime in Russia.  Nevertheless, focused hard work and dedication resulted in an invitation by Harvard University to visit, study, and teach. Young Frenkel was just approaching age 21, and a Ph.D. degree in Mathematics quickly followed his visit. He is currently a Professor of Mathematics at the University of California, in Berkeley. You may look in on him at his website, [...] to watch him teach or see the impressive list of contributions he has published. All of my grandchildren have heard this message, and they are getting copies of Frenkel's book for Christmas. Inspiration can be contageous.  Edward P. Parris"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1F5CCBGB3T3W0"
                },
                "Date": "on December 5, 2013",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFS3GQEPOGME2"
                },
                "Date": "on October 1, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Even if I can't understand every detail, the big picture is clear - you never no where that path to truth come from or leads to."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XQN8L7BF14YF"
                },
                "Date": "on February 3, 2014",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34V5BYHKW3KBU"
                },
                "Date": "on January 2, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Poignant and valuable story of  Russian Jewish math genius and how math and physics are related. It was a revelation."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16IITISD2LAX0"
                },
                "Date": "on October 13, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38DU6T4KOK4G1"
                },
                "Date": "on November 15, 2013",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JCIWJ90665N8"
                },
                "Date": "on December 12, 2013",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "This book is interesting on several levels. First, it is an account by a world's leading mathematician of exciting recent developments in mathematics and quantum physics, presented so that they can be understood even by people far away from math. Second, it is a compelling personal story of overcoming adversity and fulfilling one's dream that many can relate to. And third, it is powerful narrative on what it takes to make a breakthrough or achieve something of great importance. It turns out that genius needs teachers and mentors just like everyone else; it really \"takes a village\". The book's success is not only in giving the reader a good sense of what modern mathematics is about, but in making it human."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GK6ADT70NLHB"
                },
                "Date": "on December 18, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "It was colorful and well-written.  The topic is a little narrow, but it does well with math appreciation."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EC5HDDYSBJI1"
                },
                "Date": "on April 20, 2014",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "2",
                "Text": "I saw Frenkel on Colbert and was very excited to get this book. It sounded like it was written for someone like me--I am almost 50 years old and still have yet to truly connect with math. I was very hopeful that this book would open something up. But it didn't. I understood nothing of the math that was discussed and I continually experienced that familiar bewilderment, frustration, and shut down that the author promised to replace with inspiration and excitement. His personal story is inspiring but math is still a completely hidden reality to me... maybe another lifetime..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A48YIVHN3J9EX"
                },
                "Date": "on February 10, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "A true delight! An eye opener.  I'm less than half way through and still on track. Thanks"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADVPZ3CN7AVVY"
                },
                "Date": "on November 26, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "A very good book that got me more interested in math than school has ever done."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MOMZ9C93UGY9"
                },
                "Date": "on January 18, 2014",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "Except for this book I'd never have had a shot at understanding what math really is, can be, is up to now.  I had to give it a second reading to understand some of the more difficult parts, but the autobiographical narrative all the math descriptions are embedded in made that possible and interesting to do.  I probably only understand the edges of the mathematical ideas in this book, but they knocked me into a new orbit nonetheless.  It's a deep pleasure to be so astonished."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARPI18O5LPH3T"
                },
                "Date": "on April 25, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Excellent!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A178QYD48YWL9B"
                },
                "Date": "on October 12, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Very much enjoying this book and the author's story of his life/career."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AML5KAUU9LA8U"
                },
                "Date": "on May 4, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I found it fascinating for the combination of personal history and mathematics lore. However, Frenkel's assumption that the typical reader can follow his explanations of abstract math and number theory seems unreasonably optimistic. It's a daunting subject, even for someone like me who was a math minor in college. Still, I recommend this book for anyone interested in what it was like to make a career, given antisemitism  in the Soviet Union, and for anyone interested in what's going on in modern mathematics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2690ILHA76XOI"
                },
                "Date": "on August 8, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Definitely learned things I never knew before. Fascinating subject."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32K2JH0VRWAUO"
                },
                "Date": "on February 3, 2014",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "I have never enjoyed a book about math more.  Other titles I have read, on probability, statistics, and other math concepts, always seem to skip though the most interesting aspects of the mathematics, most likely in an effort to be accessible to a wider swath of readers.  However, this book went into a surprising and refreshing amount of detail (especially with the endnotes), while still managing to stay engaging."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AV8MUNGMI5JL9"
                },
                "Date": "on December 27, 2013",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25ADVKUBGUZ4R"
                },
                "Date": "on March 24, 2014",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2C7JDP9PUMNMR"
                },
                "Date": "on December 28, 2013",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "A painless way to learn about the Langlands program, which is revolutionizing mathematics and is now spilling over into physics and computer science. It produced the proof of Fermat's last theorem, but that's just the beginning. Learn how sets are gradually being replaced by categories. You also learn how horribly Jews were treated in Russia even quite recently."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2R5LVMBWE5LVY"
                },
                "Date": "on April 23, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Author is very good at explaining higher  math to laymen."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MMXL1P18AL41"
                },
                "Date": "on April 19, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "A great book.  A good read and very instructive in math."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KBV0G9ULFG7V"
                },
                "Date": "on April 18, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HKFPL8YOWXXQ"
                },
                "Date": "on October 8, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I bought the audiobook and the Kindle book, but I found it too difficult to follow the information on the audio, as it always refers to numbers, symbols and equations. The information was worth reading, so I could get an overview on what a “mathematician world” is like. The information is way too complex to understand, at least for me who does not have any mathematical background."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18XWI9FR9W5MU"
                },
                "Date": "on January 31, 2014",
                "Helpfulness": 0.6,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3K9YD805629I5"
                },
                "Date": "on July 10, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I am not a math fan but the authors passion for the subject was what drew me to the book and kept me interested throughout."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJR1A803IPTCT"
                },
                "Date": "on May 31, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Edward Frenkels passion for mathematics is infectious. I was fascinated by his life story and how his searching for mathematical knowledge drew him to mentors who encouraged him on his journey of discovery. He was able to convey his story with a sense of warmth and enthusiasm which enabled me to view mathematics in a new light. I did not fully understand much of the formulae but as I persisted I was rewarded with an overall understanding. I found the combining of writing, the arts and mathematics another means of Edward Frenkels enthusiasm."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2X430317M9G8F"
                },
                "Date": "on November 1, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I am not a mathematician. I loved this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1D36RMZG4CIII"
                },
                "Date": "on May 11, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Great"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANRXJOYGQW5MW"
                },
                "Date": "on March 16, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BWVMCCMS211X"
                },
                "Date": "on December 29, 2013",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5HAJA1EROGTN"
                },
                "Date": "on September 13, 2014",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "3",
                "Text": "I gave this book a rating of 3 because the math was very complex for me.  The book was written in a casual manner, with a lot of interesting anecdotes that provided my wanting to continue reading.  It was thought provoking."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29RKWWEWMTMRX"
                },
                "Date": "on December 1, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Edward Frenkel's math history promotes an important life strategy of tenaciously pursuing what brings enjoyment. For younger people who find mathematis interesting, the understandable examples of complex math theories could encourage them to delve deeper into secrets of the universe."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QGZTORTP99RG"
                },
                "Date": "on October 6, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Great book, worth reading for the author's life story alone. Much of the math is incredibly sophisticated, but that's probably to be expected given the author's accomplishments. Nevertheless, it's enlightening to read about the interactions between math and physics at this level."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2C793GY3LA3AL"
                },
                "Date": "on December 7, 2013",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "3",
                "Text": "Much of the mathematics was obscure and not easy to follow.  The explanations could have been much clearer.  Otherwise the book was interesting."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WV8Y608V90IJ"
                },
                "Date": "on October 24, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13FZLFM7FVV05"
                },
                "Date": "on December 23, 2013",
                "Helpfulness": 0.625,
                "StarRating": "5",
                "Text": "The best part of Frenkel's book is the autobiographical parts, telling of a bright young Jewish student in the last years of the Soviet Union and how he prospered in mathematics through determination and the support of teachers int he face of official discrimination. Fascinating! Almost as good are the parts where he talks about the math, where he does a great job of making some fairly complicated ideas understandable. I can't say that I cared for his musing on math and art, however.  But his love for math shines through and makes the book. (I'm not a mathematician, but I am a scientist and have a decent math background. It's not clear to me how much someone with little or no math background would get from it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NVTP8R1Q5X7P"
                },
                "Date": "on November 10, 2013",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2B6CL4HSWLCY1"
                },
                "Date": "on February 23, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This book,albeit sometimes more autobiographical than technical, has the power to open the readers mind into this wonderful world of mathematics. It breathes life and relevance into a world few understand."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUE38ASZ29XGJ"
                },
                "Date": "on January 11, 2014",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "Author's love for maths and ability to put them in words is profound. A great work for people who are looking for a maths connect and perspective."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OIVHYUQ6PY6E"
                },
                "Date": "on October 1, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Worth reading every word"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LMZS5ZEXYWE9"
                },
                "Date": "on May 20, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1U5M9DA3WQY2W"
                },
                "Date": "on October 26, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Even though I am seriously math-challenged and most of the math in the book was beyond my reach, the sub-text was riveting and well worth plowing through the book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A190TI25PM295E"
                },
                "Date": "on February 17, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CMN3JULOKI22"
                },
                "Date": "on September 11, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "A fascinating story."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27M27Q0U55UB5"
                },
                "Date": "on December 26, 2013",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NIY1RKB3GPJN"
                },
                "Date": "on February 20, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "This book. It is incredible. Full of passion and wit, Frenkel clearly has great talent with the written word and an equally brilliant aptitude for pure mathematics. He draws together a broad narrative and weaves it together very well, showing the links between pure and applied mathematics, and the link with theoretical physics, especially in regard to quantum field theories and string theory, The Langlands Program, as far as I am concerned, is the real future of pure mathematics. I can see great application to theoretical computer science, in particular to quantum computing. This is highlighted by his introduction to category theory, much like set theory but rather than working with numerical outputs of functions, we deal instead with vector space outputs. A fascinating read - highly recommended."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21P6ZJZSLCXS5"
                },
                "Date": "on November 27, 2013",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "This is a wonderful book that gives the reader a deep sense of what modern mathematics is about and what it is like to be a mathematician. The author is on a mission to open up the hidden universe of mathematics to everyone. He presents fascinating ideas, such as the Langlands Program, in an accessible and entertaining way, using analogies we can all relate to. Math comes alive as humanity's infinite quest for truth and beauty. Author's passion for mathematics is palpable, and this is what makes this book such an enjoyable read. His personal story is gripping and moving. He says in the Preface that after reading this book, \"mathematics will get under your skin and your worldview will never be the same\". In my opinion, he delivers on this promise."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16BY0Y11RUNWI"
                },
                "Date": "on May 20, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "wonderful reading"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARU4ZKRI6YQUY"
                },
                "Date": "on April 29, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23GTDVKUYFKW4"
                },
                "Date": "on March 7, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Excelent book!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4X6Y7FZSHHOG"
                },
                "Date": "on January 18, 2014",
                "Helpfulness": 0.6,
                "StarRating": "5",
                "Text": "This is an amazing book containing both challenging math and interesting story. I can't say that I started loving math after reading this book (because I always did), but it certainly reminded me once again about beauty and power of mathematics. I'd like to thank Edward Frenkel for this fascinating experience and wish him very best in his future career."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AN5QH1P3ELNFD"
                },
                "Date": "on February 3, 2015",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": "After the raving praise at the beginning of the book, I was prepared to have my socks knocked off. No such luck. While Frenkel's life story (mainly his overcoming the antisemitism of the former Soviet Union) is interesting, his writing style and self-indulgence makes this book an unsatisfying read. The math is challenging, and there is a lot of it. And Frenkel fails to explain why the reader should care or struggle through it (I did). The connection between math and the erotic movie escapes me."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LCLTLJLYQC97"
                },
                "Date": "on November 17, 2013",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PEY7PZMWBIOC"
                },
                "Date": "on December 24, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Great book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32K4BL9TV11BQ"
                },
                "Date": "on November 18, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This book is a good starting point for unraveling the mysteries of mathematical concepts."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UDPJPYQIMAX2"
                },
                "Date": "on May 17, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "This book has regenerated the love I once had for mathematics when I was in college. Dr. Frenkel cleverly crafted this read understanding he has the ability brighten the bulb for those of us that left this love dormant due to life's personal events. Reading this book once was not enough so I had to read through a second time. I am back once again exploring the fabulous world of number theory and manifolds. Who knows what the future holds."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3P7QNRVHPPNDL"
                },
                "Date": "on May 31, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Frenkel shows his love for math, through his life, study and research chances, adventures against Semitism in Russia (University of Moscow). A math genius, he elaborates some mathematical problems and challenges, aiming to exemplify useful applications. I don’t know if we can “explain” love mathematically, but he tries to approach this rather complex issue in an agreeable manner. A daily dimension of math appears in the book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATRXZUJ68CLEZ"
                },
                "Date": "on May 26, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "This book succeeds in outlining one of the more advanced research programs in mathematics, which gives the layman some insight into what mathematicians do. I'm no expert in the Langlands Program, but this exposition whet my appetite to learn more about it. The biographical sections about the state of mathematics in Soviet Russia, and the anti-Semitism the author had to deal with, were enlightening!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADL9TWLZGP66A"
                },
                "Date": "on June 23, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "An interesting combination of an autobiography and the latest developments in the unification of branches of mathematics and their potential application in theoretical physics. The biographical aspect of the book are fun to read, the unification of mathematics require more concentration and I found more interesting."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A624DYJM1XBCM"
                },
                "Date": "on June 18, 2014",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": "There must be other more interesting books about maths.  But the stuff about antisemitism in the USSR was amazing.  What a bunch of dummies were in charge of the USSR; they needed the help of all the bright people they could get.  Imagine if the USA was antisemitic, how much worse off the place would be?"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LKHGPVZ6EJE3"
                },
                "Date": "on January 18, 2014",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": "This book was bought as a present but I did read it first. It provided a clear and accessible explanation and examination of developments in mathematical theory  in the decades since I last engaged in any study of the subject. I am eager to hear what my nephew, for whom I had bought the book thinks."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MTJ463HP54NH"
                },
                "Date": "on May 18, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This was a gift for someone. I'm pretty sure they liked it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TQ1YEZA6PFHV"
                },
                "Date": "on February 10, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Awesome. Very inspiring, and extremely interesting."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QOL8I2UDUV0A"
                },
                "Date": "on August 15, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Great!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1B8ODTGLSDNFQ"
                },
                "Date": "on April 12, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "A good mixture of story and how he arrived at where he is today. Excellent explanation of some pretty deep concepts enhanced with very good illustrations. Some mathematics background is helpful i.e. number theory, sets, etc. but not necessary."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQPTUAFFK8LH4"
                },
                "Date": "on November 28, 2013",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Frenkel is a world class mathematician but also a true Renaissance man. Here we see both the story of his life, his love of math, and his love of the arts as he explains to us that of course math is one of the arts. Superb!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PQ0BNNM9R59Z"
                },
                "Date": "on June 16, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "A clue and aid for many of us who found their mathematical educations frustrated in high school by a system or teachers who failed to support us, when a little help would have made a huge difference."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A181MOQ6EVPVJA"
                },
                "Date": "on February 7, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Wow! Well written, dense with high-powered math and a \"lovely\" finish. The math is well motivated and makes a great story even though it's beyond this reader's comprehension. Bravo."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFIH4V6JXJ92O"
                },
                "Date": "on December 3, 2013",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Prof Frenkel is an engaging writer, intermixing his personal and professional voyages from a disadvantaged minority in Russia/Soviet Union to a successful mathematician at UC Berkeley."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21UTVO9ZNZ31X"
                },
                "Date": "on February 8, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "liked it.  approachable math and good story context making complicated concepts slightly more understandable.  Interesting historical depictions about Soviet Russia and life there."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGKKKG1TXRTOI"
                },
                "Date": "on December 13, 2013",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Frenkel is the most effect communicator of the beauty and joy of doing mathematics for the non-specialist. The book was fun to read and informative even to the mathematician."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LS4ELHGFEF6V"
                },
                "Date": "on April 15, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "This remarkable book made the beauty of mathematics available to an ordinary non-mathematician who always viewed mathematics as a practical if sometimes mysterious subject!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AO33R0PA20MH2"
                },
                "Date": "on November 15, 2013",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "excellent and clear explanations by the author ,of mathematical theories, mixed with a passionnate love story between himself and maths :a must read"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DOSJESA8XQIT"
                },
                "Date": "on May 1, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "You don't have to have a math degree to enjoy this wonderful book that introduces the reader to the wonders of math and the nature of the Universe."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AG1XD63KZHHNU"
                },
                "Date": "on November 4, 2013",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "i wish i had had this man for a math teacher or professor in college---he makes it real, particle and engaging---"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3H6FJCSOBEXQI"
                },
                "Date": "on January 13, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "This was a gift to my granddaughter, who is a graduate sgtudent in Math.  All I know is that she loves it!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A141S5WFB1SD0A"
                },
                "Date": "on March 20, 2015",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": "Don't be seduced by the author's opening preface where he makes a very convincing case at the beginning of the book how much he wants to share his love of math with the rest of us.  He seemed so sincere, unfortunately his point of view and his translation of the subject might as well have been written in Latin as so much of the book is simply incomprehensible.  I read only non-fiction, yet I found this book impossible to connect with and no plausible way into the subject and I came away with only one aspect of mathematical understanding, which is ZERO."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15PSXIH0UHLBN"
                },
                "Date": "on May 21, 2015",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "Sorry I'm an engineering graduate of a very tough school who loved math.  But this was too much for me.  The stories were interesting but following the math was tedious.  It wasn't what I was expecting.  I thought reading it would rekindle the love I actually experienced in my math classes: trig, solid geometry, calculus, differential equations.  Maybe too many years have gone by."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GFGRCGMEEXEK"
                },
                "Date": "on March 26, 2014",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": "Recently, books have been appearing in which an applied mathematician will mix stories about his own research with an introduction to some field such as applications of nonlinear dynamics.  This book is a departure from this format.  First, there is an absorbing embedded story of how the author, growing up in the USSR, managed to surmount the obstacles placed before Jewish mathematicians in attaining a top position in the system.  When he relocated to the USA, his life changed and his mathematical creativity was recognized in a new field of pure mathematics, which takes me to the second element of the book: an introduction to the excitement of doing pure mathematics.  I'm trained in mathematics, although not with a Ph.d., and I immersed myself in his presentation of his field, finding it very interesting indeed -- although it can be tough reading even with some advanced math background.  I enjoyed this book very much and, by the way, I agree with the author's critical review of a book by Max Tegmark that concludes that the universe is made of purely mathematical objects.  This absurd idea shows that it's possible to have mastered theoretical physics and cosmology and still not grasp elementary metaphysics.  Frenkel avoids that trap because he seems to have a good understanding of the philosophical interpretation of natural science as well as a powerful command of the difficult terrain of the frontiers of pure mathematical research today.  I very much recommend this book for those who love mathematics as such even if its motivation in internal to math and not (initially) linked to a scientific problem."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NVWB6JT4TCMS"
                },
                "Date": "on January 14, 2015",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Excellent Item and Fast Shipping! Thanks!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3U7AMV27SUSB8"
                },
                "Date": "on March 17, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AITPGKBCLEBH"
                },
                "Date": "on March 14, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Having a background in math in applied math, this book gave me an appreciation for the goals and joys of pure math."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1D7RRAX5589Q1"
                },
                "Date": "on January 25, 2014",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": "Some have suggested that they have never associated \"Love\" and \"Mathematics\" before, but Dr. Frenkel's book communicates a passion for living the life of mathematics in a way that no other book does.  For the great mathematicians \"passion\" not only reflects their love of mathematics but the way they live.  Dr. Frenkel lives this passion and the story behind \"Love & Math\" provides a glimpse into how this passion developed during those challenging early years when he was a young man in Russia.  Passion overcomes any obstacle including the apparently insurmountable barriers of State sanctioned discrimination.  It's impossible to finish this book without feeling a compelling drive to learn more mathematics.  I have taught college mathematics for a number of years and I have always found inspiration in the driving energy and expansive imaginations of the great mathematicians.  Dr. Frenkel carries on this tradition beautifully, for in the end it's beauty that defines great mathematics.  Thank you Dr. Frenkel."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32D23SF6K8U0N"
                },
                "Date": "on March 19, 2015",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": "This book is way too technical for the non-mathematician. Clearly, the author loves mathematics, and his love comes is obvious throughout the book, but the formulas and his discussion of mathematical concepts are daunting."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3H1VHLV3VBKQ4"
                },
                "Date": "on August 5, 2014",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "But that may be what you are looking for; this is not a textbook or (apparently) meant to teach; somewhat good for inspiration, but if you have that already you do not need to get more here"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LDEQILUZMR8Z"
                },
                "Date": "on January 1, 2014",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "It's an eye opener! But the real math chapters are, despite  the author's effort to simplify, often hard to follow. Love didn't flew in but nevertheless I now can see more clear!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AG54SU43HX1MQ"
                },
                "Date": "on November 27, 2013",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": "I studied math and this is the reason why I must give 5 stars to this one of kind of math book! A young mathematician from Russia is attractive enough.  Why Russians like math? This book will tell you one of the hidden reasons.  Yet, why should we study math? A little disappointed as Frenkel 's arguments are not convincing enough to lay people ... some examples even scare people away! Afterall, math is the heart of our hidden reality is so true, yet I don't believe there is anyone on earth today can convert those who hate math into mathematics lovers, sorry, mathematics passion is innate is the best I can explain!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QJDEVNS6U7HN"
                },
                "Date": "on March 8, 2014",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "Lots of math, but a great story from a passionate guy. Fun read. Very informative to an engineer or scientist not too familiar with the cutting edge of math."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATXOOY9SEKZCL"
                },
                "Date": "on November 19, 2013",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": "Dr. Frenkel's personal story is compelling  with his struggle in the Soviet Union to get an education that was mostly denied to Jews. The mathematics however is difficult to comprehend even if you are familiar with math at an undergraduate level."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADOQZTI54PTQN"
                },
                "Date": "on February 22, 2015",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Great condition!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KFKZBJADKH18"
                },
                "Date": "on July 14, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Very insightful."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2V5YR1MT0EA7D"
                },
                "Date": "on May 10, 2014",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "Analogs for anyone and everything in life today and forever.Everyone should read this book. Very insightful and easy reading.Thank you Edward Frenkel.."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GLHB44VBCF94"
                },
                "Date": "on January 23, 2014",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": "The first half of the book is very readable, since it covered the very interesting history of Frenkel as he discovers the beauty of math and manages to deal with the anti-Semitic society in Russia with the aid of several mentors. In the second half he concentrates on math, which is really the main focus of the book. It might be a little heavy for some, but I loved it. You just have to learn to skim (or skip) over material that is too technical for your taste (or experience) and not feel guilty about it. That ability is necessary for reading many other good books (and papers)."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23UAL6E3QL4VF"
                },
                "Date": "on April 13, 2014",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "The author tries to simplify, but remains entangled in a complicated language, and jargons, concerning concepts far too difficult to most readers."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VDU6NSFM1VTT"
                },
                "Date": "on January 28, 2014",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "4",
                "Text": "Great read. It is one of rare books (maybe only boook?) that attempt to bring the world of modern math to broader audience. Where else could you see a world-class mathematician trying to explain the concept of manifold, elliptic curve, and what Langland program is in layman's word? Mixed with the author's  tumultuous life, the story is very engaging. I would have give 5 stars if I could understand all these math concepts in one read but I was so curious what happened to the author that I had to skim through some chapters and come back later."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A373GNRV706WAA"
                },
                "Date": "on April 29, 2014",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "I liked it a lot and expect to finish it --- and as a non-mathematician. I was surprised to stick with it. Good writer. Carol Cook"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36J9UU8JBOAT9"
                },
                "Date": "on December 23, 2013",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": "fairly boring for the rest of us.  The most interesting parts of the book are the author's descriptions of his own life.  The math is too arcane for anyone but the most die hard math geek."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12315HS7O4DFN"
                },
                "Date": "on August 16, 2014",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "Still waiting for a chapter that I can keep up with. More challenging than I anticipated. Makes it a not so pleasant read"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LA098P2UJP7Y"
                },
                "Date": "on February 7, 2014",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RKS9KC04UXJP"
                },
                "Date": "on February 17, 2015",
                "Helpfulness": 0.4,
                "StarRating": "2",
                "Text": "I have an undergraduate degree in math and think this book is way too hard to follow. Part of the problem is the huge amount of material which is stuffed into the footnotes. This makes the book seem very unorganized. There are as many as three footnotes per paragraph so one is constantly switching back to the end notes and sometimes these notes themselves refer you to other end notes. The Author should have spent much more time carefully organizing and explaining the material so that at least the main text flowed smoothly and logically."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12U69GYO6T0SA"
                },
                "Date": "on June 13, 2014",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": "This book sums up every reason why I love being a mathematics major and I hope it opens the eyes to other people that it isn't a terrifying subject."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18IUIDX76XL8W"
                },
                "Date": "on December 19, 2014",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "Not an easy read but worth the effort"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3I4NHT4QNUAJP"
                },
                "Date": "on February 18, 2014",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": "Incredible-will change many peoples life who just did not get it in school. Wish he was my teacher. Thank you"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22SVH8ONICQS9"
                },
                "Date": "on March 30, 2014",
                "Helpfulness": 0.4,
                "StarRating": "5",
                "Text": "As someone who grew up convinced he would one day prove the Goldbach Conjecture, but now toiling away in front of computer statically arbitraging stocks, this book brought back so much of my fond memory of doing math for the pure joy of doing math."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KS0KP5CRY6SJ"
                },
                "Date": "on December 24, 2013",
                "Helpfulness": 0.4,
                "StarRating": "4",
                "Text": "Good book, great reading. I would highly recommend this book to young people.  Gives a good understanding of life and how to live a good life"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A555L6NGMG9IN"
                },
                "Date": "on September 10, 2014",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "Ok not great"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQFDQVYNLJFT2"
                },
                "Date": "on February 7, 2014",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1X03I2EWKLVYV"
                },
                "Date": "on May 7, 2015",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": "Theme of the book makes sense.  His personal story has interest. The math is pretty much incomprehensible and he falls short in using terms of little meaning to a no math person. Such as elegant."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZ1MAIE3UJ7KB"
                },
                "Date": "on August 28, 2014",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "I would suggest this book to everyone who ever been attracted to mathematics beauty and love to explore more about today's modern mathematics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOVNJGI1EWAMX"
                },
                "Date": "on January 9, 2014",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "This was exactly what we were looking for and completely met our expectations. We would order this product again.\\ in the future."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5OF60ALB38VK"
                },
                "Date": "on March 26, 2014",
                "Helpfulness": 0.25,
                "StarRating": "5",
                "Text": "Good lifestory and interesting inner math details at the same time. As I live in Belarus it is interesting how it was in USSR and as I am interested in math it is very useful overview of modern math"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QKZ64IFPJNKT"
                },
                "Date": "on January 5, 2014",
                "Helpfulness": 0.25,
                "StarRating": "5",
                "Text": "I got this for my husband as a birthday present. He really enjoyed the author's story and since he teaches remedial math, he found this very helpful for his students."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BF5PC9QM5NUK"
                },
                "Date": "on July 21, 2014",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VO5J2YNXJUIE"
                },
                "Date": "on March 12, 2015",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": "Did not like book too technical"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKDH2RCOM2VP6"
                },
                "Date": "on July 2, 2014",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "Very interesting read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3P3Q1WODHBGSW"
                },
                "Date": "on June 22, 2014",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "Although I found it interesting from time to time, it is not holding my interest for long. That is all."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GDPC555WC68B"
                },
                "Date": "on December 24, 2013",
                "Helpfulness": 0.4772727272727273,
                "StarRating": "1",
                "Text": "One admires the author's zeal, but finds the concepts way beyond a layman's understanding. I confess to some embarrassment to writed this."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHELDEDJS9EKR"
                },
                "Date": "on October 23, 2014",
                "Helpfulness": 0.16666666666666666,
                "StarRating": "3",
                "Text": "Over my head."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATS1VUKLT169K"
                },
                "Date": "on November 23, 2013",
                "Helpfulness": 0.423728813559322,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AWFVQV01TWLF"
                },
                "Date": "on July 25, 2014",
                "Helpfulness": 0.16666666666666666,
                "StarRating": "1",
                "Text": "Not well written or helpful for those who expect inner perspectives on math genius"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANO1UKL1RE7FB"
                },
                "Date": "on August 2, 2014",
                "Helpfulness": 0.18181818181818182,
                "StarRating": "1",
                "Text": "Waste of time"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18R0EO2D5ZANG"
                },
                "Date": "on October 24, 2013",
                "Helpfulness": 0.34615384615384615,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A152GPEHKADO1I"
                },
                "Date": "on November 18, 2014",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": "I dont see how this wil work and asked right away for refund NO response- I buy a lot on amazon no perks no nothing I am looking to shop elsewhere. In this day you should have some incentive to shop here."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FWBF2S79WS5A"
                },
                "Date": "on January 9, 2014",
                "Helpfulness": 0.043478260869565216,
                "StarRating": "1",
                "Text": "I thought he made two mistakes in the opening chapter so I decided to skip the rest of the book."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Love-Math-Heart-Hidden-Reality/product-reviews/0465064957/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "195"
    },
    "Salesrank": "#18,961",
    "Timestamp": "2015-05-24 13:12:24.039509",
    "itemurl": "http://www.amazon.com/Love-Math-Heart-Hidden-Reality/dp/0465064957"
}
