{
    "Category": "in Books (",
    "ListPrice": "",
    "Name": [
        "Teaching Introductory Physics"
    ],
    "OfferPrice": "$121.20",
    "Reviews": {
        "AverageStarRating": "4.9 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25MDF8HCA1YBK"
                },
                "Date": "on August 14, 2006",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I need to reiterate the sentiments I have already read. This book is a vital resource to anyone who instructs physics at any level. I have recommended it to anyone I come across at AAPT meetings or in my department.  This book has the special quality of adding the missing pieces that are crucial for understanding for many students.  My analogy is it adds the water (reasoning) to kool-aid powder (equations) that is physics.  For example, Arons discusses why it is good when students are suspicious of action at a distance and gives a great discussion of how science rationalizes this spooky behavior. (Surprise! Many great scientists also werent immediately sold on fields!)  Physics is full of these ideas that are hard to swallow for first time students and this really helps the teacher understand the questions and problems that students have.  Strictly students are not gaining any new content when applying the ideas of this book, but this book codifies the concepts into a meaningful framework.  Highly Recommended!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 3, 2002",
                "Helpfulness": 0.8235294117647058,
                "StarRating": "5",
                "Text": "If you are a physics teacher in high school or freshman college or university, you should own this book.  It allowed me to step in and address student difficulties in my first year teaching physics after 10 year of applied-physics research.  Who could imagine that students would have difficulty with \"simple\" concepts such as torque, kinematic time concepts, and a realistic view of static electricity?  Arnold B. Arons would, and you should!  I worked through freshman college geology and AP statistics, grappling painfully with \"obvious (sorry for the over-use of quotations, but I feel strongly about this)\" topics that confused my students, but I feel that I slid smoothly into introductory physics because of Arons's insights, literature analyses, and clarifications.  My students may not always appreciate labs and classworks that require unexpected thought and paradigm-shifts from Aristotelian thinking to rigorous classical-physics frameworks, but ultimately they benefit from the challenges that Arons asks us to accept and acknowledge.  This book is Essential, I can't stress this strongly enough!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35SSFWGOXU1GU"
                },
                "Date": "on September 12, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PRYK9DUEXCKN"
                },
                "Date": "on October 3, 2007",
                "Helpfulness": 0.7857142857142857,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A49SC8NL7CCH"
                },
                "Date": "on August 28, 2000",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": "This book is the best book I have seen so far about teaching physics. One  can find the preconceptions of students, anticipated difficulties in  teaching, recommended strategies for each topic, very well structured  homework and test questions... A teacher (or an educated learning  facilitator in a physics learning environment) can find several ideas and  methods to create a fruitfull, pleasent, efficient learning experiences for  students. The only thing that I did not like in the book is the  non-existence of solutions to questions. It deserves 5-star. Higly  recommended"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10E2440TZOOK7"
                },
                "Date": "on July 21, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANWEI7AFJFKL1"
                },
                "Date": "on August 2, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "If you are serious about teaching physics, this valuable resource should be in your library! Arons dissects the understanding of physical concepts that surpasses any instruction I've encountered."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AY9M7HXDU19MO"
                },
                "Date": "on October 5, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZHGS1NAED9PO"
                },
                "Date": "on December 14, 2011",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "A comprehensive covering of the issues and misconception involved in teaching Physics. No Physics teacher should be without it, at any level!"
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Teaching-Introductory-Physics-Arnold-Arons/product-reviews/0471137073/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "9"
    },
    "Salesrank": "#638,763",
    "Timestamp": "2015-05-24 13:28:26.123873",
    "itemurl": "http://www.amazon.com/Teaching-Introductory-Physics-Arnold-Arons/dp/0471137073"
}
