{
    "Category": "in Books (",
    "ListPrice": "$18.95",
    "Name": [
        "Blackfoot Physics"
    ],
    "OfferPrice": "$15.12",
    "Reviews": {
        "AverageStarRating": "4.3 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A270CUU2XR7R28"
                },
                "Date": "on August 4, 2003",
                "Helpfulness": 0.9302325581395349,
                "StarRating": "5",
                "Text": "It takes a while to get into this book because the first chapter is a bit boring (needs some serious editing, in fact). But once past that hurdle, there's not a dull moment. While one might take issue with the author's apparent attitude that the Native American version of science is superior to that of the Western world's, there's no doubt that the Western world has missed a lot of vital information about the nature of reality. The Native Americans were shoved aside by the Western invaders, who seldom had the sense to acknowledge the wisdom (not to mention the mathematics and the astronomy and the way to make a decent canoe) that the natives had to offer; now we're learning that much of what the natives believed is echoed in the new physics that is still being examined."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14OJS0VWMOSWO"
                },
                "Date": "on February 13, 2003",
                "Helpfulness": 0.875,
                "StarRating": "5",
                "Text": "Blackfoot Physics: A Journey Into The Native American Universe is a melding of anthropology, history, metaphysics, cosmology, and quantum theory. Written by F. David Peat (a theoretical physicist who has also studied Native American ceremonies and traditions such as the Blackfoot Sun Dance), Blackfoot Physics strives to bridge the gap between diverse understandings of the universe, while crafting parallels between science and spirituality. A unique and original work of insight, Blackfoot Physics in a unique and strongly recommended contribution to Metaphysical Philosophy and Native American Studies."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1C0MSP4K5D3AD"
                },
                "Date": "on November 24, 2013",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "In this unique book, Peat draws some intriguing comparisons between traditional Native American cosmologies and the cosmos as seen by contemporary physicists. This is complicated material but Peat presents it in a reader-friendly manner that is both informative and entertaining. Once again, there is nothing new under the son, and the Blackfoot tribe's worldview meshes with that offered by relativity theory and quantum mechanics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GE5TAN73Q3FA"
                },
                "Date": "on April 20, 2015",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "I have only read about FORTY per cent so far but what this author has related takes time to digest his multfaced observatons as well as comments about the Native American ways of thinking , their justice systems, their behaviors and prospectives of the cosmos-----i will do a full review after reading it thru at least twice since he broaches on many concepts that need to be thought out before rending a decision."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DTPXYIM3Z2G"
                },
                "Date": "on August 19, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book is very helpful, in that it shows the differences of time evaluation. A correlation of events as seen through western euro training, the views of a scientist, beginning to understand that there is value to an indigenous world view. And so the unfolding of this tale is more then just the words on the page, but also the implications of definition. A very informative book. Thoroughly enjoying it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34ZNCPTXG5Z9I"
                },
                "Date": "on March 31, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "One of my ancestors, Charlie Dawson, was a blackfoot.  I found this book very interesting.  I can relate with alternative belief systems, as well.It is well written and fun to read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OU9RI9REK82Z"
                },
                "Date": "on August 6, 2009",
                "Helpfulness": 0.6,
                "StarRating": "5",
                "Text": "Being read with great interest by my Book Club in San Miguel de Allende, Mexico.  We are all, in the group, quite stunned by the conjunctions taking place here and in the U.S. with regard to the 2 arches of: (1) indigenous approaches to the world and (2) the findings of quantum mechanics and physics, getting nearer and nearer to one another.  We would recommend it to any seeker or thinking individual.  Our next book, because of the questions this book has raised, may be Karen Armstrong's, The Great Transformation.  It was recommended by Paul Hawken at the 2004 Bioneers Conference, as a way to discover how and why we are where we are philosophically/spiritually/religiously speaking."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJOPFK4LMB7RB"
                },
                "Date": "on February 13, 2009",
                "Helpfulness": 0.6428571428571429,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JJ2RCS1SU3MM"
                },
                "Date": "on October 2, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Needed this book for a college course. Haven't really read much of it yet, but it shipped fast."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7GMRF7BCJO36"
                },
                "Date": "on November 24, 2009",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "I have only read chapters seven and eight for now because I am usuing them for my History of Native American Mathematics research paper.  This book is so interesting that I forget to mark what I want for my paper and just continue reading.  This is the BEST book I have ever read so far.  I love F. David Peat's elegant writing style and usage of quotes.  His scientific explainations are very thought provoking, but not extremely advanced and tiresome.  I will definitely be finishing this one!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2J588158KIIAS"
                },
                "Date": "on November 5, 2007",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": "Grounds heady new understandings and observations in physics and quantum physics with the human sense of the sacred found within the human experience and wisdom of indigenous peoples. The child within you just might remember. Worth the time and expense."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKSPN357I4MDY"
                },
                "Date": "on April 14, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Used for school."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3C10WRWSY149N"
                },
                "Date": "on December 1, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Excellent book that opens the reader's mind to a world view that is often felt but rarely spoken of with such an articulate voice."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Blackfoot-Physics-F-David-Peat/product-reviews/1578633710/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "13"
    },
    "Salesrank": "#625,486",
    "Timestamp": "2015-05-24 13:12:49.847247",
    "itemurl": "http://www.amazon.com/Blackfoot-Physics-F-David-Peat/dp/1578633710"
}
