{
    "Category": "in Books (",
    "ListPrice": "",
    "Name": [
        "3,000 Solved Problems in Physics (Schaum's Solved Problems) (Schaum's Solved Problems Series)"
    ],
    "OfferPrice": "",
    "Reviews": {
        "AverageStarRating": "4.4 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AGZ2XBT5MRAX"
                },
                "Date": "on February 27, 2005",
                "Helpfulness": 0.9859154929577465,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A298F0QB0364RL"
                },
                "Date": "on June 11, 2000",
                "Helpfulness": 0.9827586206896551,
                "StarRating": "5",
                "Text": "This remains my favorite book for physics problem solving since I began using it in 1988.  From the basics of vector algebra to the principles of modern physics, the student will find a single source for solved problems  (both non-calculus and calculus based).  The mathematical notation is clean  and simple and the solution to each problem is found immediately beneath it  (not hidden at the end of the chapter or collected in the back of the  book).  The diagrams are elegant and clear, as well, with a minimum of  \"cute\" (and usually irrelevant) materials.  The student can add  this book to their reference library and it serves as one of the best  review texts for the standardized tests (such as the GRE and the MCAT)."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2V4VW1HR0KQ2V"
                },
                "Date": "on March 4, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 3, 2001",
                "Helpfulness": 0.9629629629629629,
                "StarRating": "5",
                "Text": "I took a General Physics I class last semester in College (I never took it in high school) and I was very lost for a while.  If you've never done a Physics problem and then see all these new concepts and see how much mathematical thought is required -- well, let's just say it's very intimidating.  As my instructor said, the only way to get good at solving physics problems is to do physics problems.  He advised us not to give up in attempting problems and to \"sleep on some\" and have a go at it again the next day(Great advice, by the way!).  With this book, and the abundant number of problems in it, ranging from easy to challenging, I was able to get an A in the class.  The author included in this book a \"Skeletons\" outline in the very beginning in order for the student with minimal time to get the maximum benefit:  mock homework, exams, and final exams.  Awesome book, I'm so glad I bought it... and I will be taking Physics II!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on November 23, 2002",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 6, 1999",
                "Helpfulness": 0.9473684210526315,
                "StarRating": "4",
                "Text": "I use this book instead of my textbook. The problems start out easy and become more difficult as you progress. This approach works for me. You must learn how to do the easy problems first. Once you've mastered those, then  move on to the harder problems."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1J3JXEFO2AZEZ"
                },
                "Date": "on April 15, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UNJ0TOI6HNAY"
                },
                "Date": "on July 8, 2006",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 9, 1999",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "For any one who study introduction physics courses this book is a good source for practicing to Solve a physics problem, however I think it was written for the student new in the world of physics, And it is not a good  source information for advanced physics studying."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 22, 2004",
                "Helpfulness": 0.84375,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 1, 1999",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "It lacks really hard problems, but for coverage of the basics it is hard to beat."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7JEYFSKE91NL"
                },
                "Date": "on June 24, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I bought this book to help my daughter with her physics class.  I just wanted to help her practice with a few of the easier problems given that she is still in high school. Surprisingly, I found the book  better in comparison to the problems given in her actual textbook.  Obviously, one cannot learn physics from scratch by doing these problems alone. Some initial instruction is required.  However, once the basic concepts of physics are learned, this in turn becomes an excellent practice guide in order to master the topics covered. No matter what your level of acheivement is, this book will help you get to the next level.  I wish I had found this book a lot sooner."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AS8QOGUEU9RWY"
                },
                "Date": "on November 16, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I have been using this book for 3 semester. Classical Mechanics, Optics and waves, and Electricity and Magnetism. Using this book to help study for my exams has proven invaluable. The questions in this book are much more similar to test questions than the textbooks we are using. This book also sets a foundation for easier concepts which are critical for understanding more complex ones. There are no questions in this book that I have found so far that haven't been worth my time, which I can not say for other text books."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Q9FE90MFDDBH"
                },
                "Date": "on April 23, 2006",
                "Helpfulness": 0.8888888888888888,
                "StarRating": "5",
                "Text": "I bought this book back when I was in high school to help study for physics. I'm now in first year engineering and I still find it useful. This book is excellent because it has so many problems of every type which I found very useful while studying. I would strongly recommend this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16HXLP3F4TEX2"
                },
                "Date": "on September 12, 2011",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ST86YP0N2X5J"
                },
                "Date": "on July 8, 2005",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I can attest that this is indeed a good book to use as a supplement to your physics textbook. My teacher was decent...he didn't speak the greatest English and he liked to rush through problems that he did in class. So I sought extra help, and purchased this book along with Schaum's Outline of College Physics. On my first exam, I got a 70, but after using these two books for practice questions and help with the homework, I came out with a B+ average for the year."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AB3UQUI5JNMHH"
                },
                "Date": "on February 7, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "my professor pretty much leaves it up to us to learn the material for the tests.  Since our textbook is extremely unhelpful, I needed something else to coach me through the problems! The 3000 Physics Problems Solved book gave me the practice and explanations that I needed.  After our first test, the class average was a 68/100.  I scored a 100!  This book is worth it!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BOWUZJ1JNPZS"
                },
                "Date": "on August 1, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is an excellent book for anyone in an undergraduate physics course. There are a ton of problems for you to practice ranging from plug and chug problems to some where you really have to think about for awhile. This book will not TEACH you physics, it assumes you already have some sort of background in it. It's meant more as a supplement to what you are learning in class. Trust me one of the things a person needs if they are in a Physics course is to practice, practice, practice. Physics problems in an undergraduate class all different and every problem you have attack a different way. This book definatley has a huge range of problems that will help you achieve the skills you need to pass your physics course with an A."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on April 13, 1999",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": "Time and again it forced me to recognize when I didn't know an area as well as I had thought I did.  I did really well - I wouldn't have done nearly as well if I hadn't taken this book seriously."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34O1GWKSQG5IU"
                },
                "Date": "on December 16, 2008",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "The Schaum's 3000 Solved Problems is a very useful way to mix ability levels, and variety. However, it does not offer chapter by chapter quick notes like other Schaum's. So, if you don't have many of the skills or understanding when entering a problem you must refer to a text. The best thing about this book is that it offers a lot of problems in many areas so that a student may quickly find and target areas for review. My biggest peeve about help books is that the reader is bound to see problems from their own text time after time, and each of those problems is wasted energy. Always consult your text and then supplement this text for variety, but not authority. Learn from the in class text as much as possible because this book is the cut and dry mathematics. Overall, it's great for practice tests and helps here and there, which is more than what I can say about other books."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37V6P6JU1FBEV"
                },
                "Date": "on September 26, 2010",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZIEFHMMHIYL7"
                },
                "Date": "on August 9, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I've bought other books on the topic of physics as well. I'm an engineer/programmer, not a physics guru, and this is the book that's done me the most good with the advanced topics. For the price you can't go wrong, and the basic topics are covered very well also."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HI2T43ULLWCA"
                },
                "Date": "on November 8, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book is an excellent resource.  It contains solutions to virtually every type of problem I encountered.  My only complaint is that it isn't organized the same way as many textbooks."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DJ0X38FSD75V"
                },
                "Date": "on February 21, 2006",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": "I bought this book for my high school age son, who is in advanced physics, but who was struggling. It has helped him understand the concepts of advanced physics and has been a tremendous tutoring aid."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21KK9F1SNV53Q"
                },
                "Date": "on October 19, 2011",
                "Helpfulness": 0.75,
                "StarRating": "2",
                "Text": "i found that unlike this book states, and as some reviewers wrote, this book does not help with calculus based physics. i tried using it for my second semester physics class (the 2nd half of the book), and it was not helpful. it is just a bit of an easy review, it does not have a very wide range of problems, just a bunch of easy repetitive problems, and then some difficult ones which do not even have much clarification as to how some steps are performed and why. this book also seems to be outdated (from the 80s), but i didnt buy the newer version because reviewers didnt recommend it. all in all, i would not recommend this to college students, and not to their instructors either, just high school students and maybe their teachers of conceptual physics (intro course). i think that when looking for helpful books, it is best to actually see them, and not purchase something online because now i regret spending my money on this."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A296JB6Y6HZWWZ"
                },
                "Date": "on June 16, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "The problems for each topic start out easy and then get more difficult, so you can get a lot of practice, which is how one develops proficiency in physics problems.  I was stumped on a kinetics problem in my textbook...they only gave the answer in that particular section, and not the solution, so I looked in Schaum's and found the same type of problem.  So I was able to see how my textbook worked out the problem, and thus I was no longer stumped. The solutions are explained well, so I feel that I have gained a better understanding of the concepts."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13AZS4ITQT7QJ"
                },
                "Date": "on July 14, 2009",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "I give almost all Schaum's Outlines and Solved Problems Series a perfect 5 stars.  They are indispensable in learning how to solve math, science, and engineering problems. This particular Schaum's has 3000 solved elementary physics problems (no subject outlines), with numerous beautiful illustrations.  I skimmed the first 32 chapters and then read the remaining 7 chapters carefully; there are very few typos (e.g., a missing devisor in problem 34.91).  The only issue on content I have is with the Special Relativity equation for relativistic mass, given in section 37.2  Here, the author repeats the same mistake as practically every other author, claiming that the mass goes to infinity as the speed goes to c.  This is patently nonsensical; what really happens is that the force goes to zero.  (The basic equation is a = F/m; if a goes to zero, we can say that m goes to infinity, which makes no sense, or we can say that F goes to zero, which makes perfect sense.)  Other than that slip, which is common to other books in this subject area, the work is splendid."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on December 10, 2010",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "4",
                "Text": "I ordered this product because I needed a book where it had a very detailed explanation on how to do the problems. I am very satisfied with the book, however I have noticed that there has been several mistakes in the numbers, which then throw off the entire calculations. This can be confusing and irritating when you are trying to understand the concepts, and how to complete the problem. However overall the book is very good, and they have several types of problems, with multiple questions to help you get a hang of how to do them. It also has an increasing level of difficulty as you progress through the chapter. There is also specific questions which are for calculus based physics too."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12W79BOQ7HUH6"
                },
                "Date": "on February 19, 2008",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "4",
                "Text": "This book has plenty of practice problems and helped me to bring my grade up, but the problems seem kind of dry compared to textbook problems. Most of the problems have to do with the same situation (ex. boom, something going in a circle, inclined plane, etc.). Problems in texbooks are often more varied in style and force you think a bit more. If the problems are of a greater variety, this will definitely be 5 stars. I still recommend this for anyone who is hoping to get better grades in physics. You'll get a lot better by doing all those practice problems."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DF1NK6KQKSO4"
                },
                "Date": "on April 8, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "All I have to say is...This book is a must-have if you want to understand your physics and get an \"A\" in your class. My grades starting climbing rapidly after going through the problems in this book on a regular basis. It totally helped me understand physics! Great textbook, a true gift to a science major!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1O246EDC5MD1O"
                },
                "Date": "on October 14, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great resource. covers 39 branches of physics. Covers classical mechanics and electromagnetism subjects.  Covers problems related to the first law of thermodynamics and the second law of thermodynamics.  3 of the 39 subjects are on optics. 3 of the 39 subjects covers modern physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ECDV3WY8W3DM"
                },
                "Date": "on February 14, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Good book with plenty of examples."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1L59HPIPE49SC"
                },
                "Date": "on April 12, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "An excellent supplement"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OGXUDO1DTKT0"
                },
                "Date": "on January 30, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "good deal"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15WDYGDRG59R3"
                },
                "Date": "on October 1, 2008",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "3",
                "Text": "This book has not helped me at all in my physics class, mainly because the problems are nothing like the ones my teacher assigns. They are all much easier."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKBXQVJ3EPEPE"
                },
                "Date": "on January 12, 2007",
                "Helpfulness": 0.4,
                "StarRating": "5",
                "Text": "Just like it was 30 years ago.  Plenty of solved problems to self learn Physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D4Z9QQ6F06QI"
                },
                "Date": "on June 6, 2003",
                "Helpfulness": 0.40625,
                "StarRating": "1",
                "Text": "It is amazing to see good reviews for this worthless book. The method of teaching how to solve physics problems presented here is contrary to what physics problem solving is all about. The book is called 3000 solved physics problems, and indeed it presents 3000 different methods of solution. The idea of understanding physics is that a few well understood concepts leads to insight; it is that insight which enables a student to solve many problems. This book presents no insight; it presents no underlying concepts; it is essentially a formula plug in type manual for a set of dull plug in type problems. If you are looking to comprehend physics and get insight into solving problems, please look elsewhere."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32QYE3KG7Q2EZ"
                },
                "Date": "on November 6, 2006",
                "Helpfulness": 0.06666666666666667,
                "StarRating": "3",
                "Text": "The information in this problem book are many and some pertain to all physics have similar concepts in the way Alvin  Halpen,PH.D has structure this book. Yet, for the newcomer in Physics will not easily understand. This book for resource and problems is fair!But not recommended!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on May 26, 1999",
                "Helpfulness": 0.20689655172413793,
                "StarRating": "1",
                "Text": "As many books from Schaum Series, this book is also useless and time consuming. It seems, the book tries to teach you the formula by making you put the numbers in right places. The book says: \"F=m.a\" learn  this and solve F=100 N, m=2 kg, find the acceleration.  Of course, I  exaggerated a bit. But really: NO THINKING, NO GAIN. Don't buy this book  (and maybe other Schaums)..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18YH4K6RZA64V"
                },
                "Date": "on February 28, 2006",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "The books were in excellent shape and I got the delivery well before the expected date."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 18, 1998",
                "Helpfulness": 0.05263157894736842,
                "StarRating": "5",
                "Text": "I really enjoyed"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 10, 1998",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "fluids and mechanics thermodynamics kinds of energy"
            }
        ],
        "ReviewUrl": "http://www.amazon.com/000-Solved-Problems-Physics-Schaums/product-reviews/0070257345/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "42"
    },
    "Salesrank": "#556,123",
    "Timestamp": "2015-05-24 13:25:19.564935",
    "itemurl": "http://www.amazon.com/000-Solved-Problems-Physics-Schaums/dp/0070257345"
}
