{
    "Category": "in Books (",
    "ListPrice": "$17.00",
    "Name": [
        "From Eternity to Here: The Quest for the Ultimate Theory of Time"
    ],
    "OfferPrice": "$14.51",
    "Reviews": {
        "AverageStarRating": "4.0 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3M2CIZGBU3T5H"
                },
                "Date": "on January 7, 2010",
                "Helpfulness": 0.9072164948453608,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADXCXX15KNZC9"
                },
                "Date": "on March 21, 2010",
                "Helpfulness": 0.9310344827586207,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BFDKPQ1U53QJ"
                },
                "Date": "on January 7, 2010",
                "Helpfulness": 0.868421052631579,
                "StarRating": "5",
                "Text": "I am not a physicist. I majored in English in college. I shouldn't be able to understand this book on any level. But I do. And it's fascinating. Illuminating. And just plain interesting as hell. That's Sean Carroll's greatest achievement in this page-turner about the TIME we live in. If you have any interest at all in getting your head around just what this elusive \"time\" we all experience is all about, you should read this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1G8H4J8PAHBMR"
                },
                "Date": "on May 3, 2011",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JZDVMN2QGN5L"
                },
                "Date": "on April 20, 2010",
                "Helpfulness": 0.7909090909090909,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1H7Y5XKPGT0OS"
                },
                "Date": "on January 28, 2010",
                "Helpfulness": 0.8076923076923077,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VXVH4P85N73K"
                },
                "Date": "on November 18, 2010",
                "Helpfulness": 0.7916666666666666,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATA980NJ3OSZT"
                },
                "Date": "on December 27, 2010",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CFER3RSIYJKB"
                },
                "Date": "on January 12, 2011",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JZ1LA3IQIOIJ"
                },
                "Date": "on August 31, 2011",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13PUMDC1R1OJ3"
                },
                "Date": "on October 13, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJ98YA4Y333BK"
                },
                "Date": "on April 2, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KXGLNYY61VUC"
                },
                "Date": "on February 2, 2011",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGZDZEISVKEYC"
                },
                "Date": "on June 24, 2011",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QRZ06JM57LS6"
                },
                "Date": "on July 5, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A226JXOZLWTJH6"
                },
                "Date": "on May 23, 2014",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IU9VPCBKZPE8"
                },
                "Date": "on October 16, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LI8P7VU8UWPU"
                },
                "Date": "on July 24, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2C7JDP9PUMNMR"
                },
                "Date": "on October 12, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17JF4T1578FZB"
                },
                "Date": "on January 14, 2010",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "5",
                "Text": "Carroll has a talent for clear and in depth descriptions of cutting edge Cosmology and Physics. This book is an example of this talent. For anyone with any interests in Cosmology or Physics this book is a must read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35VF8VZ0XER8Q"
                },
                "Date": "on December 31, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I just finished reading From Eternity to Here: The Quest for the Ultimate Theory of Time by Sean Carroll.  Now, I am not going to tell you that after reading it you will be qualified to discuss either time or quantum mechanics but I will tell you that you will have a basic understanding of the complex nature of our world.  I took Physics 1 two times in college (and got a B the second time around) so I am not the greatest student of quantum physics.  But I found this book very worth buying and reading.  You (like me) may have to read a handful of pages at a time to digest the whole thing but it is easy to do. The organization of the material makes it very easy to stop and start where you want. And if you do read it, don't pass up the footnotes. Read each one as though they are spices sprinkled over a fine dish.  They add so much meaning and understanding to the discussion.  If you have any interest in why there is an \"arrow of time,\" get this book and read it, a time or two.  I really did not know that quantum mechanics could be so interesting!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WU2GH2HFC7D2"
                },
                "Date": "on October 5, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2C7JDP9PUMNMR"
                },
                "Date": "on January 25, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A100UD67AHFODS"
                },
                "Date": "on February 16, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "I purchased this book after watching a series of shows on NOVA covering the topic. The book gives an excellent overview for the theory of time, however for me it was a little difficult to follow. I've read in some of the other reviews that a layman would have absolutely no problem understanding all of the ideas put forth in the book, but even so it wasn't a case where everything was perfectly clear to me. I have no background in science, just an interest in the theory of time and the possibilities of time travel. I'm giving this book 4 stars because it's not the authors fault that I couldn't understand all of the concepts presented. I would love to be able to find another book which explains in really easy to understand language if time travel will ever become a reality, and the obstacles of going back in time or forward to the future."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TP9SVN0GIG0E"
                },
                "Date": "on March 20, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "As an undergraduate I studied physics, each course a separate entity and no one put it all together as it were. At least until I read Professor Carroll's From Eternity to Here. The text and the ideas presented are very accessible, and I found myself nodding \"yes\" to the topical discussions and growth of the discussion of entropy from thermo to black holes. For me the discussion unified many past theories I have learned, and brought in some new ideas that I want to study. I still don't know why we have the arrow of time, but it is time for me at least to go back to school."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NS2RO75KABXF"
                },
                "Date": "on April 7, 2013",
                "Helpfulness": 0.75,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A280Q2TYDQSI4"
                },
                "Date": "on March 22, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A289USTAORQ6J6"
                },
                "Date": "on February 22, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TXUKVIWNLUIU"
                },
                "Date": "on February 8, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LI77U7CDGY3Q"
                },
                "Date": "on March 2, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28JCEI2IKEJD0"
                },
                "Date": "on November 22, 2013",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3O6UUL5B8NZ0Y"
                },
                "Date": "on May 2, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8OATGDIENBNC"
                },
                "Date": "on January 18, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1S5YNS29ZYBB8"
                },
                "Date": "on December 14, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APXP3X7BFBAZ"
                },
                "Date": "on March 3, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Working in computer science I've always been fascinated by the concept of information, entropy, complexity, reversibility and how they are intertwined with physics and time (yes I know, it's the other way round, but I'm a computer scientist). Carroll talks about these and takes care to present in a non-technical and fair way a LOT of ideas (he has his favorites, but refrains from championing them from the start) and speculation about the nature of time and why it goes in one direction and not the other, Particularly liked a lot his discussion of  Boltzmann's ideas on entropy and the universe. Carroll also states clearly what is speculation and what is accepted fact within the physics cosmology community. His implicit assumption through most of the book is that the laws of physics are fundamentally deterministic and time symmetric, an issue that he addresses directly towards the end of the book, and that influences his cosmological outlook. Carroll doesn't say names but he clearly does not buy Hawking's interpretation that space time itself started with the big bang (Hawking-Hartle no boundary universe), and his justification for the need of a model that should go beyond that is quite convincing. It is a long read, and 3/4 through the book, as most physics books without formulas are, it can get a bit ethereal, but it's a satisfying read, quite philosophical and inspiring, and when you get to the end you'll appreciate the elegance and the reasons behind the model of the universe that he is seeking."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SVO5KOPODFPB"
                },
                "Date": "on May 1, 2010",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "2",
                "Text": "This book did not need to be written.  I expected more from Sean Carroll. I have his Teaching Company lecture series on Dark Energy and Dark Matter which is excellent. Frankly this book is a huge disappointment.  It is overloaded with wanderings through science history citing off-the-point facts and figures that can already be found in countless other volumes and sources.  It gave me the definite impression that Mr. Carroll had a panel of graduate students write this book for him- or at least most of the chapters. It is that off-focus.  It never gets to the point. And whether it reminds you of your ex-wife or not, it does keep repeating the same concepts long after the horse is dead. Okay, we got the bit about entropy. There are no original ideas in this book. It introduces no new theories, and draws no interesting conclusions. The only salient concept is that time moves in one direction because entropy moves in one direction.  Unless you are completely ignorant about basic science and cosmology you will find this book to be the same as I did - a waste of time (and money).  Sean Carroll please don't waste your time writing books that go nowhere and say nothing new."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NRRNJ3Y6E1UR"
                },
                "Date": "on July 22, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Popular science books as always hit or miss. You get quality books that describe modern physics in a way that actually helps you understand what science is discovering. On the other hand, you get cheap pop books that are more focused with shiny theories and predictions that are at the peripheral of the science community. Fortunately, From Eternity to Here falls into the first group. Sean Carroll sets off to discuss the current theories of why time only flows in one direction. That is pretty heady stuff and can get really complex. Carroll does a good job explaining some of the science in an understandable way, but he does not cut corners when he does not need to. Because of that, From Eternity to Here has pretty lengthy discussions of the law of entropy and general relativity. These discussions do not rely so much on the flashy predictions that seems to populate a lot of science books, but rather involve the nuts and bolts of these theories, even going so far as to get into the mathematics. I enjoyed this approach, because I felt that Carroll was focusing on the actually science and not just trying to write what would appeal to mass audiences. Carroll’s approach made this book interesting, especially to somebody like me who is studying physics in college. I would highly recommend From Eternity to Here to people who have some background in physics"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AS6EPVW1IRRP5"
                },
                "Date": "on May 15, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "If you're interested in the subject matter of this book -- time: what it is, why it is, how it came to be, and what it may become -- and you're not fluent in higher math and haven't done a lot of prior pop sci reading on these questions, FETH is a great place to start.  Even if you have read elsewhere, I'd still recommend it highly.  Many of the ideas I read about in FETH I'd read about elsewhere, but nowhere as thoroughly or cogently developed as they are in this fine book.  There are so many things I only half-understood before working through them here.  And so many connections among ideas that I only encountered for the first time as I read this book.  As popular science goes, FETH is not an easy read.  But the rewards it pays out to the patient and persistent reader well match any challenges they entail.  Of course, no popular treatment of physical/cosmological concepts can truly close understanding gaps that require years of scientific training and a talent for higher math.  But reading FETH brought me about as close as I can imagine getting to a genuine grasp of the ideas that are at stake in this endlessly fascinating realm of inquiry.  Cosmology/physics/metaphysics/philosophy buffs: have at!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20EEWWSFMZ1PN"
                },
                "Date": "on May 12, 2010",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2W5BN46MLSSX4"
                },
                "Date": "on November 27, 2010",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A338OJ94FDJNW3"
                },
                "Date": "on December 10, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NSZ57UBCQY8I"
                },
                "Date": "on August 20, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANQHLKSEA00ER"
                },
                "Date": "on March 13, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A really great overview of the modern day physical understanding of why there appears to us to be an arrow of time.  In order to answer that question Carroll takes us on an odyssey across space/time to first come to terms with what is meant by entropy and the second law of thermodynamics, black hole physics, and big bang cosmology.  The explanations were very clear but at the same time thought provoking and challenging.  This is a book that really gets you to think about deep questions that most of us usually take for granted.  Could there actually be a plausible explanation for how the universe came to be?  Why should the entropy of the universe have been so low at the begining?  Science is begining to find good answers to these difficult questions.  Always grounded in actual physics, Carroll is careful to make us aware when the discussion moves from proven theory into science-based speculation.  A must read for anyone interested in a serious discussion of the origin of the universe and what might have come before the big bang."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATW1TWVQSES3Z"
                },
                "Date": "on October 16, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I have read most popular physics books. I found this one to be particularly challenging and mind blowing.  I bought it because I am interested in the true nature of time.  The book was more about the various definitions of entropy and the second law of thermodynamics which states that The total entropy of a closed system increases in time, which is the main reason for the unidirectionality of time. It explored multiple definitions of entropy and how they effect theories of cosmology.  It was very up to date and well written. I wouldn't recommend it for your first book on modern physics. It assumes that you have a reasonable understanding of modern physics already. It also has some math but nothing too difficult. This book is cutting edge. I have read other books by Sean Carroll and find him to be an excellent writer with a good understanding of modern physics and cosmology. No other book that I have read has done such a detailed treatment of entropy which is a very difficult topic."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VFQHHWND6WO5"
                },
                "Date": "on January 31, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book is fantastic; Sean Carroll is brilliant at taking enormous, complicated concepts and slowly taking you in to them, step by step."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33RQ9HL46S639"
                },
                "Date": "on April 21, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A101F8M8DPFOM9"
                },
                "Date": "on July 19, 2010",
                "Helpfulness": 0.6521739130434783,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CQRJFY5EEMDZ"
                },
                "Date": "on June 5, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YHCNYHZGJ2WX"
                },
                "Date": "on August 9, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Not sure this was an ultimate theory of time, but it was interesting reading about the problems physicists have in trying understand the nature of spacetime and problems explaining low entropy at the Big Bang.  For comparison purposes, I found Penrose's Cycles of Time much more compelling, believable, and thorough.  Still, Carroll is a great writer.  I'd compare this with the somewhat awkward writing and much more incomplete ideas in Smolin's Time Reborn, which I found irritating to even finish.  Still, I'd recommend each of these books, especially Penrose."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MJMVL5J0RNOH"
                },
                "Date": "on December 24, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "I loved that this book explores the intersection between entropy, the cosmos, and life, among other things. It presents some mind-bending ideas in a way that is accessible to people with a small knowledge of physics and math, but at the expense of people who have a deeper understanding and demand a more rigorous explanation of the conclusions presented as fact. It's also maddeningly repetitive at times, and lengthy."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HV1ZRHBQYUJL"
                },
                "Date": "on October 18, 2010",
                "Helpfulness": 0.625,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOP9VEM2RVCXB"
                },
                "Date": "on August 12, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Sean Carroll is an excellent scientist.  He is also a great communicator with a knack for explaining things to the non-scientist (the general public).  It is a great pleasure to read his works or listen to lectures available on You tube.  He is head and shoulders above most scientist when it comes to communicating with the common man.  I can't recommend his works highly enough."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XVT3NJQONXGO"
                },
                "Date": "on March 17, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZW9CZXDOTAKY"
                },
                "Date": "on March 28, 2010",
                "Helpfulness": 0.6363636363636364,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYLFUXHDFNP7C"
                },
                "Date": "on July 15, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Deep and fundamental questions discussed with brilliance and illumination. Changed my view of the universe. Best popular physics book I have read!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QN49UCWSJL2C"
                },
                "Date": "on July 22, 2010",
                "Helpfulness": 0.6,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Y4UFBTIBME57"
                },
                "Date": "on March 28, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I am still reading it. This the second book that i read from Sean Carroll. I enjoy the way he write. I am a Phisicist but i learn from writers that explain Physics to the layman. Some times specialists  have to learn explanation directed to non specialist to understand what we are they taking about. I will be writing more about this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33WZJ2DETSJO2"
                },
                "Date": "on September 26, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Very interesting look into the relationships between entropy and time.  The author helps to give an intuitive understanding of entropy at several levels...there are statistically more ways to be disorganized than organized.  Discussions on time reversible processes and experiments to test the hypothesis were fascinating."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GS792I7BPIH7"
                },
                "Date": "on August 31, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AD94TZ3RGJTDW"
                },
                "Date": "on July 31, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "He explains some things that I found baffling in Brian Greene's two books, but by writing so colloquially, I think that Carroll occasionally confuses me by over-simplifying things rather than being more precise.  It's the textbook for a course I'm taking this fall."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11JT1OSUUW35G"
                },
                "Date": "on March 12, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Sean Carroll has an ability to explain complicated physics theories without using hard-to-understand mathematical formulas. This book talks about \"time\" from many different perspectives and needs some think time between chapters."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24K6D09MSJSL3"
                },
                "Date": "on March 1, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I have no science background, so I have to reread pages occasionally, but the author is excellent at explaining complicated ideas.  His diagrams really help a visual person like me.  I bought two extra copies to share with friends."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGVSIUYQ82LTI"
                },
                "Date": "on September 13, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Realy a very interesting Theory that solve  why phisc laws doesn't work in the Early Big Bang Model, maybe the autor colud be moré direct in some arguments, I got lost in  some chapters because of  an excess of data or caviats."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10OQPQZMC1SCK"
                },
                "Date": "on February 16, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book covers topics in quantum mechanics, cosmology, philosophy focusing on the concept of the arrow of time. Sean Carroll's explanations are understandable and clearly presented with great examples."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKTN9J6O279DR"
                },
                "Date": "on December 21, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Good book on the arrow of time and quantum theory. Sean Carroll does a good job of explaining physics. His examples are easy to follow. The layman will have no problem understanding this complex subject."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7OSULEPJO29I"
                },
                "Date": "on January 18, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book covers all the key points in a very complicated story that mixes science with philosophy.  Not exactly easy reading, but it makes this deep subject alost accessible to the average reader."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2G4CVI94VHB2L"
                },
                "Date": "on December 10, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Very provocative and challenging: a must read for anyone doing some honest thinking about the meaning of time. It's about time for this volume to be discovered by probing minds. --George Thompson"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3O7DBKVCN7PMC"
                },
                "Date": "on September 7, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excelent exposure about one of the most important problems of physics and knowledge based on experience and theoretical insight, sugesting provocative cuestion and summarizing opinions"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19RXE5TTTAW26"
                },
                "Date": "on July 18, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "want to know about what time is at the most fundamental level? then you may find this book quite informative as well as entertaining. no physics textbook can match in this respect."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10YYYW3Q5DJWI"
                },
                "Date": "on October 16, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I never new entropy played such an important role in the foundation of theories regarding the origin of the universe(s) and time itself. Fabulous read. Enlightening."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATGH2ZS0UCBCG"
                },
                "Date": "on March 19, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Sean Carroll takes the most complicated and confusing subject and makes it understandable in clear lucid language. Wish he had been my physics teacher years ago."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AX1FG8M0VJU8C"
                },
                "Date": "on June 7, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "For someone with no physics background to speak of, I found this book on a difficult and complicated topic relatively easy to comprehend and a fascinating read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IC449TMH5C6C"
                },
                "Date": "on May 14, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This was the greatest science read I've had all year.  Insights into the physics of time and the future of discoveries around it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28FP9KTEWTQYK"
                },
                "Date": "on April 9, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I am passionate about elementary physics. It does not get any more elementary than time. Makes me want to chat with the author."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NKOFSVEIVABU"
                },
                "Date": "on December 12, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "As always Sean Carroll gets to the point of the matter explaining the information n a way everybody can understand."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QILOAKFXNU04"
                },
                "Date": "on July 17, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "You folks should maybe explore Tom Campbell's \" My Big Toe \" ( my Big Theory of Everything ). It is free on Goggle."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LM1HE1HAXMVB"
                },
                "Date": "on February 16, 2010",
                "Helpfulness": 0.625,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2M6Q0M563E6V6"
                },
                "Date": "on April 14, 2010",
                "Helpfulness": 0.625,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AD7IUV5M3T1YX"
                },
                "Date": "on January 8, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "For the curious beginner, the rating says it all. Read the book, don't waste time on my impressions. Off you go."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IMO49QD6OYKN"
                },
                "Date": "on August 30, 2010",
                "Helpfulness": 0.6,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UIXU97JYCPZG"
                },
                "Date": "on March 19, 2010",
                "Helpfulness": 0.5714285714285714,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1D1P9JQKWW8N"
                },
                "Date": "on October 31, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent all the way around. I would buy from them again. Very satisfied overall."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGYCRDOE5JLDV"
                },
                "Date": "on September 9, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Goes with his video series. Very clear with many illustrations."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SG5S0HB2G7C"
                },
                "Date": "on March 14, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great book for the lady reader on the nature of time."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TOUHMJCB0GDJ"
                },
                "Date": "on January 28, 2015",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14VS6YWQXL7SG"
                },
                "Date": "on March 3, 2010",
                "Helpfulness": 0.5714285714285714,
                "StarRating": "5",
                "Text": "Carroll does an excellent job of navigating through the most daunting intellectual icebergs.  More amazingly, he does so in language that does not exclude readers with less technical background.  Although I approach the sciences from the perspective of Intelligent Design, Carroll speaks in terms of the science without preaching.  I strongly recommend this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQQ4JR086YHH4"
                },
                "Date": "on December 20, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A168BBPE0JGDFU"
                },
                "Date": "on February 1, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This guy's pretty smart."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XMXRQUSPRTS2"
                },
                "Date": "on October 6, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "fascinating"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EHE7M69JB346"
                },
                "Date": "on September 13, 2013",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6QD4RD0U297J"
                },
                "Date": "on November 16, 2012",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "Very, very technical. I would say that the book is not for the lay reader with an interest in cosmology. The hypotheticals are somewhat obscure and hard to understand. This probably is not Carroll's fault entirely, after all, spacetime is tough stuff, but he assumes a level of understanding that I certainly don't possess. I would venture that many people are in the same boat as me."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36PEWJDXLA593"
                },
                "Date": "on January 16, 2014",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXPVHE07J1YU0"
                },
                "Date": "on January 7, 2010",
                "Helpfulness": 0.5909090909090909,
                "StarRating": "5",
                "Text": "Whenever a scientist attempts to make complex topics such as space/time accessible to the layman, he/she must inevitably cut some corners lest the average reader become hopelessly lost.  One method for doing so is to use the rhetorical vehicle of analogy, with which a certain reviewer below is obviously not acquainted.  Kudos to Mr. Carroll for translating eggheadspeak into the vulgate."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQEA4BTLLPRZB"
                },
                "Date": "on April 4, 2013",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": "I thought I knew a lot about astrophysics, relativity, and quantum mechanics; but this book is way above my head.  Consider read his book \"The Particle at the End of the Universe\"."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AG09BRFN728RH"
                },
                "Date": "on January 7, 2010",
                "Helpfulness": 0.5833333333333334,
                "StarRating": "5",
                "Text": "Sean Carroll's book is wonderful. It's written with a spirit and skilll  thatt makes his  fascinating science accessible, engaging, , and  really compelling. I read a ton of science and science history books and this is one of the best at being contemporary and historically revealing."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32VPPG9TEQY3T"
                },
                "Date": "on August 13, 2013",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "This book did a decent job explaining some tough concepts. It did get a bit wordy at times, but in general it was worth reading."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A255E1L105V4MU"
                },
                "Date": "on August 13, 2010",
                "Helpfulness": 0.5555555555555556,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1T8UTWI98HCTR"
                },
                "Date": "on July 31, 2010",
                "Helpfulness": 0.4,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Z2JFJJZP3D7M"
                },
                "Date": "on March 25, 2011",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MOQGWFCRO1M4"
                },
                "Date": "on August 27, 2010",
                "Helpfulness": 0.5333333333333333,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QVAJO1JJN03E"
                },
                "Date": "on January 25, 2010",
                "Helpfulness": 0.5384615384615384,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A303QLU95M2U40"
                },
                "Date": "on July 12, 2013",
                "Helpfulness": 0.25,
                "StarRating": "2",
                "Text": "I like to pick random books by Richard Dawkins and other writers and listen to them in audio book form. Never have I been laughing out loud as the reader hits me over the head with way more information than I can take in. And I was doing it in audio book form, not properly reading it. Believe me when I say that I'd rather read the Bible in Japanese than read this book in paper form. No offense to the (at times humorous) writer, it's just a topic that cannot be handled by casual readers."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LHYSCK9WXEJ8"
                },
                "Date": "on December 12, 2012",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "Lots of good info in here and no shortage of interesting schtuff, but ultimately the author falls short in his goal to \"define\" time."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A114LUB4IYJK5W"
                },
                "Date": "on February 12, 2010",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "4",
                "Text": "Having never taken a science class beyond Freshman Geology, I'm woefully deficient in \"the sciences\"; esp physics.  However, Sean Carroll's explanations and examples of arcane concepts (entrophy, 2nd law of thermodynamics and curvature of spacetime, etc.) would, at times, seem crystal clear; as long as I didn't stray too far from his examples.  However, when I tried to formulate these new-found scientific concepts in my own descriptive terms, I would draw a blank.  If only I could go back in time and take challenging high school science classes and major in Physics/Math for my undergraduate studies and Cosmology for my post graduate studies, etc., then I'll bet I could come to terms with Mr Carroll's explanations.  But, as the author stated unequivocally, the \"arrow of time doesn't go backwards.\""
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASRHEWQOP6MKQ"
                },
                "Date": "on September 2, 2010",
                "Helpfulness": 0.25,
                "StarRating": "5",
                "Text": "Very well and pleasantly written. Understandable for non expert readers. Thought inspiring. Some redundancy with arguments and explanations serves well the purpose of being clear and reminding what the point in question is. Excellent."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A304IV8A37E2VV"
                },
                "Date": "on December 1, 2014",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "too long and too casual, what I am not looking for in a book of science"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AE1XCN29D1GZL"
                },
                "Date": "on November 29, 2011",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NMW51418AO9M"
                },
                "Date": "on December 31, 2014",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KQEMM9WA8JIR"
                },
                "Date": "on July 2, 2014",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": "Not very accessible."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CWOK0DSDP245"
                },
                "Date": "on February 10, 2010",
                "Helpfulness": 0.16666666666666666,
                "StarRating": "5",
                "Text": "This book is excelent, despite the deep subject, it is explained in a easy manner."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3STVLDJDLQR7B"
                },
                "Date": "on April 17, 2010",
                "Helpfulness": 0.14285714285714285,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZDPQA6FLY8XM"
                },
                "Date": "on January 7, 2010",
                "Helpfulness": 0.5177664974619289,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9K8AQLJCYB1X"
                },
                "Date": "on February 14, 2010",
                "Helpfulness": 0.14285714285714285,
                "StarRating": "5",
                "Text": "This book is a bit headache inducing, since it informs you of what you may already be aware of but then you step out of the box into the much bigger picture of possibilities and more ideas of what truth may lay beyond our everyday experiences about time. It is written to be understood by the layman as many practical examples are given with many great illustrations to help make the ideas more concrete. At the time of this review, I'm only about a quarter into the book but am looking forward to reading the rest."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ESDIV72OF7X2"
                },
                "Date": "on March 4, 2010",
                "Helpfulness": 0.2222222222222222,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Q9391JRHTC06"
                },
                "Date": "on April 21, 2010",
                "Helpfulness": 0.3684210526315789,
                "StarRating": "2",
                "Text": "I'm not a scientist so I can't comment on the Science. By the way, Amazon should limit the length of customer reviews, one persons review of this book was far too long and far too detailed. Less is also more for reviews. I took this book for what it was worth to me after I gave up, too boring, trying to read it cover to cover. I skimmed it, what a waste of money, to find anything that I was interested in. I agree with the reviewer who gave this book one star, his complaint was that the author says the same thing over and over again, he's right, and also right about the book being way too long, God where are the editors these days? But my main criticism of this author is that he can't write. Too many odd sentence constructions, odd ways of using words, unnecessary words and phrases, stilted, hard to read sentences. All this could be improved by editing for clarity, ease and flow of narrative, and conciseness, most of which this book lacks. This fellow may be a physicist, maybe even a very good one, but a good writer he's not."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25BFCEQ3ZACON"
                },
                "Date": "on March 18, 2010",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "applies entropy concepts to time and incorporates theories of quantum gravity - very timely, good review of history of thermodynamics"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14OJS0VWMOSWO"
                },
                "Date": "on April 19, 2010",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "FROM ETERNITY TO HERE: THE QUEST FOR THE ULTIMATE THEORY OF TIME come from a Caltech theoretical physicist and blogger for Discover, and offers a new way of thinking about time - a directional way of thinking. Time owes its conditions to events before the Big Bang - and Sean Carroll postulates that actually our universe is part of a larger family of universes, some of which experience time running in the opposite direction. An intriguing, detailed survey recommended for any library strong in popular physics titles and theories."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28BPGOGA7CSK7"
                },
                "Date": "on March 27, 2010",
                "Helpfulness": 0.25,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21NBZLEIBA2RM"
                },
                "Date": "on February 20, 2010",
                "Helpfulness": 0.09090909090909091,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A53VSW4J6CZ36"
                },
                "Date": "on February 26, 2010",
                "Helpfulness": 0.39436619718309857,
                "StarRating": "1",
                "Text": "I found the style of the book hard to deal with. It's overwritten, with a lot of silly examples thrown into the mix that just confuses the story and delays the reader from the points the author is trying to make. So it's not an elegant discussion we have here.  It's the feeling you get when someone  takes way too long to tell a joke,  embellishing to the point of frustration. I would advise reading part of this before jumping in with a purchase, maybe you'll like it.  Wished I had, what a waste and disappointment."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3H7GWFD2FHDWI"
                },
                "Date": "on November 3, 2013",
                "Helpfulness": 0.07142857142857142,
                "StarRating": "1",
                "Text": "I found the book repetitious and void of anything fundamentally new. He touched briefly on what could have been an interesting path to follow at location 368 when he acknowledges that the concept of time can be completely eliminated from physics. So why don't we eliminate it. There is no need for time, other than as a convenient bookkeeping system, so let's admit it doesn't exist. Everything then gets a lot easier."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AHNRD88XKOU0"
                },
                "Date": "on August 11, 2010",
                "Helpfulness": 0.1111111111111111,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35C4TOE0LYIAC"
                },
                "Date": "on April 15, 2010",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "1",
                "Text": "...this book was perfect.  Much like either of my ex-wives this book repeats and repeats and then repeats the same concepts over and over.  This book could easily have been one-third it's size.  To summarize this book: time=entropy.  That's all you need to know.  Now find something worth reading.  I could go on but then my review would be as self serving as the book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XMH2BR8VPDNJ"
                },
                "Date": "on August 9, 2010",
                "Helpfulness": 0.18518518518518517,
                "StarRating": "5",
                "Text": "Please note that I have already submitted to you one written review of Carroll's \"From Eternity to Here\", and can't guarantee that this will be exactly the same but, as I said previously, this is a \"must\" read for all amateur cosmologists. Not since Hawking's \"A Brief History of Time\", have I had to go back and reread entire chapters just so that I was sure I understood what Carroll was saying. He greatly enhanced my appreciation for the vastness of our visible universe, and what may lie beyond it that we can never observe. He challenges numerous traditional notions of time and space in a way that really forces the reader to think. An invaluable addition to any amateur scientist's library."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23UAATRRQISB6"
                },
                "Date": "on June 2, 2010",
                "Helpfulness": 0.2,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3774MBQJ66HJS"
                },
                "Date": "on May 29, 2010",
                "Helpfulness": 0.045454545454545456,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CQYRIOR5QXDG"
                },
                "Date": "on July 26, 2014",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": "terrible"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FW4UB3JA7KUI"
                },
                "Date": "on June 16, 2010",
                "Helpfulness": 0.21333333333333335,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFR6GDLDYBIQL"
                },
                "Date": "on January 8, 2010",
                "Helpfulness": 0.21965317919075145,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A285FU1EE9NPWQ"
                },
                "Date": "on April 24, 2010",
                "Helpfulness": 0.13432835820895522,
                "StarRating": "1",
                "Text": "Boring. Un-interesting. I've readother treatises on the theory of time and this book was a complete bore."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Eternity-Here-Quest-Ultimate-Theory/product-reviews/0452296544/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "130"
    },
    "Salesrank": "#31,765",
    "Timestamp": "2015-05-24 13:23:49.072745",
    "itemurl": "http://www.amazon.com/Eternity-Here-Quest-Ultimate-Theory/dp/0452296544"
}
