{
    "Category": "in Books (",
    "ListPrice": "$16.99",
    "Name": [
        "Knocking on Heaven's Door: How Physics and Scientific Thinking Illuminate the Universe and the Modern World"
    ],
    "OfferPrice": "$14.81",
    "Reviews": {
        "AverageStarRating": "4.0 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36A9HWQ9U1IK4"
                },
                "Date": "on September 22, 2011",
                "Helpfulness": 0.9245283018867925,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZDPQA6FLY8XM"
                },
                "Date": "on September 21, 2011",
                "Helpfulness": 0.9216867469879518,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMDUBD22D2UDF"
                },
                "Date": "on January 12, 2012",
                "Helpfulness": 0.8657718120805369,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMRZ5G7HF7I03"
                },
                "Date": "on September 20, 2011",
                "Helpfulness": 0.7878787878787878,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TXD4O7Z15FY4"
                },
                "Date": "on October 7, 2011",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38ELBK7FLXGOY"
                },
                "Date": "on October 27, 2011",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RYXTPKP7TGF1"
                },
                "Date": "on January 10, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I took great pleasure in reading this fascinating book.  I'm recommending it to all my friends.  I admit there were some points I didn't understand but I was happy to learn that people like Ms. Randall are striving to understand the true nature of physical reality.  Also being a former engineer the descriptions of the Large Hadron Collider were enlightening and allowed me to fully appreciate the great work done by the people that designed and built the LHC."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A246HTMSLTNIWM"
                },
                "Date": "on November 26, 2011",
                "Helpfulness": 0.8888888888888888,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WFXYRDB5A0N5"
                },
                "Date": "on December 24, 2011",
                "Helpfulness": 0.782608695652174,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KJO5VP4K3CHU"
                },
                "Date": "on September 21, 2011",
                "Helpfulness": 0.7894736842105263,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19R0HWIFWTTYP"
                },
                "Date": "on December 13, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UR8B7DN6E2Z9"
                },
                "Date": "on January 6, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I am going to keep this very short because the reading that you should be doing is from Knocking On Heavens Door. This book accomplishes the most important thing when it comes to putting time aside and making the choice that this will be the one that you will pick up and read today. It made me feel profoundly excited and inspired about new ideas and new ways of looking at old ideas. I am not a scientist but a visual artist with an amateur interest in science and physics. Knocking On Heavens Door is a both a scientific and creative venture and is truly successful on both counts. In it Lisa Randall brings to us her particular strength in translating very complex ideas in Physics to those of us who do not always find the language an easy one to grasp. She does this without losing the brilliant science and does so in a way that is really fun and new but not watered down. Read this book! It is  magical and the pictures are also spectacular!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WZ1VJLR3F14R"
                },
                "Date": "on December 17, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "It came as a welcome surprise when I spied Knocking on Heaven's Door in the bookshop and an even more welcome one upon reading it.  It is one of those rare reads where not only does the book meet its expectations so thoroughly, but surprises the reader in very unexpected and pleasant ways.  It's uncommon for me to reread a physics book, but I'm already halfway through the first chapter of my second time round.  Superb book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FWLZE5EVPUD6"
                },
                "Date": "on December 14, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I just finished reading \"Knocking on Heaven's Door\".  I enjoyed it as much as \"Warped Passages\".  She did a great job in explaining some complicated concepts such that they were clear to a non-physicist like me.  Prof. Randall did a particularly good presentation of the hierarchy problem.  And there is a great deal of information on the LHC--let's hopeit finds the Higgs boson!  J.E. Madigan"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11AZG938XL5UU"
                },
                "Date": "on March 25, 2012",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JLJHDX3U16E1"
                },
                "Date": "on October 8, 2011",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": "Lisa Randall continues to illuminate, creating the opportunity and expectation for meaningful understandings of theoretical and practical physics. Rich and insightful, KOHD interweaves many ways of thinking as it explores the world of science and scientific thought. I especially enjoyed Randall's compelling ideas about the relationship between art and science. Cross-discipline comparisons or collaborations often occur diminished on the printed page - not so with Randall's lively, fully formed discourse on the role of creativity and beauty and science. I really loved this book and appreciate Randall's sincere commitment to extending the conversations about the nature of the universe to the layperson."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HFQ2FKCXYME1"
                },
                "Date": "on December 9, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Once again Lisa Randall has given us a stellar achievement in science books. Over the years I've read dozens of science books which range from Carl Sagan's \"Cosmos\" to meteorology textbooks brimming with differential equations. In general, I enjoy most of the authors and can appreciate the different approaches each scientist takes in conveying their message. There are very few that I consider being at the pinnacle of excellence and Lisa Randall certainly fits that bill. After reading \"Warped Passages\" I was hooked on her writing style and ability to explain complex concepts of physics to a non-scientist like myself. My interest in physics was further reinforced when I was fortunate enough to attend a lecture Dr. Randall gave at the University of Tulsa. When I found out \"Knocking On Heaven's Door\" was published, I couldn't wait to relish the chance to read another work by Dr. Randall. Trust me, I was not disappointed...and you won't be either. The information on particle physics alone would make this a great science book. Dr. Randall's writing shines in her explanation of how the Large Hadron Collider works and makes the complex nature of particle physics easy to comprehend, even for those who are not accustomed to reading science books. Perhaps the deepest and most valuable concept I've gotten from this book is how to think & view the vast, complex universe around me through the eyes of a scientist. That alone is a priceless characteristic and makes this book, in my opinion, a must read for anyone remotely interested in science. Readers from high school students to professional scientists will easily find a great deal to learn from Dr. Randall. If you're looking for a Christmas gift for the science-lover on your shopping list, \"Knocking On Heaven's Door\" will deliver the goods. Not only is it state-of-the-art, but on the cutting edge of the most dynamic and exciting areas of science and will thrill all who read this excellent book. Dr. Randall's writing and intelligence is as engaging as her personality...and easily deserves the utmost praise. I can't recommend this book highly enough and am pleased to give it a solid five stars!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2V5M5EJPOD2IU"
                },
                "Date": "on November 29, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15JHIMKO0GTJE"
                },
                "Date": "on October 18, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TN060F7JRU43"
                },
                "Date": "on October 8, 2011",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BMMUPJUSXLLX"
                },
                "Date": "on October 1, 2011",
                "Helpfulness": 0.7692307692307693,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XJO7DS5M956T"
                },
                "Date": "on October 6, 2011",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "5",
                "Text": "Although I am only halfway through this book I have found it so fascinating that I felt compelled to write a review.  Lisa Randall has accomplished something that few in the rather obscure world of particle physics have been able to do.  As with her first book, Warped Passages, she has brought 21st Century physics down to the level understandable to a non-physics reader without sacrificing the essence of this remarkable field and its most recent discoveries.  In addition to sharing with her reader her understandable excitement with the potential new discoveries of the newly operating Large Hadron Collider she has captured, in a most lucid fashion, the recent history of discoveries in physics and in the development of its \"microscopic\" instruments, so as to clearly school the reader in understanding of the potential of this newest investigatory tool into the invisible world of subatomic particles.  Using historical examples, most notably reference to the pioneering work of Galileo and his telescope and microscope, Dr. Randall explains how the indirect measurements of such instruments, so essential for investigating both large and small scale physics, have been enhanced throughout the ages to ever higher energies and why these energies enhancements have been so essential for observations of the world of small scale physics.  The subject of scale, which is so important not only in physics but in the arts as well, is something that Dr. Randall has explored early on in the text in a way that captures the readers minds eye.  The early chapters pique the imagination and enlightens one so as to be better motivated to understand the more detailed discussions of the issues that current physicists are addressing today as presented in the later chapters.  This book has made the wonders of physics of the modern day accessible to the enlightened reader and is a must read for anyone with even the slightest interest in the exciting achievements and even more exciting potential achievements of the pioneering physicists, such as Dr. Randall, who venture into this mysterious world."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3S0Y5GVW1CYRW"
                },
                "Date": "on December 20, 2011",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": "I knew when I ordered this book that it might be incredibly difficult to read. However, I find the subject matter so interesting that I have been breezing right through it. If you have even a remote interest in physics, you need to buy this book and read it from cover to cover. It really is illuminating."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NNB5ZX8A42EP"
                },
                "Date": "on December 9, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is one of the most interesting books on the understanding and origins of the Universe I have read for a very long time. Lisa takes you through a witty and clearly mapped pathway of new developments in particle physics and cosmology, describing, without needing detailed specialist knowledge, the latest research and key scientific questions faced. But the book is more even than that as it explores and develops the very nature of science itself, how it advances and where scientific thinking can be applied to other areas of key decision making. If you want to know your quark from your electron and understand the forefront challenges facing theoretical and experimental physics today - including why so much has been invested in the Large Hadron collider, then you wan't find a better, easy to digest exposition"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37FFWZUGO8L7W"
                },
                "Date": "on October 5, 2011",
                "Helpfulness": 0.7391304347826086,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2000NKHHZNYR2"
                },
                "Date": "on December 13, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEURA0IEZLCKK"
                },
                "Date": "on December 27, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I think this is a remarkably lucid description of some very complex ideas in quantum theory and cosmology.  Lisa Randall is quite gifted at making very difficult concepts at least accessable to those of us without a Ph.D. in physics.  Her description of the building, testing, and potential of the LHC at CERN is the best I have seen.  She obviously has a passion for science in general and her chosen field in particular.  But she also demonstrates her multidimensionality by invoking conversations with artists, screen writers, and musicians to help explore her ideas.  This is heady stuff that is just the beginning!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQ6YJM2J2LNOP"
                },
                "Date": "on October 4, 2011",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AH73ZXI1T0I77"
                },
                "Date": "on November 9, 2011",
                "Helpfulness": 0.8,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DY2ZZNUPS9DH"
                },
                "Date": "on January 5, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "As a reader not well versed in the ways of particle physics or cosmology, Dr. Randall's book provides a fascinating story of the scientific thought process that has helped to illuminate the hows and whys of our universe.  I would highly recommend this work to all who wish to better understand both the history of human endeavor into understanding the mechanisms of the cosmos as well as to what future science hopes to glean from such projects as the LHC."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9FP2FC6R5FU7"
                },
                "Date": "on October 11, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KYP04AV9J14B"
                },
                "Date": "on February 9, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MGXQJVQQAN6T"
                },
                "Date": "on October 9, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFN32PGTZ31MV"
                },
                "Date": "on January 22, 2012",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APB7WIDR7BXI4"
                },
                "Date": "on October 19, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A140IVF7U8K7DY"
                },
                "Date": "on May 16, 2012",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Good read about current Physics research without being so far out there that a non-science person would not understand the contents (I think I am a science person.) Best explanation of Higgs so far that I have read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A119M7A18DEVFW"
                },
                "Date": "on December 27, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YXRT2XIJIO57"
                },
                "Date": "on April 27, 2012",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LN51XUBN1V99"
                },
                "Date": "on November 12, 2011",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "5",
                "Text": "Hogwarts contains no magic that exceeds the apparent realities of the universe in which we humans are the tiniest of specs - although the most complex known cells. Randall's second book is highly readable for us laypeople and covers matters beyond any human imagination. Excellent."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3M6TKV7ORRMXW"
                },
                "Date": "on October 15, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Lisa Randall has an exceptional way of mashing up fascinations and frontiers in science with art, opera, religion, beauty and long list of others into an incredible read! Of the recent publications that explain these frontiers to a mass audience Randall's book is a sure stand out.  It offers a provoking and thoughtful examination into the world of particle physics and what discoveries could be in our near future at the LHC.  The books looks at the process of how we know what we know so far in science, and what thrilling direction we could be heading.  \"Knocking on Heavens Door\" weaves meditations on science with a diversity of experiences and perspectives from artists, inventors, musicians, blockbuster Hollywood, and even rock climbing.  As someone working in a creative field, I was truly impressed with the flawlessly merging of science, art, and creativity to examine commonalities and the conceptual interworking of each.  The book is powerfully written and truly dynamic."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28HHU4U3MT3YP"
                },
                "Date": "on December 12, 2011",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Discovered Lisa Randall's book after listening to an interview with her on the December 2011 BBC Focus Magazine podcast [...]. Hearing her incisive, witty responses and rational tone provided great context for, and helped me appreciate, the way she frames an argument. These qualities are reflected in her book. Although I am early in the book, I am so enthralled that I often almost miss my subway stops! Although I cannot speak for others, the context for my perspective comes from the following experiences:  I took physics in college but the knowledge has long since faded; I trained as a psychiatrist, where most concepts were nebulous and now work in healthcare communications where we place a premium on clear communication of data predicated on providing relevant context. I find this work very accessible and mind bending. Before you make a final decision on the book, I recommend you listen to her interviews."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3K2TJU9NJRD9K"
                },
                "Date": "on October 7, 2011",
                "Helpfulness": 0.8,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACH8A81AOIAQI"
                },
                "Date": "on November 2, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DVZ92OSMPX6A"
                },
                "Date": "on October 14, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WSCVDV1SFJXR"
                },
                "Date": "on March 3, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I am retired but have taught introductory physics and astronomy while studying the aurora borealis. I recently agreed to give a lecture today to 150 freshman taking a history class at the University of Alaska Fairbanks on what we've learned about our Universe since Copernicus. Your book Knocking on Heaven's Door and Lawrence Krauss's youtube talks have been invaluable to me.  I sincerely appreciate the analogies you developed to help non-scientists at least get a thinking grip on some complex science involved. Thank you, Neal Brown Alaska Science Explained 1569 La Rue Lane Fairbanks, AK 99709"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1C65YSCWI7NDT"
                },
                "Date": "on April 29, 2012",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": "Lisa Randall must have written this book with the layperson in mind; it is brilliant, encouraging, stimulating and greatly appreciated. The scales of measurement are illustrated and her examples leave the reader feeling not only part of her world but also in better touch with the world around us. What may have been difficult theories to comprehend otherwise, are explained so thoroughly, the reader cannot help but believe they are intimate observers. I will be sitting on the edge of my seat in anticipation of learning more about the outcomes of CERN's experiments surrounding magnetic forces, Higgs bosom, extra dimensions, anti-matter, dark matter and energy. I wish her and her colleagues much success and praise them for all their elegant yet humble contributions past, present and future. We live in a better world because of them."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1U9U30ME0OQU2"
                },
                "Date": "on January 15, 2012",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YIK6C7RG0IWR"
                },
                "Date": "on September 26, 2011",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": "What an intelligent and entertaining book. It is an incredible feat to take a slice of the broad subject of physics and make it digestible for someone like me who left science studies behind a few decades ago. What I (and I think most layman) want in a book about scientific thinking is a point of view to which I can relate, and that may include a few stories about people in the news. Kudos to Professor Randall and others who devote their careers to explaining what we cannot see, and for forging ahead against the tide of the dumbing down of America."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2004NC5MSWP9Y"
                },
                "Date": "on November 5, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Professor Randall has elegantly opened a window  and given the reader an incisive  view into how real science is done. She is both clear and captivating.This is in my opinion a must read for those that are interested in doing real science,even if it's not physics.Professor Randall is a disciplined scientist and a dogged pursuer of truth. This a great book by an Amazing physicist."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2V0NXLTYHP7V9"
                },
                "Date": "on February 14, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A316YZBC8RQE16"
                },
                "Date": "on August 19, 2012",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1M4U3GSR3JD5Z"
                },
                "Date": "on March 1, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WBEIH7Z37LN9"
                },
                "Date": "on January 16, 2012",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KLKHMFYY1O19"
                },
                "Date": "on December 27, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EB2EQFX4IRNL"
                },
                "Date": "on June 3, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1D9Z20TCUH6ZX"
                },
                "Date": "on January 23, 2012",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A167ABU99FT4OC"
                },
                "Date": "on October 26, 2011",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XKQQP3NNFIBH"
                },
                "Date": "on November 28, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CC1IKCUIQMUV"
                },
                "Date": "on April 5, 2013",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQQDNPIU22JLM"
                },
                "Date": "on February 2, 2012",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATNQJL1SF21TS"
                },
                "Date": "on November 10, 2011",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZELB6VS165SY"
                },
                "Date": "on April 22, 2014",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13KNCFLH0IH2G"
                },
                "Date": "on October 7, 2012",
                "Helpfulness": 0.7,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKE1NDU5KHMZ7"
                },
                "Date": "on September 27, 2011",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DGSLFVP2MZC5"
                },
                "Date": "on November 26, 2011",
                "Helpfulness": 0.6794871794871795,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PGOBR90C2QJK"
                },
                "Date": "on October 26, 2011",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Lisa Randall's new book is an interesting and easily understandable discussion of the development, characteristics, and scientific potential of the Large Hadron Collider (LHC), which complements her earlier book \"Warped Passages\".  It skillfully summarizes the current status of the principal experiments underway at CERN, but it suffers at times by wandering off topic, most notably when she elaborates on differences between how risk assessment is applied to science and other areas such as economics.  That digression causes a loss of focus on her story, and for those readers eagerly awaiting her building presentation of the scientific applications of the LHC and the results to date, it is very distracting.  Overall though, it's worth the read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AC6LV5D2RKTIR"
                },
                "Date": "on April 12, 2013",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AY12APG0JD3FI"
                },
                "Date": "on January 3, 2012",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "3",
                "Text": "There are enough reviews of this book, so I will be brief.  As I read this book, I found myself wondering why I didn't find it very enjoyable.  I love good accounts of the excitement and serendipity of scientific discoveries, both past and present, and the triumph of scientific over magical thinking.  This book failed to capture this excitement.  It is, well, just dull.  From the angle of scientific thought, the book does not convey the sense of wonder that can accompany this activity, the \"grandure in this view of life.\"  And from discussions of particle physics, as others have said, there's nothing new here.  I'm waiting for news of exciting discoveries from CERN, but nothing had been discovered by the time this book was written, so at best, there is just a little wimper of \"Hey, we might find something.\""
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOPGDH5M54SWN"
                },
                "Date": "on December 3, 2011",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "I enjoyed Professor Randall's first book Warp Passages and was delighted to see she wrote another book. Knocking on Heaven's Door takes readers into the greater understanding of reality and the enormous scale of the universe and its vast effects on our system and beyond. I enjoyed the chapters 17\"the World next Top Model\" and chapter 21 \"visitors from the dark side\". The author describes the Hardon Collider, the particle accelerator on the border of France and Switzerland- and the research that is taking place to help understand ideas of cosmology and current dark matter experiments."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYCQ9L55KQZ9X"
                },
                "Date": "on October 30, 2014",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EGUMZQAWMUN9"
                },
                "Date": "on March 18, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "For the lay person who has some interest in the workings of the universe, this book tell everything, in a simple way, easy to understand and digest."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MWQ02KEJ49HS"
                },
                "Date": "on February 8, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "an easy read for the layman. Told in a way that is easy to understand. It opens the mind of the reader to the world of sub atomic particles in a way that no other book I have come across."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26M17IQ0STTII"
                },
                "Date": "on January 5, 2013",
                "Helpfulness": 1.0,
                "StarRating": "2",
                "Text": "It's probably not fair I'm writing a review because I didn't even read to the half-way point. But that's worth commenting about, isn't it? I made it through the exhausting introduction thinking \"It'll get better,\" but each chapter was a disappointment. Like the stars, the subjects were random and confusing. Then, the author threw in obvious opinions that rankled my sensibilities. I was done."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OQBVIXUOEUSY"
                },
                "Date": "on March 8, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BUQ28PNPJ3GW"
                },
                "Date": "on September 27, 2011",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RNNHT8T1I5ZR"
                },
                "Date": "on March 22, 2012",
                "Helpfulness": 0.75,
                "StarRating": "2",
                "Text": "I've always enjoyed Lisa Randall's writing, which makes it hard for me to knock this down. There's not a lot of new science here, there's far too much of the \"LHC travelog\", and there's a frustrating amount of simple repetition. This really felt unfocussed: no clear audience, no clear purpose. What a shame."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AOJD4ECLF4A9"
                },
                "Date": "on May 25, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LM1HE1HAXMVB"
                },
                "Date": "on April 9, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TWBW1B17R151"
                },
                "Date": "on November 3, 2011",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JNI9V0X3YHK"
                },
                "Date": "on October 18, 2011",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FKGKUCI3DG9U"
                },
                "Date": "on September 4, 2012",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CWIYIETNBAK3"
                },
                "Date": "on March 14, 2012",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKT8TGIT6VVZ5"
                },
                "Date": "on October 8, 2011",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AY49I1NF512HZ"
                },
                "Date": "on January 14, 2012",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22B8TQJS37NP"
                },
                "Date": "on November 2, 2011",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KX5VD3VUJBKB"
                },
                "Date": "on October 29, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Because of my limited scientific background I have to read it slowly and in small bites, but it's worth the effort. What a mind! And have you seen pictures of her? She's really quite beautiful."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AG65AWDI2HMFF"
                },
                "Date": "on December 30, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Get their hands on it.  It is eyeopening for the layman(woman).  I haven't found too many problems with it..but being a Medical Technician I was wondering why Ms. Randall mentions the Netherlands being the birthplace for the microscope, and doesn't happen to mention..Antonia Leeuwenhoek and his Microscope.  I guess he doesn't still get the cred because he was an amateur at best in science at the time.  But his development of the better lens for the time can't be dismissed.  At least that was what was taught to me in tech school. It could of been taught wrong as I know even in certain levels of education anything can be held circumspect. But getting back to the book...\"Knocking on Heaven's Door\" is a fantastic book.  Sorry for the sweeping generalizations.  I am just getting into it, and I wish everyone can read it. Many of the ideas of it are over my head, but it is written in a fashion that anyone can find thrilling, and be amazed at what science is on the verge of discovering through particle physics. With the provocative title it might get people who are not generally into reading about science out of their shell and delve into the reality of science."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3S3R88HA0HZG3"
                },
                "Date": "on November 16, 2011",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUZO51KJH3WLB"
                },
                "Date": "on November 11, 2011",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYQGDKK76OEVT"
                },
                "Date": "on July 30, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I love Lisa's books. Her very entertaining yet meticulous writing with close attention to detail gives a layperson like me a glimpse into the amazing and wild world of physics. To me this book is so exciting because it gives one the ability to look at some of the thinking that has produced new theories that may be tested at the L.H.C. in the next five to ten years. It appears scientists have shown the existence of at lest one form of the Higgs boson and will now be looking for some verification of extra dimensions that will further  enhance our understanding of how our universe works and if indeed we're part of a multi-verse. Lisa explains how this is a matter of scale, traveling from huge distances measured in billions of light years to distances that are almost infinitely small. She also explains how our view of reality based on how we perceive it in our daily lives is very limited and that there's much more to the organization of the universe than we can know using our senses. This is a book you can read several times."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DUQCWUYX726O"
                },
                "Date": "on February 11, 2012",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "2",
                "Text": "Terribly written!  It reads as if it were dictated over many disjoint sessions and never edited by Randall (or anyone else).  Wordy and repetitive (a common result for dictated books), with many sentence and paragraph transitions that left me baffled (perhaps showing the boundaries of the dictating sessions).  There are far better and more readable introductions to physics and cosmology than this.  You would even learn more by reading some recent articles in Scientific American on the topic.  Loren Eiseley must be turning over in his grave!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15PV8J0IYVDNH"
                },
                "Date": "on March 16, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "As other have indicated Professor Randall offers an excellent presentation for the interested layman on the current outlook of particle physics and cosmology she also describes in an understandable fashion the goals and structure of the Large Hadron Collider (LHC) and what its investigators can reasonably hope to learn.  Like most professional scientists she is best at pursuing and explaining her own areas of endeavor.  There are however digressions into religion and social policy and life experience. Here her opinions while interesting are neither novel nor expert, and the popular presentation of scientific concepts is not enhanced by these digressions."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AEPMPA12GUJ7"
                },
                "Date": "on April 12, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Knocking on Heaven's door is an approachable and fascinating book about science, the Large Hadron Collider, politics and funding, religion, candidates for a general field theory, and not blowing up the world. I will be reading it again and again; it has more content than I can go through in one round, but I really like her matter-of-fact style and her willingness to discuss all kinds of subjects in relation to science. I want to soak up the details of that world of particles, anti-particles, spin, color, charm, strangeness, strings and branes. Wow! Lots of wow."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A239CTS802GZLP"
                },
                "Date": "on December 28, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Good book in terms of philosophy.  A majority of the book is spent on Randall harping about how people don't understand science and that scientific thinking can make the world better.  If you are already a proponent of science and want to uncover good arguments for its continuance then get this book.  However, if you are like me looking for a book about modern science and explanations of phenomena look elsewhere.  There is barely any actual talk of physics in this book other than to use it as a quick example to prove why science is important."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27E44IWS3B7VD"
                },
                "Date": "on April 19, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ICKSJ6T7WIBO"
                },
                "Date": "on July 28, 2012",
                "Helpfulness": 0.6363636363636364,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KQLV5QJUGE95"
                },
                "Date": "on October 16, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Nice overview of the aims, means, achievements, and open questions associated with contemporary particle physics and comsomology, with an emphasis on work being done at the CERN Large Hadron Collider.  To get the most from this book you should first read Randall's \"Warped Passages,\" which is technically and stylistically more demanding of the reader; however, \"Knocking on Heaven's Door\" can still be appreciated as a stand-alone volume."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WK0AN2YFFWJL"
                },
                "Date": "on March 5, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Lisa Randall is a gifted writer and expositor of difficult and arcane concepts. Her description of the design and operation of the Large Hadron Collider at CERN is  extremely instructive and without peer for a lay audience. The book is a must for anyone interested in the search for the elusive Higgs boson, hidden dimensions, and, more generally, in what is happening at the frontiers of both particle and astro physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A271DJY8BDRZ51"
                },
                "Date": "on April 2, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "THE AUTHOR TAKES YOU ON A TOUR FROM PARTICLE PHYSICS TO COSMOLOGY WITH DETOURS INTO ART, FINANCE, AND RELIGION ALONG THE WAY. AS OTHER REVIEWERS HAVE POINTED OUT, NOT MUCH NEW IN THE WAY OF SCIENCE, BUT THAT IS NOT WHY THE BOOK IS SO INTRIGUING. IT IS THE DEFTNESS OF PRESENTATION AND EXPLANATION OF THE PROBLEMS AND POTENTIAL SOLUTIONS THAT GRASPS YOUR CURIOSITY AND ALMOST DEFIES YOU TO PUT IT DOWN. A MUST READ!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31TQ00F7AWBVJ"
                },
                "Date": "on March 30, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Randall has written an excellent account of the current problems in and status of physical science.  Her book is suitable for any intelligent person who wants to have a general understanding of particle physics and cosmology without having to learn the difficult mathematical tools necessary to follow every step.  She has done a wonderful job (even while splitting too many infinitives)."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VSRV9X7B0LR1"
                },
                "Date": "on April 28, 2015",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "I have learned a little bit with this book, but she spends far too much time justifying science rather than elucidating it. It comes off quite defensive, and a bit annoying While I am interested in the LHC and have learned a lot about it, it is not why I wanted to buy the book. I am struggling to finish it. While it is well read, I give it a 'meh'."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AH687Z694PFGV"
                },
                "Date": "on June 22, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book covers the waterfront in terms that are both informative but also in a \"friendly\" tone.  It was written prior to the confirmed  existence of the Higgs boson, but prepares you for its presence.  A great book!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3R7WHOIN5HVQG"
                },
                "Date": "on May 12, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24GRSGE4AK4XW"
                },
                "Date": "on March 2, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I am not a scientist. Knocking on Heaven's Door taught me a lot about the new physics unknown when I was a kid in high school. A lot was unknown even when I was in college.  She writes to explain and not to show off.  I think I understood most of what I read.  It made me more creative and happy. I would love to meet her one day."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFL3YM8RLRPCK"
                },
                "Date": "on February 24, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Well written and very informative for the layman struggling to find answers among the hype and hysteria surrounding the so called war on science, or religion depending on which side you are on! Will look for more by this author!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35DNQLMTFSCMV"
                },
                "Date": "on December 19, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I learned a great deal about the LHC and what we hope to learn. The discussion about the Higgs Boson is very informative. It was interesting to read about various theories and questions that will be tested and hopefully resolved. Lisa Randall takes a potentially dry discussion about the Higgs and other current particle physics and cosmology topics and gives us a fun read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DEFSZO5ZUQV3"
                },
                "Date": "on June 22, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Excellent, well thought out book, but will be appreciated most by those who remember a bit of their college science courses. Not a quick read. Should be read carefully while fully awake. Not a bedtime sleep aid."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1R4U5DS1JUUEY"
                },
                "Date": "on February 8, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Good book for the non-physicist to understand the latest in research on the cosmos and an understanding of the LHC status."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GSPLYHQYNYX3"
                },
                "Date": "on February 3, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27QEY4P1I33F6"
                },
                "Date": "on January 27, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I have not finished reading this book, and I am ready to give it a great review.  Lisa Randall is an excellent writer.  I have read many books on science and scientific thinking, and this is one of the best.  I am looking forward to finishing this book and re-reading it in the near future."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LJ1UMBXY0VVL"
                },
                "Date": "on January 17, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Knocking on Heaven's Door is a great book for people interested in science but who are not scientists themselves.  It explains in clear terms for ordinary people the excitement of the world of particle physics and why research into this realm is so important.  Lisa Randall explains clearly why larger and larger machines are required to probe to ever smaller scales.  Best of all is the idea that she pointed out time and again of the \"effective theory\", that science is all about theories that match observed phenomena and that theories must be changed and adapted as new evidence comes to light."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BMC3IDV1QODV"
                },
                "Date": "on January 16, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I like the conversation about the religious view point on the universe and how to look at science on different scales."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2N4M0SED74BBR"
                },
                "Date": "on January 15, 2013",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "It is written in common English so all can understand, but not the book I was expecting.  Anyone interested in science and physics would enjoy reading this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JTHO8ELZHOS6"
                },
                "Date": "on January 14, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "If you are interested in the fields of Cosmology and Astrophysics, the writings of Lisa Randall, including this one, are a must read.  She explains the latest research and theories of these challenging subjects in a clear and concise manner for the non-professional, while not over-simplifying the content with childish analogies."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A125Q87CM7HIFA"
                },
                "Date": "on January 13, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "After reading many books on theoretical physics this author gave some very excellent descriptions of the Standard Model and Quantum Mechanics tenets giving me a much better understaning of the two theories independentaly and how they work together. A bit too theoretical in parts for a non scientist - but understandably so."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KG010R3GA3T6"
                },
                "Date": "on January 12, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10HSOTK8PFTQF"
                },
                "Date": "on January 11, 2013",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "Lots about they way scientiests think and approch a problem but a tad short of explainations of what possible uses might come from current physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HXKMGVMQSA29"
                },
                "Date": "on January 8, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "It is an expertly account of what the LHC experiment is aiming at and what is the apparatus. It is well written though the introduction to the state of physics is, surprisingly, fairly standard and not that illuminating. Other chapters are interesing."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQUEOGBPFEOO0"
                },
                "Date": "on January 5, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Written for the lay person, the tone is informative, and the diction is easily understood. I think there are many people interested in physics who would enjoy Randall's work."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVVQ5PWQPJVUO"
                },
                "Date": "on December 28, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Lisa Randall has the unique ability to describe complex subjects in layperson's terminology so simpletons (like me) can understand them. Warped Passages by Lisa Randall is also an excellent book for anyone interested in quantum physics, quantum gravity, string theory, - or extra dimensional space in general."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWMF4FT3QEA5J"
                },
                "Date": "on December 25, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PTK23STCV4MD"
                },
                "Date": "on October 23, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Lisa Randall does a good job of covering the current status of particle physics, at a high level.  There are a couple of chapters on the Large Hadron Collider, which I found interesting.  These topics are about one quarter of the book.  For the rest, she covers science and religion, the scientific method, the importance of scale and many other science related topics.  This book is a good read, and at a level for the lay person."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11RYMD0220F69"
                },
                "Date": "on January 2, 2012",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2F3M93RRLFQNJ"
                },
                "Date": "on February 24, 2012",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJLW1DZSHOVGW"
                },
                "Date": "on December 9, 2011",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3M6X9GJ039PI0"
                },
                "Date": "on January 21, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Lisa's interview with Charlie Rose made me think that i could read a book about physics & as well as understand it. The book is well written. It portrays the quest for the smallest particle; the Higgs Bossom, as a star character in a romantic movie that you wanna see alive & forever."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A184ZFZZBWEXMS"
                },
                "Date": "on October 18, 2011",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ABLA714RDRG3"
                },
                "Date": "on August 17, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30QH6G2FP10KN"
                },
                "Date": "on October 3, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book is a must reading for anyone interested in The Standard Model of Particle Physics, the cosmology, the Higgs boson and supersymmetry.  It leaves the reader with a deeper understanding of the Universe and leads to many unanswered questions."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TCBOAX24DSHT"
                },
                "Date": "on February 27, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Wonderful explanation of scientific development to this time and where we are in terms of our understanding of the universe and its composition. Particularly liked her emphasis on the importance of scale in our current understanding."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CNEGXTWVTE2R"
                },
                "Date": "on February 11, 2012",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1T0HU80TNVZ8O"
                },
                "Date": "on January 3, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "It is interesting for people like me that does not know anything about this subject. It covers new ideas of particle physics and dark matter. It covers the Higgs field."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2D7CYQT27L2FA"
                },
                "Date": "on December 30, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great book. Lisa Randall does a great job explaining all the details. You can sense her passion for science and her love of physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQ5RGNYAE132W"
                },
                "Date": "on March 31, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Well written for the average person - me to understand.  Haven't finished yet ... but looking forward to getting to the end"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A85JLV855GPMD"
                },
                "Date": "on August 25, 2014",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": "You have to be a physicist to understand most of this book.  Definitely not for the lay people."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATFIIW1PBR2G9"
                },
                "Date": "on April 17, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This lady writes from first hand experience on the new physics and where it is going ,maybe."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASP9SKP57RFTU"
                },
                "Date": "on July 20, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2777F2YPMU7MN"
                },
                "Date": "on July 24, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great book, but you must be committed, because it's not light reading."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EI2HPMQMZY74"
                },
                "Date": "on September 7, 2012",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "...this book has been written by a scholar and a teacher...she delivers the facts with personal anecdotes in a manner that allows the layperson to understand something extremely complex...thanks for your hard work Ms. Randall."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LE04PUEI3APM"
                },
                "Date": "on July 27, 2012",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "This is an excellent summary of the developments in physics over the past 30 years. Lisa has an extraordinary way to explain the most intricate knowledge available in ordinary language. If I was on the inside of the door she is knocking on I would open it with a smile. Thanks Lisa for your very hard work."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1G3NIYOAOC2DY"
                },
                "Date": "on November 24, 2011",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3P730GBO4T4SH"
                },
                "Date": "on February 18, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "I am enchanted by this book, although I confess I didn't absorb or grasp it as well as I wanted to.  It is well written and even a lay person with little science training can fall in love with the study.  Lisa Randall is a talented voice."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20Z86Z8CAC1LI"
                },
                "Date": "on March 20, 2014",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": "Lisa Randall undertakes the task of explaining scientific principles. The first thing I noted is that she would use a whole chapter to explain something that could be explained in one paragraph. Interesting, but a drudge to read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NVK25SNU2BOM"
                },
                "Date": "on April 7, 2013",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": "It's a subject matter that is quite interesting but the treatment was just not exciting. The author is incredibly knowledgeable but provides too much detail without truly getting to the big picture quickly enough."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1H7Y5XKPGT0OS"
                },
                "Date": "on September 21, 2011",
                "Helpfulness": 0.5833333333333334,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VP7JOT3K7PFM"
                },
                "Date": "on February 23, 2012",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31RQXW5N866T0"
                },
                "Date": "on February 5, 2012",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Excellent book. very readable for scientists as well as lay people interested in science. This was a gift to my daughter who is a scientist and she loves it.Arrived in excellent shape and promptly."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NE8EUVT74KFO"
                },
                "Date": "on March 8, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Great book, but not easy reading"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3202TE793QTB8"
                },
                "Date": "on April 7, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Christmas gift for my husband."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAZ7VZ35GKNXR"
                },
                "Date": "on November 27, 2012",
                "Helpfulness": 0.5,
                "StarRating": "2",
                "Text": "JDr. Randall has a clear understanding of the basic concepts of the physics she writes about. The only problem for me is that there are simply too many words. The qualitative features of particle physics is elementary, and the challenge for her would be to simplify the equations which support the theories. This book should have been no more than 150 pages.A LOT OF REPETITION."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24X13BUJQCI9S"
                },
                "Date": "on February 13, 2012",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJSA2D3Y76NXN"
                },
                "Date": "on September 25, 2011",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A274FCHWHG04JS"
                },
                "Date": "on March 20, 2013",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "I enjoy reading books by intelligent physicists, and Randall's book easily fits into that category.  The marvelous discoveries of physics help us better understand the world / universe about us."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1A6KB3O3GANX0"
                },
                "Date": "on February 18, 2012",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1J4YPO05ZIC3U"
                },
                "Date": "on November 6, 2011",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "This book gives an excellent description of the LHC and its role in modern particle physics.  Dr. Randall has that rare talent to explain abstruse mathematical concepts in language understandable to the non-physicist.  I finally could mentally conceive the framework of the submicroscopic world.  I would like to raise my rating to 5 stars."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3462O3B8K0BKG"
                },
                "Date": "on May 2, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I desired to read all of Lisa Randall's books and wanted this one for my collection.  I recommend this book and others she writes.  This is an interesting field and perspective on these universe and scientific fields.  Thank you for a good sale and shipment experience.  Book arrived quickly and in new condition."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AB4U4O6BIP8R3"
                },
                "Date": "on March 1, 2014",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "If I were a smarter person in the field of physics, I'd love it !  Meanwhile glad to have it to re-read until I can learn more and love this book more with each re-read evie"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2342AFDIQBMQO"
                },
                "Date": "on March 23, 2015",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "By this book right now. It is great! And if you follow Lisa on Twitter and say, \"Hi, Lisa\" she may even say \"hi\" back!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3THC3H1QSQG87"
                },
                "Date": "on October 4, 2014",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": "good book"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23WKX7YZ5TCOC"
                },
                "Date": "on March 1, 2012",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QSM5XHPL1T6Y"
                },
                "Date": "on November 15, 2011",
                "Helpfulness": 0.42857142857142855,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BV4XKIIDAR81"
                },
                "Date": "on July 15, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Great service, wonderful product."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1N6AY0XTAPBM2"
                },
                "Date": "on April 10, 2012",
                "Helpfulness": 0.42857142857142855,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARGMKZPE2XOT1"
                },
                "Date": "on November 14, 2011",
                "Helpfulness": 0.4,
                "StarRating": "3",
                "Text": "The first half of the book only remotely relates to small particle physics and the LHC.  It was primarly a discussion of scientific process,and little on physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26CESD5CCO2YF"
                },
                "Date": "on March 12, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "One of the most fascinating books I have read in ages.  At the time of publication, we were thaaaat close. OK, Lisa time for a sequel. I get the first signed copy!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGGV7RC170K2D"
                },
                "Date": "on September 26, 2011",
                "Helpfulness": 0.42857142857142855,
                "StarRating": "5",
                "Text": "Dr. Randall does it again! Just started but love the book so far. Hope to get it autographed next week...."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VAYPRMV0ZAA0"
                },
                "Date": "on January 7, 2015",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "Clearly and cleverly written but no 'new news' and starting to feel a bit recycled."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QIQ8YYA1C7C6"
                },
                "Date": "on December 6, 2011",
                "Helpfulness": 0.45454545454545453,
                "StarRating": "2",
                "Text": "sadly, this book just wasn't fun to read.  I tried to like it, but in the end I used it as a sleep aid.  The prose just felt so laboured. Not stilted just dull.  Many paragraphs seemed to be saying the same thing."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AW1RXMVF3XMW"
                },
                "Date": "on February 28, 2015",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": "Went out with the trash."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JOU1MS2BMR5P"
                },
                "Date": "on September 9, 2014",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "great reading"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3267QX4JF5LBR"
                },
                "Date": "on August 30, 2013",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": "Too much boasting and name dropping and uneven treatment of the actual physics. Reading about the LHC was interesting, but could have gotten a more succinct description probably from a brochure about it. I'll read someone else's book to learn about when they discovered the Higgs."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3P0JOT9GDM408"
                },
                "Date": "on October 2, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Great"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BNKQLRTR0K0G"
                },
                "Date": "on October 24, 2011",
                "Helpfulness": 0.2,
                "StarRating": "5",
                "Text": "Lisa Randall has written an excellent book. She has taken the time to explain various aspects of physics. Considering the complexity of the subject matter she has hit it aplomb."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABJCPH4Z4GZS7"
                },
                "Date": "on September 22, 2011",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RD6HN5KEVOZB"
                },
                "Date": "on October 25, 2014",
                "Helpfulness": 0.25,
                "StarRating": "1",
                "Text": "A cheap shot at Sarah Palin that has nothing to do with the topic.  A weak discussion of religion that should have been left to other authors who do a much better job.  And finally a relatively weak review of the topic.  Not worth the trouble."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYB2H9VMAUG15"
                },
                "Date": "on May 30, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Thank goodness that i got this book on-time. I have always wanted books that were about physics but i didnt find my passion for physics until i went to school and i almost signed up for a class but i found out that i needed calculus in-order to take physics with calculus. Now that im about to take precalculus in late june I hope to aspire to advance the needs of our world and our nation. i know this not a blog but people like lisa randall inspire me to do and think about life from my own unique perspective. I hope it changes my way of thinking about science and i hope anyone reading this knows to never quit in life"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27VJ7UE7VW4NE"
                },
                "Date": "on January 15, 2012",
                "Helpfulness": 0.4375,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LYXG5HR8ANOQ"
                },
                "Date": "on January 26, 2013",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28F85EMNBHA13"
                },
                "Date": "on December 9, 2011",
                "Helpfulness": 0.4489795918367347,
                "StarRating": "1",
                "Text": "This book has some potential, but Lisa Randall focuses too much on differences between science and religion.  There are admittedly differences, and those differences should be briefly addressed.  Unfortunately, the science-religion differences are discussed for at least the first 85 pages of the book.  I was disappointed in this book; I expected a book on physics, not a book arguing why science and religion are different."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RCWI0I157DXH"
                },
                "Date": "on December 2, 2011",
                "Helpfulness": 0.4230769230769231,
                "StarRating": "1",
                "Text": "I really enjoyed Warped Passages, and have read many books about the cosmos, physics, etc. I looked forward to reading Randall's new book, Knocking on Heaven's Door, only to be totally disappointed that she has spent so many pages talking about her political views, including some thoughts on global warming and the banks! The book is recommended by Bill Clinton, as revealed on the dust cover once you buy it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1R4BL5MYUDNDJ"
                },
                "Date": "on September 21, 2011",
                "Helpfulness": 0.40816326530612246,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AND9DVZWNEE1S"
                },
                "Date": "on October 19, 2013",
                "Helpfulness": 0.21428571428571427,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAW97OPBT8CD2"
                },
                "Date": "on March 2, 2012",
                "Helpfulness": 0.15384615384615385,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A172686UHU0RJV"
                },
                "Date": "on January 1, 2013",
                "Helpfulness": 0.14285714285714285,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KSHVQPZFF9ZR"
                },
                "Date": "on April 13, 2012",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SNJQ0TKKOX5N"
                },
                "Date": "on October 10, 2011",
                "Helpfulness": 0.35398230088495575,
                "StarRating": "1",
                "Text": "Professor Randall has added nothing to the understanding of physics in this jargon filled and extremely boring book.  What a disapointment from an author as quailfied as anyone to make sense out of the latest thinking in physics.  Don't waste you time on this very bad book. The author never hesitates to expand upon the blindingly obvious, while skipping everything of real interest at the cutting edge. A real disapointment from an author who should have known better."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SE2FM908PZI8"
                },
                "Date": "on January 7, 2014",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": "THIS WAS THE WRONG BOOK!! THE ONE I ORDERED WAS ALSO NAMED \"KNOCKING OF HEAVEN'S DOO[R\", BUT/ IT IS ABOUT A BETTER PATHWAY TO DEATH."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NV0QT5DB4UOW"
                },
                "Date": "on November 11, 2011",
                "Helpfulness": 0.055900621118012424,
                "StarRating": "1",
                "Text": null
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Knocking-Heavens-Door-Scientific-Illuminate/product-reviews/0061723738/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "188"
    },
    "Salesrank": "#27,086",
    "Timestamp": "2015-05-24 12:46:54.946534",
    "itemurl": "http://www.amazon.com/Knocking-Heavens-Door-Scientific-Illuminate/dp/0061723738"
}
