{
    "Category": "in Books (",
    "ListPrice": "$14.99",
    "Name": [
        "Six Not-So-Easy Pieces: Einstein\u0092s Relativity, Symmetry, and Space-Time"
    ],
    "OfferPrice": "$13.17",
    "Reviews": {
        "AverageStarRating": "4.6 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KSBNXFCEY6D6"
                },
                "Date": "on April 4, 2003",
                "Helpfulness": 0.9833333333333333,
                "StarRating": "5",
                "Text": "Six Not-So-Easy Pieces is the sequel to the book Six Easy Pieces. The first book is a collection of six of the easier lectures from Feynman's freshman and sophomore physics classes at CalTech. Six Not-So-Easy Pieces are some of the more difficult lectures from those classes. In contrast to the first book, these lessons are much more mathematical. Freshman calculus is definitely a prerequisite to reading this book. Courses in vector calculus and differential equations will help the reader to more completely understand the works, but they are not absolutely necessary. However, without much mathematical knowledge, one can just take Feynman at his word for all the equations, reading mainly the conceptual explanations, but one will invariably miss out on some of the points. For anyone reading the book, Feynman's teaching style is something that can be enjoyed. He explains the concepts in a comprehensive and not-too-difficult manner and seems to have a full understanding of what the student in the lecture hall is thinking. The six topics (chapters) covered in this book are: Vectors, Symmetry in Physical Laws, The Special Theory of Relativity, Relativistic Energy and Motion, Space-Time, and Curved Space. This book is in no way a survey of physics. It is more of a sampling of Feynman's teaching. However, the common thread that runs through the six pieces is that they all relate to understanding relativity. For the layman who has a mathematical background and wants to understand the concept of relativity, this book is an excellent help. I would suggest reading Six Easy Pieces before reading this book, but it is not necessary. If you enjoyed reading the first book, I would highly recommend this one and vice versa."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FHAMLNGHCFU7"
                },
                "Date": "on December 30, 2002",
                "Helpfulness": 0.8640776699029126,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3G90U3RUL4IU9"
                },
                "Date": "on June 14, 2000",
                "Helpfulness": 0.918918918918919,
                "StarRating": "5",
                "Text": "These lectures where designed to give the student the reasoning behind relativity.  Unlike some books, this book does not just explain the results or phenomena of relativity.  Feynman actually explains the problems with  Newton's laws and actually derives and gives the reasoning for Einstein's  theories about relativity.  These lectures need only some calculus and  basic physics knowledge to appreciate.  However, as with most bonfide  scientific literature, the more \"mathematically and scientifically  mature\" the reader the better.  Feynman uses pieces of calculus (very  basic stuff), algebra (symmetry, vector notation, cross products, and dot  products), geometry (non-Euclidian), and basic physics knowledge  (conservation laws, Newton's laws, Maxwell's equations etc).  You don't  need all of this to listen and understand the lectures, but obviously the  more the better.  Feynman also does a good job of explaining some the  mathematics involved as well.  The lectures pretty much follow the book so  you can read along while you listen.  These are actual lectures that  Feynman gave at Caltech to undergraduates so they are very rigorous.  In  short, the lectures were clear, very understandable, and offer something to  everyone.  You don't need anything more than a solid background in calculus  and introductory physics to get something out of these lectures."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XQ5LZHTD4AFT"
                },
                "Date": "on July 28, 2004",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Though the title implies it, this book is not really a sequal to the Six Easy Pieces. They can be read seperately. It treats some of the concepts centered around Special and General Relativity that revolutionized physics near the turn of the century. It would be impossible to find another book that can dive so deeply into topics such as symmetry and space-time, while bypassing formalism and exposing the fundemental ideas and signficance in every-day terms. The delivery is in lecture form, and while that makes it more authentic and real, the fact that this is a book and the reader is not really in a lecture, makes it a little awkward. One often gets the feeling that one had to be there to get the full benefit. There is little attempt at explaining the historical context and other niceties and focus is solely on the concepts themselves. One needs to have at least college level math background to follow the derivations. Feynman has done a phenomenal job in reducing such complex concepts into digestable pieces of conversation. There is no abstraction, everything is quantified. I especially enjoyed the chapter Curved Space, as I had never seen it treated so intimately. The self consistency of all these topics and how they are interrelated is elegantly presented."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1E2WQFVYF4E71"
                },
                "Date": "on June 27, 2001",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "\"Six Not-So-Easy Pieces\" are six selections from the Feynman \"Lectures on Physics\".  They represent not the hardest material to be found in the \"Lectures\" (and certainly not elsewhere concerning Feymnan's essays or other lectures) but perhaps some of the most thought-provoking and challenging conceptually (although, if you would like a conceptual challenge, check out Feynman's \"QED\").  Spacetime, Relativity (Special and General), Vectors, Symmetry --- there is no end to the knowledge and unique grasp of physics that Feynman possesses.  I recommend this book highly to anyone with the impulse to ask, \"Why?\""
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3637XW4AJL9OI"
                },
                "Date": "on March 3, 2002",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1E50HHYCSD1HO"
                },
                "Date": "on May 12, 2011",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on May 31, 2004",
                "Helpfulness": 0.875,
                "StarRating": "4",
                "Text": "Six not so Easy Pieses is a small anthology of six pieces taken from Feynman's great classic, The Feynman Lectures on Physics, which were delivered to Caltech freshman.  I would not recommend buying this book unless you have an excellent backround in calculus and how it relates to physics.  I have read the first volume of the Lectures, and i will tell you it is nice having this to accompany it, since some of the chapters such as on Relativity merit to be read twice and since the Lectures is so bulky and heavy.  There is no way someone can read understand what he's saying without knowing a good amount of math.  Its like reading a book in which all the concepts are expressed in Greek.  Also, these lectures were given during the middle of course, and he often mentions things which were discussed in previous lectures.  The reason it gets a four is because the lectures are great (many great lectures were ommitted though), but it is too short and is out of place.  This is NOT a great sequel to Six Easy Lectures, they have practically nothing to do with each other.  The perfect sequal to Six Easy Lectures is the whole first volume of the Lectures."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35H0XIWPU4Y39"
                },
                "Date": "on July 9, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "As in the first book, Feynman clearly explains each concept from vectors  to curved space-time in a manner suitable for those embarking on those  concepts. Even persons who have already read texts on special relativity  and space-time can benefit, in part, from reading this book. And any  student or novice beginning with these concepts will find this book  invaluable. Nothing less could be expected from Feynman!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 6, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "If you want to understand relativity, start with this book. Feynman's explanation of the basic principles is very clever. I've never found a better introduction, not even Einstein's \"Relativity\", which is the book I suggest to go to after reading this one."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A267XNIM9719UE"
                },
                "Date": "on January 25, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book, its predecessor and the entire lecture series are the finest companion that a physics teacher can have.  The simplicity and elegance with which Feynman explains things inspires me reach for a way to show the  beauty in physics to my students.  Nothing but the wonder of physics itself  inspires me to enthusiastically teach physics more than the writings of  Richard P. Feynman."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1H7Y5XKPGT0OS"
                },
                "Date": "on October 31, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1A6KB3O3GANX0"
                },
                "Date": "on March 10, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1E2WQFVYF4E71"
                },
                "Date": "on June 27, 2001",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AR2GLQZGC5XW7"
                },
                "Date": "on February 12, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BDY15VLUOB2J"
                },
                "Date": "on February 11, 2002",
                "Helpfulness": 0.8,
                "StarRating": "4",
                "Text": "How refreshing it was to read Feynman's explanation of relativity after wading through Einstein's dry coverage of the same material. Perhaps the drama didn't come through in the translation from the German, but Feynman's account was so much more gripping. Moreover, Feynman went far beyond simply explaining the special and general theories of relativity; he pieced them together into the larger fabric of physics and pointed out all sorts of interesting curiosities along the way. If you want a solid introduction to relativity and you have an understanding of basic physics, this is the place to get it."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 29, 1998",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": "this book explains many interesting questions, such as why nothing can travel faster than light, why when light travels in a moving craft its speed doesn't increase, why we need to think of space-time together etc.  the book includes a lot of equations, but skipping them still leaves the  text very understandable. feynman uses a lot of real life examples to  illustrate his points, which makes the book a lot of fun along with a great  learning experience."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2D2SAVHW1XH3J"
                },
                "Date": "on April 13, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "These are an excellent set of lectures. You really do not need too much of mathematical sophistication beyond standard calculus and geometry concepts. If you wanted to start on Einstein's general theory of relativity without any prior knowledge, this book is a good place."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KJO5VP4K3CHU"
                },
                "Date": "on October 17, 2007",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DDDBB9P90E44"
                },
                "Date": "on April 5, 2014",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3W3EJKHGYC9VQ"
                },
                "Date": "on June 23, 2009",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is not a traditional layman's book as it does assume some background in calculus and physics -- but it is not overloaded with endless mathematical equations, just the critical ones. If it's difficult to appreciate the meaning of an equation like F = d(mv)/dt -- then it's probably best to skip the book -- but if it resonates with you, the book is very approachable. Though his style is informal, Feynman's words are carefully chosen.  It is not especially long -- but it should be read very carefully.  The book contains excerpts from his famous lecture series -- this particular collection focusing primarily on special relativity with some vector math, symmetry, and a touch of general relativity tossed in.  If you have a layman's working knowledge of special relativity, this is a nice way to cement it into place with a very intuitive development from a moderately basic level."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JT0VZE1TEZ13"
                },
                "Date": "on August 22, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "Whereas Six Easy Pieces was a well-written physics primer for lay readers, Six Not-So-Easy Pieces reads like a poorly conceived text book. The introduction of vectors serves to form a foundation for the explanations which follow in the next chapters, but lay readers who don't already have an exposure to vectors aren't likely to learn them from this brief passage, and more experienced readers already have an in depth knowledge of the subject. This second volume loses or neglects everything which made the first volume good. Unfortunately, I can't really recommend this book to anyone; if you're a lay reader, look elsewhere for explanations of these topics, and if you're a student of physics, spend time reading an actual text book and learning the subject."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20EEWWSFMZ1PN"
                },
                "Date": "on August 20, 2000",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQVNQQ3V7IECC"
                },
                "Date": "on January 13, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book has allowed me to verify some of the concepts I thought were true, based on other books I have read but did not totally understand.  Feynman does not presume that the reader can mentally leap from one mathematical concept to another without a conceptual bridge which he usually provides.  His examples around how the longest elapsed time is the shortest spacetime distance are excellent.  His explanations of time dilation due to speed and gravity are very clear.  I really like this book.  The subjects in this book can be understood by anyone who has some physics and math background but it is not going to work for someone who has no background or has no intention of taking some time to ponder and study."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1J21NGOED8BGN"
                },
                "Date": "on September 1, 2009",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 5, 1999",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "Feynman is amazing. Thanks to his genius, descriptions, and a few (tricky, but not impossible) equations, Feynman manages to explain even the most mind boggling concepts in a way understandable to even people with no  physics background. From vectors to space and time warps, this book has it  all."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1C0VH44D2TFDR"
                },
                "Date": "on August 13, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Although I struggled with some of the math, this was still an interesting read. Feynman articulated his examples well and provided sufficient details to understand the concepts even if you are not capable (or willing) to work out the calculations."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PA56FWDJQ57F"
                },
                "Date": "on June 18, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "While this presentation is for non-technical people, it does take some focus to understand the concepts. However once you grasp them your mind can open and you'll understand much more about physics and the scientific method."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17IFN0BTGO7V7"
                },
                "Date": "on July 20, 2010",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book tackles the next set of material continuing from \"Six Easy Pieces\".  It's not that these pieces are any more \"not-so\" than the previous ones, just a bit more abstract; but essential for understanding physics.  Feynman's writing is top-notch (as usual), and the book is relatively short, so it isn't too large of a time commitment."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19IMMHA6VG9PR"
                },
                "Date": "on March 21, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Although originally intended for physics students, Richard Feynman's writing is so clear, so understandable, that non-scientists can learn a great deal.  One can learn the particular physics, like relativity, and one can learn also how science gets done, the essence of what science is --- as taught by the master."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2S5ZJUXYCV3UF"
                },
                "Date": "on January 4, 2009",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 3, 1999",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "An extremely excellent book! These six lectures really teach a lot about physics, are very in depth, and include a little humor too. They did not bore me at all, but instead sparked my interest. Warning: It contains a bit  of math, and may be a little difficult to understand."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25QA37OVMVNOA"
                },
                "Date": "on October 10, 2009",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33CT7P95B2DXR"
                },
                "Date": "on September 3, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Love all of Richard Feynman's work.  I come from a science background so I would likely enjoy this more than someone not interested in the sciences though."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2467A6DK4620H"
                },
                "Date": "on December 24, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "He is known as a brilliant and personable man, and a great teacher. I have found other books easier to follow however."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28CQJB08KOS8"
                },
                "Date": "on June 3, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is subject I have a strong curiosity for. Mr. Feynman makes it easy for a not so accomplished student of Phtsics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30RWOFF6DRG54"
                },
                "Date": "on February 18, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is a great follow-on to Six Easy Pieces. Where that book left off, this one continues in the same fashion."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAR0AE40N1Z3A"
                },
                "Date": "on December 7, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Great book.  Only problem is that font for equations show up very small on Kindle version"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24OTNRFNFZG1F"
                },
                "Date": "on January 8, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I gave this to my boyfriend for his birthday. He loved it!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17JUXNU7PUWMU"
                },
                "Date": "on December 16, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Anything by Richard Feynman is great to own"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAVVPHV7ALEAY"
                },
                "Date": "on April 11, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Dr. Feynman is a great read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VCUHTNO1EDB7"
                },
                "Date": "on August 4, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Received in great condition."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CVJZGIKW03F8"
                },
                "Date": "on February 12, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Educational"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UN3L3PJCZNGG"
                },
                "Date": "on February 16, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 31, 1998",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": "Feynman at his finest.  Presents not so easy arguments in a manner that is at once clear and convincing.  Other than a small bottle of advil, nothing but ensthusiasm and curiosity are required to finish these tapes in  one long but worthwhile drive towards the apocalypse."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2U9ZOT757BRVS"
                },
                "Date": "on June 3, 2010",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "OK. You'd think I am kidding talking like that and calling a book \"MUSIC\"-al. Trust me, this guy REALLY knew how to expose a difficult topic(s). Check this out when starts of explaining relativity - \"The equations of motion enunciated by Newton were believed to describe nature correctly, and the first time that an error in these laws were discovered, the way to correct it was also discovered. Both the error and its correction were discovered by Einstein in 1905\". Honestly tell me how many books on Relativity can explain in two sentences what the essence of relativity is. The chapters goes on to reveal nature in all her glory at the hands of this man. He truly was a wonder. One of the seven pillars of scientific wisdom. The entire book actually are chapters from his lectures on Physics. I ONLY wish they'd take more chapters out and create shorter condensed editions like this. The Feynman Lectures on Physics, while marvelous in every which way, is too hard to carry with you and read in the park or a cafe. This version makes it a perfect traveling companion. Read it, re-read it! Its really awesome"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A276T3T9Q4UHMK"
                },
                "Date": "on January 18, 2008",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Great book. Bought this book for my son, the Physicist, and he loves it. Detailed but an easy read if you understand physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31EAT8J90OBMA"
                },
                "Date": "on March 18, 2002",
                "Helpfulness": 0.4166666666666667,
                "StarRating": "4",
                "Text": "Though I'm not very excellent in Physic,I can understand what he wants to say easily. In the prosses of reading this book, you may find interesting for he never tells you the answer but guids you to find it by yourself. It's just like an adventure. In addition, if you are not satisfied with what you had learned, you can learn Feynman how to explain a thing more clearly and easily to people."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MR1VMK999I6O"
                },
                "Date": "on May 6, 2000",
                "Helpfulness": 0.34782608695652173,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CDB11A78ROO8"
                },
                "Date": "on July 13, 1999",
                "Helpfulness": 0.16666666666666666,
                "StarRating": "3",
                "Text": null
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Six-Not-So-Easy-Pieces-Einstein%C2%92s-Relativity/product-reviews/0465025269/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "50"
    },
    "Salesrank": "#188,846",
    "Timestamp": "2015-05-24 13:26:22.622797",
    "itemurl": "http://www.amazon.com/Six-Not-So-Easy-Pieces-Einstein%C2%92s-Relativity/dp/0465025269"
}
