{
    "Category": "in Books (",
    "ListPrice": "",
    "Name": [
        "How Things Work: The Physics of Everyday Life"
    ],
    "OfferPrice": "$6.99",
    "Reviews": {
        "AverageStarRating": "4.9 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A61LJQICFZQQX"
                },
                "Date": "on October 10, 2006",
                "Helpfulness": 0.98,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A49SC8NL7CCH"
                },
                "Date": "on August 15, 2000",
                "Helpfulness": 0.9333333333333333,
                "StarRating": "5",
                "Text": "As a highschool physics teacher, I strongly recommend this book to every  physics (and science) teacher. It can serve as a source for daily life  examples of physics principles in your instructions. Even if you are an  inquiry minded person, you are going to find well-designed explanations for  the functioning of lots of tools, machines, etc. in the book. Really  exciting, rich content, excellent book."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 4, 1999",
                "Helpfulness": 0.9523809523809523,
                "StarRating": "5",
                "Text": "The impact of this book is extraordinary.  As you walk through your house, you realize how many appliances are now familiar to you, in terms of how they work.  This book makes me think in awe of the scientists and inventors  that come up with all of these common, yet complicated tools.  I have used  this as a resource, valued above the encyclopedia."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on August 13, 1999",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Mr. Bloomfield describes ordinary objects in a way that appeals to all.  I never had an interest in knowing how things worked until I read this book and realized how interesting many appliances that I had taken for granted  are. I found the book very informative and interesting.  The pictures  really help to make the book more successful in relaying the important  information.  This book is definitely worth the money!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 12, 2000",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": "You don't need to be a physicist to understand this book. Take me for example, I took a year of Physics in college and this is enough for me to grasp the concepts presented in this book. What's so wonderful about this  book is that it goes beyond the mere equations and formulas we desparately  memorized before a physics test, it shows that how physics can be  incorporated into our lives and improving the quality of our lives. This is  a great book for those preparing for the physics AP test and those who  simply want to keep themselves amazed."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NTUV3WPXNRY2"
                },
                "Date": "on February 10, 2009",
                "Helpfulness": 0.875,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on December 21, 1999",
                "Helpfulness": 0.7272727272727273,
                "StarRating": "5",
                "Text": "For all of those people that are struggling over what to get their science-loving friends and family members, this is the best book you could get!  Adults and teenagers alike will surely love reading this book and  looking at the wonderful pictures.  I am so glad that I got this book,  because I have learned about the devices that I use everyday."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DBC35E03DHJ2"
                },
                "Date": "on November 16, 2007",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "This is the book for you if you think you ar not into physics.  Or even if you are. It explains the physics of how ordinary things that we use daily really work.  It might even spark an interest in learning more.  It starts with the practical and goes to the theory and you can go into it pretty much as far as you want to go. If you have any curiosity about science this is a great book by a master teacher."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12GT3STWICXU2"
                },
                "Date": "on April 1, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I am using this text for Prof. Bloomfield's Intro Physics course How Everything Works on Coursera. The text is very helpful. The first two chapters of the text cover the material in the first course. There will be other physics courses on Coursera and they will probably follow the next chapters in the text."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15CNZMLK2IILD"
                },
                "Date": "on December 1, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The book is fantastic. Jumping up and coming down is now a lot more understandable, but I still can't do a headstand."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1409343012LCE"
                },
                "Date": "on May 3, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book should be in every home. it is the most up to date book on physics. An easy to read classic."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A361MU89PO9BOF"
                },
                "Date": "on November 25, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent --- arrived in great condition --- as advertised.  Thank you"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AU4X87SW1BYL"
                },
                "Date": "on January 12, 2011",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I ordered this product a week before classes started and I received it a day early. It wasn't in perfect impeccable condition, but it's description said used. I expected it to look worse than what it did and was surprised when I saw that it was like new. Love the fact that I got it for 3.75 when the bookstore wanted 80 something dollars for the newer edition! Very pleased."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABX92UIR9U4LI"
                },
                "Date": "on February 16, 2007",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Book in excellent shape and quickly shipped would definitly buy from seller again."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KJ2Y72T3VPVC"
                },
                "Date": "on March 9, 2010",
                "Helpfulness": 0.07142857142857142,
                "StarRating": "3",
                "Text": "Client took care of my purchase with reasonable time and was very quick to help."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/How-Things-Work-Physics-Everyday/product-reviews/047146886X/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "15"
    },
    "Salesrank": "#214,553",
    "Timestamp": "2015-05-24 13:32:45.380014",
    "itemurl": "http://www.amazon.com/How-Things-Work-Physics-Everyday/dp/047146886X"
}
