{
    "Category": "in Books (",
    "ListPrice": "$17.95",
    "Name": [
        "How the Hippies Saved Physics: Science, Counterculture, and the Quantum Revival"
    ],
    "OfferPrice": "$16.13",
    "Reviews": {
        "AverageStarRating": "4.3 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36A9HWQ9U1IK4"
                },
                "Date": "on June 18, 2011",
                "Helpfulness": 0.9534883720930233,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QAF89X027MFX"
                },
                "Date": "on June 1, 2012",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "So--basically man--these stoners got heigh on Heissenberg, and heard John Bell ringing the universe with superluminal messages. Sure, we all did that back in the early 70s, but these freaks could speak fysiks out of one side of their mouths and the tao out the other. And, the way Kaiser lays it down, these weedwhackers weren't just blowing smoke in the Esalen hot tubs and talking to Leary--and friggin' dead Houdini too--they were also talking to some serious Physics profs embedded in the Ivy League. And one freak came tickling-close to having his experiment that tested Bell's entanglement theorem against psychokinesis published in a super-high Science journal worshiped by Physicist Straignts, and signed off on by Straights. The Straights were already teetering on the brink of Everything-We-Know-is wrong; and they were listening. So was the CIA, which feared the Ruskies were lightyears ahead of us on psychic research. The espionage agencies wanted to transmit messages to spooks in the field telepathically. What were they smokin'? Anyway, the phys-hippies didn't bring us faster-than-light communications, but they stimulated the thinking that brought us other weird technologies, such as quantum effects in computer chips, and quantum encryption of bank transactions. Thus spake Kaiser. A fun read that contains decent science explanations along the way."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LI8P7VU8UWPU"
                },
                "Date": "on July 31, 2011",
                "Helpfulness": 0.8461538461538461,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMRZ5G7HF7I03"
                },
                "Date": "on July 21, 2011",
                "Helpfulness": 0.8461538461538461,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TNH3LUA1GYCK"
                },
                "Date": "on September 9, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ANRKHR4QWXJU"
                },
                "Date": "on December 14, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I15LMXPVQH1D"
                },
                "Date": "on April 22, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NJ1ZH6L0ENS4"
                },
                "Date": "on August 3, 2011",
                "Helpfulness": 0.7777777777777778,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A315JC8BNPRID"
                },
                "Date": "on October 10, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEHO35YVALAYI"
                },
                "Date": "on April 15, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20EEWWSFMZ1PN"
                },
                "Date": "on January 8, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2V54BJRX48DU2"
                },
                "Date": "on April 15, 2012",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A68H8ASAMXO91"
                },
                "Date": "on September 13, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "The author has put together a masterful work of scholarship to track down this history of quantum physics and how it has gone through the politics and leading stories of our times to evolve to where it is today.  Even though it is a lot of research and facts, it still reads like a good fiction novel.  Since I lived through these times, and I know the Bay Area,  I found it put into a clear  sequence the events of those times; he  knits it all together into a fascinating narrative. By the end of the book, one feels quite intimately connected to all the characters from Berkeley, Livermore, San Francisco, Esalen and such."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Q4SRII0YC9KV"
                },
                "Date": "on November 18, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This has little to do with hippies and more to do with the history of quantum physics.  However, I recommend it for those who have an interest in starting to learn about quantum physics.  David Kaiser tells the story well and includes references to other excellent books on the subject."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASJIDMR8IZ4H5"
                },
                "Date": "on September 2, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book makes me recal the Firesign Theatre quote: \"how can you be in two places at once when you are really nowhere at all?\"  This book tells a great story of the perennial human resistance to metanoia, it has a religious flavor in the depiction of the resistance of the ordinary materialists to a new paradigm, which has been true throughout the history of religion, as the kundalini/DMT shamans try to explain the reality of many-worlds to their fellow tribesfolk concerned with everyday survival mode consciousnes, i.e. grant proposal writing.  It is certainly nice to be reminded of Schroedinger's Vedanta background, even if he himself didn't take it too seriously later in life.  And it is nice to see the verification of the many-worlds view of the ancestors like Dogen zenji (\"We are each in the midst of many worlds and each moment in time is a universe unto itself\") being affirmed if not confirmed.  Still the majority of physicists are required to maintain that 'interpretations' are irrelevant to experiment, like Newton's 'Hypotheses non fingo' declaration, and they do not find it at all puzzling that conventional physics is completely consistent with the absence of consciousness as a property inherent in nature and not just a side-effect, as the  negative results of 60 years of AI seem to suggest.  The human mind will always resist the ultimate implications of the equations it discovers, as Wheeler wrote in his preface to Everett's paper.  Even the pre-Socratics knew the reality of consciousness as a universal nonlocal attribute of nature.  Oh well, it will still be while before we catch up to the wisdom of the ancients, it seems. See prof Victor Mansfield's book 'Synchronicity Science and Soulmaking' for another view into the scientific anomalies of consciousness and synchronicity."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ROEAB9YU6EZW"
                },
                "Date": "on September 7, 2011",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": "Fun to read. I read it to see if Eastern mysticism had influenced physics(not much), but the story is fancinating and the author very readable. And it is interesting to see that one of the founders of the Berkeley Fundamental Fysiks Group became a conservative Republican -- so much for the idea that the \"new physics\" produces a leftist social agenda."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXY07XO2Z89R9"
                },
                "Date": "on May 20, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A223WBQXG2NXMN"
                },
                "Date": "on February 20, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWFMGDUUGNGYW"
                },
                "Date": "on October 16, 2012",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FQW9O9ZGOJDM"
                },
                "Date": "on November 25, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I still don't understand Bell's Theorem, but this book helps me understand the context from which it arose and in which it spawned such a burst of new and creative thinking about quantum physics.  What a surprise to find that it was pretty much the same context (the counterculture of the 60s, especially in the SF Bay Area) in which I was coming of age in anthropology.  Definitely a fun read, which I've passed on to my 30s-something son for inspiration."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15FE3H3RJOGP4"
                },
                "Date": "on December 13, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I loved this book. I inched toward a better understanding of modern physics while enjoying the story of the San Francisco physicist-hippies who significantly advanced quantum mechanics in spite of opposition from the physics establishment."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1E0SQUJJ9IRSM"
                },
                "Date": "on August 1, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "I'm sure it's just the nature of the beast, but it was pretty easy to get lost in the relationships and time lines. Maybe a couple of graphics would have helped."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20EEWWSFMZ1PN"
                },
                "Date": "on November 14, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIVIH9VZ67DDW"
                },
                "Date": "on March 10, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Well written, easy to follow: an fascinating account of how the paths of quantum physicists and the 1970s counterculture intertwined."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAP5J2FVA79FK"
                },
                "Date": "on April 18, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A276CGU1PI9YU3"
                },
                "Date": "on December 21, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "A quick, decently written visit to a small corner of the physics world in the 1970s, populated with hippies who happened to be, for the most part, underemployed physicists.  Some great characters, kookie ideas, and a brave endeavor to rescue the field of physics of the blinders placed on it by the pell mell pursuit of the atomic bomb.  Explanations of the physics principles involved accessible but could have been both clearer and more extensive.  A fun read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38H54NW0NIA7J"
                },
                "Date": "on September 13, 2011",
                "Helpfulness": 0.6527777777777778,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACTF6C6WA47JP"
                },
                "Date": "on December 31, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I found the book to be a concise history of the evolution of physics during a transitional time in both science and the sponsorship for basic research. The depth of the science writing is limited however the story that is told is most interesting and enlightening. I would recommend it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TH8FIWI7KNE7"
                },
                "Date": "on October 18, 2011",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35VAQCQ4U28V7"
                },
                "Date": "on October 21, 2011",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3K06JDGAXESSZ"
                },
                "Date": "on November 26, 2011",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12VII57FDTRCD"
                },
                "Date": "on May 23, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "great timeline of recent physics although it was hard to get through at times."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1J9IOLRLTEHIK"
                },
                "Date": "on December 22, 2013",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": "A good book on the history of Physics of a few decades ago, nicely written. From the paradoxes of quantum mechanics and the revealing doubts raised by the theorems of John Bell, the author leads us to glimpse at unexpected developments of computer programs for encription and protection of sensitive information."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15EQVQXFZU22T"
                },
                "Date": "on June 9, 2012",
                "Helpfulness": 0.6,
                "StarRating": "2",
                "Text": "if you want to know something of modern physics, skip the book. If you want to read about a series of SanFran area people who had some physics training up to Phds but found that talking about it and writing about the \"feel\" of physics was ultimately more profitable than accomplishments in the field.  the cast of characters has some value: Werner Erhard and his EST, Ira Einhorn who murdered his girlfriend, kept her body in his apartment for more than a year and then spent 20 years hiding in Europe and blaming it on the CIA, and Uri Geller....along with many physicists who don't publish seriously but write of mystic received thinking from asia as though that has inherent meaning..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11DDMAHC4OZIQ"
                },
                "Date": "on October 18, 2011",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GN77DMO6CNGC"
                },
                "Date": "on May 30, 2014",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "Maybe it was just not what I expected, but it's more about history... Could not read the whole book, after some time you get lost in \"that guy from that university met those guys and they published some paper in that journal and then another guy read that paper and that guys was..\" and so on.."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UYV88AWQ6SH7"
                },
                "Date": "on June 9, 2014",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "As a scientist I found the early chapter interesting and enlightening, but then the author goes into the personalities and relationships of the players, which became boring very quickly.  I finished the book because there was an occasional quantum physics nugget tro catch my interest but I wouldn't recommend it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24505CR98NLLV"
                },
                "Date": "on November 19, 2011",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31TQ00F7AWBVJ"
                },
                "Date": "on February 27, 2013",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "3",
                "Text": "Interesting historical anecdotes about interpretation of quantum mechanics.  Take some of the claims of importance of \"hippie\" contributions with a grain of salt."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28BPGOGA7CSK7"
                },
                "Date": "on August 13, 2011",
                "Helpfulness": 0.42105263157894735,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AL1ITWCH7W86I"
                },
                "Date": "on December 2, 2012",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I bought this and then the ex took it.  Just reordered it.  Can't wait to read it.  Looks interesting!!  Gotta love those hippies!!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SZ97AOCJG4R1"
                },
                "Date": "on August 1, 2011",
                "Helpfulness": 0.3076923076923077,
                "StarRating": "3",
                "Text": "I found the emphasis on the ESP and other para-psychological aspect to be quite boring (if not distasteful).  I wish the book included a bit more in the way of conceptual descriptions of topics like the no cloning theorem and no signaling theorem.  Perhaps this is a book more targeted to practicing physicists who already have a firm background in these topics and who are interested in a history lesson."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UQ6QH8A43SA5"
                },
                "Date": "on August 19, 2012",
                "Helpfulness": 0.1935483870967742,
                "StarRating": "1",
                "Text": "This book should be titled How the Fanatics Wrecked Physics.  You cannot learn physics from this book because it is all about describing the indescribable spookyness of Quantum Mechanics, and did a terrible job at that because the author did not understand quantum mechanics enough.  It is a biased history book.  The book is only good to see the desperation of people like Jack Sarfatti and FA Wolf, and the rest of their gang, in their biased, and flawed interpretation of the world in terms of the weirdest interpretation of quantum mechanics.  The author's view of QM is to accept the weirdness interpretation in the weirdest of experiments, and then imply a weird world.  The way to understand physics is to find the flaws of those weird experiments and explain an explainable world. The world is not flat-out crazy the way the author and his described physicists say it is.  This sort of fanatic interpretation of our experiments is just a way to sell books.  This outlook of physics has become very popular and they all do the same thing: accept the weirdness of QM interpretations instead of trying to find the error of their ways. This happens because the experiments and their interpretations are flawed.  I know because I do experiments with the opposite results. The upshot of all these books on the spooks of QM is that physics itself has lost its credibility.  I bought the book because a friend said it described Bell's theory in a way that one could understand it.  No, it did not describe Bell's theory well at all."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FNZYP0LUFDJ7"
                },
                "Date": "on July 8, 2011",
                "Helpfulness": 0.1,
                "StarRating": "5",
                "Text": "the problem is poor recording. a lot of money  in exchange for crack sound CD. belive it or not i have an average of 100 cracks per audiobook from blackstone audio. dont this people listen to there own products before shipping them to poor customers. what a shame???"
            }
        ],
        "ReviewUrl": "http://www.amazon.com/How-Hippies-Saved-Physics-Counterculture/product-reviews/039334231X/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "44"
    },
    "Salesrank": "#532,788",
    "Timestamp": "2015-05-24 13:01:22.801970",
    "itemurl": "http://www.amazon.com/How-Hippies-Saved-Physics-Counterculture/dp/039334231X"
}
