{
    "Category": "in Books (",
    "ListPrice": "",
    "Name": [
        "Moving Through Parallel Worlds To Achieve Your Dreams: The Epic Guide To Unlimited Power"
    ],
    "OfferPrice": "$9.95",
    "Reviews": {
        "AverageStarRating": "4.6 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29PRLQ3B17Y55"
                },
                "Date": "on May 30, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "This book is different. I would recommend this book to anyone who is interested in creating change in their lives. This book utilizes the latest cutting-edge quantum scientific discoveries to move the reader from a world of unfulfilled dreams to a world where literally anything is possible. The author will take the reader through all the fundamentals of quantum physics, but he does so in a way that anyone with a good grade school education will understand. Then he shows the reader how to use this science to achieve the reader's goals, and he does so in a way that truly stands out from almost all the other books out there that purport to help you to achieve your dreams. This book is well-worth your time and money. Go for it!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2000UWY2NE2EB"
                },
                "Date": "on September 19, 2013",
                "Helpfulness": 0.9259259259259259,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Q6TB34QLJ85G"
                },
                "Date": "on September 2, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CHDXSQ339TC0"
                },
                "Date": "on June 3, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book is a summary of the more than 200 spiritual and self-help books I have read.  It clearly expresses many of the concepts that have kept me on the spiritual path and gives them life and access. I will definitely be giving this book to my grandchildren!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SX9XC0T7S2JQ"
                },
                "Date": "on October 3, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Excellent book that really makes a person think and ponder reality and what it may really be and how out thoughts may be really shaping out reality."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EAWBDX527ADG"
                },
                "Date": "on July 31, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "I've searching for a book like this one for e very long time!  A well planned guide that can change your life.  Unlike \"The Secret,\" this book tells you how to achieve the life you desire. It is well written and easy to follow.  Kudos Kevin!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24LZATRRYHYBJ"
                },
                "Date": "on August 7, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZTYIEWP1V0HQ"
                },
                "Date": "on December 30, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Life changing. This is the best book on manifesting abundance I've ever read. Makes The Secret look like a kindergarten primer. Shortly after finishing this book, I manifested a grand prize trip to Florida and plan to build on that success. Thank you Kevin Michel!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JO855I1REASV"
                },
                "Date": "on November 3, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I'm not a scientist, but I've been reading about quantum physics for a couple of decades and Kevin Michel takes a very mind-boggling concept and translates it into multiple practical ways to make the time-tested laws of physical reality useful for the average person. It's clear he researched fields as diverse as physics and brain science but doesn't bore the reader by trying to sound like somebody with multiple PhDs. One does not have to be familiar with all the underlying science to see that the steps he promotes constitute a good strategic plan for reaching goals, even if one does not subscribe to the many worlds theory. However, since I subscribe to that theory, I was very happy to find a book I can share with friends and family to help provide them practical advice on how to achieve their dreams while also giving them an interesting lesson in one of my favorite topics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2H3JURQZOHVMB"
                },
                "Date": "on January 8, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "moving through parallel worlds to achieve your dreams; the epic guide to unlimited power by  kevin l. Michel touches upon using your subconscious mind to get in touch with the aspect of your spirit that can help you to connect to your inner world either via dreams or other ways  where the answers to what you want to accomplish are already there. The author’s message reminds me of the similar concept of quantum jumping by burt goldman. Anyhow,  there are some unique parallel world methods in this book such as stream of consciousness writing on page 103, guidelines for planting ideas in the subconscious (page 129), and viewing the world through the eyes of the person you will be upon arriving at your ideal parallel world (page 147), the subconscious and the next ideal frames (page 132), and the pathway to genius (page 133)."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3P0T87KEEWHR2"
                },
                "Date": "on September 2, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I like it very much. Really. I like this kind of scientific but simple approach. It is a great start, targeting our logical dimension, and in addition it is excellent connected and aimed toward different kind of understanding of our real world. The book is interesting, have different approach, and it is simple, clear and wise from beginning to the end. I enjoy reading it. Nice :)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1L6JVK8FY3DV"
                },
                "Date": "on November 26, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OXGYH818JM9C"
                },
                "Date": "on January 1, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36ZE01O21XWK4"
                },
                "Date": "on July 7, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWURUZW9HH87V"
                },
                "Date": "on April 22, 2015",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Some very thought provoking and advanced ideas in metaphysics. His writing style is very inviting and accessible. This book actually provided an ask and it is given moment, as I was growing tired of reading similar books that all seemed to say the same things only in a different way. Mr. Michel's book introduced a lot of new ideas using quantum physics, metaphysics, and quotes from other teachers. The book repeats itself a bit too much in the middle, and the \"Next Ideal Frame\" portion could be condensed and tightened up a bit, but if you like books regarding metaphysics and would like some new and advanced ideas to chew on, this is a great book! Thank you, Mr. Michel."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2P1G0YNH98VLY"
                },
                "Date": "on March 7, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I enjoyed the way the Author described our reality's relationship with other parallel universes. I didn't think that the explanations were detailed enough. I didn't see a lot of instruction in how to utilize the ideal worlds that exist. There were strong hints and off the cuff instructions, which kept me hungry for the main course. Kevin did a good job, and this is a fantastic introductory book to the Many Worlds Theory. I am still intellectually hungry though."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JQZ2995EMYQG"
                },
                "Date": "on November 13, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "At the beginning  the concept of moving through parallel worlds sounded to me more like a marketing gig to hook the candid reader, but as I read on I was gladly surprised by the depth of the author's knowledge of the quantum world and its physics. I enjoyed it and learned quite a bit from it, but that thing of IPW and NIF really put me down a little and hence I give it 4 stars."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13C5NP9JGEQGT"
                },
                "Date": "on December 13, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "If you've ever read \"Think and Grow RIch\" but felt that you were still missing something--then read this book.  As you do, you may hear an almost audible \"click\" in your mind at some point; that would be the unmistakable sound of an important truth being revealed."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AM5SQ0732W6JL"
                },
                "Date": "on March 28, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3T57E82NL3CGQ"
                },
                "Date": "on March 31, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Buying this book was a leap of faith for me.  Quantum physics was something I only vaguely understood, if you could call my knowledge of it understanding at all.  The author puts this in a way that anyone can understand and implement easily.  In the past manifesting small items has been easy.  It was getting to that next step that was overwhelming for me, and I suspect most other people.  The author creates a clear and concise road map to achieving success that any of us can follow if we put these principles into daily practice.  Well done, Kevin L. Michel, and thank you!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GI3TFYMQN6MY"
                },
                "Date": "on April 14, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Many physicists will challenge a number of statements made here, but physics, neurobiology, and psychology sit beside metaphysics and mysticism, and look like birds of a feather. The author offers quite a few tools for you to get there... So this is not mere theorising. I'd say, though, that even reading the theory here, most of which I have read before, lead me to an altered state. This book brings it all together very logically, to take you beyond mere logic."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XJHO5UTAA1YV"
                },
                "Date": "on March 27, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I have been reading and studying daily for the past eight years. This book resonates with me!  I have read Tolle, Abraham, The Course In Miracles and much more. Moving Through Parallel Worlds To Achieve Your Dreams ties everything together. If you are open to looking at life in a different way this is one of the must reads. It is fantastic!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3T8ADRY7AVCCN"
                },
                "Date": "on May 8, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AW9728SGLHR85"
                },
                "Date": "on January 9, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "The more I read about quantum mechanics, the more I recognize the similarities to psychology, religion, and other methods of self help I have discovered along my journey.  This book brought it all together for me in one concise and understandable place."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXX7WTQQP2ZN6"
                },
                "Date": "on February 21, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Important quantum facts presented in a very nice manner. Powerful self help reading. Especially liked the explanations of functioning of different parts of our brain as related to our subconscious."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2066WLWHU8QJ5"
                },
                "Date": "on April 22, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Very impressed with the clarity of this book. This book offers a. Clear road to self mastery through the subconscious mind stripped down into easy to understand allegories and verbiage."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIAHNIHMN5KM6"
                },
                "Date": "on March 16, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book was amazing and followed me through my life for a while helping me understand myself and the world it also helped finally complete some of my own theories"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGSL2YIY0OOH6"
                },
                "Date": "on October 2, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "What a great perspective the author presents. I would highly recommend this book. You will definitely get something out of it. :)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4MHCMG9Z9A1M"
                },
                "Date": "on October 4, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book was great I did not want to put it down dislike it ended. As any great book we look for the next one ,why bother ? This book is full of info and anyone looking for more is missing it's right here in these page of Kevin's Michel book .Great job brother thank you."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KPVY5QPOTODW"
                },
                "Date": "on September 13, 2014",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "Loved all the scientific backup presented in a way that I could actually understand!  I'm a logic nut, so facts neatly lined up to present the author's premise positively enchanted me!  And - there's a great step-by-step route to get where you want to go."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AB4GRAHE8VEG2"
                },
                "Date": "on February 7, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I enjoyed reading it immensely."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22KQ6553QX5UA"
                },
                "Date": "on October 30, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I enjoyed reading this work by Michel. In facts here are presented many theories that can be (should be) immediately turned into practice. This book will give you lots to think about.. quite literally."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AV7JV7SIKQ5T"
                },
                "Date": "on May 20, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is an unusual thought provoking book with some fascinating concepts. I enjoyed reading and learning more about the subconscious mind!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3U8HCOQ4JXLNR"
                },
                "Date": "on May 20, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35DHITYZE2RPT"
                },
                "Date": "on August 3, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Sending love and appreciation to Michael.  Read this book and use it.  Focus only on the positive.  It's fabulous."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1J6ILYD2P4YLQ"
                },
                "Date": "on May 17, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Even though the message is not brand new, the angle is new. I loved the way it was written. Easy to understand."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A260J3SURHH4YR"
                },
                "Date": "on April 29, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book truly resonated with me and caused some paradigm shifts in my consciousness. Highly recommend it!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TE5RSC7ZUUKD"
                },
                "Date": "on October 22, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is the most useful book I have ever read! I'm going to change my life for the better."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RYT8ILG1A0B6"
                },
                "Date": "on April 4, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book changed my life, and the first half is a great explanation of physics"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YGJ2JJT3ZOKU"
                },
                "Date": "on November 2, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Very interesting, thought provoking book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIIYLTP030WM3"
                },
                "Date": "on March 5, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "great concept with strong potential for more development"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AG6HF1BL9FUER"
                },
                "Date": "on April 30, 2015",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "Interesting topic, too repetitive"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BJ6TH083Y8AG"
                },
                "Date": "on October 12, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Thought provoking."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYHQC129C82O4"
                },
                "Date": "on September 11, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Great Book!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DXBL35XYEA68"
                },
                "Date": "on April 15, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "1"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3O7IAF5GT74LG"
                },
                "Date": "on December 28, 2014",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": "Very interesting."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFAW7DXBDN2BY"
                },
                "Date": "on February 26, 2015",
                "Helpfulness": 0.25,
                "StarRating": "1",
                "Text": "The epic guide....what nonsense. I skipped around as much in this book as the author does. If you can apply this book then you don't need it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A203Z3JH7BCV5D"
                },
                "Date": "on August 25, 2014",
                "Helpfulness": 0.4,
                "StarRating": "4",
                "Text": "Like it!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGBJGBYGJMMAK"
                },
                "Date": "on December 24, 2014",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": "wasn't at all what i expected."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AICZ0V6QAIAE"
                },
                "Date": "on August 2, 2014",
                "Helpfulness": 0.07692307692307693,
                "StarRating": "1",
                "Text": "This book tried to blow smoke up my ass and then tell me it was foggy out! Nuff said I'd have to say!!!"
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Moving-Through-Parallel-Worlds-Achieve/product-reviews/0615872034/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "50"
    },
    "Salesrank": "#142,678",
    "Timestamp": "2015-05-24 13:17:26.700269",
    "itemurl": "http://www.amazon.com/Moving-Through-Parallel-Worlds-Achieve/dp/0615872034"
}
