{
    "Category": "in Books (",
    "ListPrice": "$19.99",
    "Name": [
        "Physics I For Dummies"
    ],
    "OfferPrice": "$12.04",
    "Reviews": {
        "AverageStarRating": "4.2 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2W1WMDR1LYFSF"
                },
                "Date": "on July 7, 2011",
                "Helpfulness": 0.972972972972973,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1V0KFVFFPNO65"
                },
                "Date": "on October 2, 2011",
                "Helpfulness": 0.9324324324324325,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YZXGES3ONCYV"
                },
                "Date": "on October 9, 2011",
                "Helpfulness": 0.9375,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IY75VAPFJEFN"
                },
                "Date": "on June 20, 2013",
                "Helpfulness": 0.84,
                "StarRating": "1",
                "Text": "The scanned images of equations are so small as to be illegible. Zooming in simply reveals an unusable low-res image. Complained but received unsatisfactory email response (asked to provide 'examples' - can't they just look at their own Kindle book?). Was also advised to lodge complaint via Kindle App on Ipad which received no response at all. Ended up buying print edition from local bookshop. Not going to buy any more Kindle books that contain anything other than text. Have had similar problems with useless scans of maps etc. in travel guides."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EDVIIFH4Z7DM"
                },
                "Date": "on November 5, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I teach Physics and our school does not have a physics text book since we do most of the course work on line. I needed a simple way to fill in the gaps for what we were getting on line and what we were doing in the classroom. The Physics for Dummies series was a great resource. The exercises were practical and easy for the students to understand. I really like the relationship between the books and the workbook. This has been really useful for my students."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SL0WUT6OSAHM"
                },
                "Date": "on October 3, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Unlike others may be, I was not new to physics upon reading this text.  I needed review for a state certification test, and this book is wonderful going over the basics of Physics 1, in a way much more understandable than Physics textbooks are.  The chapters are arranged in a logical order.  The examples are a bit cheesy, but somehow make it more fun to read through and understand physics concepts in real life scenarios."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9P9M4JJ3GTT2"
                },
                "Date": "on March 10, 2014",
                "Helpfulness": 0.7777777777777778,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ALSH7ZYSVPK3"
                },
                "Date": "on April 6, 2013",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "5",
                "Text": "My daughter is on a pre-med track and has done well in all science courses in college but found she just couldn't understand the physics textbook.  I purchased this for her the second week of class and she immediately began using it, reading first her textbook and then the same subject matter in this \"dummies\" book.  She found that it helped her immensely with the understanding and she is now getting a B+ in the class!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1L4V02QOH6R78"
                },
                "Date": "on October 29, 2013",
                "Helpfulness": 0.7777777777777778,
                "StarRating": "2",
                "Text": "While the book definitely covers (and for the most part clearly explains) the basic topics, the Kindle version is seriously, seriously flawed. The images of the equations do not scale up when viewed (which isn't uncommon in Kindle books). They are, effectively, useless. The end result is that the reader is hampered by not being able to clearly see exactly what the author means. Unfortunately, it really ruins things. In addition, the formatting for the Kindle seems to have been an afterthought, with no consideration for screen resolution, etc. Things are just crammed into the screen. The problem is entirely the publisher's fault, not the author's. I'd stick with the print version."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IQQJPGZ2RDN7"
                },
                "Date": "on February 25, 2015",
                "Helpfulness": 1.0,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GCZT23AZDG0P"
                },
                "Date": "on February 3, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "I wanted this book to review my high school physics.  It is well organized and written and I understood it better than my class in school.  I wish I had had it in high school physics class."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JL04KGB5O7WY"
                },
                "Date": "on October 18, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "My university physics textbook is impossible to understand. The combination of the bad textbook and my professor's thick accent makes physics unenjoyable. I still don't care for physics...but this book has made everything MUCH simpler. One paragraph in this book sums up an entire chapter in mine. The author (Steven Holzner) has a quirky sense of humor,too, which makes me smile every once in awhile. It's mostly trig based...this book won't cover everything for a calc-based physics class."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1W27574F1A04Z"
                },
                "Date": "on September 14, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "It's been quite a few years since I've taken a Physics class, and this was a great way to brush back up.  Very easy to understanding.  I love the humor.  The content is clear and thorough.  I also have Calculus for Dummies.  I wouldn't have been able to re-learn either subject without these books.  I also think they are a great supplement to a college text book for struggling students."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A339NU1P1IUU03"
                },
                "Date": "on August 21, 2011",
                "Helpfulness": 0.8,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21CWYTT3W76NF"
                },
                "Date": "on November 17, 2012",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "i tried using this for my physics class, but i just did not find it helpful enough to stick to it. Though some of it was helpful and to the point. One guy in my class recommended it, because it was working for him, so it works for some."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QMCV4T8INURQ"
                },
                "Date": "on July 6, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I used this to help prepare for a Physics class I was going to take. It laid the groundwork for me and gave me a good head start on the concepts covered in the class. Also useful as a reference to go back to during the class."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IDWXGTDJMTPZ"
                },
                "Date": "on May 7, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I recommend this book to anyone who is struggling in a physics class. My teacher wasn't much help so I bought this book; explains things better than my required text for physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWUSP841T6OQU"
                },
                "Date": "on January 19, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Very good start!  Never felt comfortable enough taking a class but still wanted to know about it.  Still working on it but maybe I will take a class."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUQ200WREEJ0M"
                },
                "Date": "on January 16, 2014",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AB84IAXZAUDRC"
                },
                "Date": "on September 29, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GLYV1U7ZSWO4"
                },
                "Date": "on September 25, 2013",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "Good overall book that covers the basics. I'd rather it had more examples to better show the formulas and how they work out. I think the practice problem book should come with it. I don't know if it is truly a good companion or not, but I'm sure it cant hurt. Overall good reference book for the basics of Physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OPJKC8BNS96L"
                },
                "Date": "on October 28, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Bought for my son who is a senior in college. He has used Physics I for Dummies extensively. While the teacher does a pretty good job in lecture, my son finds the style of the Dummies book much easier to understand difficult concepts. This book works especially well with the workbook."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1H9NI4ELHO03K"
                },
                "Date": "on November 25, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "My niece was struggling with her high school physics class.  This book helped support different concepts reviewed in class.  I think the book would also be appropriate for a beginning college level class."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18OKRSXRY35R5"
                },
                "Date": "on September 26, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I love the \"For Dummies\" series for math and science.  I made a B in my college calculus course with the help of these books and the Physics I for Dummies is greatly benefiting me in my physics class!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APMAFFCUJBI21"
                },
                "Date": "on May 31, 2013",
                "Helpfulness": 0.75,
                "StarRating": "4",
                "Text": "Got this to prepare me for college physics since I didn't take it in high school and it is very understandable and a nice introduction to help put me ahead when I start the class."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AK6U8HSWJWZI4"
                },
                "Date": "on September 8, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Extremely helpful for an emerging physicist!  As a teacher I needed some inspiration into further simplifying the content to my special Ed students and this helped greatly."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20F9DHCZD0AXW"
                },
                "Date": "on December 17, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Very helpful book.  My basic physics textbook is no help at all.  This helped me more than I can imagine."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYISL95F0K2LJ"
                },
                "Date": "on May 13, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I will be taking a course in college this fall semester called Physics 100 (not 101) \"Introductory Physics\". I cannot decide if I should order just the plain, regular \"Physics for Dummies\" or the other book called \"Physics I for Dummies\". Is there really much of a difference? Can anyone reading this post who is familiar with the subject of Physics as well as these two books make a recommendation along with why your recommendation is what it is? Please help!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ESNORNPJBZTD"
                },
                "Date": "on July 21, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Excellent book for students preparing to enter a Physics I class"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15H254UFUNLLX"
                },
                "Date": "on April 30, 2015",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "I would have preferred more examples. I know that's in another book, but they could have provided more for study material. If you believe this book will help you pass Physics you are wrong. The only thing this book is good for is quick reference to concepts and equations that will be imposed upon you in class. I would suggest another book that provides conceptual knowledge as well as applied experience within its pages."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30QPTL862P5O8"
                },
                "Date": "on May 1, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "The book arrived in a good fashion and condition. However, I should have previewed the book before buying. I might be a little bias, but the book covers basic physics (over a broad spectrum). I would recommend it for high school students who are taking their first physics class. For college students, there are other resources that they can invest instead."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24MO8VMNHKFRX"
                },
                "Date": "on July 2, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Great for students and non students to learn. River wanted to know the pull of gravity between earth and sun it is here"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28FEGE6J5MN7J"
                },
                "Date": "on June 22, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "If you are struggling with your physics class buy this book! It makes complicated things very easy to understand and apply."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NP1B2ITW3J3C"
                },
                "Date": "on February 3, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16D4QM60L8OLE"
                },
                "Date": "on December 2, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Basic physics.  Simple explanation of basic concepts.  This gave me an excellent understanding of thermodynamics and basic structural engineering.  Good information."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BDEWRDDSHXOW"
                },
                "Date": "on May 20, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "My 13 year old asked for a book about Physics.  Because that subject covers so many areas, I thought it would be best to get a book that explained this, and then included some information about each of the primary areas.  This looked like the best choice.  He is about half-way through, and loves the book, and the author's style of writing."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LA0ZY61GG2EN"
                },
                "Date": "on October 17, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I am part of a support system for special ed students with learning disabilities in a public high school. As such, I supplement what they learn in the classroom by attending the classes with them. I have to learn and retain the info in order to reinforce their learning. The book helped immensely, by acting as my tutorial."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXJLCA3SZDA68"
                },
                "Date": "on March 5, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I had a terrible physics professor for general physics in college. This book really helped me understand the basics. Once you get past the basics and into more complex problems, you may need to find something else to supplement this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3F2D1GVRWIF74"
                },
                "Date": "on April 22, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "While this is one on the Dummy Series books, the subject matter is still physics.  The concepts and math are still intense.  All in all, you can get a lot from this book if you truly have real interest in doing so."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3T7ND3SWG24RP"
                },
                "Date": "on December 2, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I found this book very helpful in explaining what I needed to learn in an informative and easy to understand format. I would recommend this for anyone whom needs to understand the basics"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13FBPNGRJXECS"
                },
                "Date": "on October 4, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Well written, easy to follow! I used this to tutor, and it was perfect for my needs! Definitely suggest for anyone wanting to learn or struggling with Physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZPGMUVVZQMP1"
                },
                "Date": "on March 31, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "not finished yet but well and easy to read with great references, this was my weakness and am challenging with great enthusiasm and focus."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SLPWNVXLZDAV"
                },
                "Date": "on December 18, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Love this book -- very helpful for a \"dummy\" like me who is simply looking for an introduction to the world of physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQGXG2BIQFY9"
                },
                "Date": "on March 3, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Easy to read and understand, and even more important, easy to absorb/retain. This user recommends this book for your PhD work."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOP11TWT3NCTS"
                },
                "Date": "on April 29, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great way to review advanced high school or college physics! Gives both the concepts and some of the (algebra and trig) math."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KHKH01L4YK5K"
                },
                "Date": "on March 24, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "These books are really helpful for college level students who may need to get up to speed on some of the subjects."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZKQCD68LI6X7"
                },
                "Date": "on January 11, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Functions as a great outline.  Real easy to read.  Would recommend to those who want to learn more about physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IW82JT5EZ4DR"
                },
                "Date": "on April 15, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "It totally helped me I'm my Intergrated Science class, and very well written. Most of all understandable."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANAER1NR62M9U"
                },
                "Date": "on November 17, 2013",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PUF2TS7KC0UW"
                },
                "Date": "on January 21, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book is very helpful in the study of physics. I've enjoyed reading it and having it in my library."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Y7SA6CJAOE6H"
                },
                "Date": "on May 6, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "8th grader loved it. Made it interesting , and wanted to actually learn more \"not for dummies\""
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18HQJT4YHWB91"
                },
                "Date": "on September 8, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Easier to understand than the textbook, but still doesn't answer all of my questions about Physics"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Z16DVNV0NE0A"
                },
                "Date": "on November 8, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I'll see how I like it at the end of the semester when I pass my Physics class!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3R1TBISOXX94T"
                },
                "Date": "on December 24, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "It help me in my class in college toget a general idea of some topics,"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGSKYNY292FC2"
                },
                "Date": "on March 29, 2015",
                "Helpfulness": 0.5,
                "StarRating": "2",
                "Text": "I am having trouble in a college physics class that uses the book Modern Physics and the master physics website. I got this as a study aid. I did not intend for it to replace the textbook only supplement it. The book did not contain the formulas that I need. That is why I am only giving it 2 stars."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3L7N7WSNFXZSS"
                },
                "Date": "on July 18, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Easy to understand and go through the problems"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A54PRTZV1WXUT"
                },
                "Date": "on December 20, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent Seller.  Highly recommended.  A+++"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13L45CSY7TEQZ"
                },
                "Date": "on July 3, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "needs more variety of problems. dry humor."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFWT6SN4IP560"
                },
                "Date": "on May 16, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Easy to understand for a dummy like me :)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35C22PJ7FVTT3"
                },
                "Date": "on April 5, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "No surprises. Delivered as promised."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1T35JDRYBQEV3"
                },
                "Date": "on June 28, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Well written and very helpful"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OA017772CA1U"
                },
                "Date": "on January 10, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Just what I wanted!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EA6RHQPGDGVM"
                },
                "Date": "on December 4, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "as advertised."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AL5W6FYQIK6SF"
                },
                "Date": "on December 1, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "great review"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JON8UVO3BKWK"
                },
                "Date": "on January 1, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great price!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RDFAMZ81ACAE"
                },
                "Date": "on January 7, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent !"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1S5YVC95QGTHY"
                },
                "Date": "on January 18, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "thank you"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13Z2XMGRPYTYC"
                },
                "Date": "on January 14, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "good book"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8ZVEK5OZ6PNX"
                },
                "Date": "on November 12, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Thank you"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADRA3QWBVT0ZT"
                },
                "Date": "on January 3, 2013",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "Bought this for my teenage relative struggling with physics.  She said it helped alittle bit but not as much as I would have thought. Probably would not buy another one again."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AP7FL9ZIFPUF"
                },
                "Date": "on May 16, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Dummies books are awesome.  They take the most convoluted subjects and simplfy them to easily understood reading.  I am addicted to Dummies books for all subjects"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AZMJ05PA7BAQ"
                },
                "Date": "on March 5, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "good"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26HLLY43QPGA4"
                },
                "Date": "on May 13, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Dummy books are always useful. I have used them and now my kids use them in college. Great product as always!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A237TO6B746TDE"
                },
                "Date": "on February 3, 2015",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "This is a good book if you are dumb and trying to learn physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8A5BGA2XEZCN"
                },
                "Date": "on November 30, 2012",
                "Helpfulness": 0.25,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AE0Q1LMZXGIGY"
                },
                "Date": "on July 1, 2014",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AM6LHYT1H8V7P"
                },
                "Date": "on November 20, 2013",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": "Did not help with general physics homework. Very disappointed, I wish I did not purchase this. It wasn't expensive but it's that's money I could've saved. :("
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KX5KAMNENCY8"
                },
                "Date": "on June 19, 2012",
                "Helpfulness": 0.1,
                "StarRating": "1",
                "Text": "I ordered this book with high hopes that it was the answer to get my daughter through college physics, with which she was struggling, having no prior knowledge of the subject. The course is over, and she did not find a single helpful explanation in the book. She is ordinarily a straight A student, so I have to trust that she would have found help in the book, if it was there. She had more luck looking on Google for explanations to formulas and equations. Sorry I wasted the money. Anybody want an almost new book?"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OSP4DTWPH5LD"
                },
                "Date": "on July 29, 2013",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "I don't like physics. It is boring. I have to take it for my major and I really don't want to."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Physics-I-Dummies-Steven-Holzner/product-reviews/0470903244/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "79"
    },
    "Salesrank": "#7,179",
    "Timestamp": "2015-05-24 12:23:11.290860",
    "itemurl": "http://www.amazon.com/Physics-I-Dummies-Steven-Holzner/dp/0470903244"
}
