{
    "Category": "in Books (",
    "ListPrice": "$177.00",
    "Name": [
        "Physics: PrinciplePhysics: Principles with Applications Volume I (Chapters 1-15) (7th Edition)"
    ],
    "OfferPrice": "$139.74",
    "Reviews": {
        "AverageStarRating": "4.3 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22JT2MOREWHSX"
                },
                "Date": "on July 3, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I don't normally write reviews for books, but I really loved this book! My Physics professor wasn't great, so I basically had to teach myself everything. That would have been difficult if this book hadn't been as helpful. There are a lot of great examples throughout the chapters and there's a ton of helpful questions and problems at the end of each chapter. The coolest thing (for students at least) is you can find the solutions to the questions online for free! Although I strongly recommend working through them yourself first, of course! Although I have no background in physics (and completely suck at everything math), I successfully finished the physics course with an excellent grade thanks to this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5QHG17214JWG"
                },
                "Date": "on October 26, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I love this because I was able to get it much cheaper here than at the school bookstore. Thanks"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AED122LYCFITF"
                },
                "Date": "on September 27, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Book was in good shape and 4 chapters in... I am finding it very useful and helpful."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATN53OIWQSQYB"
                },
                "Date": "on February 23, 2015",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "Nice book however, it doesn't explain how to get the answers in the answer key."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19W1KZF5BOTY5"
                },
                "Date": "on April 12, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Helps walk through problems.  A great tool to study with"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UKO4JYN1LEHO"
                },
                "Date": "on February 15, 2015",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": "This book had a decent text. Not great. The examples used in the book are some of the most ludicrous examples of physics ever. Like the \"Superman needs to stop a 120km/h train before it hits a car stalled on the tracks.\" Well, first, Superman doesnt exist, but why would he stop the train and interrupt commerce if he could much more easily push the car off the tracks? Or figuring out how much a box weighs by pushing it up against a wall and using the friction coefficient and trigonometric components to solve instead of being a non retard and putting it on a scale? And how many bathroom scales do you find A: in an epevator, and B: give readings in Newtons? I can't help but lose interest in the material when its that ridiculous. The text seems to be more aimed at teaching you how to do homework than actually teaching about the physics. The not so practical application of physics in this book demonstrates the origin of the college - educated idiot. You can solve homework problems, but can't apply it to real life. It gives a start to understanding physics in theory, but it's a misguided understanding because most of it isn't based in reality, where physics lies. I'm an engineering major, and this book has taught me many equations that I can't use."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A271AP7H2FNQYH"
                },
                "Date": "on April 12, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "great"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHZMRJOUV8EPA"
                },
                "Date": "on April 9, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Physics-PrinciplePhysics-Principles-Applications-Chapters/product-reviews/0321762428/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "8"
    },
    "Salesrank": "#65,848",
    "Timestamp": "2015-05-24 12:39:01.004781",
    "itemurl": "http://www.amazon.com/Physics-PrinciplePhysics-Principles-Applications-Chapters/dp/0321762428"
}
