{
    "Category": "in Books (",
    "ListPrice": "$35.00",
    "Name": [
        "Sneaking a Look at God's Cards: Unraveling the Mysteries of Quantum Mechanics"
    ],
    "OfferPrice": "$24.88",
    "Reviews": {
        "AverageStarRating": "4.6 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18ER7C0OVPHOG"
                },
                "Date": "on August 19, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is a very comprehensive introduction to the foundations of quantum mechanics for the sophisticated lay person who is willing to think and work through the examples and explanations.If you do the work you will really learn something--as opposed to popularizations that only give you the feeling of understanding--usually an illusion. No math background is assumed but the less math exposure you have the harder you have to work. I have read numerous popularizations--this is one of the very best. In particular it clearly and evenhandedly addresses the alternative interpretations of the quantum formalism pointing out the various myths and popular misconceptions that one can find in both popular and technical literature, the mistakes of Popper and Pais among them. The historical progression from the first versions of the Copenhagen Interpretations up through von Neumann's theorem, and Einstein's challenges(for once Einstein is treated fairly--not as an old geezer who was stuck in the past) through Bohm's 'hidden variables' approach, to Bell's analysis of nonlocality is especially good. It is often hard to keep straight the various logical twists and turns of the competing interpretations but Ghirardi continually recaps the arguments and clarifies the the different points of view. This book is in the league with Albert's and Gibbin's introductions to the philosophy of quantum mechanics.It is often useful to have more than one such book so that when you get stuck in one maybe the other has a clearer explanation. Also you could use this book in conjunction with Prof. Leonard Susskind\"s quantum mechanics for the rest of us video lectures (9) on Stanford University itunes (FREE)."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on April 24, 2004",
                "Helpfulness": 0.9230769230769231,
                "StarRating": "5",
                "Text": "This is the best book I've seen on quantum mechanics. It's probably too hard to follow without some scientific experience on the part of the reader. But it is the only book I know of (and I'm aware of most) that really covers the conceptual issues of the entire subject in an open-minded non-romantic, non-mystical and realistic way. Very refreshing. A gem."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PBP7UYPRC1KD"
                },
                "Date": "on December 7, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1J1IU1LTAMFQL"
                },
                "Date": "on November 16, 2009",
                "Helpfulness": 0.9285714285714286,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A390QJIODG8XT0"
                },
                "Date": "on June 18, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "GianCarlo Ghirardi has produced the perfect introduction to the quantum theory: it focusses on the essential issues of physics and gives as well a clear and complete account of the historical development of the theory and debates among the great physicists. Both specialists and non-specialists will learn a lot from this book. It is the best conceptual introduction to the theory on the market. In addition to the more familiar topics, there is discussion of quantum computation and quantum information theory. I recommend this book in the highest terms to anyone interested in really understanding the issues surrounding quantum mechanics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LLIB93WWI4MK"
                },
                "Date": "on December 30, 2010",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QWCRVV9VNLOK"
                },
                "Date": "on September 18, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3WPSK2F76UO3"
                },
                "Date": "on January 7, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "If you want a serious book on conceptual problems behind quantum mechanics theory that does not use mathematics to fool the readers about the physical and philosophical troubles bounded to this discipline, this is your book. A convincing confirmation of the reason why one of the best physicist such as Dr. Feynman thought that no one has never understood completely quantum mechanics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QBJFAUAL174I"
                },
                "Date": "on April 20, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Professor Ghirardi (University of Trieste & ICTP) wrote an excellent introduction to quantum mechanics (QM) and its modern interpretation starting from the work of the founding fathers (Heisenberg, Schroedinger, Dirac, Pauli, Born, Wigner, Bohr, etc.). The Copenhagen interpretation was challenged  by Einstein in the famous paper coauthored with Podolski and Rosen (EPR) in 1935. For several years few people paid attention to the deep implications of EPR but in the early 1960s Bell proved through his famous theorem that QM is non-local. This stimulated new research activities on the foundation of QM and in 1986 Ghirardi together with Rimini and Weber proposed their GRW theory concerned with the collapse of the wavefunction (WF). Thus when QM is applied to a macroscopic object, the collapse of the WF removes the superposition of states thereby eliminating the embarrassing prediction of standard QM that such an object should be \"here and there\". QM is still incomplete a theory and many developments are expected to be seen in the present century. A book that nicely complements Ghirardi's book is Zeilinger's book Dance of the Photons: From Einstein to Quantum Teleportation (2010)."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PZ3T8RUK7AN1"
                },
                "Date": "on October 6, 2014",
                "Helpfulness": 0.4,
                "StarRating": "2",
                "Text": "There are a few errors in the book that the editor should have picked up. In the Appendix 2A on pages 41-41 the text has the sine and cosine switched. Page 41, line 7 should read in parentheses: (that is AB/OB and OA/OB) referring to the Figure 2A.1. The error is repeated in the text under the figure. Segment AB is opposite the angle theta, segment OA is adjacent to the angle. The sine of the angle is the ratio AB/OB not OA/OB, and the cosine of the angle is OA/OB not AB/OB. This appendix begins with the authors desire to \"complete the review of essentials for readers who may have forgotten some of their mathematical training, by recalling the simple definition of the trigonometric functions sine and cosine...\" Doesn't inspire confidence in the rest of the book which is laborious to read with prolonged arguments that I found very difficult to follow. Wikipedia's discussion of Bell's theorem was more lucid and understandable. Another error is on page 432 (yes I read the entire tome, including all end notes). On line 12 the thickness of the myelin sheath of the human nerve cell is stated as \"precisely of the order of 10 to the 5th power in cm\" Of course since the range of thickness is .5 to 2.5 microns (or .00005 to .00025 cm) the text should have placed a minus sign before the fifth power. The author is obviously very brilliant, perhaps absent minded, but certainly not a very good writer in my opinion. Of the 20+ books I have read on Quantum Mechanics, this one is near the bottom."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Sneaking-Look-Gods-Cards-Unraveling/product-reviews/069113037X/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "10"
    },
    "Salesrank": "#554,059",
    "Timestamp": "2015-05-24 13:48:20.066115",
    "itemurl": "http://www.amazon.com/Sneaking-Look-Gods-Cards-Unraveling/dp/069113037X"
}
