{
    "Category": "in Books (",
    "ListPrice": "",
    "Name": [
        "Hidden In Plain Sight: The fundamental link between relativity and quantum mechanics"
    ],
    "OfferPrice": "$9.99",
    "Reviews": {
        "AverageStarRating": "4.1 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24ZUBHSQVYB7T"
                },
                "Date": "on December 31, 2012",
                "Helpfulness": 0.9454545454545454,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CRSVDV27EUW5"
                },
                "Date": "on October 9, 2012",
                "Helpfulness": 0.9193548387096774,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2X3BDMIZJ2BAW"
                },
                "Date": "on September 4, 2012",
                "Helpfulness": 0.9574468085106383,
                "StarRating": "5",
                "Text": "I came across this book on the author's website, where he covers a lot of interesting topics (some of which are included in the book). I assumed this book was a popularisation of standard physics theory (and the author does cover a lot of standard sub-atomic theory in a very concise and clear way), but this book goes beyond that to cover the author's own ideas and theories. This is quite thought provoking, although I would caution that not all of it is universally supported in the academic cummunity. In particular, his thoughts about the links between gravity and quantum theory are interesting, but not proven."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVXY75LRGX34N"
                },
                "Date": "on March 29, 2013",
                "Helpfulness": 0.95,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JOVOR1RY8AEH"
                },
                "Date": "on July 26, 2012",
                "Helpfulness": 0.8620689655172413,
                "StarRating": "4",
                "Text": "I really enjoyed reading this book.  The author is very convincing about the fundamental principles of the universe and physics.  I had trouble following some of his explanations, which may simply reflect on my ability to understand the material rather than on the author's ability to explain it.  I also think that the author repeats some concepts too much in order to ensure the reader is following along...the opposite of the aforementioned problem. Overall, this is an excellent, important book that will change the way you understand and see the universe.  It is a very fast read that anyone with average intelligence and an open mind can comprehend, which is not to say that it is \"dumbed down\"; the author simply leaves out math and technical jargon that would detract from the point of the book.  I highly recommend this book to anyone interested in learning more about the universe in which we live.  And at $.99 for the electronic version...you can't go wrong!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3H3H2VRLT34XF"
                },
                "Date": "on December 17, 2013",
                "Helpfulness": 0.8387096774193549,
                "StarRating": "1",
                "Text": "I wanted to give it 2 stars (as it is entertaining) but the level of misinformation and self contradiction was simply too high. He talks about stationary objects moving through the dimension of time at the speed light in one chapter and in another says that nothing moves through time in an ever present block universe (which he insists is the only possibility).  He totally misses the point with the double slit experiment (the mystery is that  if EVERYTHING is a wave then how does that first particle exist to collapse the others).  He claims that on a macroscopic scale 'real' particles exist and act as observers.  He misunderstands the problem - that every particle is a probability waveform before being collapsed to a particle - so where does the first particle come from in the first place (the observer created particle)?  There are plenty of other misconstrued notions and logically unsound assumptions making the book dangerous - it seems sensible on the surface which will simply confuse lay readers."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WSLCHWZFM5SJ"
                },
                "Date": "on August 16, 2013",
                "Helpfulness": 0.8157894736842105,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MMZHSY4Q41TP"
                },
                "Date": "on November 21, 2013",
                "Helpfulness": 1.0,
                "StarRating": "2",
                "Text": "Interesting ideas, but not convincing.  I give Thomas credit for presenting his thoughts on how to unify quantum mechanics and relativity theories, but the book is full of self-contradictions.  Certainly his basic premise has merit and may serve physicists in this endeavor.  This is an easy read, perhaps too easy.  He takes well-known ideas and works backwards to reach a foregone conclusion."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJQD0XPLH5YQ9"
                },
                "Date": "on December 27, 2012",
                "Helpfulness": 0.8235294117647058,
                "StarRating": "2",
                "Text": "A non-mathematical and highly simplified approach to a very complex subject. High degree of redundancy. Seemed like it had yet to see an editor."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A330H8AH95MW7Y"
                },
                "Date": "on December 31, 2014",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2D41OTKIYNG5X"
                },
                "Date": "on November 16, 2013",
                "Helpfulness": 1.0,
                "StarRating": "2",
                "Text": "Andrew Thomas's Hidden in Plain Sight contains some interesting speculation on a \"simple\" view of unifying principals for quantum and relativistic physics.  Thomas, though he seems unable to present his ideas with the rigor of a real physicist, does touch on some interesting ideas regarding gravitation and General Relativity which remind us of the recently explored links between gravitation and information theory.  His presentation, however, is a mostly philosophical approach having neither the scientific or mathematical background required to coherently present or rigorously defend his theses.  Perhaps he intentionally simplifies the presentation to make the ideas more accessible to the reading public.  And of course he is maintaining that the heart of his theories is, in fact simple.  This is a good example of the type of books that we will continue to see in a world where there are not well established editorial review processes before publication of science books.  Anyone with any kind of cockamamie idea can get published.  And Andrew, who is surely not a total lightweight, and who offers some thought provoking ideas, also does not have a book here worthy of serious consideration."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VCMCJWVN6FR5"
                },
                "Date": "on April 26, 2014",
                "Helpfulness": 0.875,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3M6DCC9KXKDEH"
                },
                "Date": "on October 5, 2013",
                "Helpfulness": 0.875,
                "StarRating": "2",
                "Text": "Incoherent. As I reads it I kept making notes on my kindle. He takes \"facts\" way out of context. Doesn't seem to understand the math. and ridicules other authors. I'm so frustrated by this book that I admit I couldn't finish it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HCSOFLWL2HUZ"
                },
                "Date": "on November 15, 2012",
                "Helpfulness": 0.7428571428571429,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10111TZWX5YLH"
                },
                "Date": "on July 11, 2014",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AO6KKKYHY6ZTW"
                },
                "Date": "on October 8, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is a great book for the science buff, like myself.  The author uses clear, simple language used to describe some of the most arcane concepts emerging from theoretical physics.  Using the priinciple of Occam's Razor ... that the simplest explanation is almost always the right one ... he proposes a means of unifying the two theoretical systems that seem to work best, today.  I hope he's right.  But even if he's not, the descriptions he gives of the most important concepts in physics today are so clear, and so understandable, that this book deserves a place on your bookshelf, as it has on mine."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IMH5FOSTIF2Z"
                },
                "Date": "on March 11, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I cannot praise this book enough. Between this read and Dr. Thomas' web site, I finally understand much more regarding relativity and its connection with quantum physics than ever before. It is well written with very good analogies. Much food for thought. Dr. Thomas may be the closest to tying relativity to quantum physics at this time and anyone who reads this book would have to give its contents serious consideration when approaching the concept of quantum gravity. Thanks so much Dr. Thomas."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZU5UM8ZI8LQG"
                },
                "Date": "on January 25, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GZXF55A1FR39"
                },
                "Date": "on December 4, 2012",
                "Helpfulness": 0.75,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ER32CA64D96P"
                },
                "Date": "on November 3, 2014",
                "Helpfulness": 1.0,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALY4FE7RUR2BW"
                },
                "Date": "on October 21, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EU44JTS2O50O"
                },
                "Date": "on March 13, 2015",
                "Helpfulness": 0.8,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2H5ZIKWE7DP4X"
                },
                "Date": "on November 7, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2L17AIDRXD0FV"
                },
                "Date": "on May 14, 2014",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KKI4WPIYHLK7"
                },
                "Date": "on May 16, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "By chance I stumbled across this book while perusing the kindle lending library. A few weeks later I returned the book and bought a copy. This book is a deceptively easy read with deceptively simple ideas. I could rate this book based on a list of pros and cons or  likes and dislikes but decided against that. After a second reading (with a few weeks in-between reads), I give this book five stars even though there is a certain amount of repetitiveness which irritates me. My rating is based solely on the amount of time the ideas introduced within this book have occupied my thinking since I started reading it; not on whether I agree or disagree with any of them. Those ideas and their implications are taking a long time to digest. Rarely have I read such a simple book that has affected my thinking for so long afterwards."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JMUIUUKKU2GW"
                },
                "Date": "on May 10, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I really liked this book and I highly recommend it.  The author explains basic quantum mechanics very well and he deals with complicated concepts a very simple way.  I don't necessarily agree with everything he says, but as another reviewer pointed out, he is onto something and this books makes you think.  It is well written and I enjoyed reading it.  I also liked The Trouble with Physics by Lee Smolin, Three Roads to Quantum Gravity by Lee Smolin, The Elegant Universe by Brian Greene, The Fabric of the Cosmos by Brian Greene"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AL4N9Y2JWXAU7"
                },
                "Date": "on January 5, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AN89MYMWS3FI8"
                },
                "Date": "on September 9, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20P6OCNSQIMU8"
                },
                "Date": "on December 2, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "The existence of this book demonstrates that there should NOT be something strange about quantum physics and relativity that puts it intellectually out of reach of the lay person.  If you love the 'Big Bang Theory' TV show, you will appreciate this book.  This was a good, quick read and I feel that the author provided great examples that a reader could easily wrap their mind around w.r.t. relativity and quantum theory.  The focus of this thesis is very tight and compelling philosophically.  If you are looking for equations to back up the words or a methodically mathematical proof- if you 'see' the world  more easily through math symbols- this might not be for you.  For me, this work though short, triggered many interesting thoughts about the way we choose (and sometimes the 'why' we choose) to view the fabric of the universe.  The author does a great job of pulling on your heart strings if you follow popularized modern physics in the media (specifically 'unification' concepts and 'theories of everything') and have aligned yourself (if only in spirit) with either the 'loop quantum gravity' or 'string theory' camps.  I did read this on the Kindle iPad app and the one comparison table was difficult to read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2R671KTXS611S"
                },
                "Date": "on November 4, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This, and the subsequent two books in the series, are without doubt the best written, most original, and delightful books in the area of physics for the lay reader that have been published in decades. The remarkable thing about them is that while one may be occasionally challenged by the concepts initially, the author always provides clear, simple, and completely understandable explanations so that even the most complex theories are intellectually accessible. Such was the genius of Richard Feynman, and so also is the genius of Andrew Thomas. Virtually all of the major theories, problems and controversies current today in the area of quantum mechanics and relativity are addressed and most remarkably of all a much sought after link, a plausible unification of sorts, between them is given. Starting with the obvious truth that there is \"...nothing outside the universe\", the author is able to construct a systematic explanation of the major concepts behind modern physics in such a way that reader is both informed and delighted."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AF1DJYJK5B2IR"
                },
                "Date": "on June 27, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I am a professional engineer, not a physicist or mathematician, and have taken a close interest in Theories of Everthing, Relativity and Quantum mechanics. I have struggled with Superstring Theory (Green, Schwarz & Witten and so far only one profound thought has come into my mind. First it is assumed by physicists that somehow The Universe consists of space containing many differing types of particle. We appear to be stuck with the idea of 'particles' and have been ever since J J Thompson and Ernest Rutherford which have been described, subdivided and subdivided again so that now the question gets asked (for example) 'what is a string made of?' Now for the profound thought. The unifying idea is that all of what we describe as fundamental particles are simplely strange chunks of space! The Universe is just made of space and a very odd and yet to be described sort of space. There are no particles; they have only served to confuse matters and removing them would be the ultimate cut of Occam's Razor to set physics in a new direction!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2A092HMX4OW1Y"
                },
                "Date": "on December 27, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UZY9E0E2FKNW"
                },
                "Date": "on February 20, 2013",
                "Helpfulness": 0.7272727272727273,
                "StarRating": "2",
                "Text": "Well it was written well but it seemed like the book was accusing the world of being ignorant to simplicity. I do not feel that it explains any form of unification between the two vital and fundamental theories."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VDATGCAS1ACS"
                },
                "Date": "on April 4, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOH773UPOB64T"
                },
                "Date": "on June 25, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "This book takes some very reasonable and fundamental assumptions, primarily that there is no absolute coordinate system outside of the universe (I.e. the universe is everything) and shows that both general relativity and quantum mechanics follow as necessary consequences.  The arguments are quite convincing but at times it reads like the author is trying to stretch his message to book length.  A bit repetitive after a while."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QHCIWBXPGQUV"
                },
                "Date": "on September 10, 2012",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "I came to know of the book through the authors blog \"whatisreality\". I was amazed at how so many of the complex ideas of contemporary physics were made so simple to understand. There is a vivid clarity in his writing which only happens when you understand the nuts and bolts of your subject. I am a fan of authors like Brian Greene or lee smolin who take up extremely complex ideas and make them understandable to non-physicists like me. Andrew is in the same league."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKY9RPPIHNQGC"
                },
                "Date": "on July 10, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HKFPL8YOWXXQ"
                },
                "Date": "on June 15, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I like to read books about relativity and quantum mechanics, but what I found in this book is different from everything I've seen. It gives you a broather view of how everything works. There are some different points of view, from the block universe to the decoherence. It is worth to be read, I really liked it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3M0C793O6SMVN"
                },
                "Date": "on June 8, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AG64O75VUXUY"
                },
                "Date": "on September 27, 2013",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "Thomas proposes an amazingly simple approach and builds the case of how powerful it could be to explain the way Nature works. Maybe this will become a new avenue of research for theoretical physics, but for now I am left with the feeling of light reading."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2S2ZVO3UPGBPP"
                },
                "Date": "on August 18, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Brilliant! Incredible how much can be explained when you discover a fundamental principle. The principle, so consistent and clear, that in no way can be undermined. I recommend to all interested in the nature of reality:)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A222LXSVBWKUBB"
                },
                "Date": "on July 28, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is the most accessible for the non-mathmatically minded reader I have ever read concerning the nature of theUniverse.  Dr Andrews begins with some simple, self evident postulates about  this place we find ourselves in,,  and Euclid-like, builds up to the conclusion that it couldn't be any other way.  The book is clear, original, and a delight to read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25P8RL44UXZWR"
                },
                "Date": "on July 27, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This was a good read. It was simple and easy to understand. He made Quantum physics easier to understand for me."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BLB9P59T0VBZ"
                },
                "Date": "on June 15, 2013",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BDAJR87PRCO2"
                },
                "Date": "on May 16, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JPU7W563REMB"
                },
                "Date": "on May 13, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "The most complex problems in physics are clearly explain,(space, time , relativity) and was remains in awe at the very simplicity of the principle that all is relative"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A313SD544IGVXP"
                },
                "Date": "on May 6, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Intelligent and elegant thesis, postulating the relating of two streams of physics. Worthy of a read as an understandable explanation of perceived complex subject matter."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GYTVSAOUENSS"
                },
                "Date": "on May 2, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Interesting concept.  How it catches on by authors peers will determine it's validity.  I look forward to the follow-on book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ESTL03WIAPDS"
                },
                "Date": "on April 25, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Thomas manages to articulate his case well. He supports his views on complex concepts and theories using plain, unforced logic. This combined with his down-to-earth use of language is refreshing and makes this a great read for anyone, even physics enthusiasts like me!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GLFZTHSPSRFE"
                },
                "Date": "on April 22, 2013",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "The postulates are explained through pure logic, but there are no demonstrations, nor physical evidence for some of the claims this book makes.  It's entertaining, and the subject is easy to follow if you have no mathematical training.  Not recommended for advanced readers."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DOHO9917TKDC"
                },
                "Date": "on April 13, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Good science but very deep thought required. Not as simple as I had hoped but thought provoking and a real head scratcher."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AO9LMX0H70D85"
                },
                "Date": "on April 1, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "It was a great book. I was a proponent of the multiple universe theory but the author has really shed some light on the fundamental flaws of the theory and now I'm compelled to reconsider. I also enjoyed his discussion on the theory of time and the fundamentals of measurement."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AO2OTUB4TZRD"
                },
                "Date": "on March 30, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "If the world of the physicist interests you but you, like me, are a bushel short of the math but have lived long enough to have a serious curiosity about the Quantum world, this book will satisfy that curiosity without requiring you to have a PHD in science, or even a BS. I thoroughly enjoyed it and came away with a better understanding of the universe we inhabit."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RNYRD50JFXNU"
                },
                "Date": "on March 28, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Nice logical foundation, fairly well written, very difficult material.  Another good source fro trying to wrap one's mind around the oddities of modern physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOTK7IMQQ3C1B"
                },
                "Date": "on September 30, 2013",
                "Helpfulness": 0.75,
                "StarRating": "2",
                "Text": "The propositions in this book are simplistic and insufficient proof has been offered. But it is worth reading just to get different points of view."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PZ2M1PREFIT4"
                },
                "Date": "on March 19, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "So glad I did read it!!  It completely confirms my life-long belief in the simplicity of things.  It not only furthers help my faith in the way I have been observing and thinking of how things functions; it also helps me how I should analyze the nature of things based on the current known connections of theories."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATW1TWVQSES3Z"
                },
                "Date": "on March 29, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "A excellent attempt along the lines of DesCartes Discourse on Method to derive quantum mechanics and relativity by accepting the facts that nature has no access to absolutes and everything is defined by its relationship to something else. He also does an excellent job debunking the Many Worlds Theory."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TZT5FNBH27ID"
                },
                "Date": "on September 2, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1H7Y5XKPGT0OS"
                },
                "Date": "on July 31, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMPFKFKXZOEDB"
                },
                "Date": "on September 14, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This first of his three books in this series is excellent, started on the second one already. He deals with logical constructs not math, although says what the math results say. He started by citing Galileo who realized that a person moving at a steady rate cannot feel anything different from someone still at rest, and couldn't do any experiment to prove it one way or other. Later, Newton unified gravity by realizing that an apple falls from a tree by the same force that makes the planets revolve around the sun. Next Faraday realized that electricity and magnetic fields were two sides of the same electromagnetism. Maxwell proved that mathematically, and it lead him to realize that light was an electromagnetic wave, like radio signals. Another unification. Then Einstein unified mass and energy with e=mc2, and later gravity with the geometry of space (general relativity). It remains to unify quantum mechanics with general relativity, and Thomas does an excellent job laying the goundwork for his belief that they will finally be unified by a very simple concept, a brilliantly logical construct that anyone can understand even without going through a lot of complicated math. I'm looking forward to the next two books. He also has a website packed full of similar lay-friendly explanations of the major questions of modern physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A384VL2R37VTQU"
                },
                "Date": "on August 18, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HKB2QHU3NOSC"
                },
                "Date": "on July 25, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Spoiler Alert! Don't read this review if you want to follow the author through the rabbit warren. Here is the bottom line: if you like to believe that your actions affect the future and you believe in causality ( as it is usually thought of ) you won't like where this ends up i.e. a Minkowski Block Universe. Yeah. Pretty dispiriting. Still, this is an interesting read and Thomas takes pains to keep his thesis grounded in experience and observation. The conceit that we are, in any way, in charge of what is going on is an artifact of our own perceptions. Many people will find this untenable and will reject the thesis out of hand. The take away for me is this: the Universe is not what we think it is, it doesn't work the way we think it does, and we aren't what we think we are. The thing to keep in mind is that what it is, how it works and who we are are still questions that deserve answers and thinking clearly about things will serve us better than hiding from the plain facts. The truth is hidden because we won't look at it. Choose to look."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KHREHA409RYY"
                },
                "Date": "on December 3, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Very much a laymen who understood the logic and theories. What a great job explaining complex ideas so even amateurs  can grasp them."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HX6DWNX8DVQJ"
                },
                "Date": "on September 17, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "It's a fantastic read. After many books on the subject now I have begun to comprehend. Next on agenda: Dr Andrew Thomas's website."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EHE7M69JB346"
                },
                "Date": "on June 18, 2013",
                "Helpfulness": 0.6571428571428571,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKQTE8B2XB34C"
                },
                "Date": "on September 17, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MMGBUJ85GXPG"
                },
                "Date": "on May 18, 2015",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "This was an interesting read. Andrew Thomas has a good broad knowledge of physics, and some interesting ideas on fundamentals of our universe, but I'm not convinced by his conclusions. Just because you say things over and over (this book gets repetitive in beating simple ideas into your head), does not make them a facts. Obviously this is theoretical physics he is tackling, so he (everyone) is still missing a lot of information, so I feel he needs to trim back on the certainty he expresses his ideas. I'm not quite sure who this book is for. I think people new to the world of physics might be confused and mislead, and those who are better/well versed will find themselves skimming it and picking holes."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AL3KPUJUF4OXZ"
                },
                "Date": "on April 26, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATYY74AGWM8K0"
                },
                "Date": "on September 15, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Unusually coherent book on the physics of Quantum and Relativity theories.  Focuses on fundamental laws of the Universe... particularly the absence of any independent \"clock\" or \"location\" values.  Thus, expands this fundamentalism thru very lucid discussion and arguments to better understand the interpretations of Q and R theories.  Because of the author's discussion, I now understand why the Uncertainty Principle works... as well and a deeper understanding of other aspects of both theories.  Really a must read for students of fundamental physical theories."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOS2FZZ6L3812"
                },
                "Date": "on September 9, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "It is the first book about physics; relativity and quantum, that did not break down into equations that I have no ability to understand.  The author's theories were presented in plain english, even though at places it seemed to break down into gibberish.  I found his foundation theories of the universe interesting.  I don't know if he has convinced me.  For sure he has not convinced me about it all.  It does appear that he has come up with the Unified Field Theory in the written word that had eluded Einstein in mathematical equations."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GXR6CHHPX0JS"
                },
                "Date": "on August 26, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "In all honesty this book is probably better if you are more of a science geek than I am.  While it was clearer in writing than most text books, much of it went right over my head. I am also not crazy about the speculative nature of the book. Andrew Thomas makes many assumptions that may or may not be true, he can't really prove his what he says. He just relies on his own logic being taken as the gospel truth to prove his points. I really was not impressed. Glad I only paid $1.08 for it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AT3VSAZPX05FP"
                },
                "Date": "on March 27, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DG5EH4JH2IL"
                },
                "Date": "on August 30, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "If you are looking for something to think about while you're in your chair, try this. Beware though, once you start down the road of quantum mechanics and relativity there is no going back. The concepts and possibilities presented in this book are so beyond the pale of everyday thinking that is it is almost unimaginable. That's the problem, the word \"almost\". Because once introduced to these ideas you will be fascinated and haunted by them. Good luck."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KBV0G9ULFG7V"
                },
                "Date": "on September 6, 2013",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VEYL3WG8O9GD"
                },
                "Date": "on January 20, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I give it 5 stars for the carefully crafted text.  It is very concise and well worded.  That said the equations are worse than terrible; they are much too small to be seen.  I'd say they must be enlarged at least by double or more.  Do buy if this does not trouble you.  I would imagine that the same process for creating this ebook is much same for the other books by this author.  It is not his fault but the way the book is readied for the reader."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XRDY1BS66TDR"
                },
                "Date": "on May 15, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Written for the non-physicist, this wanted to be a quick read.  However, I had to re-read much of it just to understand the \"deep thoughts.\"  I enjoyed this book so much that I am currently reading  #2 of the series.  I recommend this to anyone who wants a fairly good understanding of the Universe and its workings.  Plus, after reading this book, everything said on \"Big Band Theory\" will make sense."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A176VR9924B796"
                },
                "Date": "on August 8, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "For all you amateur theoretical physicists, like me, this is a refreshingly simple review of the big questions and the big theories. The author's quest is to achieve unification by asking fundamental questions in a logical progression.  He does make some assumptions that might be disputed by other theorists, but he does so in an effort to get to simpler answers than multiverses and eleven dimensions. Recommended."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YN44Z84L6BXK"
                },
                "Date": "on September 15, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Some of the reviews I read before I started said this was interesting but relatively simple. Well for me that is a good thing. I have read many books on various areas of physics but I admit that I often don't understand what I'm reading. That is not the case here. The author may be completely off track but he,was interesting and clear and I was able to follow along. His explanation of time was fascinating."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22W1UEBECSFDC"
                },
                "Date": "on May 20, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Definitely a must read for those interested in Physics, but need it broken down to an understandable level for the average person.  I have read other Physics books that were very complicated and, unless one understands intricate mathematics, is far above the reach of the average person.  I highly recommend Hidden in Plain Sight for the average person interested in Relativity and Quantum Mechanics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18Q5TWZ0LJILT"
                },
                "Date": "on August 24, 2014",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": "Poorly written prose makes this book a sleeper.  His constant reiteration of his main ideas creates a boring, tedious monologue that wants you to put the book down and move on a book that can capture ones imagination and interest.  Quite literally this short book could have been edited  down to 50 fewer pages.  I am no longer interested in reading the rest of the Hidden in Plain SIght series."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3J0EGT5PFCESZ"
                },
                "Date": "on May 20, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is a thought provoking book which includes a brief review of Quantum and Relativity theories.  The concept that everything must be measured relative to other objects in our universe seems simple and yet has profound implications for many assumptions we make about our universe.  A must read for anyone wanting a general understanding of both theories and their differences."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A296PIHZXAGY6B"
                },
                "Date": "on September 18, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Although the reasoning process of this book may not be very rigorous, it's central theme definitely inspires me to use a new way to think about our universe. The physicists have long been searching for an absolute reality of this universe, but it seems that they are now reaching a deadend. The fact that the reality is relative does not undermine the reality itself."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKAWPV482ODX8"
                },
                "Date": "on March 20, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "The points brought out in the book are interesting, but they are more concerned with pointing out the similarities between Relativity and Quantum Physics rather than demonstrating \"links\" between the two.  Still, it's an interesting read and if the \"links\" could ever be proven it would be a massive change in the way physics sees the world."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YT0SJDFDNP1V"
                },
                "Date": "on July 7, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Enjoyable and very easily understood thesis on \"getting back to basics\" rather than the philosophical discussions that pass for physics of late. Hopefully other physicists will continue to follow his lead and get back to doing science that creates testable hypotheses."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QYEBJB2NG84M"
                },
                "Date": "on July 2, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent conceptual explanations and interpretations. Makes rational sense of relativity theory and quantum mechanics. Clearly demonstrates that real conceptual understanding and interpretation do not require any mathematics beyond first year high school algebra, if even that."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ICGH6YH43V9E"
                },
                "Date": "on June 30, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Dr Thomas' reasoning is deep yet clearly presented and easy to follow.  I really like the way the author starts with first principles and builds from there."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARQYRWQUVVXFS"
                },
                "Date": "on June 25, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QQUOTG2MZV6B"
                },
                "Date": "on June 23, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This was a fairly quick read, didn't have to stop anywhere to say, \"now, wait a minute.\" Particle physics and cosmology fascinate me and this book does a good job of trying to tie them together."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25I5PT90V42T1"
                },
                "Date": "on June 23, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "I am not a scientist or intellectual . . . . . do not even have a bachelor degree, but I found the basic premise (that there are no absolutes in Nature) and much of the content of this book to be obvious through intuition."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZEK3FOT1ZJMM"
                },
                "Date": "on June 18, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWZBK3S4AVP8M"
                },
                "Date": "on June 11, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "It is a good effort trying to unify quantum physics and gravity but I don't like the way he jumps fast to conclusions."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YWOSTR8D5CWJ"
                },
                "Date": "on June 7, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "a simple and engaging book. physics for the common man. an elegant way to explain the fundamental nature of the universe"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37N43FERL9T4O"
                },
                "Date": "on May 30, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "As a long time lover of Physics and Relativity in particular, this was an interesting read. I have always had a problem with the way most physicists have had to introduce way out concepts such as dark matter, dark energy and such to fit their theories. Mr. Thomas introduces a new concept that reconciles the questions raised by the latest theories without resorting making up things."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EXZ37KKIXIGZ"
                },
                "Date": "on May 29, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I gave it a 5 because it is very interesting  and easy for a lay person to understand. I have the 2nd and 3rd in the series. I am reading the second book now and enjoying it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AY62KUDPSM256"
                },
                "Date": "on May 29, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I was also astonished to learn how simple things can be. I completely agree that \"the universe is only one\". How else could it be? My congratulations to Andrew Thomas for so clear written explanation on the \"mysteries\" of special relativity and quantum mechanics. Their foundations seem to be exactly the same!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADY7WVROHO9Q2"
                },
                "Date": "on May 23, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "The author attempts to describe the relationship between quantum physics and relativity in a non-mathematical way and based on a bottom-up approach instead of the normal physics top-down approach.  Some conclusions seem a bit contrived, though I must say that by the end of the book, his attempt to come up with a unified description of both domains does seem to fall together.  Very non-technical.  Not high-wuality writing, but done well enough to get to the end and the conclusions of the author."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25PRM814ML4EE"
                },
                "Date": "on May 22, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEZSES2UEQG34"
                },
                "Date": "on May 16, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "While I was not convinced by this book to completely discard all the various Multiverses described in Max Tegmark's Mathematical Universe, this book was extremely well written.  The ideas presented are argued convincingly.  This is a valuable compilation and critique of the main ideas prevalent today in Cosmology and Quantum Mechanics.  Highly recommended."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOUZ8QHHG29XV"
                },
                "Date": "on May 12, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The subject i this first book by Dr. Thomas  deals exclusively with Relativity and Quantum Mechanics. I have read a lot on these theories and this is as easy to understand explanation as I have seen. The only new information for me is about the Quantum  through the slot explanation. I definitely understand Relativity and QM better then before.I am half way through the second book and it is a different story."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A90FZ5OZFUBN3"
                },
                "Date": "on April 30, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is a wonderful book which shows what can be done with clear and general thinking.  The idea that everything's properties are only defined by their relation to everything else in the universe is so simple and obvious and Thomas uses it to clearly relate both quantum mechanics and general relativity.  He must be on the right track."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHV4DFI1I90TX"
                },
                "Date": "on April 30, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A322MLCS6WEE3I"
                },
                "Date": "on April 28, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZS3FUDUU71YD"
                },
                "Date": "on April 27, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33568PEJIO09E"
                },
                "Date": "on April 24, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I like the book because it delivers a clever synthesis of both relativity and quantum mechanics theories. I have to ponder the conclusions for a while. Overall is worthwhile reading, it is very original."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FL6YFXVUGLFU"
                },
                "Date": "on April 17, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Like his central premise about the simplicity of the underlying nature of the universe, Hidden in Plain Sight is a wonderful read if one is interested in physics due to the clear and simple explanations by Thomas."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FDB5ZMVJYANF"
                },
                "Date": "on April 17, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Being an enjoyable read it is difficult for me to believe that anyone truly knows Nature. One would have to physically go out into the universe and absorb it. That aside, it was worth the time and I like it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3A0J34PKV8JUQ"
                },
                "Date": "on March 30, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A very interesting read. More Ontology than Physics. But it is ideas and arguments like the ones put forth here that science can use as a catalyst for further research. The question now is how to begin to test them."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QGO0675HS6YW"
                },
                "Date": "on March 30, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11OIY8US97P9N"
                },
                "Date": "on March 16, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The book is written in a form that at least is comprehensible to me, I do like physics but I'm not some one that can say that knows much science. so for me is a book that I can read and understand."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJZL9GJAIKKYO"
                },
                "Date": "on March 11, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Whether or not you agree in principle with the author, you will agree that this book provides some new and interesting perspectives."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HYWBCLB10TG4"
                },
                "Date": "on March 11, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "Thomas has achieved his goal of presenting physics in a bottom-up, rather than top-down fashion, and in formula-free English comprehensible to almost anyone. At times somewhat oversimplified, and often relying upon terms (such as \"Nature\") which cannot be defined, he nevertheless has unified for me that which previously had me practically catatonic. Moving on now to Volume 2!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17AB2TR3CP30A"
                },
                "Date": "on March 8, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "One can only imagine how difficult it is to explain details of such exotic notions a string theory or loop quantum gravity, but Andrew Thomas does it like it was a piece of cake. Cursive style, down-to-earth language and simple, clear explanations. If you have ever wondered what your typical absent-minded physicist was blabbering about when speaking of quarks, symmetry, strings, quantum mechanics and time dilation, read Andrew Thomas and you'll tart making sense of it all."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATYNZV56I9LBO"
                },
                "Date": "on March 5, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "Dr. Thomas has attempted to explain both to the \"layperson\", as well as the well educated scientist, the ideas of the theories of relativity and quanta from a slightly unorthodox perspective.  Some people will rankle how he interprets these scientific fields [that's kind of a pun, since he barely acknowledges the existence of the field concept of the Universe].  It's easy reading, with only a very few equations, which he does not develop.  Speaking of \"which\", the author is English and uses \"which\" in too many cases where \"that\" is most appropriate.  If you can live with that failing, you should enjoy the read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TI35UE8U16QQ"
                },
                "Date": "on March 4, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Recommended as good overview of leading theories with separate chapter on author's solution to the paradox (clearly disclosed by the author).  Just enough easy math for understanding.  Enjoyed it as much as the first - looking forward to his third book!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IFN8EE9FAFH0"
                },
                "Date": "on March 4, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VS9AKSIA487A"
                },
                "Date": "on February 28, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Good read for those interested in quantum mechanics and relativity, both subjects well explained in layman's terms, plus the author's own well argued  theory- well, not quite theory, more well thought out premise-  on how the two correlate, a real paradox  in  current thinking. If he's correct  he may just change the course of physics, though I suppose his premise will have to tested and verified  by mainstream physicists and/or mathematicians before being accepted- time will tell."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31L0XOY4GVRR8"
                },
                "Date": "on February 28, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FUXDNOST7H2Q"
                },
                "Date": "on February 23, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "The premise of the book is that if there is to be a better understanding of our world it must come about as if we see the world better, as if we see what was not seen before with just Einsteins relativity isolated to one side and quantum mechanics far on the other. An elegant \"aha\" moment has to occur about the one universe that has both the big and small, or we are missing something. Having read much about the physical world and many a popularization about theories of everything, this book was very unique and just what I had been looking for. That is, someone tackling the problem's in physics with a little more elegance and a little less about new particles. If you like a Hawking, Kaku, Wolf, or generally books about possible theories of everything, this is a must have addition to the library."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DOY2DPDRLLQA"
                },
                "Date": "on February 11, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Not only Dr. Thomas provides a very exciting approach to solving the various quandaries of theoretical physics today, but he does so by providing some of the most clear, concise explanation on key relativity and quantum theory phenomena, I have ever read. Together with the second book with the same title, Dr. Thomas works down from first principles (I would say, he works on a top-down basis; though the author says he is working on a bottom-up fashion), to deduce the \"whys\" for various phenomena and to show how those first principles can unite relativity and quantum physics. You may agree or disagree with his very novel perspectives, but even if the author assures you there is nothing absolute in the inverse, I think you must absolutely read these books!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1USGJJN44RZS7"
                },
                "Date": "on February 9, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This book is well written and is very good at describing a very complex subject. It progresses logically through the subject and describes the theories in detail before moving to the next chapter. So it is comprehensive and  although complex it is enjoyable. My only criticism would be that it is not just explaining the subject, the author is putting forward his own theories on the subject, in that regard it is not merely and explanation of relativity and quantum mechanics  it is the authors own explanation woven into the subject. Nevertheless I would have no hesitation in recommending this book to anyone interested in the subject."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21QGWLUOT4FV7"
                },
                "Date": "on February 9, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "I don't know how orthodox this is (not that everybody agrees on all of this stuff. Seems to be  a bit of an outlier on the subject of unifying Relativity and Quantum Mechanics.  But its cheap"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZY0M4QGWYZZM"
                },
                "Date": "on February 7, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "A well written insightful discussion of a theory to unite quantum mechanics and relativity.  The author explains the compelling concept that there is no absolute system of measurements that relates to the universe because the universe is all.  That is, there can be nothing outside the universe. I was hoping for an 'ah ha' moment to come near the end of the book that would cement the authors premise but it did no happen for me.  Altogether,  a  very good non technical read for folks who ponder the nature of the universe."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DDUIHEDC32AM"
                },
                "Date": "on February 6, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TYUBLLUUH2MB"
                },
                "Date": "on December 21, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Andrew Thomas writes in way which is easy read, on a topic which escapes most. He couples this with some great examples, and does this with some thought provoking conclusions, such as that we are all travelling at the speed of light, as we speak. If this intrigues you, read it..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9ZTOZONEVS1K"
                },
                "Date": "on December 17, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I don't have any education in Physics but the pop-culture theories in sci-fi movies are so intriguing. This book simplifies quantum mechanics and relativity in a way that anybody could understand. Plus, it is still pretty cool, even if it wouldn't make a good episode of Fringe."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GPLOLLE6BUDT"
                },
                "Date": "on November 30, 2013",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "The purpose of this book is to point out that there is no science that can illuminate physical principles outside of our universe even though some mathematical predictions allow for multi-universes.  Given only one universe, any standards of measurement or properties of nature that we may use are relative because they exist within our universe and are therefore not really standards because they are not based upon an external reference.  Any supposition with respect to those properties outside our universe is purely conjectural and imaginary.  Accordingly, we have no external standards in which to measure or compare physical properties such as energy, distance, mass or time within our universe.  Since all measures are relative within the confines of our universe, including those employed in quantum mechanics, there is a link between the theory of relativity and quantum mechanics because both lack an absolute standard of measurement.  This point should be obvious to those who have pondered a lack of universal reference but provides little insight into the unification of relativity and quantum mechanics.  The value of  Mr. Thomas' book is not in the discovery of the universal lack of reference, but the value of the reminder that there is no such reference.  It provides food for thought but provides no real answers."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOZKXNLPPCAOJ"
                },
                "Date": "on November 29, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The book is an excellent investigation into the problems of reconciliation between the theory of relativity and quantum theory.  It is not a technical offering only to be understood by experts in the field, but rather is based on clear thinking and logic that is understandable for the rest of us.  The author presents what he feels are obvious connections between these two theories that does create the ground for connection and consistency between them.  It makes good sense and also illuminates how string theory and others have gotten so far from data in the real world to become untestable mathematical creations.  The author also goes into detail to investigate the seemingly unexplainable situations discovered in quantum research and by the end does, I feel, make sense of it all.  How refreshing that something makes sense in this modern world where so much seems like nonsense."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YB09J2QINJ45"
                },
                "Date": "on November 22, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Along with a fine overview of quantum theory is an approach to combining relativity with quantum mechanics that may be a big step toward understanding the here to fore unexplainable ."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MX78QP932NR0"
                },
                "Date": "on November 22, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Well written and thoughtful,  specifically focused on we mere mortals who are interested in science but not schooled in it. Mr. Thomas should be proud of his efforts to help us grasp the fundamentals."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BP8G5NLKNDRV"
                },
                "Date": "on November 10, 2013",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "I found it fairly understandable for the layman and interesting. There are so many telling the same story but this does have a differrent twist and that helps make it a worthwhile book to read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39OO1C3KZKM05"
                },
                "Date": "on November 3, 2013",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "A different approach from the rest of the experts. Quite interesting but not entirely convincing to me. The book is very well written."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1R4Y3BE7O8YTE"
                },
                "Date": "on September 23, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Overall the writing is great, it keeps your attention pretty good through the book. The book is well organized, the author emphasizes a new theory of unification or link between Relativity and Quantum Mechanics, based on logic and some fundamental principles; it's interesting to read, it's a simple and logical approach to this problem. It definitely makes you think and that's the idea."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32Q6TMGTLYGTW"
                },
                "Date": "on September 21, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "His logic is very linear and insightful, I think this is a great book for someone trying to wrap their head around the weirdness of physics. It does grow tiresome how often he repeats himself. I suppose that's because he really wants to emphasize the main idea of the book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10U0Z7BHCS17T"
                },
                "Date": "on September 14, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This starts a little slowly but winds up developing a very persuasive and interesting theory. I would really like to know what Lee Smolin and others think about it. Don't be put off by the $0.99 price - this is a must read for those that follow physics and cosmology"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A97ZNBO8F2JSG"
                },
                "Date": "on August 26, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Very informative and well written book. Highly recommended for anyone with an interest in cosmology, physics, etc. Buy this book"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UHU1HZVUW0EG"
                },
                "Date": "on August 23, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Thank goodness an author that does not spend his ink on who's who in physics.  He writes about physics and the facts .  Not weird star trek hypothesis."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A88FRGSQKC5S2"
                },
                "Date": "on August 18, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Even though some of the the content is somewhat speculative the ideas are presented very clearly and with appropriate restraint."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACZPEE40WGSF0"
                },
                "Date": "on August 18, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "A very good description of the principle of unification of concepts and theories in physics. An ultimate aim to simplify the difficult concepts of quantum mechanics by bringing them together in a simplified unification theory. An altogether very readable and easily understood description"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MNHA4LJJ85L0"
                },
                "Date": "on August 15, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Refuting string theory for its inaccuracy.  Physics is to be simplified so instead of creating another field of study based on hypothetical we should focus on the fact there is one universe not several connected by wormholes..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WB247A5AC50B"
                },
                "Date": "on August 10, 2013",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "Fancy title and seems to be exciting from the beginning. But this is really about something well known in the quantum world and not what readers are expecting from the title. This is NOT a book about science but personal opinions and conjectures about quantum mechanics and how it can be unified with relativity. Unfortunately opinions are opinions after all and I think the author has totally exaggerated the beauty of his ideas."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXO329UESJJVJ"
                },
                "Date": "on August 7, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JU2LOO4GOTZI"
                },
                "Date": "on July 15, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is a good light read for enthusiasts of quantum physics. It is explained in such a manner that you can grasp it without a huge background in quantum or relativity."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IU49YPVF8T7C"
                },
                "Date": "on July 4, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "My understanding of the relationship of \"things\" was enhanced by reading this book. I plan to read it again as it covered a lot of ground. The state of experiment regarding this subject is such that,for the layman, the more you learn, the more questions you have."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A132H7YN6E8K2U"
                },
                "Date": "on July 3, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This was a very interesting book and it made some very insightful points.  Probably the best thing about this book is that it is very easy to read even with little previous knowledge of the subject.  It is hard to know whether the book is very credible within the realm of the scientific community."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARWZMWUR3OHHA"
                },
                "Date": "on July 3, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I'm 2/3 of the way through Thomas' remarkable book. Spencer Case's review states that one of Thomas' axioms - that the universe contains everything there is and that nothing exists outside of the universe - is trivial. It is hardly that: it's an elegant and profound axiom. Thomas doesn't invent this idea; I had come to this conclusion myself independently years ago and use it, for example, in disputing those who argue for the existence of god. But what Thomas does with this idea in relation to physics is pure genius. His other major premise - that everything is relative and no absolute criteria exist outside of Nature - is also profound in its implications. That he solves the long-standing puzzle of the two slit experiment is astounding. What, I also wonder like another reviewer, is mainstream physics' response to his argument? I am not a physical scientist (I'm a social scientist) so this is not my area of expertise, but he is right when he points out in the course of his argument that drilling down to more and more fundamental particles is not going to answer the question of the fundamental nature of matter and energy since there is always going to be something smaller. He is also right that the answer to these questions is going to take the character of \"of course, why didn't we see that before?!\" It's also fascinating that he arrives at the same place as I do, coming at it from a different route. As I put it in my 2011 book Globalization and the Demolition of Society: \"Everyone and everything that exists does so only in relationship to other beings and to other things.\" In other words, you cannot sensibly talk about what something is or what it does except in relation to and in comparison to something else. Nothing exists or can even be perceived to exist except in relation to other things that are not it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHNCHMHHQV218"
                },
                "Date": "on May 21, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "this book (Hidden Plain in Sight, by A. Thomas) should be read by all interested in Astrophysics. the ideas are relevant and create relationships that others writing in astrophysics or cosmology have not pointed to. i usually go to the reference list at the end of a book on Astrophysics and I am glad that Thomas included one. perhaps the date of publication would be optimal so that one does not have to google each book to see when it first appeared. date is important in Astrophysics since change has been profound and swift in the past few year. i would just underline how much i like Thomas's wit and intellectual curiosity. His perspective asks one to reassess the work of other leading astrophysicists of today. I am anxious to read Thomas's \"Hidden PlainInSight 2\" which is scheduled for the summer of 2013."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GAWY78F0BSHV"
                },
                "Date": "on May 18, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "It is a very well detailed book and I would like to see more like it.  The organization is very good."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21OLW0T5G4S3D"
                },
                "Date": "on April 22, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is propbably the best I've read in terms of simplicity. All areas are covered well and build upon each other.  Great Book"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UX0IKVF6YDDP"
                },
                "Date": "on April 10, 2013",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "I was entertained and intrigued by the author's premise.  It is a very good quick read.  It, however is not science.  Philosophy is a better description, for it is impossible to prove his conjecture experimentally."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MLR9MCYS3WQP"
                },
                "Date": "on April 10, 2013",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3R54QGNKV7WAF"
                },
                "Date": "on March 25, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Not exactly a novel !  Slower reading for the inquisitive mind.  Very interesting.  I have not finished but will after a short break with a novel.  Need time to absorb it all."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CLCC5UY1S149"
                },
                "Date": "on March 24, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VAN6ACQ4L0J8"
                },
                "Date": "on March 21, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This was a real discovery for me because quantum mechanics has changed in the past 20 years.  With super- colliders, new proofs of subatomic particles are offered.  The author uses very simple explanations and analogies to unravel the physics of our universe.  It is sometimes a bit ponderous in explanation but the author does a very good job of explaining."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QDOFEMBJOLYS"
                },
                "Date": "on March 18, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book gives an understanding of the unity between particle physics and relativity in such a way of making the two very apparent differences very closely related."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2V2QONTTG025U"
                },
                "Date": "on March 17, 2013",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "I enjoyed reading this book. I liked the author`s presentation of the  various theories concerning the universe and how we view it. However in the end I became lost, it seemed to be a universe without rules ... is it Chaos?"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A159WR4F7ACLSH"
                },
                "Date": "on March 11, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The author explores many of the ideas surrounding relativity, string theory and quantum mechanics in simple, easy-to-read language. You won't find any equations or advanced mathematics in here, so it isn't for any experts in the field.  Also, the author can feel a little repetitive at times, and he glossed over some subjects that he could have been explained more. Overall, the book is a great guide to the key concepts of advanced physics for anyone who doesn't have a background in the field."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SOTAWS5XM9QQ"
                },
                "Date": "on February 9, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I'm not qualified to judge the facts & math (though there is only one formula used in the book, some of the information rests on math, I'm sure), the logic of Thomas' argument seems sound to me. He writes in an easy to read manner and provides clear examples to illustrate many key points. If he has it right, this is a profound view of the universe."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WKU9J3BU7YHD"
                },
                "Date": "on February 7, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "The book was suggested by a friend.  I am well iinto it and have found I understand much of it as it is written in fairly simplistic terms.  Am looking foreward to complete the book soon .  This is an interesting way to become familiar with theories that some spend a life time studing."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38CI0AJHK6DLH"
                },
                "Date": "on January 24, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Q7ECGOAR7BG"
                },
                "Date": "on January 21, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This book provides a clear exposition of numerous questions concerning the physical world that is suitable for the general public."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17ISIV7XDCBLF"
                },
                "Date": "on January 7, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I have very little background in the subject matter covered in this book,but I wanted to gain a better understanding of this topic. I found this book very well written, easy to follow, and a profitable read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3B02GMSAK2LA0"
                },
                "Date": "on January 4, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "His general concept of cosmology is  plausible but a couple important questionable assumptions are  justified by acceptance as basically obvious."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26C1I2NKC96YS"
                },
                "Date": "on January 4, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AC43O4511025A"
                },
                "Date": "on January 3, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book, in my estimation, is a great introduction to quantum mechanics, a very complex subject. I also read Jeff Yee's The Particles of the Universe. If the reader has any interest in the origins of the universe or the Big Bang Theory, both of these books offer some interesting insights. Thought-provoking."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RY8KZKCTSVD3"
                },
                "Date": "on January 1, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book speaks in language that makes very complicated concepts easier to understand.  It is written in a very conversational style that helps those of us uneducated in these matter, but curious about them, come to a place of comfort."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OWU349LYKQ0C"
                },
                "Date": "on December 24, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I bought that as part of my research for an ebook I am writing, and it has everything I was hoping for. There are still some pieces missing, but it is a readable proposal from the viewpoint of science, and seems to be consistent in its approach and use of known research."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JJIIL14E9S9C"
                },
                "Date": "on December 12, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Easy to read. Not bogged down with mathematics. Makes me want to read more on the subject. Would also suggest Lynn McTaggart's The Field."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1C0VH44D2TFDR"
                },
                "Date": "on December 4, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I am a layman that is interested in physics so I won't comment on the validity of the hypothesis presented in this book. It was however, a good read and an interesting way to view the symmetries between various branches of physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASKMTEEO40HXU"
                },
                "Date": "on January 23, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4KBH5WICFPCL"
                },
                "Date": "on September 4, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Common sense approach to very complex subject matter. Experts in all fields tend to complicate things so that they will sound like experts. I tend to think that Einstein was right when he said \"keep things as simple as possible, but not simpler\"."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10HC1UUAM6EEH"
                },
                "Date": "on August 9, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Theoretical physicists have been so annoying lately.  To a layperson they seem to want to complicate the issue until nobody but their little priesthood can understand it. This theory is simple and elegant and even better, it makes sense."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HMH9C47V2P5X"
                },
                "Date": "on March 28, 2015",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "It was a fairly understandable read made a plausible connection between large(gravitational) physics and small particle physics.  Would have liked to see mathimatical connections between both but of course, no one has done that ...yet."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FUETF2QQP1JJ"
                },
                "Date": "on May 26, 2013",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "3",
                "Text": "Interesting approach, but not entirely believable as it doesn't go far enough into connecting the math.  It is, however, a good review of relativity and quantum mechanics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIV96EGFMPIMQ"
                },
                "Date": "on May 7, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Hidden in Plan Sight is such a great book. It's not as heavy as one would think. The author goes to great lengths to make sure the \"average Joe\" can understand the text. I loved it and cant wait to read the other four."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2P3R98SM2HQNO"
                },
                "Date": "on September 22, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Nicely laid out, and well-written. The Author's argument seems so simple that at first I suspected circular reasoning, but it all seems sound science, and is very readable. I am looking forward to reading the rest of the set."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKKNZXN5PBLRZ"
                },
                "Date": "on September 9, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I never grasped quantum physics... it was always terribly daunting for me to begin studying. This book illustrated the simplicity which lies behind nature and the laws that govern us. Very eye opening and informative."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ODBKPS1A0PD9"
                },
                "Date": "on March 4, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I enjoyed this book. I'm not sure the math would agree with the theory but he certainly explains how it should. Very good teacher. I found myself smiling at the simplicity of it all. Read it ya might learn something."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A341CVJ28O7XWA"
                },
                "Date": "on September 24, 2012",
                "Helpfulness": 0.6,
                "StarRating": "5",
                "Text": "This is one of the best books I've read recently about unification, and I've read quite a few.  It describes a simple concept that probably should be explored more by serious physicists though it may not be the current \"politically correct\" avenue of research on this topic.  The author provides a simple explanation of how quantum physics may relate to gravity, without boring the reader with heavy math.  The reasoning is simple and straightforward, quite the opposite of the popular string theory view of the universe.  If you have an interest in unification theories, this simple theory may grab your attention in a way few other concepts have.  I highly recommend the book because the ideas in it are interesting and fairly simple to comprehend, and it offers an enjoyable perspective on the topic."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UQDJQFOUTZ3R"
                },
                "Date": "on September 6, 2012",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "3",
                "Text": "For me the first 3/4 was a fresh discussion Of the usual QM topics, but the conclusion seemed like common knowledge than something profound"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BD55OK69BQ1R"
                },
                "Date": "on September 7, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "More \"Philosophy\" than grounded science in my opinion, but the Author clearly states he wrote about general and universal principles. A very pleasant and interesting reading."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A76K07OJPY095"
                },
                "Date": "on February 15, 2013",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3C2AH5LBHNR1N"
                },
                "Date": "on April 15, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Most interesting hypotheses,  facinating reading, sound scholarship.  Clearly not everyone will agree nor accept the author's views but a seriously captivating point of view."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A238J7Y5LBFRQ5"
                },
                "Date": "on September 2, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Presents a plausible explanation of how relativity and quantum mechanics have similar underpinnings. No new science, but a novel view that might inform thinking on the topic."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZ83FNJ2S49DE"
                },
                "Date": "on January 4, 2015",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AONF9OVC9F7G1"
                },
                "Date": "on June 23, 2013",
                "Helpfulness": 0.6,
                "StarRating": "2",
                "Text": "As far as I can tell, the author never addresses the problem that in physical reality there are no \"closed\" sytems where there exists a point (zero-dimensional) object with no parts. For example, he talks about symmetry: Take his snowflakes--you can't rotate a snowflake without sticking a \"rotator\" into the system, and no rotated snowflake would be exactly the same as the unrotated one anyway, since the identity of the constituent parts would remain the same, though now they'd be in new positions. (If they weren't in new positions, the snowflake couldn't be said to have been rotated.) Some nitpicking is definitely called for here."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30M73GG1Z0PL8"
                },
                "Date": "on March 1, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Nothing existing outside the universe is key to the understanding of concepts presented in this book and is a game changer for me in how to think about this"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2A98ALKAIZF22"
                },
                "Date": "on May 18, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "The book is exciting to read, and in non-technical language. It is an excellent starting point for those interested in knowing what physicists think about."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASTRFWEHGZZNE"
                },
                "Date": "on September 12, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "...and the question that's been troubling physics for decades was SO EASY to answer! Amazing! This book is just brilliant! Everything makes total sense!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JO919YKO54CM"
                },
                "Date": "on February 20, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Very interesting book for someone who is not a scientist but wants to know more about the subject. Easy to understand with limited math/equations."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EZOTMZZNILM6"
                },
                "Date": "on January 10, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "unity perhaps, corresponding principals across the board ... highly likely. An excellent and engaging read and proposal, for sure. Recommended."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UP1VVWJF7ETX"
                },
                "Date": "on August 13, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I like when a book makes me think and this one made me think about a lot!!! If you have questions find some interesting ideas here!!! Enjoy!!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3A6JOQTIS0XJJ"
                },
                "Date": "on February 2, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The most understandable description of quantum physics and relativity I have read thus far.  For it is turtles all the way down"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XA1I6QJV54Y"
                },
                "Date": "on November 26, 2014",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SGPB6KYN6S52"
                },
                "Date": "on March 6, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Put forth in a powerful and understandable manner. Excellent. I would recommend to any of my friends. Pleasure to read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A286VO46EGCWQP"
                },
                "Date": "on May 16, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Andrew Thomas writes with amazing clarity. My 16 year old son and I both gained considerably knowledge from this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1F3LRZLI035J6"
                },
                "Date": "on February 9, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "For anyone who wants a refreshing view of the cosmos and the fundamental nature of our universe, this is a great read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WJYSI92M9K2E"
                },
                "Date": "on August 29, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent.  Almost makes quantum mechanics seem intuitive!  Also gives gauge theory a different look. Loved it"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A185RYL14GFRVA"
                },
                "Date": "on September 20, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book was full of great insights to our universe and I am reading the authors other books on this subject"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A347P9T7SEJ8MZ"
                },
                "Date": "on February 19, 2013",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "This is a wonderful book which is deceptively easy to read and understand.  In it, Andrew Thomas proposes a logical, simple, and obvious explanation for the behavior of our physical world.  He also debunks some of the irrational theories that have found their way into modern physics, e.g. the conscious observer of John Von Neumann and the many worlds of Hugh Everett.  Anyone with a high school physics course will enjoy and learn from this book -- especially teachers.  However, a word of warning: if you're looking to support spooky or new age ideas, this book is not for you!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GSPLYHQYNYX3"
                },
                "Date": "on December 30, 2012",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1C59FN36OBZG1"
                },
                "Date": "on March 4, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Love the book, it is a great read. Makes Physics seem so easy to grasp and understand."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACS1SMITQ63F4"
                },
                "Date": "on May 16, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Quite an interesting viewpoint, has Andrew Thomas.  An something, he could be onto."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CG7UXF4T0BMB"
                },
                "Date": "on July 26, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "If tou want to understand a little bit of physics this is a good starting point"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VXIIOE0XUV5M"
                },
                "Date": "on February 14, 2013",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": "I found the book extremely interesting, but there always seemed to be a huge amount of doubt about what the author was proposing. I also found his continual reference to \"Nature\" as disturbing, particularly since nowhere did he state what he meant by \"Nature\". It read as if one could simply replace the word nature with god, and it wouldn't change the point he was making at all."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RIRXY6NQY893"
                },
                "Date": "on October 7, 2012",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Although I was a physicist there was very little known about Quantum Mechanics in my time. This book is definitely not for someone not comfortable in the world of science. But, for someone like me the book does an excellent job of explaining both relativity and quantum mechanics. It is a quick read but, does a very good job in teaching the fundamentals of both subjects."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1V8WV1KT8B813"
                },
                "Date": "on May 18, 2014",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": "The idea that special relativity, general relativity and quantum mechanics cha ll be derived fro the idea that there are no absolutes in the the one and inly universe seems, on the surface, an attractive argument.  But it ignores the fact that there are absolutes such as Planck's constant.  I'll read the successor books and see how he argues this point."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XBO03AE97N1K"
                },
                "Date": "on June 5, 2014",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": "And that is why I did not give this a higher rating. I have no background in physics -- or any area of science, for that matter -- other than the information I got in school several decades ago. However, because the author was able to explain things so I could understand what he was describing, I found the book to be interesting and bring up some existential and (possibly) scientific questions and thoughts. It sounds from his own words as if he is in the minority of his opinion and must defend his stance. I enjoyed this book enough to consider getting the other two books of the same name."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQGSUW7AZHQ51"
                },
                "Date": "on November 17, 2013",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": "Maybe but I am not buying it.  It is not especially supported by physicists now.  I know that that is the way  most revolutionary ideas start.  But there are more recent findings that seem to contradict the central idea in Hidden In Plane Sight."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A369UNL6S9XU6T"
                },
                "Date": "on September 10, 2013",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": "A little boring! Samples and illustration not so interesting. Theory interesting, assumptions not conclusive.A little philosophical. It is more instructional."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GI288HAV93PB"
                },
                "Date": "on February 27, 2013",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APVD5YTEI611O"
                },
                "Date": "on January 3, 2013",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1T37TR499ZXJF"
                },
                "Date": "on March 31, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Another interesting angle on the quantum world. Worth reading."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12G9TYALSK6SN"
                },
                "Date": "on July 27, 2014",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": "Interesting, but don't think the author supported his claim."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RXWXNZNDLW75"
                },
                "Date": "on November 2, 2012",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXME5JCUUJ8JE"
                },
                "Date": "on August 16, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Read all three books.  Concise and clearly written."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SUL9JIX0036C"
                },
                "Date": "on October 1, 2012",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "The explanation on the quantum mechanics wierdness is suprisingly revealing and simple, based on the author's relational principle.  A must read for those who have been struggling to grasp the real meaning of quantum mechanics. Great job!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWC3RKVOJNM5O"
                },
                "Date": "on October 21, 2012",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "This was a very great and comprehendsive read it actually ties it all together is very unitary and well tought out and for the price it is almost like someone is trying to convey and idea not make money. I give it 5 stars"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YMWOWQOSLRZ5"
                },
                "Date": "on November 5, 2012",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "This book was so enjoyable that I immediately re-read the book, from cover to cover, after finishing the first time. Nice to see someone start from first principles and establish their arguments in this manner."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24WGIHDM88H55"
                },
                "Date": "on February 5, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great book. Definitely recommend it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MFI81FXD6N19"
                },
                "Date": "on April 1, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Understandable, enjoyed every word recommend to anyone with a laymen's knowledge and interest in theoretical physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4SC3WGN6H3GC"
                },
                "Date": "on February 28, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great book for science lovers"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGBLKLXAFPJ30"
                },
                "Date": "on February 25, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Has some not bad analogies."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASKV8GHDAY4O4"
                },
                "Date": "on August 20, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Haven't finished it yet"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A194SLMDCUR9C4"
                },
                "Date": "on October 6, 2014",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "The book has some interesting ideas, and conveys them in a manner that seems easy to understand. From my perspective, it suffers from two deficiencies. In some places, the author seems to trivialize an opposing view as an argument for saying that the universe can't work in that way. That is no argument, but just some purple language. The second is that there seems no way to convert the author's very interesting assertions into mathematical statements. I understand the author's arguments regarding the flaw of akways looking for a mathematical expression, but I think physicists will to know how to derive the equations of general relativity and the equations of quantum mechanics frim the same unifying set of equations. This part is absent from this book, although the unifying principle presented is interesting."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RF1GOGHS54LD"
                },
                "Date": "on October 19, 2012",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3N75WOUQQTILX"
                },
                "Date": "on February 22, 2015",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "As with all books on these subjects, it contains many assumptions, the greatest assumption of all being that human intelligence is capable of understanding the mysteries of the universe. My dog is fairly intelligent, but she would have no comprehension of why I read a newspaper, wash the dishes or put out the trash - and no dog ever will understand those things. Cosmic intelligence could be so far above human's, that these mysteries will always be beyond our understanding. It does no harm to wonder and to theorise, but why would we think our logic and mathematics  are any more than primitive attempts to interpret data from five senses, which are only receptive to a tiny part of the spectrum of total reality."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HUXNZSZU14QV"
                },
                "Date": "on March 6, 2014",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "Mr. Thomas has a writing style that lends itself to the explanation of complex concepts in simple language.  He makes a very good case for the connection between relativity and quantum mechanics via the relative nature of physical properties.  The only drawback is that his explanations at times are a little too simplistic.  He doesn't give the reader quite enough into which to sink his teeth.  As Einstein said, \"Everything should be made as simple as possible, but no simpler.\"  Mr. Thomas sometimes errs in that direction.  Still, he is a good writer for those interested in complex physical phenomena, but who lack the foundation in mathematics to understand a more rigorous treatment."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LC09WH31QS2I"
                },
                "Date": "on February 28, 2015",
                "Helpfulness": 0.5,
                "StarRating": "1",
                "Text": "The theories in this book have no basis.  Don't buy it.  Terrible."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NP9D7XUJQPVK"
                },
                "Date": "on March 2, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "This is a marvelous little book - a must read for anyone interested in understanding the fundamentals of the universe.  Only future study and research will decide if these basic principals are THE fundamentals - but 'Hidden in Plain Sight' has completely changed my thinking and focus on unified theories.  Thomas leads us through the complex universe of behavior and theories of Relativity and Quantum Mechanics.  You be the judge - can \"There is nothing outside the universe\" and \"Nature has access to no absolutes\" be the answers to understanding the universe?"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QXMYB7C1S56W"
                },
                "Date": "on March 12, 2013",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VSI4ISJRWZ7X"
                },
                "Date": "on January 29, 2014",
                "Helpfulness": 0.6,
                "StarRating": "1",
                "Text": "The author jumps to numerous conclusions without substantiation. This is a wonderful theory that he does not support logically in this text."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1130F4HNWMJMX"
                },
                "Date": "on January 14, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I expected much of the same science from so many other books I've read. But no. This book is really special. There are no difficult formulas but a point of view missed in all other science and physics books that shows a relationship between the quantum and macro worlds that alludes to the great questions they each present and how they are ultimately related. This gives readers the ability to go on to try and understand more than it presents. It's definitely a new twist on unification."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UQR1T4E6RM4L"
                },
                "Date": "on November 28, 2014",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": "Very much a helpful physics book for lay people."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3S0NPNYL6X9FB"
                },
                "Date": "on December 19, 2012",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQLOJJNXRCQK5"
                },
                "Date": "on November 20, 2014",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "It is an interesting text. It seems to present a viable alternative to String Theory as the foundational framework for energy and matter. I have get a kick out of physicists who claim they are on the brink of understanding nature. So many of the published scientists are victims of personal hubris. This writer suffers from some of this. It is a good read for those who have an interest in modern Physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FKXERL18R9E9"
                },
                "Date": "on August 9, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Insightful"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20E0OBD3B13GQ"
                },
                "Date": "on January 22, 2014",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OG7TPZMOSXS"
                },
                "Date": "on June 18, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AI6KP4CCWQ7GB"
                },
                "Date": "on May 2, 2014",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "A simple and plausible theory for unifying quantum mechanics and relativity. I have some doubts about there being nothing outside of a closed and finite system."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JL4UXPGAJWHJ"
                },
                "Date": "on December 2, 2013",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "Not a lot new, but it put forth theory In a very readable manner. It should not be your first book about either subject, but decent if you have a little background knowledge."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MTQPQ049688U"
                },
                "Date": "on November 18, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I'm a chemist, but with a strong avocational interest in physics, both the really big stuff & the really tiny stuff.  Quantum \"reality\" has long baffled me, but Thomas finally brings things into an understandable perspective that even casual science fans can easily understand.  Maybe not immediately, but by the end of the book it will no longer strike fear into your heart every time you hear \"quantum\".  And be sure to take a look at \"Hidden In Plain Sight 2: The equation of the universe\", which I've downloaded but not yet read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWXJU9821Y758"
                },
                "Date": "on November 13, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "It has reached the bedrock of our understanding. Fresh and provocative insight. It has rightly laid emphasis on the emergence rather than reductionism.It has touch of Kant 's philosophy ie a prior truth  of universe and observer interpretations. Most importantly it has great simplicity. Any one interested in the fundamental principles of nature should read this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3C56N3UOMJ21K"
                },
                "Date": "on October 31, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Excellent presentation, clear and concise. I highly recommend it and it is a good introduction to quantum mechanics for the ordinary lay person."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PXQTKZX0PI6X"
                },
                "Date": "on October 20, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A122OUD829RDV2"
                },
                "Date": "on October 8, 2013",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "A very insightful book which is also hard to put down.  The author makes a compelling case for his thesis as well as debunking alternate theories.  On the strength of this I have purchased the follow on book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16U6SNBT09FT9"
                },
                "Date": "on April 26, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2L72PD44AWQH5"
                },
                "Date": "on February 23, 2013",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "4 Stars!  Challenging and thought provoking approach to the problem of agreement between Relativity and Quantum Mechanics.  Simplicity is the important key.  Highly recommended."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RUWFQDEQ2Q7Z"
                },
                "Date": "on December 28, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Incredible method for developing an understanding of what \"reality\" is. Leaves off with emergent properties derived from the fundamentals developed and discussed in the text. And that is really something to wonder about - is life and consciousness an emergent consequence.  Will definitely be reading book 2 of this title. great stuff!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12AI4NFFIP4PI"
                },
                "Date": "on November 9, 2012",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AB0NCM8VQVQ0V"
                },
                "Date": "on January 14, 2014",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "Very readable for a laymen -- not wonderful writing. It's an understandable contrarian view, which is good for those of us who are taken in and impressed by the multiverse/ string theory but who have always suspected that the in - style science lacks elegance."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D2HMOQ7FI251"
                },
                "Date": "on November 29, 2012",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYD9X89TG9HHM"
                },
                "Date": "on December 5, 2012",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Hidden in Plain Sight offers a surprisingly simple yet deep explanation of basic quantum physics highlighting a new way to view the topic as being integrated into everything we now know about cosmology and our understanding of the time-space continuum"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9HEGBAKR5Y5O"
                },
                "Date": "on October 27, 2012",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "In this book, Andrew Thomas starts with a simple premise, and shows how everything else follows from it.  He doesn't use multiple universes, or a lot of extra dimensions either.  \"The Universe is one thing, it is the only thing that exists.\""
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2H6CBBJMMXZS4"
                },
                "Date": "on December 4, 2012",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "In every chapter, I finally found reasonable and satisfying explanations to questions which were left unanswered after reading a dozen or so other books about the Universe.  I never wrote a book review before, but I thoroughly enjoyed this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GZGTL5NQ36SE"
                },
                "Date": "on January 13, 2013",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "This author provides a somewhat unique but very logical explanation of the relative nature of the universe and how it resolves the puzzling behavior of particles at the quantum level.  Well written and understandable by the lay reader."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NGTZQ9ZMAXE6"
                },
                "Date": "on January 16, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I very much enjoy this type of book however some authors write in such technical terms that they bury whats good in the book. Andrew Thomas writes using everyday terms and strives to let the reader grasp the true meaning of his works."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALQ6A7TDTUJV0"
                },
                "Date": "on September 14, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I've read many books on the subject... this one book did more to answer questions, to clarify what I've read over the years than all the others combined. I'm going to read it again! Simple in explanation, but not in content..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASEMNS35YX9XF"
                },
                "Date": "on September 14, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "super!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WESRILV8F4UU"
                },
                "Date": "on January 21, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "The clearest explanation I have read of the puzzling world of quantum mechanics and physics. Don't usually write these reviews, but this book is a must read for those amateurs, like me, who want to understand"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JKQU5NC47KM9"
                },
                "Date": "on December 19, 2012",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QI3TI4N4CHHB"
                },
                "Date": "on November 7, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "The physical properties of the universe are explained in simple non mathematical terms. There are no absolutes, meaning is relative and has many relationships to other things."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1S7JOOXS2M8HG"
                },
                "Date": "on January 31, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Clearly thoughtout principles made this worth a five star read.  I hope others apply mathematics to extend Andrew's ideas.  I can't wait to read more from Andrew's website."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SWS791NSZI4Z"
                },
                "Date": "on January 19, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Absolutely fascinating reading. Simple explanation for so complicated subject. Finally no chasing shadows of reality, no ghosts and illusions... Elegant and interesting."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2N9SJSC9LLEWB"
                },
                "Date": "on October 9, 2014",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "If you have a wish to know what the 1 percent of 1 percent of the world population are expounding on then this is one of the books you should read. It a place to start."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2J048CZNZWQR0"
                },
                "Date": "on February 2, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Learned a lot.Excellent if you are just beginning to explore the nature of q.p.You may not agree with everything presented but it will really make you think"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Z8TVRE7L20F1"
                },
                "Date": "on January 10, 2014",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "It is different from other books. It has simpler and more convincing narrative. One will have better understanding  of relativity after reading this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32MKXQ5B7HO7U"
                },
                "Date": "on March 10, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "good"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFN3W2W2DPQX"
                },
                "Date": "on December 21, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "This book speaks in clear recognizable terms to the average individual. A great to understanding the universe, consciousness, and relativity."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LVVB1LVERU0N"
                },
                "Date": "on October 12, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Still haven't finished reading this, but it's written in terms easily understood by the layman without being simple enough to be insulting."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5LMWL4QXT9OC"
                },
                "Date": "on January 9, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I different take on the quest for unification of relativity and quantum mechanics. A great read! Very insightful and well thought out."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BNU9WKVMHVON"
                },
                "Date": "on October 21, 2012",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Excellent, easy to follow of basic physics. Good review of quantum theory,  I learned a lot.  I would buy more books from this author."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17KQOO3K6TRHY"
                },
                "Date": "on January 10, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Very clear introduction into the very difficult topics. I learn a lot aspecialy about the quantum mechanics and the coherence"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MIMB0E5PX839"
                },
                "Date": "on October 22, 2012",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Easy to read but it covers all the bases. Not a technical or math oriented. This is cosmology from a logical perspective."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A102LSS1RZX8Q"
                },
                "Date": "on October 15, 2014",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "Very clearly written guide to the connection between quantum mechanics and relativity"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7XYIYDM1S9VS"
                },
                "Date": "on October 23, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Written with such clarity anybody can understand. Highly recommended."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7IA4BNIIZS2Z"
                },
                "Date": "on November 21, 2014",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "It was good to hear a challenge to the multiverse, a very good read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZVKXBCSK715R"
                },
                "Date": "on July 15, 2014",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": "Seems obsessed with his point of view..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LW723UOXVUN0"
                },
                "Date": "on September 18, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Not for every one ,ya gotta be into it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2K2V1YYIW2SF7"
                },
                "Date": "on December 1, 2012",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "3",
                "Text": "I did not get a lot out of this book, too many words to explain in the end what should be the simple answer to atomic structure."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HKCMKAEJF264"
                },
                "Date": "on November 8, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Well written. A very easy read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MTDY36YE0NJF"
                },
                "Date": "on October 19, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Awesome - bought 2 & 3 also"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A208NX07SBW228"
                },
                "Date": "on July 7, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Good!  Get the sequel, too!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A105IO5WOM9NL4"
                },
                "Date": "on October 31, 2014",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "Well written. Easy read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Z53IE049KCQZ"
                },
                "Date": "on September 23, 2012",
                "Helpfulness": 0.4,
                "StarRating": "3",
                "Text": "The book gave a good outline of both relativity and quantum theory, however the argument re the nature of time and the implications of this and the absence of absolute values was not convincing."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2I9R790JZWO0G"
                },
                "Date": "on October 7, 2014",
                "Helpfulness": 0.4,
                "StarRating": "1",
                "Text": "Some interesting ideas, but certainly not rigorous. Saying that something is logical 1000 times does not make it so. Pompous."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21HYKG0WUN0HH"
                },
                "Date": "on January 26, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I could not begin to tell you how fun this book was. This guy reminds me of myself the way he writes. Although, I'm not a writer it fits my personality type in that it has the \"duh, hello!\" Zing to it. I normally take about 6 to 8 hours to make it through a book like this, I was so captivated by insight and eureka stile moments that I crushed it in 2 1/2 hours. Seriously fun. Ronny"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AF2H1MSBL187F"
                },
                "Date": "on May 9, 2014",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": "Bravo! A great book, could not put it down, finished in one kindle read. Discover the fundamental principal that explains everything.  Physics explained simply, without a lot of mathematics.  Enjoy a well crafted history of science.  Rather than trying to unify ever smaller elements to make bottom up conclusions about nature,  he suggests a top down approach where the origin of the laws of physics come from cosmic scale attributes."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DWF92HLZZIB"
                },
                "Date": "on March 2, 2013",
                "Helpfulness": 0.5294117647058824,
                "StarRating": "2",
                "Text": "Well written book. Works pretty well in the beginning but when it gets to quantum physics, it goes down the same pop-culture path of misinterpretation that are so prevalent when it comes to quantum."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFX3MH7G9P184"
                },
                "Date": "on October 11, 2014",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "Dont know what to say, big ideas but without the mathematical formalization, difficult even for mathematicians, give the impression to verbally understand...convicte is not explain and even more comprehend..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Y5C84Z02QOK5"
                },
                "Date": "on January 4, 2015",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "A fresh look at the universe"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BRZZB2VQFECG"
                },
                "Date": "on November 20, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Good technical book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIU8EGWC641AF"
                },
                "Date": "on December 29, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Very interesting."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AK749Y4PLBG4"
                },
                "Date": "on December 25, 2012",
                "Helpfulness": 0.2857142857142857,
                "StarRating": "3",
                "Text": "The Author is rigid in his views and denigrating to those who do not agree with him. Brian Greene may be a good Scientist but he is not the last word, there are too many reference to his books as justification to the Authors views. Further Astronomy, Mathematics and Physics did not start in Europe as the Author implies. Thinkers of the Middle East and Asia perhaps had a greater contribution thousands of years ago."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3F4AMCOL7KPIP"
                },
                "Date": "on December 3, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "These books well written and filled their intent!! Made me think!!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FZBKUCHLWR11"
                },
                "Date": "on November 21, 2014",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "okay for non-technical intro"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AD303OSXPSST6"
                },
                "Date": "on January 26, 2013",
                "Helpfulness": 0.38461538461538464,
                "StarRating": "2",
                "Text": "Will not be able to finish this one. It is not in my nature to criticize someone's hard work so I will just say that the book fell short of my expectations and didn't hold my interest although I forced myself to continue reading almost half of the book before I decided to move on to other books. Note that my interest in Quantum Mechanics and Relativity is a hobby. My degree area is Biochemistry and Organic Chemistry. Passed Physical Chemistry graduate test the first try in my first year of Grad school."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1108FD2RPR6M6"
                },
                "Date": "on December 25, 2014",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "Not profound as I realized."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OEM2QZOB9TAR"
                },
                "Date": "on September 15, 2014",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EN8020I849XA"
                },
                "Date": "on November 24, 2014",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": "Enjoyed reading every page."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Hidden-Plain-Sight-fundamental-relativity/product-reviews/1469960796/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "299"
    },
    "Salesrank": "#209,812",
    "Timestamp": "2015-05-24 13:16:51.628953",
    "itemurl": "http://www.amazon.com/Hidden-Plain-Sight-fundamental-relativity/dp/1469960796"
}
