{
    "Category": "in Books (",
    "ListPrice": "$49.95",
    "Name": [
        "The MCAT Physics Book"
    ],
    "OfferPrice": "$34.39",
    "Reviews": {
        "AverageStarRating": "4.4 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AC3NOJOWFTMJ3"
                },
                "Date": "on January 23, 2001",
                "Helpfulness": 0.9310344827586207,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 11, 1999",
                "Helpfulness": 0.875,
                "StarRating": "5",
                "Text": "By using this book, I doubled my MCAT physcial sciences score from 5 to 10, with a 34S overall. This book is very thorough, but not boring. It is very helpful, even if physics terrfies you. The comfortable writing style  helps you get over your fears and allows you to learn a lot. I can't  recomend this book highly enough.  The text is easy to read and understand,  and the questions are the best out there for MCAT physics review. Buy this  book early and give yourself time to work through it -- you will end up  feeling very comfortable in the physical sciences test. I wish the author  would write a similar book for every other MCAT subject, but I guess we  can't get everything that we want!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on August 2, 1999",
                "Helpfulness": 0.9375,
                "StarRating": "5",
                "Text": "This book provides a fairly comprehensive overview of the physics you'll need for the MCAT with easy to read and digest chapters (not just formulas - real physics) and 50+ practice problems for each section.  The questions  don't reflect the MCAT format, but they will drill in the relationships  you'll need to know and help you remember the basic formulae for the exam.  I'd look at a real MCAT test after starting here."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2G9XCCLWEHCK1"
                },
                "Date": "on August 26, 2003",
                "Helpfulness": 0.9285714285714286,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WA2RZ9QJOWFA"
                },
                "Date": "on August 26, 2011",
                "Helpfulness": 0.9230769230769231,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YPABBZ8PCPRQ"
                },
                "Date": "on April 27, 2001",
                "Helpfulness": 0.9285714285714286,
                "StarRating": "5",
                "Text": "I've never taken a physics class in my life, and I smoked the physical sciences section. Everything (physics-related) on the test, except for two of the seventy-seven questions, was covered in this book.  If you take the time to read a chapter a week and do the practice problems starting in January, you'll be set for the MCAT in April.  Best of luck!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHR2DVXZRFZGX"
                },
                "Date": "on June 26, 2005",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is the best book by far in prep for the physics part of the physical sciences.  By preparing with this book I got an 11 on the PS section.  Its either this book or your huge physics textbook..you choose.  It has 16 chapters and at the end of each there is set of 30 or 40 questions.  Although I do wish there was more passage based questions here..it is still awesome prep especially if you are terrible at physics..like me!  The concepts are explained simply and it makes you wish your physics teacher had explained stuff to you in this way.."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 24, 2001",
                "Helpfulness": 0.84,
                "StarRating": "5",
                "Text": "The MCAT Physics Book is a wonderful tool in helping prospective medical students acheive high scores on the Physical Sciences section of the MCAT. This book provides the most comprehensive review of physics avalible in prep books, and it provides numerous examples and MCAT style physics questions with thorough explanations. Even though its MCAT style questions are more difficult  than the actual exam, it greatly prepares testakers for the challenges they face on the real exam. In my physics classes, I did not do particularly well in them, and this is the reason why I purchased the MCAT Physics Book. Before I used this book to study for the MCAT, my physical sciences section was a 9; but after preparing myself with this book, my score jumped to a 12 on the MCAT. I highly recomend this book for everyone, especially students that had little physics or did not do well in their physics classes."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A432698L3VIKQ"
                },
                "Date": "on April 28, 2011",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2D56VQX2HKUB9"
                },
                "Date": "on July 24, 2008",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2K5O800I5GPTQ"
                },
                "Date": "on June 29, 2007",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": "I never really had problems with Physics during undergrad, and assumed that I would have no problem with the MCAT.  I bought the whole EK series including the 1001 question books.  I read them I dont know how many times (I've been studying for months), but by the end I was very worried about my physics.  Nothing made sense.  After purchasing this book, everything makes sense again.  Unlike EK, it offers a lot of very good example problems, and the questions at the end of each chapter really drill the IMPORTANT points, not just random physics questions.  They help you memorize the equations, but stressing them in their problems.  The problems are not really MCAT format, however, if you are having trouble with physics this book will definitely get you on the right track.  The questions are not there to simulate MCAT problems so much as drill the important concepts into your brain.  I haven't taken my test yet, I have two weeks to go...but I am feeling good, and I am considering purchasing the NOVA chem and bio books.  I liked exam krackers when I first started, but I am beginning to feel they cut to many corners and have a tendency to confuse you by making things too easy.  I give this book 5 stars if you need to RELEARN physics....if you are just looking for problems, this is not the book for you."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1P2A64130NJZP"
                },
                "Date": "on January 5, 2008",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "Perhaps its because I did well in Physics when I was in college (I'm a post-bacc premed, and I'm doing my own MCAT prep), but my finding so far (I'm on chapter 9) is that while the book provides good review, it doesn't provide many challenging questions. I think it's focusing on getting you to understand the concepts. My practice test scores suggest I should do OK in physical sciences regardless, but if you're looking for a true representation of the harder questions, look elsewhere (or at least take a lot of practice exams). I do like the dude's sense of humor though!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on May 18, 2001",
                "Helpfulness": 0.875,
                "StarRating": "5",
                "Text": "This is a truely impressive review book - much, much better than the very boring Kaplan materials. I'm amazed that the author put so much effort into creating such an intuitive guide for us pre-meds. I highly recommend this book for anyone needing a review of physics for the MCAT and any undergraduates or high school students taking physics. It really goes beyond expectations for test prep!!!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PZH07I6FTGZ9"
                },
                "Date": "on May 14, 2011",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AED3YL023TSG8"
                },
                "Date": "on August 28, 2000",
                "Helpfulness": 0.875,
                "StarRating": "5",
                "Text": "If physics has always been a difficult subject for you, this is the book  for you! This book helped me conquer the MCAT physics section. The book  provides the most interesting analogies and gives true-to-the-real MCAT  examples. Buy the book and get a serious edge over the competition."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KZEGBTPH6MMF"
                },
                "Date": "on September 29, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I was lucky enough to pick up a copy of this review text in the bargain bin at my university bookstore.  While it may not be as visually pleasing as Examkrackers, it is more thorough in both explanations and practice problems.  The chapters are divided into small, manageable segments which can accommodate a variety of study schedules.  This book could likely stand on its own for most students, without a need for a full-sized textbook for reference.  There are hundreds of stand alone practice problems and plenty of passage-based problems as well."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8ZVUZ8304EO5"
                },
                "Date": "on July 5, 2009",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KUZOGTF5ZPH0"
                },
                "Date": "on July 19, 2006",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "4",
                "Text": "I appreciate the humor which Biehle brings to the subject- the review he provides is quite thorough.  I would have liked to have seen some combination concept passages (e.g. thermodynamics, fluids, and work-energy in one passage) because I feel that is the direction that the MCATs are heading in- but overall I am really satisfied with this purchase."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XJVUNU8LLQIA"
                },
                "Date": "on June 24, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "If you're looking for an MCAT physics book chock-full of passages, this is NOT the book for you. However, if you're looking for a simple, yet effective college-level conceptual physics book to help you prepare for the MCAT, this will definitely do. I like how the book includes a lot of examples and doesn't skim through important sections with the assumption that you \"already know\" the material anyway, as a pre-med student. Well, for some of us out there, like me, who are non-traditional b/c of being out of school for a while, sometimes the MCAT review books don't cut it. We need more explanation and a greater break-down of the concepts instead of random problems. This book is good for that."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2P2ZG2YYWBLRC"
                },
                "Date": "on January 23, 2013",
                "Helpfulness": 1.0,
                "StarRating": "2",
                "Text": "This book is very practically laid out and appeared to be an efficient method of studying, but for those who are actually meticulously going through each problem, you will notice many errors. A few of the solutions are mislabeled. Other mathematical formulas are not properly written or rearranged. I have ofund 4 errors in this book and I'm only on Chapter 3. And those are only the ones i have caught. I would not buy this again."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YR3XCLWED1KN"
                },
                "Date": "on May 12, 2006",
                "Helpfulness": 0.7777777777777778,
                "StarRating": "5",
                "Text": "After having trouble in Physics class, I bought this book. This book is the main reason I did well in that class. What makes the book so useful is that it breaks down every Physics concepts very well and gives practice problems after each chapter. If you having problems in Physics, this is the best book to get."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I6XBZ69TY9S2"
                },
                "Date": "on September 14, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book is the best. It;s easy to understand and is the best book for Physics. I went from a PS 6 to a PS 12 in my last MCAT, of course i practice a lot!.  If you had trouble with this class in college or didn't understand some topics, this is the book for you. Best of luck!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 15, 1999",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "I have some background in physics, but needed a refresher. This book really worked for me. I wish I had it for my freshman physics course. It clearly covers all the bases. The many sample problems in MCAT format were  very helpful, especially the detailed solutions. Some of the problems are  really creative and funny. That makes working through them all that easier."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABKN058N01CNF"
                },
                "Date": "on September 3, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I took the Physics AP years before the MCAT and needed a thorough review.  This was comprehensive, challenging, and clearly written by someone who loves physics.  The author makes puns throughout and strings problems together in a way that increases comprehension.  I also did the Kaplan Physics book and I strongly prefer the tone of this one. They cover the same material, but for me it was more motivating to study from a text written in the tone of someone who loves and embraces physics rathern than a test company who assumes all pre-meds are scared of the subject."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XY2G5E93MPJ4"
                },
                "Date": "on August 10, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "As a current premed student, I find the NOVA physics text very informative and easy to understand as it went straight to the point on most topics compared to other MCAT physics text. Trust me, get this book and you won't be disappointed at all. Since I received this book, my physics understanding tactics under exam conditions like the mcat have improved tremendously."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OFEI284WTUK0"
                },
                "Date": "on August 20, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "This book was extremely helpful in refreshing my memory about basic physics.  The practice problems at the end of each chapter give you a variety of how different questions can be asked about that topic of physics.  I would say that this book should not be solely used to study for physics but used as a supplimentary or giving ideas on how questions could be asked for the mcat.  The author gives hints to as certain aspects that the mcat likes to test on as well.  Overall, this book is good for those that want to refresh  things about physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QTYXP9FEBYJL"
                },
                "Date": "on March 12, 2012",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LP14X41S0LSU"
                },
                "Date": "on June 29, 2007",
                "Helpfulness": 0.75,
                "StarRating": "4",
                "Text": "The thoroughness of the topics covered and the quality of the questions make this book very valuable.  I would highly recommend this book.  The passage based questions are helpful as well."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BMVELSVWNGMI"
                },
                "Date": "on June 3, 2009",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "I recommend this to every student who finds the physics aspect of the MCAT the most challenging. For my first rough go around as a junior on an AAMC pre-test, I scored a 13 on the Biological sciences (my organic chemistry is pristine), and a 10 on the Physical sciences, the massive chasm being a result of solubility/phase chemistry and archaic physics topics (my modern physics is also pristine). This book, which I received three days ago, has illuminated several issues. If you have problems with:: Centripetal force, banking, cars; gravitational force; and reading graphs & knowing when to utilize the area under the curve, this will compliment everything taught in the Examkrackers or Kaplan versions. I actually recommend this PLUS Examkrackers Physics, as they seem to compliment one another where I had areas of weaknesses."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGXIIS46M03MG"
                },
                "Date": "on April 13, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on August 28, 1998",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "Nova put this text out specifically for students studying for the MCAT.  The passage format and the overall approach towards MCAT physics are an  invaluable help. The large study guides don't go into a tenth of the  necessary information in the MCAT physics section. This book covers it all  and explains all of the physics problems from the easiest to the most  difficult in a much simpler way than my psycho physics professor could. If  you have the time to flip through all 400+ pages, I highly recommend it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Q22UNDKRQ5DE"
                },
                "Date": "on March 30, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book was so awesome! I had a hard time with physics as an undergrad because my professor from my first semester of physics wouldn't teach us hardly at all and would just go off on tangents in class, so I had to teach myself physics for the MCAT. This book helped me learn the material easily and effectively. The book gives great examples within the text and has many problems in the back with explanations on how to get to the answer. Even if you weren't preparing for the MCAT, this book would be great for teaching yourself physics for school."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21YN2MNQLP2A5"
                },
                "Date": "on July 1, 2007",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "This book gives you practice tests that are MCAT style at the end of sections and thats what makes it the best review book out there. The MCAT is about not only learning the concepts but about PRACTICE. And this book does both really well.. Buy the book, use it, improve your score. Simple!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HEVWMVJLRMKM"
                },
                "Date": "on May 9, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2J7CHDTFJ01QS"
                },
                "Date": "on January 3, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "got this book for MCAT physics content review...had a weak Physics class even though I pulled A's...my plan was to blast through NOVA over winter break then get into berkeley review which is supposed to be more complex.  Happy I got NOVA's to start, really dumbs things down.  Wish I had just used this book during my Physics courses instead of the text"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Z4UM6Z5P7UB1"
                },
                "Date": "on August 14, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "I don't like this book, it has too much detail that you won't need for your MCAT... The only good thing that it teaches you how to think about Physics, however it greatly reduces your productivity..... I want to return it but I have already used it... TBR is not effective either ... USE TBR for passage practice."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GTFOWTC5QYZT"
                },
                "Date": "on August 21, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book helped me understand physics in a way I never imagined! I struggled in the Physical Sciences section on the MCAT but after purchasing this book, my score went up dramatically. I recommend this book to anyone looking to gain improvement in their PS score of the MCAT."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AP2Z2RW1ZJ1KG"
                },
                "Date": "on August 26, 2014",
                "Helpfulness": "",
                "StarRating": "1",
                "Text": "There was a printing mistake and the entire book was upside down and backwards! As I have been very busy I did not have the chance to return it but this must have been known to the company who shipped it to me anyways. Very upset about this"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AM4G71K690PJQ"
                },
                "Date": "on December 19, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Before buying this book I was not the greatest person at physics, but after using this book it has given me a whole new different perspective on physics. For the first time in my life I can finally say I understand physics!!!! Amazing book!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANCNPCPK50YWI"
                },
                "Date": "on July 25, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is a great tool for those who need a thorough refresh in physics. My scores have greatly improved since I've used this book and I would reccomend it to anyone in need of a thorough review."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Y3BFADXA7PWS"
                },
                "Date": "on June 18, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Definitely the best preparation you can get for the MCAT Physics portion of the Physical Sciences. Highly recommend purchasing for studying."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2T01UMV7S0HSL"
                },
                "Date": "on May 14, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "very good mcat review book. Kaplan was too brief. print can be better, not a major flaw though. not a lot of MCAT style questions."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ED6V2OTK55AN"
                },
                "Date": "on February 1, 2009",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Z9YP348N6ZFQ"
                },
                "Date": "on July 5, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The book gives you easy way to solve the problem."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BPM7S4ZN70VS"
                },
                "Date": "on July 27, 2011",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39XKRE4YKK3AD"
                },
                "Date": "on July 7, 2012",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "This is a great book to add to your study material.  The book has a briefing section in the beginning followed by  multiple choice questions and more importantly PASSAGES.  This book even shows how to cut corns so you do not waste needed time.  Strongly recommended if you are like me and need additional aid in the physical science area of your studies."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QBSQJKP8M0IC"
                },
                "Date": "on December 5, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "This book really helped me learn the physics - tons and tons of practice problems which is what the exam krackers series was missing. I think there is a little too much information in this, so use it with exam krackers to see what you actually need to know as far as formulas and whatever."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KK2C2158UGYK"
                },
                "Date": "on December 7, 2014",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": "I didn't think this was as well-explained as it claims to be. There were many times I was scratching my head wondering how they got from one step to the next."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HL5WU1RF7MT5"
                },
                "Date": "on January 4, 2015",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "The book came as described."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FBB819IJF9PF"
                },
                "Date": "on January 7, 2014",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": "I had purchased this based on the reviews it had received and recommendations. I was not helped or improved at all using this book, if you want rapid easy results go with the ExamKrakers series."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 19, 1999",
                "Helpfulness": 0.5,
                "StarRating": "2",
                "Text": "I am no genius in Physics, but I can recognize inconsistencies when I see them.  I am not even halfway through this book, and I have already found more than 23 mathematical / formulaic errors / inconsistencies that have me  wondering if any editors at all even glanced at the numbers and formulas  printed on each page. I give up...back to Kaplan."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on May 4, 2000",
                "Helpfulness": 0.2857142857142857,
                "StarRating": "4",
                "Text": "This review book is clear and concise.  It gives great strategies for how to approach the MCAT.  But it's not an overnight cram book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AC39FNSV35DQ2"
                },
                "Date": "on April 4, 2009",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "this is brand new just as described as in the product details.  the shipment also came in quickly"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 14, 2004",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I've been trying to find a copy of this book online, but haven't had much luck. apparently it won't come until august if i get it from amazon, which isn't much help since i need it to study for the august mcat. if anyone has a copy i can buy off of them, please let me know. thanks!!! my email addy is asneha@hotmail.com"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OL2MCW2DQI9X"
                },
                "Date": "on November 21, 2009",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "book was shipped via normal delivery well before scheduled date, in good condition. i highly recommend this seller"
            }
        ],
        "ReviewUrl": "http://www.amazon.com/MCAT-Physics-Book-Garrett-Biehle/product-reviews/1889057339/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "55"
    },
    "Salesrank": "#40,629",
    "Timestamp": "2015-05-24 12:25:14.922686",
    "itemurl": "http://www.amazon.com/MCAT-Physics-Book-Garrett-Biehle/dp/1889057339"
}
