{
    "Category": "in Books (",
    "ListPrice": "",
    "Name": [
        "Time Travel True Stories: Amazing Real Life Stories In The News (Book 1 & 2)"
    ],
    "OfferPrice": "$11.97",
    "Reviews": {
        "AverageStarRating": "4.2 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SOK5LS27V8KK"
                },
                "Date": "on October 7, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Perfect for all Lovers of Time Travel - This collection of real life accounts stirred my imagination, much the way that my interest in time travel was first sparked by H.G. Wells book 'The Time Machine' in my youth. I was particularly taken with the Sid Hurwich story; quite convincing!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BTJ5SJRRN4HI"
                },
                "Date": "on October 12, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "The theory of the Israelis using the Hurwich time-altering device to pull off the raid on Entebbe is interesting.  I find the stories of planes losing radar contact and the maritime stories of ships involved in time shifts fascinating.  Years ago, as an Air Force Pararescuman, I was involved in numerous unexplained plane crashes and maritime incidents."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XP4S2P2571FE"
                },
                "Date": "on October 12, 2013",
                "Helpfulness": 0.8888888888888888,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OVSEY8427N7W"
                },
                "Date": "on October 13, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KQ4UTGRQLXAF"
                },
                "Date": "on April 10, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Terrific.  Wish it had given more stories.  Too short and really gives an idea of various points of perspective and viewpoints into time zones....parallel worlds."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9YTPD7QYKHB5"
                },
                "Date": "on June 11, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2R710AO0BTHEC"
                },
                "Date": "on April 4, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "A very interesting book. I highly recommend this book to individuals who are open minded and want to explore and understand time travel."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQZSGJNS7IFH7"
                },
                "Date": "on March 6, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Nice. Definitely made me think and it dares to open one's mind. A quick, to the point and thought-provoking read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I72VCRTPU0SI"
                },
                "Date": "on June 28, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I enjoyed reading this books many stories of time travel. The author does a great job telling the stories and keeping the reader interested."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1X757EC5GCN9F"
                },
                "Date": "on September 25, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "Either way, the stories contained in the book are fascinating. Time slips and potential mind time traveling. There are many questions posed by these stories. Can we really time travel sitting in an arm chair? Could we turn the corner and be in a different time place? Very entertaining. Very frightening if true. Why? Think about the anchor you have placed with the time acceptance of the here and now. Now remove it. See?"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BCCC8NLD62VE"
                },
                "Date": "on January 2, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This is the first and only book that I have ever read about time travel so it is difficult to compare against anything else. Unless I check out his references, I have no feeling for the validity of what is in the book. It is interesting in any case. He did make one statement about physicists agreeing on time travel. In my 15 years at Los Alamos, I met a lot of physicists and none of them ever mentioned time travel."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31TO6FTBL89CE"
                },
                "Date": "on October 4, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Richard Bullivant wrote an astounding book with True Time Travel Stories. if your interested in stories of other people having \"time slips\" or their experiences with reported time shifts/definitional shifts then this book is a must read. My personal interest is a little more personal and even though it's a great book,it didn't have the complete information I was looking for but it had some."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PUULYPN8K6NV"
                },
                "Date": "on August 27, 2014",
                "Helpfulness": 0.6,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VY75QEFJX9UE"
                },
                "Date": "on June 14, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UOSJOABIRD9S"
                },
                "Date": "on May 18, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A121DQYITOGCP1"
                },
                "Date": "on May 15, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This was a fascinating book to read; I learned quite a bit about time travel cases of which I had been unaware. Having said that, it was a tad frustrating to find the meat on the bone of the subject matter in the book. There are tantalizing clues and nebulous accounts of various time travel incidents throughout the book; however, the author doesn't provide any follow up or offer any attempts by him to contact some of the people involved in these incidents. Granted, some have passed away, some faded into obscurity, and what not, but due to the what I can only imagine is a world-wide fascination for most people with the very idea of time travel, I feel the author should've made the effort if he was able. If you're looking for that type of experience with this book, save your money. If on the other hand you are like me and would like to have a primer on the various reported/alleged time travel incidents then go ahead and get this book. You will enjoy it if you enjoy speculating about the \"what if\" but not if you want the \"show me the proof\"."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2T8A8BUKZ7605"
                },
                "Date": "on May 8, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I actually heard a story from this book on one of the pod-casts I listen to.  As soon as it was over I hit Amazon and bought it.  Several very interesting stories involving time travel and time slips.  All are fairly short, read the entire book in one sitting.  I have always been interested in time slips but it can be hard to find good stories that are not heavily slanted in one direction or another by the author.  This book is the exception, the author does a good job presenting you with stories and letting you make up your own mind.  Book is well written and easy to read.  Not to heavy on technical or physics jargon.  For the most part the stories are presented just as the person experienced the phenomena.  I recommend this book (and it's sequel) to anyone who has an interest in the subject of time travel."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3A25G21849322"
                },
                "Date": "on February 7, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Enjoyed the book but it could have been longer and had more time travel stories, I like the topic anyway and the price was right."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7WZUXQK6LVGM"
                },
                "Date": "on January 31, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "As a topic I already had more than a passing interest in, I found this to be fascinating.  And the alluding to remote viewing, parallel dimensions, etc., gives me much food for thought.  I would recommend this book to anyone who is interested in learning more about the subject.  Thoroughly enjoyable!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DY27UFBAOGQU"
                },
                "Date": "on January 25, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This is an interesting book. It's well laid out and has some great stories. I'd heard most of them before, but not all."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MJD747DVNZKS"
                },
                "Date": "on January 20, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I enjoyed the book immensely.  Especially the stories of time skips.  Even after I closed the book u couldn't stop thinking about the possibilities of what those stories mean."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37Q1MQ37JAPT5"
                },
                "Date": "on January 17, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This little book has some great stories of time travel that will make you wonder if this could ever happen to you.  The downside is that it's too short and it leaves you wanting to know more about them.  It is a great place to start if you're interested in reading more about the subject."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XNFEQAROHM3M"
                },
                "Date": "on January 3, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The book was very well researched, and gave good examples of time slips, and the various people who invented time machines"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NMILJN8NVOH1"
                },
                "Date": "on November 29, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I love stories of time travel. We will never know unless we encounter the phenomenons ourselves . I only wish I did not hear almost all the stories in the book on podcasts. Book can be finished in one day. I hope the author writes more stories and left out many other well known stories such as the Philadelphia Experiment and John Titor."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A291RS0XAFVI6E"
                },
                "Date": "on November 2, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Enjoyable, fun, and short.  This book which was featured on Mysterious Universe was promoted for what it was; a collection of strange stories where time had been breached.  It does not get a full five stars because at times there seemed as if time anomalies and other paranormal theories seemed to clash.  It is still a good fun read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CE7EN4TBTG38"
                },
                "Date": "on October 16, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "True Time Travel Stories: Amazing Real Life Stories In The News by Richard Bullivant is an interesting collection of stories of time travel that make you think about the possibility..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NXOUSSXH6LKA"
                },
                "Date": "on February 10, 2014",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "3",
                "Text": "just some short stories out of the news, no real explanations or reasons, interesting to see the stories that made the news, but no ground breaking discoveries here, if your just looking for a quick read of strange stuff to kill time, have at it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2502D2N2TDOBN"
                },
                "Date": "on November 1, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "some interesting examples. easy digest and very thought provoking. it just underscores the fact that we are far from understanding our world and how time and space operates. found this book highly fun to read and a good place to start on th e path to learning more on this subject."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AU9C0B0F3JHW0"
                },
                "Date": "on July 16, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Having had a time shift experience (you don't want to have one), this book helped me understand my experience better and realize that others have experienced similar events. I found this book interesting as well as beneficial."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36ZXLLASZ6P27"
                },
                "Date": "on July 25, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I love the mystical things of this world that challenges mankind's arrogance in believing that we are all the intelligent life in this vast universe.  Starting book 2 right away."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3J0OEQ8Q28AO9"
                },
                "Date": "on February 18, 2015",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": "I at least expected more stories from people who claim to have experienced time slips. It all seemed very short and minimal and with no real attempt to verify facts."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KO324KKG4MI1"
                },
                "Date": "on December 6, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I found this such a quick and fascinating read. I loved the stories and lore, as well as the scientific studies that have been done. It left me wanting more!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BQCPTNANHLUL"
                },
                "Date": "on December 1, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Very interesting book. Several of the stories I had read/heard about before, but it was facinating to read the other stories, about the time slips."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1N652RRELNCL8"
                },
                "Date": "on March 30, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I thought this was well presented and very interesting.  I am buying the second book to learn more time travel incidents of ordinary citizens!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NLVH6X7ROY8S"
                },
                "Date": "on December 31, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Very easy reading time travel book, good stories with fascinating stories of the scientific study of time travel."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2M3D8QFVZ9DK2"
                },
                "Date": "on October 21, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "Not much new in the book.  Lots of speculation and few facts.  It was interesting or I would have given it a two."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACQHC5XIPG0QV"
                },
                "Date": "on March 31, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I thought this would be a rehash of old stories but found it to be well written and very enjoyable."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VBUE7EUCQH1N"
                },
                "Date": "on January 30, 2014",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": "Incidents presented as facts are so breathtaking. Need to do self research on these unsidents if one truly in to facts. A good collection of facts and good storytelling."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KQZT4H57XAXE"
                },
                "Date": "on January 8, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACFEAG8TVVI8X"
                },
                "Date": "on December 15, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "These stories seem believable. It's definitely worth checking out!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2E5CAABD78KG8"
                },
                "Date": "on March 1, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "I am a big fan of science fiction, but this book is about real life events that actually happened. I had never heard of most of them and once I started reading, I couldn't put it down until I finished. I actually read vol 2 first and liked it so much that I bought this one, also. This is the kind of book I wish I had written."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NM0VVM2VH5B4"
                },
                "Date": "on October 24, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I enjoyed this book so much I purchased the second one."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A328Y13OHDFQXR"
                },
                "Date": "on October 22, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Another great book by Richard Bullivant"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A131L6DEL8583O"
                },
                "Date": "on November 28, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "INTERESTING BUT NOT WHAT I EXPECTED."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HK8FCDKALWUX"
                },
                "Date": "on January 8, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Really makes you stop and think."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33JZF53E2HXAM"
                },
                "Date": "on November 17, 2014",
                "Helpfulness": 0.5,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AY98GPSJLSNU"
                },
                "Date": "on February 21, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "loved the book"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A148R759F9JW0A"
                },
                "Date": "on August 7, 2014",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": "Amusing, but don't let it fool you into thinking that time travel is a real possibility.  If one really could travel back and forth in time, one could go a little ways into the past and change it, which in turn would change one's memory of it, but how then to explain why your memory failed to notice the changes?  Also, a man could go into the future and attend his own funeral, being both the corpse and one of the mourners.  Time travel implies the ability to be in two places at the same time."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AS7BTP2LQT8XU"
                },
                "Date": "on January 9, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great book!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JOZIDHJXHASE"
                },
                "Date": "on April 10, 2014",
                "Helpfulness": 0.5,
                "StarRating": "2",
                "Text": "These stories are really just hokey UFO stories....ones we've heard over and over again from wacky wackos.  Nothing that even comes close to what you might consider a serious time travel anomaly."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QCQ33CIS7T5K"
                },
                "Date": "on May 6, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "The fact these stories are taken from headlines makes me very curious and intrigued. I did search for the source articles and indeed fond these accounts. So fascinating and tantalizing if true...right?"
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Time-Travel-True-Stories-Amazing/product-reviews/1508619352/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "51"
    },
    "Salesrank": "#389,990",
    "Timestamp": "2015-05-24 13:09:49.760716",
    "itemurl": "http://www.amazon.com/Time-Travel-True-Stories-Amazing/dp/1508619352"
}
