{
    "Category": "in Books (",
    "ListPrice": "$18.95",
    "Name": [
        "The Cosmic War: Interplanetary Warfare, Modern Physics, and Ancient Texts: A Study in Non-Catastrophist Interpretations of Ancient Leg"
    ],
    "OfferPrice": "$15.47",
    "Reviews": {
        "AverageStarRating": "4.4 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJRXCRZM4IP54"
                },
                "Date": "on February 3, 2008",
                "Helpfulness": 0.9368029739776952,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YARPLI6VMC3E"
                },
                "Date": "on November 23, 2007",
                "Helpfulness": 0.9107142857142857,
                "StarRating": "5",
                "Text": "This is about the third of fourth of Dr. Farrell's books that I've read recently and I must say his research and analysis hold up very well.  He addresses and answers the many anomalies of the Standard Model of Physics and also the many historical oddities that have been ignored or brushed aside.  His version of the history of our planet actually makes more sense than anything you might have been taught in school.  Of course, many of his conclusions by necessity have to be speculative, but it's speculation that looks to be closer to the target.  And he makes his case in a way that's understandable, accurate and fascinating."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KD8NJPZ01R37"
                },
                "Date": "on November 20, 2009",
                "Helpfulness": 0.9743589743589743,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14OJS0VWMOSWO"
                },
                "Date": "on December 2, 2007",
                "Helpfulness": 0.90625,
                "StarRating": "5",
                "Text": "A fascinating and detailed study offering an iconoclastic commentary that rejects traditionally naturalist and materialist assumptions to account for the presence of the asteroid belt in our solar system, Joseph P. Farrell's \"The Cosmic War: Interplanetary Warfare, Modern Physics and Ancient Texts\" asserts that what is commonly attributed in the scientific community as the result of gravity driven accretions of material, the asteroid belt is in fact the remains of an exploded planet whose catastrophic demise was brought about by a Cosmic War. Drawing upon extraterrestrial artifacts, novel ideas in contemporary physics, and the texts of ancient myths, Farrell intriguingly postulates an ancient interplanetary war fought out within our solar system with weapons of horrific power and sophisticated military technology. \"The Philosophy Of Rich\" is a fascinating read and especially commended to the attention to alternative archeology students and non-specialist general readers with an interest in ancient legends and cosmology. Also very highly recommended and iconoclastic reading are Joseph Farrell's previous books: \"The Giza Death Star\"; \"The Giza Death Star Deployed\"; \"The Giza Death Star Destroyed\"; \"Reich of the Black Sun; and \"SS Brotherhood of the Bell\"."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OICNXB30F29F"
                },
                "Date": "on August 25, 2011",
                "Helpfulness": 0.9333333333333333,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5O3KDOAL3M5R"
                },
                "Date": "on April 30, 2008",
                "Helpfulness": 0.8478260869565217,
                "StarRating": "3",
                "Text": "Everyone else before me has rated this 5 stars and to be honest, the content is good enough to warrant a top rating. The author has built a reasoned argument using earlier work by such non-conformist, alternative-knowledge and unconventional writers like Velikovsky (Worlds in Collision) Bruce Rux (Architects of the Underworld) and Zecharia Sitchin (Earth Chronicles)to present a theory about how the solar system evolved, the origin of the moon as possibly an artificial satellite and the planetary-scale wars between \"gods'' that led to planets being destroyed. All maybe far-fetched if you're not used to this sort of thing but if you keep an open mind, it's all good stuff.  The science might be difficult for some to follow, especially since it involves knowledge of physics. Still, even if you aren't scientifically inclined, you'd still be able to learn something from this thought-provoking book. But what annoyed me continuously throughout was the poor editing - this book is filled with spelling and punctuation errors. Worse, the author relies heavily on a seminal work on ancient knowledge and precession called  Hamlet's Mill by De Santillana and Von Dechend but mis-spells the latter's name in more than a dozen mentions as Von Dechind. I wonder how he would feel if another researcher were to use his texts as a springboard for their own work and consistently mis-spelled his name as Farel or Faril or Furell. Yes I know I'm being picky but \"suppose you red a book in which some words were often wrongly speled or ifthe spacings or punctuations were omitted, wouldn't it irritate you? Minus two stars then for the annoyance factor."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32X51A18H8N0C"
                },
                "Date": "on February 23, 2008",
                "Helpfulness": 0.9047619047619048,
                "StarRating": "5",
                "Text": "This is an excellent description of historical matters from earth's earliest (known) ages. It doesn't seem possible, at least not presently, to accurately depict everything that happened during these times, and who was on who's side, and was anyone on mankind's side(?) and yet, with the texts that are available, this seems to be as accurate a description as any. Ancient texts have often been considered myth in the past, because the tales seemed so fantastic, and far fetched, but as our science, and our understanding of the universe multiplies, suddenly the ancient texts make sense in an unexpected way. It seems that in this book, that \"unexpected way\" is well described."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Y4PXNBEL9WQ3"
                },
                "Date": "on August 31, 2008",
                "Helpfulness": 0.9285714285714286,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WGTTCU54M35C"
                },
                "Date": "on November 23, 2008",
                "Helpfulness": 0.875,
                "StarRating": "5",
                "Text": "Although the title seems crazy, there is a lot of information worth reading in this book. As a professional historian I have to say that the author has amassed a great deal of evidence, both direct and indirect fromm sources most people do not read or know that they exist.  You would do yourself a disservice to not read this if you think that the victors write the history books. Is it true?  That depends on what you believe is evidence and what is not. But everyone should judge that for themselves.  Read it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AU3GYRAKBUAEU"
                },
                "Date": "on May 4, 2008",
                "Helpfulness": 0.8421052631578947,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZVKR8J4S96DQ"
                },
                "Date": "on September 16, 2010",
                "Helpfulness": 0.8666666666666667,
                "StarRating": "5",
                "Text": "First of all, for anyone, like myself, who professes to be an avid reader of Zachariah Sitchin, this book is highly recommended.Farrell greatly expounds on the Cosmic War hypothesis, using ancient texts and sophisticated modern physics to elaborate on what Sitchin and others have theorized. I found the physics part of it a little overwhelming but that doesn't detract from his main argument, which is meticulously brought together from various sources. His ideas on  the \"Tablets of Destinies\" (and the intriguing possibility that it, or they,are still buried somewhere under the sands of Iraq)are fascinating. As well, the possibility of an Annunaki/human lineage stemming from Enki/Eve and Enki/Lilith, daughter of the notorious central character Nergal, and also married to Adam(!!),this is absolutely mind blowing. Also, Farrell's assesment of the moon, Mars and (most fascinating of all) Saturn's moon Iapetus as artificial satellites is convincing. Overall, I thought this book to be a \"fantastic read\", he's certainly opened up a giant \"can of worms\". Well done Joseph Farrell!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13LAHQM9405M4"
                },
                "Date": "on October 3, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CNEGXTWVTE2R"
                },
                "Date": "on December 21, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GE5TAN73Q3FA"
                },
                "Date": "on April 27, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANE321OEIUTBK"
                },
                "Date": "on June 16, 2009",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": "Author lays out a very interesting argument. Even if you want to take this book as fiction (Which it is not) it is still a great book. One of my more favorite books as of late."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMRBVWKGJBBDX"
                },
                "Date": "on June 9, 2009",
                "Helpfulness": 0.7692307692307693,
                "StarRating": "5",
                "Text": "Fascinating! I'll still need to read it a few more times and slower to remember all the connections between the different cultures' myths, the known sciences, the historical records, and be able to correlate them to very mysterious passages in the Bible."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A385C57HHE6MJI"
                },
                "Date": "on June 4, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21JTCPBN9U8A"
                },
                "Date": "on April 3, 2011",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "The scientific approach and evidence was excellent but far too technical and complex for the average person. The author does an excellent work in trying the sciience with other disciplines."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30VLCK31Z82DN"
                },
                "Date": "on March 5, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I loved it! great book! Joseph Farrell is fabulous author. Well researched and clearly written.I have enjoyed reading many of Farrel's books."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21M03BV4JQ899"
                },
                "Date": "on May 24, 2012",
                "Helpfulness": 0.7083333333333334,
                "StarRating": "1",
                "Text": "I was very excited about reading this book because I believe that human history is much, much older than scientists claim. And I also believe that intelligent civilizations have risen and fallen on Earth for millions of years. However, anyone with half a brain will find this book a joke because 75% of the book is quoting other writers work. But that's not the main problem with it because Dr. Farrell does credit all source material he uses and his research was very deep indeed. What caused me to put this book down after only a few chapters was simply this: he says numerous times that the planet that used to occupy the asteroid belt was much larger and more massive than Earth but the inhabitants were \"Giants\" because there was much higher gravity on that planet than on Earth so they had to grow larger to adapt. This is the complete opposite of how gravity effects matter. If this missing planet was much more massive than the Earth then its inhabitants and even its geology (mountains, volcanic cones,etc.) would be much smaller in height than on Earth. The gravity would keep any and all inhabitants from growing larger than on a less massive planet such as Earth. Again, I am skeptical of many \"main stream\" scientific theories about our solar system but I do believe that the laws of gravitation are pretty accurate because they can and have been tested since Sir Issac Newton's discovery!! How are we supposed to take an author seriously (especially one who claims a PHD) if he doesn't even know how gravity effects living or non-living systems? That flaw in his thinking reads like bad science fiction!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3E8RRCZW4P9ZP"
                },
                "Date": "on May 11, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Spectacular! The author accomplished  what we only dare to dream about, to put together strings of long forgotten , undervalued stories into the serious , complex and fascinating  picture of our past . This work is not to be taken lightly!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4GVKS32S5Y2H"
                },
                "Date": "on September 13, 2012",
                "Helpfulness": 0.75,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2P8517SOJGNPM"
                },
                "Date": "on February 20, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I enjoy reading Mr. Farrell's books. I find them to be fascinating and off the beaten path. Definitely food for thought. I love the fact that he is able to back up his statements with so much research."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TSM4PD5RDTN"
                },
                "Date": "on May 2, 2014",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "Well, Farrell is way way out there, as usual, but in this book he does make some interesting points.. It's the kind of tome that makes you go 'hmmmmm'."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34WIYAZSJNAVO"
                },
                "Date": "on March 1, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "What a mind bender. I will be reading all of Farrells books. If you ever had an inkling of thought that there is more to our world, politically, socially, monetarily, physically etc. Farrells well researched and thought out works will give you new perspective on it all. I am not a 'science guy' so some of the discussion is out of my knowledge base but other content allowed me to understand the larger points that were being made. If you are into studying history and current events but have become bored with the same, tired narratives, Farrell's books will re-ignite your love of learning about the human experience."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OPSPL8LSSJPC"
                },
                "Date": "on October 13, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "he does a good job of looking at such a strange and incredible subject as objectively as possible, given the scant nature of evidence, and how far outside the norm such a subject pushes oneself. that said, it has been a great read so far, as many books show, there is so much scientific data out there the average person is not privy to, or doesn't care to learn, so as you read some of it it isn't a total shock that there is so much we are in the dark about. leave it to modern man to hide things we don't know about as to not look foolish."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VCF3O31Z5KIV"
                },
                "Date": "on May 3, 2008",
                "Helpfulness": 0.7,
                "StarRating": "5",
                "Text": "A rich conpemdium for both the scientific mind and lovers of history. Abundance of facts, useful chronology, intelligent analyses, plenty of material to sink your teeth in. A serious work, no question asked. Will this remarkable book convince the ordinary minds? No. But it will incite them to question many vital things surrounding their world. Highly recommended! Buy a copy for sure!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2B8IAIGEHPW28"
                },
                "Date": "on June 14, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "As with his other books lots of over-my-head physics but the point still comes through and its very interesting. This posits an alternative to the Ancient Aliens theory, and yet could also fit in with it: the aliens could have been us."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APJCS3LZ9E6J1"
                },
                "Date": "on April 26, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "although all speculation kudos to the intense research involved.  the theory is exposed in methodical step by step progression with  all the information at his disposal.  believe or not...still worth the read"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VZTLW144HDL9"
                },
                "Date": "on August 7, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Fun read interesting and thought provoking. There is much to be said of the topics discussed in this book and Farrell covers them fairly and honestly."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A128C0DX3518XO"
                },
                "Date": "on November 26, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Absolutely Brilliant Information. I listen to Joseph's weekly news update on youtube too. He's a great guy."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CV54ZHQ88VPF"
                },
                "Date": "on February 16, 2009",
                "Helpfulness": 0.6551724137931034,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24J66Y83BOV1G"
                },
                "Date": "on January 17, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Dr. Joseph Farrell has written a book in grand measure and scope. It is superbly cited, biliographed, and its topics are threaded in such a way that his case FOR this can be comprehended layer upon layer as his narrarative moves from the Epilogue to the End. It busts open the case for the following topics: What really are the mechanisms that caused Valles Marineris chasm on Mars, how far back in antiquity does humanity stretch? How do the Mythology and Metaphors of Antiquitous theological texts from Sumer, Babylon, Egypt, and Hebrew, relate to this cosmic war between the Gods. How do the Nazi research of THE BELL fit into this? How is Govt suppression related to physics, archaelogy, solar system research? Are these related in terms of Disclosure of EVERYTHING?"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MT9G4WVAVDNV"
                },
                "Date": "on May 3, 2008",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "In this book you will visit the two ends of the spectrum. The past and the present, even the future. A very important analogy study in depth. Read this book, you will learn something. I enjoyed reading it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ROQ4Q2BSC93C"
                },
                "Date": "on March 30, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Joseph P. Farrell has extensively researched many of the US Government's \"Black Projects\", and is a leading authority on our true history and the current state of \"The State\" between our brothers and sisters whom share the Galaxy, the Universe, and the Multi-verse, and human beings who inhabit Earth."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1957RB0QFJIH4"
                },
                "Date": "on May 22, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Lots of historical perspective in here, even if you do not embrace the full extent of the ideas proffered.  I never thought I would find history this engrossing.  Speculative at times and may not embrace some other ideas which could explain some of the same observations."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZLHOUUM0ASUZ"
                },
                "Date": "on August 23, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A real dazzler.  It could just be the absolute truth.  J. Farrell takes us on far journeys and shows us things we are not always familiar with.  Another  learned lesson of the past and he backs it up with hard research."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZUWIXFAKX3DR"
                },
                "Date": "on April 11, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The most comprehensive material available today. It gives the average citizen insight into our solar systems ancient past as a reference point to better understand our present and prepare for the future!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13LTX8J9EX4ML"
                },
                "Date": "on November 14, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Incredibly cohesive arguments! Astonishing from start to finish! A symphonic blend of understanding emerges from the correlative synthesis of works spanning from ancient texts to modern scientific works."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3B75UV7L81X2U"
                },
                "Date": "on February 21, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great books and really thought provoking.  It is a very exciting read.  It is hard to put down.  I plan on reading some more of Joseph Farrell and love the \"high octane speculation.\""
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWBFRGM84B20W"
                },
                "Date": "on October 23, 2009",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "Great reading for the open minded. You are wasting your time if you read it with skepticism."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A311FPQVZM5X3P"
                },
                "Date": "on December 27, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I think besides the Bible, this is my favorite book. I have read it twice and Joseph P. Farrell shines in this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14ZPXUD0Z7SYP"
                },
                "Date": "on February 18, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "science fiction could be science fact, things the mainstream won't tell you."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQOF0GQF2EWJM"
                },
                "Date": "on September 25, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is an EXCELLENT book, as are the rest of Joseph Farrell's books."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A313PBJQHR2OW2"
                },
                "Date": "on September 6, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Very out there but I evnjoyed it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOR1T4HASREN5"
                },
                "Date": "on January 20, 2008",
                "Helpfulness": 0.6190476190476191,
                "StarRating": "5",
                "Text": "Reads like the science fiction of Robert A Heinlein or James P Hogan come true, and author claims this will all be confirmed in times to come!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DFCSQJ8KJ61R"
                },
                "Date": "on April 29, 2015",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "This is very deep reading"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MN5XEOXPEKWO"
                },
                "Date": "on February 16, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great insightful piece ."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OT7FVMJK598T"
                },
                "Date": "on May 8, 2009",
                "Helpfulness": 0.5555555555555556,
                "StarRating": "4",
                "Text": "This is an interesting book, speculative and somewhat academic, from a cogent writer and speaker who is fast becoming a modern icon in the genre. All of Farrell's work is well researched and tends to verify the work of those who came along before him - in this case Zecharia Stichin and his Earth Chronicles series."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3M8I0D66160L4"
                },
                "Date": "on May 18, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHJMAJSHT7R3P"
                },
                "Date": "on October 2, 2013",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": "as long as your a physicist and can understand the basis of his theory,which is not his at all but Van Flandern's you might get something out of it. also using research by Hoagland is realy stretching it.i guess the bottom line is if your a physicist you might actually get something out of it.For me it was a waste of time."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CUUDM1LEUS01"
                },
                "Date": "on March 29, 2014",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "excellent.  A good overview of ufo's and their impact on mankind. the book gives the reader a real insight into alien technology."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EDHKYDP494FN"
                },
                "Date": "on November 23, 2012",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "3",
                "Text": "This is an interesting book. I believe it is a little far fetched about a cosmic war. Most likey a collision of planetary bodies. I am looking forward to reading His Giza Death Star trilogy."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30B3GCBKYL22J"
                },
                "Date": "on April 19, 2014",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VG0K8BQDDJH9"
                },
                "Date": "on February 22, 2009",
                "Helpfulness": 0.5555555555555556,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20MDSBKC74T5Z"
                },
                "Date": "on March 7, 2010",
                "Helpfulness": 0.25,
                "StarRating": "5",
                "Text": "We are being asked by the author to believe his concliusion , which seem at times , far fetched , and yet , well researched , well informed, and discomfortingly logical. Certainly for answer seekers about our solar system history. Have we been here before?"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11KI7RTLX47GC"
                },
                "Date": "on November 15, 2008",
                "Helpfulness": 0.2857142857142857,
                "StarRating": "5",
                "Text": "I couldn't put this book down. I didn't notice anything written in The Cosmic War that contradicted the Bible, and also it expounds on consepts that most Pastors wouldn't bother to put out there because the information isn't considered foundational.  Someone I mentioned this book to told me that the information distracts from the Gospel's message and would only confuse people, I disagree. Faith comes from the Word of God, but this book could make a skeptic rethink their perspective enough to research further. If you are well grounded in your faith, and already have a secure relationship with Christ, this book is GREAT. However if you are not, then this book is only very very good."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31T39T483V9QV"
                },
                "Date": "on September 1, 2008",
                "Helpfulness": 0.25,
                "StarRating": "3",
                "Text": "Joseph P. Farrell is man who fearlessly follows the truth wherever it leads.  How much scientists and spiritual seekers could learn from his extraordinary example!  If you already have your mind made up and don't want to be confused with the facts about this subject, DON'T READ THIS BOOK!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WRZST8NYNA6B"
                },
                "Date": "on August 29, 2008",
                "Helpfulness": 0.3902439024390244,
                "StarRating": "1",
                "Text": "I've been reading this book for awhile now I have to say the author says a great deal but what he writes is empty. Many passages with references to ancient texts and myths and yet for a volume filled with speculation about cosmic war and epic battles, it fails to spark my interest, like opening a box of tastey cookies only to find they are horribly stale."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Cosmic-War-Interplanetary-Non-Catastrophist-Interpretations/product-reviews/1931882754/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "59"
    },
    "Salesrank": "#275,682",
    "Timestamp": "2015-05-24 12:46:26.730719",
    "itemurl": "http://www.amazon.com/Cosmic-War-Interplanetary-Non-Catastrophist-Interpretations/dp/1931882754"
}
