{
    "Category": "in Books (",
    "ListPrice": "$29.95",
    "Name": [
        "Meeting the Universe Halfway: Quantum Physics and the Entanglement of Matter and Meaning"
    ],
    "OfferPrice": "$25.96",
    "Reviews": {
        "AverageStarRating": "3.8 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34IM1VGCGSDSN"
                },
                "Date": "on September 24, 2007",
                "Helpfulness": 0.8648648648648649,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACXD76INXY13U"
                },
                "Date": "on February 1, 2014",
                "Helpfulness": 0.9375,
                "StarRating": "3",
                "Text": "Barad is an ex(?) - theoretical physicist. She is able to explain her ideas clearly - which is a wonderful change from many \"continental\" philosophers. I had no trouble with the physics but I have a degree and 25 years experience in medical imaging so I might not be an average test case. Her basic point  is that we should be more aware that things do not always pre exist properties rather they come into being via property-relations -in fact jointly with context. Put this way it doesn't sound very world shattering or original, however this is where the book enters concept inflation mode rendering it tedious to read: Firstly Barad shoots first person pronouns like a maniac. Secondly she repeats her arguments dozens of times -sometimes using identical words. Thirdly she claims, in early chapters,  to use a non-representational non-metaphorical discourse called 'diffraction' with a  claim to be non metaphorical we will understand by the end of the book - there is however no clarification forthcoming and in the notes she seems to have changed her mind -diffraction is demoted to metaphor (a useful one though I think). Fourthly she bases her position on \"a cut\" that is made in the phenomenon - on one side (apparatus side) the degrees of freedom are massively reduced - this universal distinction is not implemented or dependant on human or even indeed biological involvement. Clearly then, she proposes a piece of physics - however little unqualified (very) evidence is supported and there is no attempt to explain how classical physics and the world of things arises - in other word the crucial problem of scale is just bypassed. Fifthly she veers towards the crackpot in some of her feminist applications of the \"cut\". The juxtaposition of feminism and the philosophy of physics needs grace and careful handling - Barad is rather too full of her own importance to say anything useful here, in fact she is probably quite unhelpful. Sixthly I think she should have drawn more attention to prexisting highly related similar approaches. For example the central concept of dependant co-arising advanced by Buddha more than 2500 years ago. This might have given her a more productive steer. Barad has the drive, passion and talents to work in this area it would be great if she de-emphasised the premature and naive social interpretations and the cliche science journalism. She has too much talent to  waste time on just firing off words however easy she finds it to write in these other styles."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DYUBZNOXQPCV"
                },
                "Date": "on December 13, 2010",
                "Helpfulness": 0.8823529411764706,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PQLK297IBLHI"
                },
                "Date": "on September 11, 2007",
                "Helpfulness": 0.8666666666666667,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A67XDSSTO6D35"
                },
                "Date": "on May 8, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KK8YZXRYWKI3"
                },
                "Date": "on May 14, 2013",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "after reading so many others on this topic, this was a good read...thought provoking and educational as well, deep thinking..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DGJVGTOE563T"
                },
                "Date": "on June 6, 2012",
                "Helpfulness": 0.10344827586206896,
                "StarRating": "1",
                "Text": "IMHO, the author unskillfully combines established facts and theories from physics with wild speculations, many of which are \"not even wrong\" (as W. Pauli is quoted to say). I would rather not waste extra time on detailing specific examples but would suggest to a potential buyer: try to get somewhat familiar with this \"book\" first before deciding whether to buy it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3Q5SUKKDFE5HQ"
                },
                "Date": "on January 7, 2008",
                "Helpfulness": 0.03333333333333333,
                "StarRating": "4",
                "Text": "I think that all in all, this product lived up to all of my expectations."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1K9F3A74053IN"
                },
                "Date": "on November 19, 2007",
                "Helpfulness": 0.06593406593406594,
                "StarRating": "2",
                "Text": "The description and reviews are enough to rate this.  Any intellectually astute atheist since Spinoza could tell you absolute freedom was impossible, and determinism has been defeated both mathematically and by quantum mechanics.  No recondite postmodern obfuscation is necessary."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Meeting-Universe-Halfway-Quantum-Entanglement/product-reviews/082233917X/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "9"
    },
    "Salesrank": "#68,392",
    "Timestamp": "2015-05-24 13:24:42.171436",
    "itemurl": "http://www.amazon.com/Meeting-Universe-Halfway-Quantum-Entanglement/dp/082233917X"
}
