{
    "Category": "in Books (",
    "ListPrice": "$12.95",
    "Name": [
        "Science and Music (Dover Books on Music)"
    ],
    "OfferPrice": "$10.26",
    "Reviews": {
        "AverageStarRating": "4.3 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANDO9OR68P8GL"
                },
                "Date": "on December 16, 2006",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQLKBEVHUQ0JK"
                },
                "Date": "on December 24, 2006",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "If you're a technical dummy like me, but what to understand some of the basic concepts behind how music, in particular soundwaves, are created work and behave... this is a great book.  - - The author seems genuinely sincere in wanting to convey the concepts behind the science of sound to the everyday people and makes no attempt to intimidate of show off.  - - No, after reading the book you won't be an expert acoustic engineer, but you might want to take further steps to become one...  Topics start with the human ear, how sound waves are made/what they are -- the book explains frequency, harmonics, disonance, tuning systems, how scales and chords are put together to get these waves to behave the way we want them (and what happens when they don't)  and then takes a look at a wide variety of instruments - - what factors control the sound in a room and lot's more.  - - The author's ability to give simple examples that are very eas to visualize is a strong point of the book.  - - If you are looking for something very mathematical and that assumes that you're a physics whiz, the book might not be so interesting, however, if you're a musician, there's a lot of insight to be gained by reading the book... and to boot... its very concise and has a great flow.  In conclusion:  even as a music teacher I would suggest my students to give this a read - - and the abstract realm of \"music theory\" will suddenly begin to make sense as get to wittness the source from where it comes from and realize that all it is is a bunch of logical conclusions which you'll be able to reach too after finishing the book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HPOFRUPO29AS"
                },
                "Date": "on January 24, 1999",
                "Helpfulness": 0.8125,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UR38E34LK60L"
                },
                "Date": "on April 15, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Every student of physics and every serious musician should read this book.  Having read many books on the \"physics of music\"  this is by far the best i have ever read.  Sir James Jeans offers incredible insight even approximately 70 years after is was written."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3J4Y42U3MKPAY"
                },
                "Date": "on January 1, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book covers the basics of what sound is, how we here it, and how this is relevant to music.  In some ways, this is a great summary of Helmholtz's fantastic work (from 1862), but *much* easier to read, and has the advantage of another 70+ years of research (Science and Music was originally published in 1937)."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EQ5D5JRSW23K"
                },
                "Date": "on August 3, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "There are numerous books on music theory and the science of sound, but what this book brings to the table is leaving mathematical treatment of the subject to geometry, and only geometry. Its presentation of simple harmonic motion, and then the superposition of multiple harmonic motions using circles and simple lines with geometric truths provides explanations that resonate with intuition."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASW77A8J0I068"
                },
                "Date": "on February 19, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This book would be ideal as an introduction to the physics of music for someone who has at least high school training in science and who knows music theory at least to the level of being comfortable with what temperament means. The reader would be especially well prepared if they have used a pipe organ because Jeans often talks about these as examples. Coming to the book, I did not have the level of music theory knowledge that I needed to absorb everything, but the writing is good enough that I never felt hopelessly lost when reading about things like descending fourths. And now I have been exposed to this terminology and at least know what I don't know. On the side of science, I think that pressure should have been explained more systematically. I found that Jeans often talks about pressure changes but never about the time over which the pressure is changed: are we talking about the instantaneous rate of change at a point in time, the average rate of change from one time to another, or the absolute change from one time to another? Of course these are things that one can find out, but I don't think the reader coming in ignorant of sound pressure would be able to answer the above question just from reading this book. It's because of this and because I think Jeans could have introduced the music theory terms he uses with some explanation for those who don't already know them (perhaps at the level of explanation someone would need to remember them who had learned the terms years ago) that I give the book four stars instead of five."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AU07870HW90FF"
                },
                "Date": "on July 20, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "This book is an adequate introduction to the physics of music and would benefit those wanting to know some of the fundamentals of what is actually quite a complicated subject.  Those fundamentals have of course not changed since the book was written, but I would suggest that the serious reader in this area, one desiring to understand some of the details of musical phenomena right up to current electronic keyboard devices, should obtain a copy of the several more-recently-written texts.  Sir James is well-respected for his popularization of a number of scientific subjects, but he was not particularly an expert at acoustics, so his name alone should have little to do with being a reason for purchase of this book."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 30, 2001",
                "Helpfulness": 0.6,
                "StarRating": "5",
                "Text": "SCIENCE AND MUSIC is great, but I should like to direct those readers interested in an in-depth more recent study to THE PHYSICS AND PSYCHOPHYSICS OF MUSIC by Juan Roederer."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on April 14, 1999",
                "Helpfulness": 0.5714285714285714,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7D78A6QADOSI"
                },
                "Date": "on June 25, 2013",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AY84NBVT7XQA9"
                },
                "Date": "on January 3, 2009",
                "Helpfulness": 0.2857142857142857,
                "StarRating": "5",
                "Text": "If your into mysticism, metaphysics, and related subjects, and are tired of throwing around words who's meaning you still don't really understand, such as \"resonance\" \"harmony\" \"harmonics\", \"scale\", \"vibration\", \"tone\" and et all, this book will make it all come to life for you. Not the authors intention to encourage such thinking at all, deep and profound metaphysical principles are nonetheless on every single page for those with the ears to hear. New Age groupies: Learn the definition of the words you use first, and you will be all the better for it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VJZYSXVAJYER"
                },
                "Date": "on May 24, 2010",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": null
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Science-Music-Dover-Books/product-reviews/0486619648/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "13"
    },
    "Salesrank": "#112,465",
    "Timestamp": "2015-05-24 12:41:24.467254",
    "itemurl": "http://www.amazon.com/Science-Music-Dover-Books/dp/0486619648"
}
