{
    "Category": "in Books (",
    "ListPrice": "$72.95",
    "Name": [
        "Theory of Elasticity, Third Edition: Volume 7 (Course of Theoretical Physics)"
    ],
    "OfferPrice": "$53.34",
    "Reviews": {
        "AverageStarRating": "4.1 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ABABZIT5EAW7"
                },
                "Date": "on July 23, 1998",
                "Helpfulness": 0.875,
                "StarRating": "5",
                "Text": "This is the Volume 7 of the famous Course of Theoretical Physics by L. D. Landau and E. M. Lifshitz. All serious students of theoretical physics must possess the ten volumes of this excellent Course, which cover in detail and rigour practically all the branches of theoretical physics. The Volume 7 treats the subject of the mechanics of deformable bodies. Unlike the major part of other similar books, the Volume 7 is concise and very elegant, and is at the same time detailed in the exposition of the basic elasticity theory. Moreover, it contains certain topics not usually found in other similar books, such as the theory of thermal conduction and viscosity of solids, and a detailed exposition of the fundamentals of the mechanics of liquid crystals. A highly recommended book!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 30, 2002",
                "Helpfulness": 0.7916666666666666,
                "StarRating": "5",
                "Text": "Timoshenko's book is a collection of exercises. Landau's book is a collection of ideas."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ENB6W7WW82A4"
                },
                "Date": "on October 20, 1999",
                "Helpfulness": 0.7368421052631579,
                "StarRating": "3",
                "Text": "The book is a classic in the field; it's well written and clear, with interesting  problems. However, the Publisher chose  very tiny fonts, sometimes lacking in toner. Overall they did a terrible print, hard to  read!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TKSGXTZTP3S9"
                },
                "Date": "on March 4, 2013",
                "Helpfulness": 1.0,
                "StarRating": "2",
                "Text": "Very disappointed, not with the text but with the multiple errors in the characters, apparently in making the text compatible the editor mixed up the notation in almost every page! Will ask for a return and wait for the printed version..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31YNTZ66XWHNC"
                },
                "Date": "on October 27, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Il n'est pas nécessaire de présenter la collection MIR ni ses auteurs qui, il y a 60 ans, ont tenté de créer une encyclopédie de physique et de mathématiques très bon marché, visant l'excellence sans compromis démagogique ni pédagogique : c'est dire à quel point les temps ont  changé . Dans ce qui était l'union soviétique, cette entreprise a conduit à mettre dans les mains de nombreux étudiants dont j'étais, des livres sur des sujets variés sans comparaison avec la littérature scientifique ni anglosaxonne ni française. Bien sûr il y avait dans la collection MIR quelques insuffisances mais beaucoup de ces livres alliaient l'orignalité de la démarche avec la pertinence des propos. Il a parfois été reproché l'abondance des mathématiques mais c'est en cela même que ces livres sont précieux. En effet il faut quelques efforts pour comprendre. L'elasticité est un petit bijou qui malheureusement avait disparu , on ne peut qu'encourager les éditeurs à rééditer toute la collection."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AU4QUV6QO4F7M"
                },
                "Date": "on January 8, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "It just doesn't make sense to compare Landau's approach to Timoshenko's. Timoshenko writes for engineers while Landau writes for theoretical physicists so either one of them sucks from the other's perspective. That being said I recomend this book for anyone interested in the subject because it is always enlightening to see Landau's insight"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GR0TEBQOW9PC"
                },
                "Date": "on February 18, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "i am getting ready for my PhD exam, and this book really help me out with study. Highly recommended! strong buy!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 28, 2000",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "4",
                "Text": "Timoshenko is a Russian genious scientist/engineer who has credits in theory of elasticity and vibration analysis.  Landau is a great physics educator in general but not an expert of elasticity.  If you compare any  elasticity book with Timoshenko's you will sure be very disappointed.  Anyway I think this book is still fairly well written."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HSAHNDXO8A0T"
                },
                "Date": "on March 30, 2000",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "3",
                "Text": "I was looking for something similar to Timoshenko's \"Theory of Elasticity.\"  This was not it.  I am a working mechanical engineer.  This book is aimed at the physicist/student.  It is 200 pages long and  crammed full of tensors.  They also hit on waves and liquid crystals. I may  or may not keep this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25G1J5JOTAX3S"
                },
                "Date": "on June 24, 2008",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": null
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Theory-Elasticity-Third-Theoretical-Physics/product-reviews/075062633X/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "10"
    },
    "Salesrank": "#350,568",
    "Timestamp": "2015-05-24 13:07:13.558574",
    "itemurl": "http://www.amazon.com/Theory-Elasticity-Third-Theoretical-Physics/dp/075062633X"
}
