{
    "Category": "in Books (",
    "ListPrice": "$49.95",
    "Name": [
        "Russian Spacesuits (Springer Praxis Books / Space Exploration)"
    ],
    "OfferPrice": "$37.46",
    "Reviews": {
        "AverageStarRating": "5.0 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HIF47373QFJZ"
                },
                "Date": "on March 26, 2004",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is an excellent book with details not before shown outside the formerly closed confines of the old Soviet space program, except in various technical society papers. It has many excellent b&w photos and diagrams of Russian spacesuits from the SK-1, used for Vostok, up to the most modern Russian investigations of Mars EVA suits. The text is somewhat general in content though well written. It is also done in the typical style of Russian/English transliteration. Readers in the West, if they have not previously read any Russian technical papers, may find the transliteration hard to follow at times; but, this does not detract from the value of Mr. Ibramov's good work. If I had any complaint about the book it would be two items. First, the book lacks some technical detail in specific areas, so it sometimes creates more questions than it answers. If I did not already have a background in pressure suits some explanations would have confused me. The inclusion of a few explanatory drawings could have avoided this. Second, while the book gives credit, for the first time, as to which designers at Zvzeda created various general concepts, it does not often shed light on specific contributions, or the dynamimics involved in individual contributions. Nevertheless,I recomend this book. It is a MUST for your library. If the reader wants a technical look at Russian spacesuits I recommend \"Pressure Suits and Systems For Work In The Open Cosmos\" by Abramov, Severin, Stoklitsky and Sharipov. It is, however, a nearly impossible to find textbook."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IRVUQP2ZCII9"
                },
                "Date": "on March 12, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17F2NEGBF8W94"
                },
                "Date": "on September 11, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Russian-Spacesuits-Springer-Praxis-Exploration/product-reviews/185233732X/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "3"
    },
    "Salesrank": "#1,280,494",
    "Timestamp": "2015-05-24 13:34:51.245393",
    "itemurl": "http://www.amazon.com/Russian-Spacesuits-Springer-Praxis-Exploration/dp/185233732X"
}
