{
    "Category": "in Books (",
    "ListPrice": "",
    "Name": [
        "GRE Physics w/ CD (GRE Test Preparation)"
    ],
    "OfferPrice": "$19.99",
    "Reviews": {
        "AverageStarRating": "1.9 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30574EFHBEEA7"
                },
                "Date": "on March 2, 2010",
                "Helpfulness": 1.0,
                "StarRating": "1",
                "Text": "To say that this book was poorly proofread would be an EPIC understatement.  As printed in the book and on the included CD, the first question of the first practice has an extraneous equals sign that means the correct answer cannot be arrived at through any math that a PhD in physics might use, let alone a recent BS.  There are consistent omissions within the review sections (including the explanation of the Dulong-Petit law, which omits the portion of the derivation that allows you to solve the related question on the first practice exam) rendering that information suspect as well.  The point of getting a review book is to minimize the time spent parsing through old text books, but this review book seems to expect you to do just that so as to not run afoul of an editorial department asleep at the wheel."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13HENYW69VQQ6"
                },
                "Date": "on April 9, 2010",
                "Helpfulness": 1.0,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFZ6JX1WKJ3JX"
                },
                "Date": "on April 13, 2010",
                "Helpfulness": 0.9285714285714286,
                "StarRating": "2",
                "Text": "I can't believe it's actually the 6th edition. The only reason this book helped me study was because I had to correct the answers it provided. I found typos almost consistently every two pages. It just seems like the authors did not take a second look at what they were writing. They give an equation for charge in an RC circuit, for example, and it does not even solve the differential equation. I had to solve the problem myself to find the right answer. So it did help me review some topics, but only because I had to work from scratch to find the answers (which you don't have time to work out during the test, so it's easier to memorize them). I'd recommend getting this book in a later (7th??) edition when they have figured out that they really need to proofread."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQ1NK2KT5ZB4P"
                },
                "Date": "on March 9, 2010",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3S75WQHLJG9EA"
                },
                "Date": "on July 14, 2010",
                "Helpfulness": 1.0,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2O0WA7PWB5RB8"
                },
                "Date": "on December 20, 2011",
                "Helpfulness": 1.0,
                "StarRating": "1",
                "Text": "This book's \"review\" section is horrendous, there's hardly anything even remotely helpful, the entire section is filled with things you already know or things you don't need to know.  The practice tests were poorly proofread, and not even close to what is on the real Physics GRE."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7TR7DZ2D9YKU"
                },
                "Date": "on July 17, 2013",
                "Helpfulness": 1.0,
                "StarRating": "2",
                "Text": "This book is limited and contains errors.  I used the test as a rough guide so I would know what to expect, and the review sections just to gauge what level the GRE was at.  If I had more time I would have used more of the Case Western flash cards for the Phyics GRE"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1O76ETQCL8Q6I"
                },
                "Date": "on October 8, 2010",
                "Helpfulness": "",
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABZK6ZPI7QWR1"
                },
                "Date": "on October 27, 2012",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFQSQV8WM7L6U"
                },
                "Date": "on November 8, 2010",
                "Helpfulness": "",
                "StarRating": "1",
                "Text": "As my title says, absolutely terrible.  For starters, they don't maintain consistency in their variables; kinetic energy might be labeled T in one section and KE in another, which wouldn't be so bad if they would ever define their variables.  There is virtually no text, the entire thing seems to be a continuous list of derivations, which is great if that's how you learn, but again, it's difficult to pick up knowledge that way when they don't define their variables.  Finally, I've taken their practice tests side by side with the practice test that ETS sent me.  There is virtually no overlap between the two, doing well on the REA test is no predictor of doing well on the ETS test and vice-versa.  Having recently used the Princeton Review book to study for the General GRE, I expected more from a study aide.  I have been very disappointed in this offering."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TPXQYP0ZWF7U"
                },
                "Date": "on May 29, 2013",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VLMCOC05O2PL"
                },
                "Date": "on October 25, 2010",
                "Helpfulness": "",
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1K81NTXDUCY4U"
                },
                "Date": "on November 6, 2012",
                "Helpfulness": "",
                "StarRating": "1",
                "Text": "This book is absolutely terrible. There are typos and errors in almost every section, including the practice tests. Sometimes whole chunks of information are lost or rendered unusable. This is especially bad in the practice tests, as entire questions can be made unanswerable, or answer guides will give misleading proofs/introduce constants and variables with no explanation as to what they are, or why they are being used."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2B9GCL1UFB5OW"
                },
                "Date": "on October 6, 2010",
                "Helpfulness": "",
                "StarRating": "1",
                "Text": "This is one of the worst products I have ever purchased.  The number of errors and typos almost out-numbers the correct things.  A few problems into the practice-test solutions, you'll realize that you have encountered so many blatant inaccuracies that you clearly can't trust ANYTHING in the book.  If this is the 6th edition of something, the fourth edition must have come out of a toilet."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A399GLS14OED2Q"
                },
                "Date": "on September 13, 2011",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "The book is actually helpful for someone, like me, who try to get a good score on physics GRE, but don't know where to start. The book is actually pretty good guide. Practice exams are not bad either. However, still, there are lots of typos. If you are ambiguous whether or not to buy this book, I'll say, if you can spend 20 bucks on a meal getting this book is not a bad idea."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXUMFLD1B6Q5U"
                },
                "Date": "on May 17, 2014",
                "Helpfulness": "",
                "StarRating": "1",
                "Text": "I thought it was just me until I read the other reviews.  This book is a joke.  The \"detailed\" explanations are not detailed at all.  They state equations that are no where to be found in the preceding review sections.  Also, there aren't any practice problems in the review sections.  I'm going to return this book and look for something that will actually help prepare me."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11PZJ8YBL31PO"
                },
                "Date": "on June 27, 2012",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": "There are so many typos in the equations in this book.  Some of its obvious cause its not consistent from line to line, but others you would need to know the equation to catch it. I looked at the older version of this book, which is pretty much the same content, but with fewer errors."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RXM9V176BKTA"
                },
                "Date": "on December 17, 2012",
                "Helpfulness": "",
                "StarRating": "1",
                "Text": "I completely regret buying this book - I wish I had looked at the reviews on Amazon first! I only got through one chapter of the book and found so many errors that I had to give up. Don't they employ people to proofread and error-check at publishing companies?"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FG240AF01I8V"
                },
                "Date": "on January 24, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "It was almost brand new, the CD was also included. No scratch, however it was delivered a little bit late almost the last day of approximate delivery date."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5U55ATD7WG68"
                },
                "Date": "on November 14, 2013",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "This book was decent for studying, has practice tests, it helped some. This is just to meet the word requirement"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGJJL9SZXJFAZ"
                },
                "Date": "on February 5, 2013",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "good review, but practice problems not the most characteristic of actual test.  Previous (released) real tests are much better.  not bad, though."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/GRE-Physics-CD-Test-Preparation/product-reviews/0738606596/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "21"
    },
    "Salesrank": "#834,183",
    "Timestamp": "2015-05-24 13:29:41.231638",
    "itemurl": "http://www.amazon.com/GRE-Physics-CD-Test-Preparation/dp/0738606596"
}
