{
    "Category": "in Books (",
    "ListPrice": "",
    "Name": [
        "Student Solutions Manual for University Physics Vols 2 and 3"
    ],
    "OfferPrice": "",
    "Reviews": {
        "AverageStarRating": "3.1 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CNCZU29LIYZ5"
                },
                "Date": "on March 6, 2009",
                "Helpfulness": 1.0,
                "StarRating": "1",
                "Text": "I was incredibly frustrated with this manual. I had it in my mind that I would study by doing a large number of the odd problems and compare it with the solutions manual, thereby allowing me to learn the concepts better. Unfortunately, I didn't realize that less than half the odd problems had explanations, and the problems that did exist had scant detail as to the problem solving strategies used to find the solution. This was annoying for me, as I like to see detailed solutions and lots of them. That's how I learn. This book was a waste of money. Even more frustrating, the instructor's edition does have ALL the answers--so why they couldn't bring it upon themselves to at least put all the odd numbered answers in this book, I can't say."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXYFQ6SEO5VK1"
                },
                "Date": "on November 23, 2008",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "This was a good study guide as it is consistant with the book in the presentation.  However, if you are looking for anything more than what the book explains then this is not it.  It will give you the answers to almost seemingly random problems and there will be some your instructor will assign that this manual won't have (there book has all of the answers).  If you want all of the answers I would suggest finding the instructors manual."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20X890TSPGSAQ"
                },
                "Date": "on October 15, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Like all solution manuals recommended by teachers not all problems are worked through, but all solutions are explained most of the time in great details. You'll have every other odd problems that can be used as examples or even templates. A must have to succeed and understand physics. I saved a lot of time on my homework and I understand better the concepts and how to twist the formulas to solve problems. Great investment."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LT6XRP47D8ZK"
                },
                "Date": "on June 10, 2009",
                "Helpfulness": 1.0,
                "StarRating": "1",
                "Text": "Most of the even solutions are present but not all, I don't know why. What is there is better than nothing, but it's hard to justify the price. Too bad I can't find a teacher's edition."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NEFUDAV5SH10"
                },
                "Date": "on February 20, 2011",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": "A very frustrating way to study. You expect this manual to provide detailed solutions for all odd-numbered exercises. Countless times I have completed a problem, looked for the solution to check my work, only to discover that it isn't included! There seems to be no rhyme or reason to which odd-numbered problems are included and I honestly feel like it prevents me from learning some important concepts that I'd like to practice. Buy with caution!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SPMRTXUORG66"
                },
                "Date": "on February 26, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2O8MRLKCH9S5M"
                },
                "Date": "on December 7, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The solutions manual is useful for those who need help and those who need to check their answers.  It does not have all of the answers to each problem, but you can still learn a lot from the selected problems answered to hopefully help you other similar problems in the textbook."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3J903KK6KOFO4"
                },
                "Date": "on June 6, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VK02TUTQP35B"
                },
                "Date": "on October 3, 2014",
                "Helpfulness": "",
                "StarRating": "1",
                "Text": "The solutions manual is only odd-numbered and some of the odd-numbered problems are not even there."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEWZ829BWS302"
                },
                "Date": "on February 11, 2013",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "This book don't know me.  It tryin' to trick me wit all it's explanations and equations and tryin' ta play dat game bout greedy money and rich ppl who wont pay their fair share.  Shiiiii."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Student-Solutions-Manual-University-Physics/product-reviews/0321500385/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "10"
    },
    "Salesrank": "#577,880",
    "Timestamp": "2015-05-24 13:34:03.565516",
    "itemurl": "http://www.amazon.com/Student-Solutions-Manual-University-Physics/dp/0321500385"
}
