{
    "Category": "in Books (",
    "ListPrice": "$16.95",
    "Name": [
        "Cycles of Time: An Extraordinary New View of the Universe"
    ],
    "OfferPrice": "$14.52",
    "Reviews": {
        "AverageStarRating": "3.5 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BKE8B96MMQER"
                },
                "Date": "on October 16, 2010",
                "Helpfulness": 0.9834710743801653,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14AD0NQTRVVJC"
                },
                "Date": "on May 6, 2011",
                "Helpfulness": 0.9411764705882353,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVYG1RU7EWZKG"
                },
                "Date": "on November 1, 2011",
                "Helpfulness": 0.9583333333333334,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Z2JFJJZP3D7M"
                },
                "Date": "on May 7, 2011",
                "Helpfulness": 0.821917808219178,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YC54ICKWE89U"
                },
                "Date": "on June 24, 2012",
                "Helpfulness": 0.9230769230769231,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TA4AIMWDPKX4"
                },
                "Date": "on July 27, 2012",
                "Helpfulness": 0.9090909090909091,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39UJHY1EGTDVZ"
                },
                "Date": "on December 31, 2011",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SFTMZMKZ4IT"
                },
                "Date": "on October 6, 2011",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2809U2S14N0K1"
                },
                "Date": "on July 14, 2012",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28DPWQWUGETEV"
                },
                "Date": "on June 12, 2012",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "\"Cycles of Time\" by Roger Penrose.  Roger Penrose is an erudite and acclaimed  mathematical physicist who has written a book about cosmology that a vanishingly small number of people will actually be able to read, but we can all gain some glimpses into modern physics and some visions of cosmology, according to our preparation and our concentration  level.  Basically, he proposes an old-new cosmology of repeating cycles, or aeons, of 10**100 (ten raised to the 100 power) years or so, in a very loose sense intermediate between the older steady-state model and the more recent big bang model.  He motivates the need for a new model in order to reconcile cosmology with the Second Law of thermodynamics, namely the inexorable increase in entropy, or disorder,  in the universe.  Penrose provides an intuitive picture of entropy as a measure of disorder, which will be helpful to people at all levels in understanding this murky concept.  It is when he \"explains\" the need for his new model in terms of the conformal geometrical structure of the universe that he will lose most readers, but those that bear with it will be rewarded by an edifying summary of other cosmological models and  their implications for the ultimate future of the universe.  According to the current favorite big bang model, the mass of the universe will accrete into black holes at the center of galaxies and Hawking radiation will slowly convert this mass to radiative energy, and the universe will end in a series of small pops of dead black holes producing a sea of massless photons and gravitons.  But not to worry, because this will be another 10**100 years, which raises the question why so many talented physicists are spending their time working on cosmology when there are so many nearer term problems."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FNZYP0LUFDJ7"
                },
                "Date": "on July 13, 2011",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": "i bought the audiobook.it was smooth and clear.the originality of thought, idea and command of physics and mathematics make this product a must for all lovers of science. there is no democracy in physics my friends and i hate to see a bunch of physicists hugging and agreeing with each other at a time when our understanding of science is only at it's infancy.no lover of physics will retire from physics for the simple fact that it is not a job but a calling.READ AND MAKE UP YOUR OWN MIND."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15JVGVXK15C1"
                },
                "Date": "on December 29, 2012",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "I have great respect forRoger Penrose who is well known in the scientific community for his ideas on cosmology and the role of humaity and human consciousness within the cosmos but meakes it a bit difficult for the lay public to access and understand his theories, esecially in regard to his prolfic use of complex mathematics throught his book. I'd love to be able to fllow his story line all the way through and that  Iwould value his findings, but, due to my lacking of an advanced knowledge of of math, I just don't have the \"where-with-all\" to be able to decipher his text!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24REOGXQ9MDBK"
                },
                "Date": "on May 21, 2013",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "The book is okay, but it would be a very difficult read of the average reader. You should have some background in physics and preferably quantum mechanics. It definitely has some interesting idea though. I particularly like his discussion of entropy."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3K75WXQKHH8GZ"
                },
                "Date": "on September 22, 2011",
                "Helpfulness": 0.75,
                "StarRating": "2",
                "Text": "As a lay reader of popular physics books, the amount and level of mathematical knowledge required to comprehend this book in any depth is beyond what was expected.  This was very disappointing because I respect Roger Penrose and his original ideas, and wanted to understand more of what he was saying."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANPZS3FNDBKC8"
                },
                "Date": "on December 16, 2010",
                "Helpfulness": 0.7012987012987013,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JN8LCO5HVJN0"
                },
                "Date": "on December 7, 2012",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "Dr. Penrose writes for the math-enabled, and hopefully the reader is able to grasp the concepts involved. Be prepared to try to understand Tensors and Fields if you don't understand them already, although he endeavors to explain them."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A180JF63FHWMH2"
                },
                "Date": "on January 19, 2012",
                "Helpfulness": 0.75,
                "StarRating": "2",
                "Text": "Excessive detail on the fundamentals obscures the big picture messages the author references at the beginning, thoroughly disappointing, expected more clarity and better balance for such an eminent physicist.  I never did come to grips with why he does not accept inflation and why there's reason we can \"see\" events before the Big Bang. Cannot see the forest for the trees!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HYD9BOFKCUVV"
                },
                "Date": "on September 20, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JSUW5FF0MOT2"
                },
                "Date": "on March 25, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "tHIS BOOK RELATES TO 3 COSMOLOGY QUESTIONS: What came before the Big Bang, What causes order in the Universe, & What cosmic future awaits us.  The cosmic microwave background is elucidated.  A physics background is helpful for understanding all the discussio.  Two appendicies give mathematical details.  An excellent presentation."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23FNCIBRXS1UV"
                },
                "Date": "on April 8, 2014",
                "Helpfulness": 1.0,
                "StarRating": "2",
                "Text": "Yesterday I attended a public lecture by Sir Roger Penrose, who said that the U.S. version of Cycles of Time contains several printing errors (he didn't elaborate on what these are) that do not afflict the U.K. version. So maybe you should purchase his book whilst in London."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A303N34LYPC1X1"
                },
                "Date": "on April 15, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Most books on physics and mathematics are either too limited in their technical details/mathematics, or too far the other direction (all math, little concept/insight). Penrose's style in his \"popular books\" may be totally unique in that he discusses ideas in plain language like a \"for the layperson\" book, but also provides technical details (in an appendix at least). He will respect your intellect if you are looking for something deeper than a \"for dummies\" type discussion, even if you don't have a university education in science. So, in addition for the obvious target audience of The Interested Layperson\", the book would be excellent for practicing mathematicians and physicists looking to get into these new cosmological ideas on a research level, as the scholarly literature can be too terse and dense at first. In fact, the latter observation is what makes Penrose's books, such as Road to Reality gold. His technical literature is written brilliantly as well. Rarely is a person's communication skills on par with their scientific prowess."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25ZK0YFESBUIJ"
                },
                "Date": "on February 12, 2013",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": "I read thru the end of section 1.3.  Then read 1.2 and 1.3 again and made a half page of notes that I need to understand what he is saying.  I think there is a typo in his description of Fig 1.5 on page 23 (of the softback edition).  It should say \"...configuarations that appear to be _macroscopically_ identical are represented ...\"  to be consistent with the paragraph immediately above the figure.  I have a masters in physics and hope this book won't be uncomfortably complicated for me ....  I read some more since making the statements above.  Not much more.  Sure, his equations are in apendices, but it's still a very mathematical discussion.  And it's just too tedius to actually follow his arguments.  And it is full of little side stories, such as describing the concept of spin in particle physics, even though spin isn't related at all to his actual arguments, and that is distracting.  I doubt I'll read much past section 1.5 and I changed my evaluation from 3 stars to 2."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AA4GG23YVRFFD"
                },
                "Date": "on April 13, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is the description of not just our current visible Universe, but our past and future epochs as well. He explains forever, forever!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18HU3FUI7HQMS"
                },
                "Date": "on April 28, 2015",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": "Overall I liked the book due the intriguing speculation about cyclic universes. It starts gently, even spending almost two pages to describe logarithm and its additive property (!!!), but as you advance it becomes more and more complicated, and there are parts that are very hard to grasp, even by mathematically trained persons, as myself. For instance, he mentions coupling but does not explain it. It is not an easy book to read but the main idea is provocative. It gave me the impression that, as Penrose was writing the book, started to become impatient and glossed over many definitions. Conformal geometry diagrams are not explained properly. Seems that during the writing he started to assume that his readers would have the necessary training to understand all he describes, which is not reflected at the first chapters."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Z7SUOG081OX7"
                },
                "Date": "on May 2, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IR08KYVDCTXA"
                },
                "Date": "on May 5, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "I have a Kindle HDX 7\" and the immersion feature does not work as described. I pushed the may day button and the consultant checked all my settings and still it wouldn't work properly. Audio and text both work separately but not together. I was referred to audible.com and the consultant there was also not able to get the immersion feature to work. She said I would be contacted after the problem was  looked at by someone higher up the food chain but this never happened so it still does not work properly. So if that feature is important to you as it is to me that is the reason for the 3 stars. Otherwise  it is a very interesting book. Since immersion won't work, it is better to just get the text version. There are many diagrams and following with audible alone is not very useful."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SWOOIZK2YSGA"
                },
                "Date": "on April 12, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AO33R0PA20MH2"
                },
                "Date": "on November 15, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "The paper version is difficult to read due to its weight and is therefore impractical.Can we hope to obtain a Kindle version? thanks"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2L3O11NDN6I0K"
                },
                "Date": "on March 12, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3K3TQIZTA6344"
                },
                "Date": "on March 11, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "As usual from this scientist - another gift - well written, solid foundation, sound development, thorough, and bold. You can't get much more fundamental than exploring and redefining entropy and the \"beginning and end of time\". A reread for sure."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23RKDO59M7O03"
                },
                "Date": "on July 25, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "As with most books by Mr. Penrose, this one is superficially accessible, but not really comprehensible unless you have advanced degrees in mathematics and physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18NYU12SQ4CEG"
                },
                "Date": "on March 6, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is It! This is the voice of truth! The book is infinite pleasure, a companion of the soup of fraud we swim in."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17PJNLL97KMMJ"
                },
                "Date": "on April 29, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Sir Roger strikes again. This view of the universe is more correct than Penrose knows."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2A2IC7N64H66G"
                },
                "Date": "on July 25, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great book, interesting theories, and as always, Roger Penrose is a great writer."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2E31EO11BHE9H"
                },
                "Date": "on February 6, 2013",
                "Helpfulness": 0.6,
                "StarRating": "5",
                "Text": "Yes this work is not geared for the layman, though what Penose is offering is a viable new leading candidate for what happened at the moment of the Big Bang, and even before. The physics is amazing."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FZBKUCHLWR11"
                },
                "Date": "on November 21, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Typical Roger Penrose, continue to read over again"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LD9WEWWH4WCP"
                },
                "Date": "on February 18, 2014",
                "Helpfulness": 0.5,
                "StarRating": "1",
                "Text": "I quit reading this book about halfway through it.  The writing isn't that bad.  But people don't usually like a lot of advanced math in books.  I like books where physicists can explain their concepts without resorting to a lot of math.  This book has some of that math, but Roger Penrose primarily uses geometrical diagrams as arguments and explanations.  I don't think he gives a clear explanation of how the diagrams represent realities of space time or the concepts he discusses.  He repeats the explanations many times but that does not help.  He seems to be a little like Richard Feynman and his state diagrams which made sense to me, but I had trouble seeing their usefulness.  It took Lawrence M. Krauss to explain those clearly in his book \"A Universe from Nothing\"."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A217AN9VPMCDL4"
                },
                "Date": "on August 15, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent books from Dr.Penrose"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APU1GMNGV6JBE"
                },
                "Date": "on February 22, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Penrose is always a must read"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XLKHJ6OSOLTX"
                },
                "Date": "on July 1, 2014",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": "Those of plan to read this book should first familiarize themselves with works of Roger Penrose relating to Einstein's general theory of relativity and related topics. I acquired the book with the hope that it would provide for me (a solid state physicist) a pedagogical and reasonably detailed overview of Big Bang theory and associated topics such as Black Hole formation and evaporation etc.  The first few chapters of the book, focusing on entropy, are excellent.  I found the transition to black holes starting in Chapter 2.4 difficult to follow.  This is probably due to my lack of full-fledged initiation in the topic of general relativity.  After several attempts to make sense of the information in Chapter 2.4 and later chapters, I finally gave up.  I wished Roger Penrose's ability as a science writer matched his skills as a mathematician."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3U7GMI6F10X70"
                },
                "Date": "on February 20, 2014",
                "Helpfulness": 0.5,
                "StarRating": "1",
                "Text": "Fascinating subject.  But I gave up less than half way through.  Too many hand-drawn pictures that add no value, too many math symbols not explained.  Every page felt like I had sat down mid-way through a physics lecture and had missed the first half.  Could have been a good book, but Penrose needed to discuss and explain his ideas before setting about with proof-level details.  Waste of time, really.  And I have few cycles of those left."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BKTXBVWN201L"
                },
                "Date": "on July 11, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "great book"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2273BQGZNQI2T"
                },
                "Date": "on December 2, 2012",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": "I received Cycles of Time by Roger Penrose (paperback) so soon after ordering it I was unable to find time to read it for  about 2 weeks. It arrived in excellent condition along with a few others.  I was very pleased with the service.  As for the idea behind the book?  Those familliar with Roger Penroses work will recognise the style.  A clear approach to the subject, a clearing up of any possible sources of contention and comprehensive explanations with evidence to support the proposition being discussed.  I confess the mathematical details are a bit beyond me but the verbal explanations are easily enough followed if not exactly understood, and with the amount of math that I do have I think I was able to develope a fair idea of the argument.  For details read the book but it has to do with the second law of thermodynamics and entropy and huge, unimaginabley huge, lengths of time at the end of which the big bang smoothly emerges from the previous run down universe.  I am only an amature trying to understand what science has learnt and this book certainly helps answer (or should that be replace) a few questions that I had. Highly recommended reading (perhaps twice) for those who like to keep up with the latest cosmological ideas."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OZ1J7ZXKJXYJ"
                },
                "Date": "on June 21, 2014",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": "Penrose has written some extraordinarily thorough and detailed books on his subject. This is not one of them. This looks and feels rushed to make a publisher's deadline."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8Q3QSS7Z5J2E"
                },
                "Date": "on June 13, 2014",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": "Not much new here and tons of math and confusing graphs. Stick with Lee Smolin and Steven Hawkins. Following Penrose's convoluted reasoning is a drag."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RWCE4Z091YYR"
                },
                "Date": "on May 9, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Good"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3938FVCCPHATX"
                },
                "Date": "on June 17, 2013",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": "My husband loves all things physics and cosmology.  I always am looking to surprise him with books from Amazon on these subjects and I hit a winner with this one.  He loves it and would recommend it to anyone who is interested in the universe."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FXRHQAPYRYPY"
                },
                "Date": "on July 26, 2011",
                "Helpfulness": 0.4,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1O363SLA1D6L6"
                },
                "Date": "on October 8, 2012",
                "Helpfulness": 0.4,
                "StarRating": "5",
                "Text": "Great read if you like the non-fiction style. Easy to grasp for anyone who wants to know about the subject of time."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Q6LLULQANUVG"
                },
                "Date": "on January 11, 2013",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "Fascinating topic. Heard an interview on the John Bachelor Show and ordered the E Book. Seems to be a bit over my head though..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQLKG5111HY85"
                },
                "Date": "on April 1, 2012",
                "Helpfulness": 0.5483870967741935,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2E5A45PY8BUYQ"
                },
                "Date": "on June 26, 2013",
                "Helpfulness": 0.25,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AOCL7S4TG711"
                },
                "Date": "on August 9, 2013",
                "Helpfulness": 0.25,
                "StarRating": "5",
                "Text": "Scientists think about time and space and mind, and combine them together. Try to understand mind by investigate physics. Maybe it is long way."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KEOXUCR3621J"
                },
                "Date": "on March 9, 2012",
                "Helpfulness": 0.4375,
                "StarRating": "1",
                "Text": "In all fairness to Penrose, the worst problem of this audio book is the voice. A broken voice that projects weakness and sore throat, from a reader that obviously understands none of the topics presented, excruciatingly boring and irritating. This came after listening to the \"4% Universe\" by Pacek, a masterpiece of a reading on a similar topic!!! The shock was too much...and I had to stop the experience after the first chapters. Those chapters contained tediously laid out explanations of the first laws of thermodynamics followed by thousands of words to explain logarithms...! I feel that Penrose copied and pasted from earlier treatises so as to introduce more people to the principles presented later in the book. I might actually have to buy the book to get a taste of these, but I am too angry at him to even bother, especially after reading the other comments."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39O3W8F5OMV3O"
                },
                "Date": "on June 23, 2012",
                "Helpfulness": 0.38461538461538464,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12IY2LYUFBISE"
                },
                "Date": "on June 28, 2011",
                "Helpfulness": 0.2916666666666667,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A157JKZXM40CP9"
                },
                "Date": "on August 22, 2011",
                "Helpfulness": 0.08333333333333333,
                "StarRating": "3",
                "Text": "It is difficult for a naive person to understand the book. Reasoning are not strait forward and am not convinced by the author"
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Cycles-Time-Extraordinary-View-Universe/product-reviews/0307278468/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "57"
    },
    "Salesrank": "#55,322",
    "Timestamp": "2015-05-24 13:23:22.042014",
    "itemurl": "http://www.amazon.com/Cycles-Time-Extraordinary-View-Universe/dp/0307278468"
}
