{
    "Category": "in Books (",
    "ListPrice": "$28.95",
    "Name": [
        "Fearful Symmetry: The Search for Beauty in Modern Physics (Princeton Science Library)"
    ],
    "OfferPrice": "$21.30",
    "Reviews": {
        "AverageStarRating": "4.4 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ET0QY969VFYG"
                },
                "Date": "on May 13, 2009",
                "Helpfulness": 0.9655172413793104,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34TCCOLPWBBV1"
                },
                "Date": "on October 7, 2003",
                "Helpfulness": 0.9038461538461539,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36FCGWRSVBKQ0"
                },
                "Date": "on December 27, 2009",
                "Helpfulness": 0.8301886792452831,
                "StarRating": "2",
                "Text": "This review must begin with a description of the context in which I encountered \"Fearful Symmetry\" by Anthony Zee.  I'm looking for a text to help guide a course on symmetry, the basics of group theory, and the relationship of both to modern physics - all for a class of scientifically curious but mathematically challenged seniors (average age 75).  I first ran across Leon Lederman and Christopher Hill's book, \"Symmetry and the Beautiful Universe,\" which I read.  However, a friend, having seen the mixed reviews of Lederman posted on Amazon, suggested the Zee book as potentially superior, which I now have read.  Regrettably, I must report that compared to Lederman, Zee's book is a failure.  It has three major flaws:  1)  Zee continually invokes the concept of a creator seeking beauty, an aesthetically driven guiding intelligence, the designer - all concepts that have more to do with religion than with science.  Besides being annoying, the implicit assertion is that theoretical physicists are now intellectually in touch with the designer, and that the pathway to that contact is through the aesthetic appeal of symmetry.  While it is true that symmetry has been hugely significant in guiding the unraveling of physical theories, both past and present, it is absurd to suggest, as Zee does, some architect of the universe sitting down trying to decide which symmetry group should govern the universe.  That may be what Zee thinks, or it may be a large metaphor, but it doesn't matter - it perturbs the flow of ideas.  2) And it is precisely in the flow of ideas that this book really fails.  It is clear that Zee doesn't know his reader - how much basic science the reader brings to the book, and how much he or she hopes to leave with.  He deals with non-conservation of parity early in the book, way before establishing a context for understanding what a small fraction of the panoply of elementary particles is involved.  His treatment of the Lorentz transformation is just words - virtually no insight.  His treatment of gauge theory is equally barren.  In contrast, the Lederman book, which is willing to put its toe one unit deeper into the mathematics of each subject, deals with all three of these in a vastly superior order and with a much more satisfying level of detail (but still targeting the general reader).  3) Zee presents himself as a \"theoretical\" physicist.  At one point he even says he doesn't care how any particular nucleus behaves.  The arrogance of this statement is appalling.  Where does Zee think the insights he trumpets came from?  He argues, with success, that Einsteinean searches for fundamental symmetries have been important in whatever significant steps our theorists have made, but most physicists I know (and I have a PhD in solid-state physics) recognize the dynamic balance between experiment and theory that is needed for any real progress - a symbiosis of very different disciplines that are inextricably linked together.  Einstein could not have come up with his theory of the photoelectric effect without the data.  Nor would special relativity come out of a vacuum - the independence of the speed of light to changes in inertial frame was a hot experimental issue, not just a theoretical one.  Zee pretends to float above all this mundane dealing with experiment, and it makes him look bad, philosophy-of-science bad, at least in this reviewer's eyes."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HMF1QVSBV2SJ"
                },
                "Date": "on July 11, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19HLI48NW08GH"
                },
                "Date": "on August 9, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book provides an excellent intro and overview of modern physics, from Noether's theorem to Yang-Mills theory. Most gauge theory books and quantum field theory books are highly mathematical but short on exposition. This is an ideal book to read while tackling the harder stuff like Zee's \"Quantum Field Theory in a Nutshell\".  Zee has one of the best writing styles of any hardcore physicists. Also Recommended is Kerson Huang's \"Fundamental Forces of Nature\"."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 13, 2000",
                "Helpfulness": 0.8461538461538461,
                "StarRating": "5",
                "Text": "This a wonderfully well-written book that explains in clear and often witty prose -- with little if any math -- what particle physicists do. If you've ever wondered what goes on inside the atom, then this book's for  you. I loved reading it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YQ6AURPM1YRT"
                },
                "Date": "on September 16, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Fearful Symmetry is the most soothing physics book I have ever read.  Perhaps soothing is a strange word, but by analogy, reading Feynman is like riding a race horse, while reading others is like being in a rather bad nightclub or being lectured to by a kind but stern uncle.  All are worthwhile in their own ways, but none are soothing.  Reading Fearful Symmetry is like listening to Schubert by a warm fire on a cold winter's night.  Anyone who loves science will enjoy this wonderful look inside the soul of physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23S10KJURBO2"
                },
                "Date": "on February 26, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Anthony Zee is one of my favorite contemporary physics writers. His work 'Fearful Symmetry' shows how beautiful the framework of modern physics can be while allowing the reader to gain a greater understanding of the physical phenomenon surrounding them. This text is wonderful for a nonindoctrinated scientist to get his feet wet on some of the unanswered questions in physics. Personally this book found me after graduating my Bachelors and helped form the questions that led to my doctoral career."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GB4WEW3WWEAR"
                },
                "Date": "on May 19, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AB6CD1BI0X3V"
                },
                "Date": "on August 2, 2000",
                "Helpfulness": 0.8,
                "StarRating": "4",
                "Text": "This book tries to use symmetry concept to describe many important physical laws from relativity to grand unification theory. For readers with ample physics background, it provides a refreshing review. On the other  hand, although the arthor attemps to simplifies some abstract concepts, I  feel it will be a very difficult read for those who lacks physics or group  theory  background to appreciate the underlying beauty of symmetry."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AW35KBEAUZBYW"
                },
                "Date": "on September 10, 2010",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10O98CWTJQTYQ"
                },
                "Date": "on August 4, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YGFS36G0NNU0"
                },
                "Date": "on November 25, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASEZ818JQHXF7"
                },
                "Date": "on November 3, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LM1HE1HAXMVB"
                },
                "Date": "on April 8, 2010",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HR4599UA78GF"
                },
                "Date": "on March 11, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Zee's discussion and development of the principles and importance of symmetry is well done.  He manages to preserve the rigor of his analysis while simultaneously writing at a level that the auto-didact or interested non-physicist (like me) can understand.  Whether symmetry in this universe is imposed by a deity, fundamental or otherwise, I certainly cannot say; but this book does provide a lively introduction to a concept with profound implications and utility."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LFJV20IFO0SX"
                },
                "Date": "on February 24, 2006",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "5",
                "Text": "Professor Zee provides a wonderfully lucid description of the important role symmetry plays in our understanding of the physical world. The eminent German mathematician once remarked, refering to his own research....\"My work always tried to unite the true with the beautiful, but when I had to chose, I usually chose the beautiful.\" Fearful Symmetry is an amazing journey into the hidden depths of physics and all the beauty contained within. This book is a definite must for all enthusiasts of popular science"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CNRR7KJVEIU8"
                },
                "Date": "on November 20, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JSXU71A42LDL"
                },
                "Date": "on January 13, 2015",
                "Helpfulness": "",
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RP4OSZYD22FS"
                },
                "Date": "on April 1, 2010",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AARA6Y6F78JCN"
                },
                "Date": "on December 24, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Symmetry seems to be a mathematical need for the description of modern physics, and the news often tells of how a new discovery involves the breaking of symmetry, such as the Higgs particle, whose existence was confirmed in 2012.  Problem with this book is that it wanders, the author tends to be cute, and after reading it, I am still, as a non-mathematical biologist, am unable to explan to myself or others what is symmetry.  I often tell myself that I do not understand something unless I can explain it in 25 words or less.  Prof. Zee himself says he cannot explain symmetry non-mathematically.  Pity, as otherwise a clear explanation  would be of great interest to those of us seeking to understand the post-Einstein world."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28B6LRWCYXY8I"
                },
                "Date": "on October 13, 2008",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Zee presents the challenges faced and already overcome by theoretical physicists in an extremely clear manner. Although some things may be difficult to understand, Zee demonstrates it's not as difficult as it first seems. A great book for a physics enthusiast or someone who wants to gain enthusiasm in the subject. I highly recommend this book for all audiences."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A129SMRH7LYTX8"
                },
                "Date": "on May 9, 2008",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Symmetry is a simple but powerful concept in physics and Zee does a good job of explaining what is is and why it is so important. He gives Emily Noether the credit that she deserves for her role in linking symmetry to conservation laws. His passion for physics and its aesthetic qualities make for fun reading."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XUYMNKJVAB5O"
                },
                "Date": "on December 11, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent book by my teacher of Quantum Field Theory at U Penn"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AK2SVT3S064NG"
                },
                "Date": "on July 18, 2000",
                "Helpfulness": 0.45454545454545453,
                "StarRating": "5",
                "Text": "This is the most exciting book that I have ever read"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EC1IG3LOB0NF"
                },
                "Date": "on July 8, 2001",
                "Helpfulness": 0.21428571428571427,
                "StarRating": "3",
                "Text": "It started very nice, author has very nice way of introducing concept of symmetry with easy introduction. He gives good examples of symmetry in Physics from Newtonian and Einstein Physics. I wish there was some formalism that would show where the symmetry shows itself in the formulations. Then subject goes to invariance transformations. Subject becames exteremely difficult for popular scientist who does not know Particle Physics and all the concepts comes with it. Overall it shows that the concept of Symmetry is very strong tool in Physics as long as you look for the right and meaningfull symmetry."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Fearful-Symmetry-Physics-Princeton-Science/product-reviews/0691134820/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "26"
    },
    "Salesrank": "#345,053",
    "Timestamp": "2015-05-24 13:17:39.818646",
    "itemurl": "http://www.amazon.com/Fearful-Symmetry-Physics-Princeton-Science/dp/0691134820"
}
