{
    "Category": "in Books (",
    "ListPrice": "$17.95",
    "Name": [
        "The Hole in the Universe: How Scientists Peered over the Edge of Emptiness and Found Everything"
    ],
    "OfferPrice": "$16.07",
    "Reviews": {
        "AverageStarRating": "3.9 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABN5K7K1TM1QA"
                },
                "Date": "on July 24, 2001",
                "Helpfulness": 0.9387755102040817,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UZA3BJKQ5C4R"
                },
                "Date": "on November 28, 2001",
                "Helpfulness": 0.8846153846153846,
                "StarRating": "3",
                "Text": "I read Brian Greene's The Elegant Universe before The Hole in the Universe.  No doubt, the scientific depth of Greene's near-masterpiece bolstered my negative reaction to Cole's rather light-weight book.  A serious science reader should avoid \"Hole\":  it is superficial, contains a bizarre digression, and is too clever for its own good.  One could argue that Hole's relatively short length is a benefit.  Undoubtedly, some short science books are very good.  (Short works by Martin Rees, John Barrow, and Paul Davies demonstrate this point.)  Hole's short length, however, is not evidence of the author having synthesized mind-bending and mathematically challenging material into clear, tight prose.  Hole is so short because it's so superficial.  In fact, I would argue that the book is too long.  The bizarre digression I mentioned above occurs at the end of the book where Cole discusses how the human brain perceives (or misperceives) the world.  The connection to her main subject -- \"nothing\" -- is tenuous, at best.  The only plausible explanation I can come up with for Cole's wierd digression is that it allowed her to briefly discuss two books she likes (one of which -- Phantoms in the Brain -- I have read and was shocked to find mentioned in Hole).  Finally, I was extremely annoyed by the clever word play and frequent interruptions in Hole.  The word play got old very quickly.  Nothing, something, and anything -- yes, these words can create cute sentences when the subject is nothing, but not past the first chapter.  Thankfully, the word play decreased after the third or fourth chapter, but my irritation with the author never left me.  As for the interruptions, I dislike headers and quotes every 2.5 pages of a book.  It gave Hole the feel of a very long Newsweek article.  If I could, I would put a sticker on the jacket advertising Hole as a MTV Book Club selection, \"catering to short attention spans.\"  Hole isn't useless, but I didn't find it particularly enlightening.  Several contemporary physicists have written popular science books that cover the topic of nothing more deeply and more satisfyingly."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on January 19, 2001",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26GTHF4IZJKYG"
                },
                "Date": "on February 27, 2001",
                "Helpfulness": 0.875,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on January 28, 2001",
                "Helpfulness": 0.8260869565217391,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YF4ZMECJVLK9"
                },
                "Date": "on November 6, 2003",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AO21KXYEHOUSO"
                },
                "Date": "on April 5, 2001",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "1",
                "Text": "I was hoping for a layman's review of the latest findings in cosmology. Instead I got a completely disorganized mish mash of random quotes from scientists (seemed to be the author's attempt to curry favor with those she may need for future articles) and endless puns on the word \"nothing\". Unlike the Universe, her book has no discernable structure, and NO attempt to clearly explain any of the new concepts (string theory, anti-matter etc.)."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on January 29, 2001",
                "Helpfulness": 0.7916666666666666,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1U69ANQ6XANSX"
                },
                "Date": "on January 24, 2001",
                "Helpfulness": 0.8125,
                "StarRating": "5",
                "Text": "The Hole in the Universe is everything promised by those raves from Oliver Sacks and Brian Greene and Dava Sobel -- and much more!  It is a deep look at an elusive, yet centrally important subject, presented with eloquence, originality and charm.  It amazes me that Cole has been able to take us to the frontiers of physics, exploring questions that physicists sstill puzzle over, and yet still make it entirely accessible (and, yes, even fun) to a complete novice like myself.  I have read about ideas like string theory and the strange \"repulsive force\" that seems to be expanding the universe, but never before were these ideas so clear and appealing to me.  Her writing is so fresh and lovely, it takes your breath away.  And I love the connections between the notion of \"nothing\" in perception -- the holes in our heads, as Cole calls them -- and the nothings of mathematics and physics.  Buy this book and give it to all your friends.  They will thank you."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARN3N3GJQYE8V"
                },
                "Date": "on January 15, 2003",
                "Helpfulness": 0.8125,
                "StarRating": "2",
                "Text": "I think that Cole is trying to explain something big here. The book tackles a lot of big subjects under the heading of \"nothing\" and tries to prove that what Cole refers to as \"nothing\" is really where everything in the universe comes from. And I think it really hits the mark sometimes. But 95% of the book is semantics and wordplay. And I think the book really stretches to fit some things into the \"nothing is everything\" theory. You'll wait at least 50 pages before you start learning real science. It must have been fun for Cole to play with the idea of nothing in riddle-like prose, but it really takes away from the science of the book. I say skip to the bibliography and read the books cited. They may be more concise."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 6, 2004",
                "Helpfulness": 0.8888888888888888,
                "StarRating": "5",
                "Text": "This book will blow your mind. It is elegant, deep, crystal clear. A tour of nothingness that will turn you inside out: whether Cole is writing about the number zero, the perceptual aspects of seeing and feeling \"nothing,\" the physics of the vacuum or the origin of time, you will feel right at home in this universe."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26K5Q7W7ROBG7"
                },
                "Date": "on March 27, 2006",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on January 23, 2001",
                "Helpfulness": 0.8181818181818182,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TPJOEN2CVO36"
                },
                "Date": "on April 24, 2002",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2I1RJP9SCFKX7"
                },
                "Date": "on March 22, 2001",
                "Helpfulness": 0.7619047619047619,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3R5B0GRK25743"
                },
                "Date": "on April 15, 2001",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29PO60L7GYPWZ"
                },
                "Date": "on February 14, 2001",
                "Helpfulness": 0.8,
                "StarRating": "4",
                "Text": "A lot of books try to be about something, but turn out to be about nothing.  This book says it's about nothing, which reveals everything.  Well, at least something.  This book starts from zero and goes nowhere fast.  But the concept of zero is very important, as well as very funny for some reason.  Or maybe none at all.  Nothing itself turns out to be something.  For example, sometimes nothing is equilibrium, which is the sum of opposing somethings.  Then again, sometimes there's nothing until you look at it.  Only then it is something.  Or something like that.  You would think nothing and emptiness have nothing in common, but it turns out they do have something, and maybe everything.  K.C. Cole is a columnist and teacher, and uses those skills to create a book you can read a little or a lot at a time.  Wit and a good ear also help move things along. This book goes from zero to the speed of space.  It's a fast laugh track around physics, quantum mechanics, string theory--life, the universe and...nothing.  Yes, it's everything you ever wanted to know about nothing but were afraid to ask.  Lovers of games, paradox and cosmic concepts with everyday implications should find this a relatively painless way to understand why humans makes so much ado about nothing.  I can see Einstein and Groucho Marx reading passages to each other and laughing hysterically, while Buddha smiles and nods.  To most people physics has been sounding crazier all the time, with its quarks of color and raspberry flavored gluons, as if maybe making the Bomb unhinged them all, so it's worth listening to what a knowledgeable and articulate non-scientist makes of it. Sometimes the metaphors don't quite work, and sometimes such a big universe in such a small space means it simplifies maybe a bit too much. But what we may lose in sophistication we make up in a refreshing respite from scientific self-importance. Besides, it's not easy to express complexities simply--I suspect some of these painless paragraphs cost blood, sweat and tears to write.  So if you have zero interest in boring explanations, you'll find this book quite something.  Prepare your mind for quite a ride-if you don't get dizzy, you missed something-or maybe nothing.  And if you've suspected that science and the absurd are like two parallel lines about to intersect, this book may confirm it.  Which is not to say that science is wrong, although it's clear that even now with everything we've learned, we know next to nothing for certain about anything.  At one point Cole asks us to imagine the universe as the scum on the surface of a pond.  Sounds reasonable to me--pond scum explains a lot.  After reading Cole I'm confirmed in my belief that this is the most ridiculous universe I've ever heard."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MWMVL8YLGMEA"
                },
                "Date": "on January 21, 2001",
                "Helpfulness": 0.7857142857142857,
                "StarRating": "4",
                "Text": "My science background consists of high school chemistry, biology and physics and one college course in physics.  K. C. Cole's ability to make the difficult understable for someone like myself is most admirable.  The \"Hole in the Universe\" and the whole concept of \"nothing\" opened up a whole new world for me and other members of our book club, none of whom  had ever before read much non-fiction, much less on physics and cosmology.  I recommend it to \"science interested\", but science illiterates like myself."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LR8SZY00IW9Z"
                },
                "Date": "on June 13, 2002",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1A8E4AAELZB7K"
                },
                "Date": "on July 12, 2005",
                "Helpfulness": 0.7777777777777778,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AS0X0UPGDGN3M"
                },
                "Date": "on July 31, 2001",
                "Helpfulness": 0.8,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADXCXX15KNZC9"
                },
                "Date": "on February 5, 2007",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYJNG40HRY6Y4"
                },
                "Date": "on March 26, 2002",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A337LJ9R9P6EXQ"
                },
                "Date": "on June 15, 2001",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1358N9ARYGZ4U"
                },
                "Date": "on May 10, 2001",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "This is book is so much fun to read.  A  lyrical, brilliant and even funny tour of this mind bending subject.  If you've read her other  books, you'll find Cole's clear, warm voice a pleasure to travel with again.  You also get to experience here the thrill and creative power at work in the exciting quest for ultimate truths.  Nobody writes with such evident joy and command of theoretical physics as does K.C. Cole.  And there's no dogma here.  The book permits you to dream along with her about what else might be possible in the paradoxical world of nothing.  And, yes, it's a perfect compliment to Brian Greene's Elegant Universe."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 14, 2001",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "2",
                "Text": "It took 2-3 chapters to get past cutesy \"nothing\" garbage.  The whole \"nothing\" thing was very annoying.  Too much \"more on this later\", and a lot of irrelevant stuff as well.  If you thought this book would be interesting you've probably already read better coverage of most of what's in it.  Get Brian Greene's book, or read it again if you already have it.  I suspect K.C. had more fun researching it than anyone will have reading it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZQZF1BRMH8AV"
                },
                "Date": "on May 26, 2010",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book went along with another book I purchased for college math as a project. The discovery of ways that math is used in the world, and not just in everyday math classes is very interesting, considering I hated math in high school. This is a great read, with different stories to take you on a journey in to the universe."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EQPYNFCDBNED"
                },
                "Date": "on August 16, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "read most of it in almost one sitting, it is that good!  recommend anyone who wants to be both entertained and better cognitively get  hold of any of her books.  You wont be disappointed.  She is one of only a few science writers that I purchase just because I recognize their names!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FDJESR1ARTFB"
                },
                "Date": "on January 2, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Presents many new concepts about Nothing that surpassed my expectations. It add a lot of importance to the research being done at the Large Hadron Collider."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGC208F2XF04B"
                },
                "Date": "on July 15, 2001",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14OJS0VWMOSWO"
                },
                "Date": "on March 16, 2001",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": "In Hole in the Universe, science journalist and author Cole explains why the scientific search for nothingness is attracting so much attention among physicists. Scientists and theories are probed in this survey of the history of the search for the 'ultimate nothingness' of the universe, yet the account is most accessible to lay audiences."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17Q8B79OX6ELY"
                },
                "Date": "on March 2, 2004",
                "Helpfulness": 0.25,
                "StarRating": "5",
                "Text": "I expected nothing, and got nothing.  Isn't that something?  If you have meditated for many years and fringed on dharmakaya this book is a delightful dance with that from which everything comes.  Ken Wilber too confusing, or too long?  K. C. Cole waterskis some of the same territory, and , frankly, I'm not sure why he isn't a reference.  This is a book a Buddhist could love.  But zen that isn't saying much.  Would have liked even more diagrams, and more pictures."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 6, 2001",
                "Helpfulness": 0.4,
                "StarRating": "4",
                "Text": "What did this author ever do to boulder to warrant his unwarranted criticism...lighten up...she never claimed to have written a densely reasoned opus magnus...cheez...it is well-written and entertaining and if this introduction results in someone looking a little deeper into the topic at hand that it's all worth it isn't it"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RZ9LXMYWRJBW"
                },
                "Date": "on January 29, 2001",
                "Helpfulness": 0.2,
                "StarRating": "5",
                "Text": "This is the only way I could think of to let you know that I already wrote a review of this book using the above title about two weeks ago and that I have yet to see it posted among your reviews which, at the moment, number four. Would you please let me  know what happened? I'm a big fan of this book and will go to the trouble of writing another review if you've lost the one I already sent to you. Thank you. You can reach mean at fikitss@aol.com."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EC5LG1URI44R"
                },
                "Date": "on February 7, 2001",
                "Helpfulness": 0.2857142857142857,
                "StarRating": "5",
                "Text": "K. C. Cole takes readers on a journey through time and space in search of nothing.  She demonstrates all the amazing complexities of the vacuum.  She goes into detail about quantum physics, astrophysics, cosmology, and superstring theory.  Her writing style prevents boredom while speaking about very complex topics.  Her book was published just this year, so her it is extremely up-to-date.  I recommend this book to anyone who wants to learn about the newest frontiers of scientific discovery."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XJKTPJCQCU6S"
                },
                "Date": "on January 28, 2001",
                "Helpfulness": 0.2857142857142857,
                "StarRating": "5",
                "Text": "An incredible ability to simplify and make understandable the physical universe's most complex issues--all done with a lightness and humor that make it an easy yet compelling read.  Mr. Cole makes it simple without sounding patronizing.  If you've never read any of his works, start here!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KR4F62KBLV5Y"
                },
                "Date": "on February 5, 2001",
                "Helpfulness": 0.2857142857142857,
                "StarRating": "5",
                "Text": "This work came to me highly recomended and deserves even more praise. An extremely understandable explanation of the science of \"nothing.\" Well written and amusing, K.C. Cole has done it again. A great book for laymen and scientists alike."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AM6NZ4OP0YZGI"
                },
                "Date": "on January 31, 2001",
                "Helpfulness": 0.25,
                "StarRating": "5",
                "Text": "Though the book comes into conflict with the views of Aristotle & Zeno, but truly enlightens it's readers about the existence of \"NOTHING\" ---- the greatest resource of the universe."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18RHI0GATS9NZ"
                },
                "Date": "on February 2, 2006",
                "Helpfulness": 0.35,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GMZHXX41ULSR"
                },
                "Date": "on September 22, 2005",
                "Helpfulness": 0.30434782608695654,
                "StarRating": "1",
                "Text": "this book is so boring and anyone without any education can write a book like this."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Hole-Universe-Scientists-Emptiness-Everything/product-reviews/0156013177/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "40"
    },
    "Salesrank": "#1,317,534",
    "Timestamp": "2015-05-24 13:33:15.929283",
    "itemurl": "http://www.amazon.com/Hole-Universe-Scientists-Emptiness-Everything/dp/0156013177"
}
