{
    "Category": "in Books (",
    "ListPrice": "",
    "Name": [
        "Student Solutions Manual to accompany Physics 9e"
    ],
    "OfferPrice": "$62.83",
    "Reviews": {
        "AverageStarRating": "1.9 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YVYX02ODVPWZ"
                },
                "Date": "on September 28, 2012",
                "Helpfulness": 1.0,
                "StarRating": "1",
                "Text": "This book only contains the odd numbered answers to the questions and not even all the odd numbered questions at that!  Now, the text book has the answers to all the odd numbered questions in the back so what you are paying for is how the problem is solved...THATS IT."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NEE9VEQH3N8E"
                },
                "Date": "on November 5, 2012",
                "Helpfulness": 1.0,
                "StarRating": "1",
                "Text": "this manual did not give the solutions to all the problems it only gave the odd numbered problems and on top of that it skipped many of the odd problems. this manual was a waste of my money, so I went to chegg.com, it is a bettetr source for physics help."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BCD6QIF9F91O"
                },
                "Date": "on October 23, 2012",
                "Helpfulness": 1.0,
                "StarRating": "2",
                "Text": "This book does not include all the solutions and is not what I would have expected in comparison to other solution manuals I have used. It helps with only certain problems, not even all the odds. It's very random and frustrating when you want to solve a problem that isn't in the manual. Very disappointing."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Z1QX9KHIK1CU"
                },
                "Date": "on October 29, 2012",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "1",
                "Text": "I purchased this book because I was having trouble in physics and thought that if I did more problems, I would become more adept at them, and thus understand the subject more. Well, paying nearly $60 for a solutions manual that doesn't even have 25% of the problems solved is not worth it in my opinion. I could have spent the money on other books that help you understand physics, gotten more out of them, and actually understood the subject! I feel cheated by the publisher and unhappy with my purchase."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PR3OJLRD9NDD"
                },
                "Date": "on December 9, 2013",
                "Helpfulness": 1.0,
                "StarRating": "1",
                "Text": "Only a fraction of the odd-numbered questions are answered.  You'll find more answers, and for free, at Yahoo Answers.  In fact, I've stopped using this solutions manual long ago, and rely on the Internet to teach me physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CNGL6D6BUGCU"
                },
                "Date": "on September 23, 2013",
                "Helpfulness": 1.0,
                "StarRating": "1",
                "Text": "I took a chance and bought this because I need help in Physics. Normally solution manuals have all of the odd problems solved. This one has some here and there solved. It is so frustrating that the problems I needed help with we're not in the manual."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OSXG8BXIPAWS"
                },
                "Date": "on May 27, 2014",
                "Helpfulness": 1.0,
                "StarRating": "2",
                "Text": "only give a few questions.  returned it almost immediately.  use Chegg.  My instructor was terrible and the explanations on Chegg helped me understand the material enough to pass."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABEGL5E5IGFO8"
                },
                "Date": "on October 24, 2014",
                "Helpfulness": 1.0,
                "StarRating": "1",
                "Text": "Wasted of money! One contains odd numbers which makes the help limited."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2T0DSKN6387M0"
                },
                "Date": "on September 21, 2014",
                "Helpfulness": 1.0,
                "StarRating": "1",
                "Text": "Really, don't but it. It does not helpful at all."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3U00BL0LF13XT"
                },
                "Date": "on July 28, 2013",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "This manual was somewhat helpful for my physics courses. It only includes certain problems, and chances are high that your professor didn't assign those problems, but it's a good idea to practice with these problems to see if you understand the concepts. The Cutnell & Johnson textbook is fairly difficult, and I would suggest getting as much help as possible."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25HBIWWBNO94R"
                },
                "Date": "on February 6, 2013",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "Very helpful, explains solutions in detail. Only downside is it doesn't have  all the solutions the actual book says it has."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DV1YU8TFPJS8"
                },
                "Date": "on March 10, 2013",
                "Helpfulness": "",
                "StarRating": "1",
                "Text": "I bought this book thinking it would make it easier to pass physics but I was mistakenly wrong. Everything you find in this book is already on yahoo answers. Beside if your repeating it again or even taking it make sure to see what the instructor will do when assigning homework. If its online or in the book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18TPNL3E2G1F2"
                },
                "Date": "on June 30, 2013",
                "Helpfulness": "",
                "StarRating": "1",
                "Text": "Purchasing this book is like taking 20 dollar bills and throwing them in a crackling fire place. The publisher is too cheap to include at least all the odd problems. Perhaps two percent of the problems I did where in the solution manual."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A322IWJAT1PCEB"
                },
                "Date": "on July 16, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "Only some of the solutions are published and it can be challenging sometimes to understand what the solutions mean. The solutions rely almost entirely on words, instead of calculations or diagrams."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASGYM2KBTKGXA"
                },
                "Date": "on January 24, 2013",
                "Helpfulness": 0.6,
                "StarRating": "1",
                "Text": "Picky, but wish it answered allllll the questions. And it won't even open in the kindle! It keeps crashing it! I tried everything. Redownloading in every way and restarting iPad, everything. What a waste that it doesn't even open. FIX IT"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Q3YDO7XGQE11"
                },
                "Date": "on September 19, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "very fast delivery  great price for this book"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28SHMT5TEH19E"
                },
                "Date": "on August 13, 2012",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "I'm taking physics this semester for college and we get a LOT of problems for homework. I wanted to take a head start so I ordered the textbook for my class and the solution manual to go with it and it's so nice to have something to base my learning on and to keep my learning process in check. If you bought the textbook, buy this too! It's awesome!"
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Student-Solutions-Manual-accompany-Physics/product-reviews/0470879564/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "17"
    },
    "Salesrank": "#27,520",
    "Timestamp": "2015-05-24 13:02:04.130071",
    "itemurl": "http://www.amazon.com/Student-Solutions-Manual-accompany-Physics/dp/0470879564"
}
