{
    "Category": "in Books (",
    "ListPrice": "$12.95",
    "Name": [
        "Thirty Years that Shook Physics: The Story of Quantum Theory"
    ],
    "OfferPrice": "$10.26",
    "Reviews": {
        "AverageStarRating": "4.7 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1N2477VRD8OIZ"
                },
                "Date": "on June 1, 2003",
                "Helpfulness": 0.9807692307692307,
                "StarRating": "5",
                "Text": "A reprinted Dover edition of a lovely set of biographies of the physicists of the Golden Period, from the pen of George Gamow. The original 1966 edition has been out of print for a number of years. This 1985 edition is beautifully reproduced, and it includes fascinating pictures, sketches, and poems, done by Gamow himself. He was born in Odessa, in what was then Russia, --before the Soviet Union. The story of his escape to the West is straight out of a thriller. Only it is real! Later in the US, Gamow was referred to by a journalist,--- some time during the Cold War, as \"the only scientist in America with a real sense of humor\". With his lovely books, we have now all come to experience how Gamow can take the most technical stuff and make it simple. Fun too! The book:--Intellectual treats, whimsy, but deep. It contains penetrating and personal biographies of Niels Bohr, Paul Ehrenfest, Wolfgang Pauli, Werner Heisenberg, Albert Einstein, and recollections from the conferences in the 1930ties in Copenhagen, Brussels, and in the Solvay Institute. Illustrated with lovely drawings by Gamow himself. A book with pictures and conversations! Much of it can be understood by a child, and other parts might require a little concentration. All of it is great fun. The author Gamow started in nuclear physics, during the Golden Age of Physics, worked with Niels Bohr, then later in the US, on the Manhattan Project during WWII, and after the war, he was professor in Boulder Colorado. He has a building on campus named after him! The books he wrote are pearls, and they have been equally popular with my parent's generation as with mine. Luckely some have been reprinted! Other Gamow titles: Biography of Physics, Atomic Energy [dedicated to the hope of lasting peace], Physics of the Strapless Evning Gown,...We are lucky that Dover has reprinted some of them. Gamow's list of scientific accomplishments includes a 1948 landmark paper on the origin of chemical elements, the Big Bang model, and later work with F. Crick on DNA and genetic coding.-- Do more Gamow editions, Dover!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A258HDMERSI6WJ"
                },
                "Date": "on May 18, 2002",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D7XC7USJ9X7J"
                },
                "Date": "on February 21, 2001",
                "Helpfulness": 0.9705882352941176,
                "StarRating": "5",
                "Text": "Actually this is the motto of a great Italian writer, Leonardo Sciascia. But, in the domain of science, no one better than Gamow lived to it. The great Russian-born physicist, educated by Bohr, reviews the birth of quantum mechanics and its first applications as an insider, with great panache and as much accuracy as is allowed \"by complementarity\" (which concept, complementarity, he explains brilliantly). He did everything brilliantly. Once, studying, with the great Brazilian theorist Mario Schenberg, ways of very efficient energy dissipation needed in the stars, they proposed that the energy should flow out in the form of neutrinos. This eventually became the well-known URCA model. Gamow named it after a famous casino at Rio de Janeiro, where money dissipated very efficiently too, at the green tables.Gamow is also the originator of the Big-Bang model of the universe, which is called by many \"Gamow's cosmology\". A great scientist, a great writer, a great wit!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1P0ZB4YAA312R"
                },
                "Date": "on January 22, 2003",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KJO5VP4K3CHU"
                },
                "Date": "on November 1, 2008",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36FEOOMP9QXFZ"
                },
                "Date": "on March 9, 2000",
                "Helpfulness": 0.9090909090909091,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17TYBG9F2HE2U"
                },
                "Date": "on August 9, 2008",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 13, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "In my opinion, the great merit of this book is to show physics as a human adventure, with wins, frustation, surprises, excitement, healthy concorrence among scientists. Gamow is very good in this aspect, as we can see by his other books. Besides, it relives by far the most interesting and exciting age of physics. This history of the quantum theory is very well written, showing how each theoretical development gives the reasons and motivation for the following, how the matter started with the solution Planck has given to his problem, leading to the later formulations and great discoveries of Weisenberg, Schrodinger, Bohr... Very interesting and pleasant to read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MDT7LWLQ8UW8"
                },
                "Date": "on August 19, 2001",
                "Helpfulness": 0.7037037037037037,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22C6LLLFXKXLG"
                },
                "Date": "on July 20, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3Q8JKUVUH88KX"
                },
                "Date": "on January 9, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "George Gamow writes a unqiue, genuine and personal account of his time as one of the great scientists of the 20th century. A peer amongst Bohr, Pauli and Fermi amongst others are documented here in this great book. It is not only the personal histories that are important but also the science that is learnt in this book. From Gamow's relationship with Bohr, Pauli and Fermi there is an exciting insight into the discoveries that made quantum physics and relativity the pillars of modern day physics. From the discoveries of atomic structure and relativistic principles, the book delves into the relationships between the great scientists and their works. It ends in the play acted by some of the greatest scientists regarding the discovery of the neutrino. A humorous book written by Gamow who shows much sincerity and wit also shows the humor that his fellow peers had as they moved science forward in the most important years of science. This is a book to treasure."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3M7LZOL7KJUW7"
                },
                "Date": "on May 11, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "A very readable account of the ideas and discoveries that transformed physics in the first half of the 20th century. Beside being a notable theoretical physicist, Gamov shows himself to be a first rate teacher. He provides clear explanations of some of the major developments in atomic theory for a time period that saw rapid intellectual development."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SOIJT9XIRJYB"
                },
                "Date": "on September 23, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "George Gamow was one of the scientists in the great era of quantum theory. He is able to bring readers in the road to discovering the quantum theory. The book also provides the views from different great scientists and what they were debating in the road to nurture the theory. It is worth for anyone, who is interested in Physics, to read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GQ6QGT4ZXNXL"
                },
                "Date": "on December 21, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RX1NARM6WAB4"
                },
                "Date": "on August 17, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APUEZPFK52MD2"
                },
                "Date": "on July 1, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book gives an excellant account of the discovery of quantum physics.  The weid and subtle nature of the quantum are readily understood with this easy to read book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AS76S1OCU5W6A"
                },
                "Date": "on April 25, 2001",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book is a must-read for budding scientists and all science lovers. George Gamow does a good job weaving the history of modern physics into an interesting narrative. The author's photograhphs of the early scientific community are part of this book, including photos of Einstein, Curie, Heisenberg, as well as himself. This book is for those with a science background, but a non-scientist can certainly read it - no jargon. If you know any young (late junior high or high school age) boys or girls who are interested in physics and chemistry, this would make an excellent gift. I was given this book and read it cover to cover the first night I received it. I was transfixed!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PND3O81WD0VC"
                },
                "Date": "on December 21, 2010",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book boils down quantum mechanics to what changed with respect to classical physics. Gamow states these changes in very simple terms. His description of the problems that lead to quantum mechanics is simple and straightforward. The leading people responsible for the many discoveries that lead to quantum mechanics appear as real people. Niels Bohr in Kopenhagen comes through as the key person that makes many fruitful collaberations possible. I recommend this to any young student of physics going into college, or for that matter to anybody that would like an excellent layman's understanding of quantum physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1S0LQX8AWELRK"
                },
                "Date": "on July 16, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "An interesting and humorous account of science development for laymen."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGNGF0B3USGOS"
                },
                "Date": "on December 5, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "A classic in understanding Quantum theory as a layman."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23VB3F6VJVVU2"
                },
                "Date": "on August 25, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "As the other books of g. Gamow this book success  in an elegant and simple way to explain very hard  subject  in a way that everyone can understand."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22J26RPRXM187"
                },
                "Date": "on September 9, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I will recommend this product to any one interested."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALXPH836UNK04"
                },
                "Date": "on April 5, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Really great book about the history of physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2X674TN3P7AVU"
                },
                "Date": "on May 1, 2011",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "I really enjoyed this book. It takes you on a journey of the development of Quantum Mechanics. (note: Einstein's picture is featured on the front cover, but he is not discussed in the text, well only in brief reference)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3T5GNM8VHBHKK"
                },
                "Date": "on March 22, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A good overview from the inside"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KUZNHWXCQU2V"
                },
                "Date": "on February 14, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "as advertised"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AARA6Y6F78JCN"
                },
                "Date": "on December 24, 2013",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AK1BNYAFXI6O"
                },
                "Date": "on October 2, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "excellent"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACE8JFORXQZMM"
                },
                "Date": "on October 12, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "great"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SC67Z2ZT7TFP"
                },
                "Date": "on October 3, 2001",
                "Helpfulness": 0.5454545454545454,
                "StarRating": "4",
                "Text": "Makes me wish I stayed awake in Math class. Some of the text is made up of formulas that make my head spin. However I am enjoying reading the stories of the men and their reasoning behind the explinations of how the world works at the atomic level versus the \"real world \" physics of Newton and others. Definitely a time when what we knew to be true was vastly different from what was actually true."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AF98F74YA42BV"
                },
                "Date": "on January 18, 2009",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "You just need to read it to see how interesting it is! Much more than the similar books."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Thirty-Years-that-Shook-Physics/product-reviews/048624895X/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "31"
    },
    "Salesrank": "#199,924",
    "Timestamp": "2015-05-24 12:56:59.343706",
    "itemurl": "http://www.amazon.com/Thirty-Years-that-Shook-Physics/dp/048624895X"
}
