{
    "Category": "in Books (",
    "ListPrice": "$16.99",
    "Name": [
        "Art & Physics: Parallel Visions in Space, Time, and Light"
    ],
    "OfferPrice": "$12.97",
    "Reviews": {
        "AverageStarRating": "4.2 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VYA4PYF830KF"
                },
                "Date": "on January 9, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "A different and thought provoking book relating artists insights to discoveries in physics.Fascinating reading.I definitely recommend this book. I find I have to read it first thing in the morning when I am able to concentrate. It is not for a relaxed read!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RNWAA23PJHTU"
                },
                "Date": "on May 6, 2008",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AG4R4TSQUWSST"
                },
                "Date": "on January 8, 2014",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NO2L7HSV6CCI"
                },
                "Date": "on December 31, 2007",
                "Helpfulness": 0.7294117647058823,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QK3JCLM8BM6L"
                },
                "Date": "on June 14, 2007",
                "Helpfulness": 0.7777777777777778,
                "StarRating": "5",
                "Text": "I thought this was a wonderful book. Tying the evolution of art to the evolution of thinking and science gave me a more holistic way to look at art.  From the ancient Greeks through the Dark and Middle Ages, the Impressionists, and into modern times the parallels of physics to art are simply amazing.  Perfect for us \"left-brained\" types."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17FCDQV2WRM9R"
                },
                "Date": "on November 7, 2009",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": "As a musician and life long educator in a school of the arts here in Pittsburgh, I am inspired by Mr. Schlain's vast insight into the relationship of creativity, science, and the human spirit. I believe this work should be a fundamental guide for educators who believe in the power of art as it historically has influenced culture and science. BRAVO Mr. Schlain!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GS03A0IEETO7"
                },
                "Date": "on May 12, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "An absolute juggernaut of information that is enlightening, exciting and mind-expanding.  Useful in any discipline, subject or simply as an enjoyable read!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZGNA0CBWK5GV"
                },
                "Date": "on December 18, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKYCGXE1GRH1D"
                },
                "Date": "on May 20, 2014",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "This book, which I read the first time many years ago, helped me to see the way history is really the creative human experience, whether it is art, science, mathematics, or language, and changed the way I see the world.  I realized that our collective history is way more complex and interwoven than any of us can comprehend.  Add that to the science of how matter, space and time behave in our universe and now it opens our eyes to the possibility that we are just one variable in the equation.  I began teaching art and art history differently from that point forward, introducing my students to the concept that art was both the reflection and the presupposition of what human creativity and intellect could conceive and that art could not be truly understood without understanding the other factors in our shared technological, social, and scientific culture.  I recommend this book to anyone who teaches art, science, or just wants to be rocked to the very core of their preconceptions of life."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AENQS0JHP0NA"
                },
                "Date": "on April 23, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I LOVE this book! A must have on any artist's shelf!!!! I learned more art history though Shlain than I did during my undergrad BFA!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4Y8JZHOL617F"
                },
                "Date": "on January 4, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is a must to read. Add this to your book list, this year. Highly recommended work from a brilliant man."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DW9V5K1BGMYA"
                },
                "Date": "on May 7, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent read"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZWWG35D17UZF"
                },
                "Date": "on July 15, 2010",
                "Helpfulness": 0.4230769230769231,
                "StarRating": "1",
                "Text": "First of all this book should have been called \"Religion and physics\" or \"Christianity and physics\". Often using biblical stories and god as supportive examples, the ground stone of this book is not objective, nor academic or scientific at all. What Shlein seems to try to study and prove is not the relationship/connection between art and physics, but religion and science in a way that he constantly and subtly refers modern science to religious myths. Such as, he pointed out that ancient Greeks believed that all matters came from 4 elements: air, fire, water and earth, while later Aristotle added the 5th element - \"stuff of stars\" (what stuff?), then he links this to physics in which he thinks that physics is all about 4 elements too: space, time, force and matter, the 5th would be light which would be equivalent to Aristotle's \"stuff of stars\" he thinks..... I am an art student and a physic enthusiast and I found this book is so very very misleading."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Art-Physics-Parallel-Visions-Space/product-reviews/0061227978/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "13"
    },
    "Salesrank": "#37,703",
    "Timestamp": "2015-05-24 12:45:52.060745",
    "itemurl": "http://www.amazon.com/Art-Physics-Parallel-Visions-Space/dp/0061227978"
}
