{
    "Category": "in Books (",
    "ListPrice": "",
    "Name": [
        "Physics For Dummies"
    ],
    "OfferPrice": "",
    "Reviews": {
        "AverageStarRating": "3.9 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AM39K5INLZ4ZQ"
                },
                "Date": "on September 4, 2006",
                "Helpfulness": 0.9666666666666667,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ALYSMFO4YZ0A"
                },
                "Date": "on August 22, 2009",
                "Helpfulness": 0.9655172413793104,
                "StarRating": "4",
                "Text": "I am in college, studying drafting and design theories. Part of the curriculum is a  two hundred level physics class. I was so lost the first few days of class and was struggling to maintain a B average. I ordered this book and recieved it a few days later. It explained the concepts of most of my physics homework in a way that made a lot more sense to me. All in all I finished the class with a 95.6% grade point average. I thank the writer of this book for all his wisdom, it was the best eighteen bucks I spent all summer."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UQZ0YOY7OE9B"
                },
                "Date": "on August 10, 2007",
                "Helpfulness": 0.9210526315789473,
                "StarRating": "5",
                "Text": "I have already received a degree in physics, but am always looking at texts for further understanding and alternate perspectives. This book is good for either a beginner or someone looking strengthen their grasp of physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34U0PLJQ98ZZ8"
                },
                "Date": "on July 28, 2008",
                "Helpfulness": 0.8260869565217391,
                "StarRating": "2",
                "Text": "This book isn't really for people who aren't familiar with physics, it's a reference for people who've already learned physics to brush up on thing that might have slipped their minds. It's both comical and insulting in how it asserts that you should now understand some long equation after providing no explanation in English, no breakdown of how it works, no explanation for why some value must be squared or multiplied with another. A book like this should be accessible and explain concepts in terms ordinary curious dummies can understand. Instead it makes you feel uninvited and left out. Concepts of algebra, trigonometry and calculus are referenced numerous times but they have clearly gone out of their way to not offer any help if you're unfamiliar with the mathematical operations presumably to push three more Dummies books. Last I checked your typical dummy wasn't well versed in college level math. There are no secondary examples or practice problems, presumably to push the Physics Workbook for Dummies, and in that respect it doesn't even live up to the standards of a basic text book. I strongly advise against buying this book and urge people to read customer reviews before buying any other Dummies book in the near future."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25D21WOA9IXJR"
                },
                "Date": "on February 20, 2006",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKYBT40LYMZSR"
                },
                "Date": "on October 15, 2008",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Has been the only help for my daughter in physics class.  She'd be lost without it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16CYLTV1YKE0C"
                },
                "Date": "on November 26, 2008",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "This is a totally diferent approach from the tranditional text book. It does give a better idea of physics world but not as indepth. If you just want to read for fun it is a much faster and fun and easier read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LP14X41S0LSU"
                },
                "Date": "on March 14, 2007",
                "Helpfulness": 0.7101449275362319,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANY29HQFFAKXT"
                },
                "Date": "on September 12, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UNXF32K07GS3"
                },
                "Date": "on March 23, 2011",
                "Helpfulness": 0.8,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39GUH0A4FJFIZ"
                },
                "Date": "on October 23, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I bought this book as an aid for the course that the author use to teach at Cornell -- an autotutorial physics course. It is very helpful with extra examples and straight-forward explanations. It does not have problems in it, but I knew that and did not need them. It is also in the same order as the textbook for my class (College Physics), which makes it easy to follow along."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UKNM5EEJUGWD"
                },
                "Date": "on March 24, 2011",
                "Helpfulness": 0.75,
                "StarRating": "2",
                "Text": "This book is not written clearly. The equations are not described adequately and logical steps in the solution descriptions are missing. I teach physical science and wanted to brush up for the Physics CSET exam. Even I, an educated person with a masters degree, could not follow the logic outlined in this text. The author attempts to teach you how to solve physics problems, but there are no practice problems to test your understanding in the book. I don't recommend this book to anyone...especially dummies ;)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARLMGIGY4MR9Q"
                },
                "Date": "on November 11, 2006",
                "Helpfulness": 0.7,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26AHNYLRN5CC9"
                },
                "Date": "on March 18, 2010",
                "Helpfulness": 0.8,
                "StarRating": "4",
                "Text": "I recently purchased the book \"Physics for Dummies\" for my daughter who was struggling in her physics class. She says that it has been very helpful to her. Though she told me that it hasn't taught her anything new, it has helped her to make better sense of things that she has already learned."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AL18W70RTZXFT"
                },
                "Date": "on November 16, 2008",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "I took physics for the first time last semester and had an aweful textbook.  This book really helped me.  It doesn't get fancy with deriving equations and junk like that.  The best thing about this book is that is is CLEAR and TO THE POINT."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21KK9F1SNV53Q"
                },
                "Date": "on September 17, 2011",
                "Helpfulness": 1.0,
                "StarRating": "2",
                "Text": "I dont think of this book as a study guide for those in a physics class, be it high school or college level. It explains some concepts only, and doesnt have a variety of practice problems that you can work on for each chapter. It also doesnt go deep into each chapter, just sort of skims the surface. It's ok for those that just want to know a bit about physics, but is surprisingly unhelpful (b/c it is very unlike the \"for dummies\" books ive read before) for students."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17VT630JYPEM1"
                },
                "Date": "on November 11, 2011",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "A very instructional book, and in the end, you'll know WAY more than when you began. everything is great, except for one little problem. The author doesn't make some of the formulas very clear, ect. Othern than that, I would've rated it 5 stars. It is, as it says, in plain English, and pretty easy to understand. A great book for anyone wanting to know basic physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31C2USG2U8PNJ"
                },
                "Date": "on July 5, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JJLSTSJHNL0X"
                },
                "Date": "on January 25, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "I would probably rate it higher if I hadn't purchased the kindle edition. The equations they use to demonstrate the formulas are so small on my kindle I can't even read them. And changing the font size makes no difference in those examples. Just don't buy it for your kindle."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KJTYS9SZ1KJU"
                },
                "Date": "on December 8, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I love Physics but haven't studied it since high school - a life time ago (I am now 68) - this book is a great refresher and really jogged an ageing brain back into life."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XVB4Q1BOOZNS"
                },
                "Date": "on July 25, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Although I dropped out of my physics class before the semester started, this book helped me achieve my dream of learning what vectors are all about. If I ever take physics again, I'll be sure to give it another glance."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEMH6NZWIFIZ4"
                },
                "Date": "on July 16, 2013",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": "Bought a used book that was supposed to be like new but was nothing like new.  Worn and used extensively would have been a more accurate description of this product.  Returned the book immediately after receiving it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AD0JB2LCMXPV6"
                },
                "Date": "on January 22, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "If you're like me, then The Dummies series is how you learn stuff.  But this will go a long way for those who are looking to go back to school, who are in school, or just want to learn physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AP7FL9ZIFPUF"
                },
                "Date": "on May 16, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Dummies books are awesome.  They take the most convoluted subjects and simplfy them to easily understood reading.  I am addicted to Dummies books for all subjects"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2060G5V6XL4IN"
                },
                "Date": "on September 16, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This book is well prepared and easy to read.  It does take into account that you are using the other 2 manuals to assist in understanding this course information."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2L6Y32VJNT54Z"
                },
                "Date": "on January 14, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I like it.  It really lays it out for you in ways that your professor might not.  It is a great companion book to read concurrent with a 1st year Physics class."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24LRLX5PPRHWS"
                },
                "Date": "on July 9, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This author uses a lot of real world examples that makes the concepts easy to understand and relate to. Great for someone just learning physics or brushing up."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NYM48D5H9CGK"
                },
                "Date": "on September 18, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "An informative and very easy to understand text book. Another example of the Dummies series simplifying what once seemed complex."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JON8UVO3BKWK"
                },
                "Date": "on January 1, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This helped me very much as a supplement to my text and clarified many things. I would suggest everyone buy it at this price."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TCGNUF1OWSWO"
                },
                "Date": "on September 18, 2010",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "We had to order this book for school. We only just started using it, so far so good! It seems easy to read and follow."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1B69G9K54N8AN"
                },
                "Date": "on December 17, 2010",
                "Helpfulness": 0.625,
                "StarRating": "1",
                "Text": "Don't waist your time with this book.  Why?  You're probably looking for an supplement, or introduction to physics, to help you fill the gaps, and have examples that your textbook at school may lack. This is a terrible dummies book, hard to follow, understand, and it's not advanced material.  It's just not thought out or fully developed for someone new to the subject.  Even the introduction to kinetics is lacking enough information and example to make it understandable.  The simplest ideas of motion, vectors, velocity, acceleration give little explanation or example.  I found this book Completely useless as an introduction or a supplement.  I turned to the web and found much better resources available for free, pod-casts and video."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MVHP3W9K1ADD"
                },
                "Date": "on October 28, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Great book quality but missing the cheat sheet, Would have been better if the sheet was included in the purchase."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4JO9LW2BZBJZ"
                },
                "Date": "on December 9, 2013",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": "not so wonderful. the textbook from school for me was more helpful then this. I got ride of this book (sold it)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHKMP7SPYPFPO"
                },
                "Date": "on July 2, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Good Book. Very informative. Really enjoyed and learned."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37MMWQIOO69TD"
                },
                "Date": "on January 22, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Awesome product and wonderful customer service"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QVFRIFY0F7IS"
                },
                "Date": "on May 21, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "just what I expected! very good!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21KW9NT015LPR"
                },
                "Date": "on November 25, 2009",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": "I bought this for my armchair science hobby and it's ok for that purpose I suppose. It's more suited for students that are still in school with a fresh understanding of math as that is what physics is mostly. I wouldn't recommend this book to anyone just interested in broad scientific knowledge as it's mainly just learning equations and such."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6VTNAF46YK5Q"
                },
                "Date": "on December 13, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "learning alot"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2USPA5NVFMIZ3"
                },
                "Date": "on September 25, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "like it"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37ZQ865Y9H4VR"
                },
                "Date": "on June 30, 2011",
                "Helpfulness": 0.5,
                "StarRating": "1",
                "Text": "After taking AP Physics and college Physics years ago, I wanted to brush up on my physics.  After the first few chapters of this book it was clear the author didn't carefully check the editing stage.  There are errors made every so often in key areas that really affect explanations.  Not that the explanations are that clear or thorough to begin with.  Some drawings are wildly incorrect and not what the author intended.  This is a very disappointing book that will not be very helpful to a person trying to learn Physics for the first time.  Better to use the book for testing the friction on the sides of your trash can."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IM8HQQR39RWB"
                },
                "Date": "on March 8, 2009",
                "Helpfulness": 0.25,
                "StarRating": "5",
                "Text": "Bought this book to help teach my Daughter Physics for the 9th grade, looks like it will be a BIG help"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3F86FO75QP7O6"
                },
                "Date": "on March 25, 2007",
                "Helpfulness": 0.4878048780487805,
                "StarRating": "1",
                "Text": "if you are really a \"dummy\" when it comes to physics, then this book is nearly a waste of money. It has incomplete explanations and very few examples."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AWWGLVXKI2I3"
                },
                "Date": "on May 6, 2007",
                "Helpfulness": 0.16666666666666666,
                "StarRating": "3",
                "Text": "It's pretty good, although it could be better. It would have helped to be a little more concise, or to have more examples; really just MORE. It does help, though."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5NVARJ25PN26"
                },
                "Date": "on May 8, 2008",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "Well, I'm not a dummy but this book will make you check your past algebra skills."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15WICBY36EPOY"
                },
                "Date": "on January 11, 2007",
                "Helpfulness": 0.36363636363636365,
                "StarRating": "5",
                "Text": "I found this to be a very helpful supplement while studying for physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MBQEDPF9CL84"
                },
                "Date": "on February 17, 2006",
                "Helpfulness": 0.2,
                "StarRating": "4",
                "Text": "This book was purchased as a gift item and the recipient is very pleased with it.  Have been told that it is providing exactly the base of information that is needed for her particular situation."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3V1FA3QG65IMC"
                },
                "Date": "on April 14, 2009",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I have been very pleased with the service provided by Amazon.com.  They have been super fast to ship the items I wanted.  I have ordered multiple books, CD's and other items and have never had a problem with the delivery, quality or service provided.  Thank you Amazon.com"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16122RFK2XUA3"
                },
                "Date": "on March 6, 2004",
                "Helpfulness": 0.17777777777777778,
                "StarRating": "5",
                "Text": "I was fortunate enough to know the author and able to get a copy of the unpublished (unedited) book, \"Physics For Dummies,\" by Kimberly Zimmermann and found this book invaluable in understanding concepts of college freshman physics while feeling bogged down with equations in the class room. I especially liked the \"at home\" experiments outlined in the book using only objects you have lying around your house. I passed the book along to a friend who took the class a year later who also found it helped him tremendously with the concepts of physics often lost in all the equations you are bombarted with while in class. What was especially neat was how the table of contents of the \"Physics For Dummies\" book written by Kimberly C. Zimmermann followed the freshman text, Holiday and Resnick'stable of contents makingh it easy to reference and supplement my reading. I was going to order the book to keep it as a reference, however, the author (a friend of mine) has informed me that when the book finally does get printed and arrive on my door step it's highly likely it will not be the book she wrote; that what I order will most likely end up being an entirely different book from an entirely different author. This is disturbing."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Physics-Dummies-Steve-Holzner/product-reviews/0764554336/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "48"
    },
    "Salesrank": "#238,396",
    "Timestamp": "2015-05-24 12:42:28.170348",
    "itemurl": "http://www.amazon.com/Physics-Dummies-Steve-Holzner/dp/0764554336"
}
