{
    "Category": "in Books (",
    "ListPrice": "$25.95",
    "Name": [
        "The Physics Problem Solver (Problem Solvers Solution Guides)"
    ],
    "OfferPrice": "$20.91",
    "Reviews": {
        "AverageStarRating": "4.3 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WHSBVLBCQHW"
                },
                "Date": "on September 2, 2001",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Y6RIWF66MV1H"
                },
                "Date": "on July 27, 2002",
                "Helpfulness": 0.9615384615384616,
                "StarRating": "5",
                "Text": "As a physics and astronomy major in college, I wanted to say how much this book helped me in the years past.  This book is undoubtedly the BEST textbook \"supplement\" that a student in AP Physics (B or C) or a beginning physics major can have!  This Problem Solver is exactly what it says it is - a book full of physics problems worked out in detailed solutions.  All too often I hear people complain that these books are not very helpful because they're not organized better, etc.  But that's nonsense!  If you're in one of the above-mentioned courses and it's late one night and you're stuck on a homework problem...there's a VERY GOOD chance that there's a problem in this book that you can use to work through the solution.  This book should not be used as a study guide, but as a reference source for anywhere from beginning to more advanced problems.  The wide range of difficulty level is the best reason to have this book because rarely do textbooks have examples that are difficult.  Textbooks like to show \"easy\" examples in then the student gets stuck on the more challenging homework assignments and exams.  This book is well worth the money!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKGH35AEEWYDP"
                },
                "Date": "on December 23, 2002",
                "Helpfulness": 0.896551724137931,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on January 12, 2002",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Well where should I begin? I guess I'll start by saying how useful and helpfull the book is for every physics, engineering, or any person wishing to expand their understanding of physics. I had a chance to use it once and boy I was impressed. Thus, I had to purchase one for myself. I am a physics student, and although I am pretty good at it, a little help now and then would'nt hurt. That is where REA's book comes into play, and quite nicely I might add. I like the way its structured by subject areas and the problems ordered in varying degrees of difficulty. Plus the diagrams (an essential part of understanding any physics problem)are great to. Defintely a must have!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FDI9ZHI4O7SG"
                },
                "Date": "on May 12, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BLIL2PCWB3DC"
                },
                "Date": "on August 9, 2001",
                "Helpfulness": 0.8947368421052632,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UT4U3MC5YTWM"
                },
                "Date": "on May 31, 2000",
                "Helpfulness": 0.875,
                "StarRating": "5",
                "Text": "This book contained in depth explanations for many of the problems I encountered in AP Physics. A must for anyone going into Physics"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASP8ZHQ41Y33P"
                },
                "Date": "on February 27, 2011",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25VQL46PV1E5D"
                },
                "Date": "on October 8, 2005",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "5",
                "Text": "I'm very impressed; this book has loads of problems with which I can practise. It's simply the best physics problem book ever published!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1D1MIFRSG50Y3"
                },
                "Date": "on March 16, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10GFT42EAC85C"
                },
                "Date": "on May 22, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is a great place to look for problems with clear explanations.  I would recommend it for students to prepare for exams and teachers to find exam questions.  :>)  For me, it provides an excellent refresher."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DPTMPWNAYBZW"
                },
                "Date": "on October 10, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Not perfect but still a life-saver when stuck. Some mistakes in there, the correct answer was in the textbook. But seeing the steps laid out when you are totally flummoxed was great."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13F35E45PRY9H"
                },
                "Date": "on February 14, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "When i buy a NEW book, I expect a new crisp and clean book. The book I received is technically \"new,\" but its been through so much storage shelves that it has small tears and a little yellowing. Since the book I got was reprinted in 2004 it must have been stored away through a whole decade at least. So be sure to ask the seller for the actual condition of the book... and the edition. I was expecting the 2010 printing that i saw in the ebook preview, but i'm sure there's no major revision between them. These are my only complaints I have. The actual problems in this book are AMAZING. Although, like other buyers have said, the font will take getting used to. But this doesn't impede my learning from this awesome book. And BTW there are about 1100 problems in my edition."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1024I0GVVSDZ"
                },
                "Date": "on January 2, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I use this book to study for tests and each topic has a good set of problems going from easiest  to hardest"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35RG4HVTNRBVX"
                },
                "Date": "on June 22, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "It is a great resource. The type face lets the presentation down a bit, but not a big problem. Thankyou"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LE287FOBH44J"
                },
                "Date": "on April 29, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I purchased this book to help brush up on some physics concepts I haven't used in years--not since being in college.  It's  very comprehensive, and it starts off basic enough and builds on basic concepts to more advanced ones.  Very good as a study guide or a desk reference.  If there's anything you've forgotten, this book will certainly help you re-learn it in a jiffy!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EVL4XW9U84NS"
                },
                "Date": "on January 30, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I love this book. It's like my bible. I absolutely love the format and typeface. The only thing I wish was that it were more organized, such as in the typical order of a general physics book, I had a hard time finding things from time to time, but otherwise great."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AZQABLL7VDOE"
                },
                "Date": "on January 25, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YZXGES3ONCYV"
                },
                "Date": "on December 30, 2011",
                "Helpfulness": 0.5,
                "StarRating": "2",
                "Text": "The book didn't really help me understand how to solve my physics problems in class. It was vastly different than my undergraduate engineering physics course taught how to solve problems. For the most part, it left me more confused. I purchased a different book that helped much more than this. However, the summary it has for each chapter helped me understand the concepts more. If you're looking for a book to help you solve physics for undergraduate work, I would look elsewhere."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4XY53BW3TPLP"
                },
                "Date": "on November 3, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A VALUABLE STUDENT COMPANION."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2U81PP7JG7008"
                },
                "Date": "on January 4, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "helpful book for class"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AV3G5BDAIQ9UG"
                },
                "Date": "on December 26, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Superb."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1R8LYWYI23P6J"
                },
                "Date": "on September 19, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on January 16, 2003",
                "Helpfulness": 0.36,
                "StarRating": "1",
                "Text": null
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Physics-Problem-Solver-Solvers-Solution/product-reviews/0878915079/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "24"
    },
    "Salesrank": "#336,757",
    "Timestamp": "2015-05-24 12:28:24.407926",
    "itemurl": "http://www.amazon.com/Physics-Problem-Solver-Solvers-Solution/dp/0878915079"
}
