{
    "Category": "in Books (",
    "ListPrice": "",
    "Name": [
        "My Inventions"
    ],
    "OfferPrice": "$7.99",
    "Reviews": {
        "AverageStarRating": "4.2 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VHDXOTX2K3UY"
                },
                "Date": "on January 18, 2011",
                "Helpfulness": 0.9310344827586207,
                "StarRating": "5",
                "Text": "An excellent read.  Tesla explains some of his background and the way he thinks.  He then explains his technology for trasmitting energy and information all over the world.  It's amazing how closey his description matches the internet 100 years later.  Read it, maybe someday we'll get past the societal issues that have delayed this tecnology for a full century."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2058V5XEXN8UK"
                },
                "Date": "on February 16, 2011",
                "Helpfulness": 0.9130434782608695,
                "StarRating": "5",
                "Text": "Tesla's book is well worth reading.  It was fascinating, from beginning to end.  I had never read anything about him but was aware of the Tesla Coil.  He had a great mind and invented many things.  I plan on reading more about him and details about some of his inventions."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UNR1BH9BLVXP"
                },
                "Date": "on January 28, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Great short and concise information of Mr. Tesla's work.  He was very intelligent and willing to think out side of the box.  It is sad that history does not raise him up to the level so deserved since he was the one that created our electricity method used throughout the world."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TKET05HC8CPZ"
                },
                "Date": "on November 14, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CP96O04C7OPW"
                },
                "Date": "on September 20, 2012",
                "Helpfulness": 0.8888888888888888,
                "StarRating": "5",
                "Text": "Nikola Tesla was a genius ahead of his time, with a strange understanding of birds.  His writing is just as impressive as his work with alternating currents and left me entertained wanting to read more.  He is sincere, witty, and delightfully entertaining describing his early life, and his journey to America.  My only gripe with this book is the length, as it is not very long.  Tesla is one of my favorite authors and I wish he devoted more time to writing."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A339OOXD57KATK"
                },
                "Date": "on January 7, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IKQKG3UJJGKU"
                },
                "Date": "on September 5, 2012",
                "Helpfulness": 0.8,
                "StarRating": "4",
                "Text": "I liked this book.  I like Nikola Tesla and all of the crazy things he did or may have done.  At times his writing got a little too. . . theoretical? technical?  Anyway, there were times when I had no idea what he was going on about.  But he had some intriguing philosophies and ideas about how the world works.  I was particularly fascinated with his psychological self-evaluations.  I've recommended this book to some pyschologist friends of mine to get their take on it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25O9X8YYVX9PB"
                },
                "Date": "on November 27, 2012",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "Intriguing book about one of history's true quirky and original thinkers.  Worth the time and effort.  I am fairly sure Tesla would have had a psychological label today's world, but his single minded focus allowed him to come up with some amazing inventions that are applicable even today."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AITBJX2ENHNEL"
                },
                "Date": "on September 15, 2012",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "My Inventions is an excellent complement to \"The Life of Nicola Tesla - Prodigal Genius\" by John J. O'Neill. It goes into more detail about his early life and inventions and contradicts some of the myths about his dealings with a major American banker. Nicola Tesla played a critical role in industry which has not been recognised."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12FX69Z0V4K1I"
                },
                "Date": "on September 9, 2012",
                "Helpfulness": 0.6818181818181818,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12ZM9I0V0FJKN"
                },
                "Date": "on September 3, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is a classic read and I highly suggest anyone interested in learning who Nikola Tesla was should start here with this book! I bought this book even though I've already read the pdf version online years ago I wanted to read it over in the comfort of my home. The book is an easy read and once done you could always pass it on to someone else if you want to introduce others to Tesla's work and get a good insight into his mind. I wish this book had mentioned about Tesla's Death ray or the Teleforce which is my interest at the moment after hearing about this on  http://www.nikolatesla369.com/nikola-tesla-death-ray-or-death-beam-the-teleforce/ so if anyone knows where i can get a physical copy of a book about Tesla that discusses this, please let me know! So i give this book 5 stars and won't take any points away because when Tesla first wrote his autobiography for a magazine in 1919 at the time there was no vision of his death ray concept until later on. I also recommend if you enjoy this book and want to get more technical and if you are familiar with electrical engineering terms, get Nikola Tesla's Colorado Springs Notes 1899-1900 it's well worth it!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23HUPSEXR68QN"
                },
                "Date": "on September 4, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "A pleasure to read. The man had more genius than any one person should have. Too bad he didn't go more in depth with descriptions of his inventions."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOIBOJRBYYVGI"
                },
                "Date": "on February 14, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book was nothing short but inspirational. I am in no way an electrical expert but this book makes me want to start a career in electrical engineering. After reading this informative autobiography of one of the world greatest inventors, I started researching ways to learn basic electrical components and how they work hands-on. I am mechanically inclined in certain ways but not an innovating way that Tesla was. The books shows how his ambitious mind to better mankind worked till he either passed out from exhaustion or a nervous breakdown. This is one of my favorite books and took notes of his quotes and actions so that I can mimic his persona to my advantage in some way."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VWT013H2VKPT"
                },
                "Date": "on January 12, 2013",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "This is one of my heroes. Despite how he lived toward the end of his life Tesla's overall story is one of wonder and inspiration. What a creative and inexhaustive man. He fought many battles for his patents and especially against JP Morgan and the likes of him. This is an excellent treatise for all inventors and creative people in general. I picture him as the Walt Disney of science."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32XGXDRKTOU46"
                },
                "Date": "on April 18, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Tesla didn't leave much of a material for general public behind him. Tesla also didn't have many close friends who would have a real insight into his life to write a story about him. Since this is an autobiography it will provide you a peek behind a curtain into Tesla's mind and his private thoughts. It will tell you a bit about the man, his motivations and system of values he had. Its a must read book for those who want to know more about one of the greatest inventors of the 20th century and perhaps of all time."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RF2LR1GVD564"
                },
                "Date": "on April 5, 2012",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "interesting view of a very complex man. his inventions and contributions to the electrical engineering field may never be fully appreciated due to his lack odf documenting his work."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A389Q7VDCJDW70"
                },
                "Date": "on March 5, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "this is the first book I am reading about tesla and so far it gives a real insight about tesla both s personality and work. he is a true genious, ambitious, and show us what a human mind can do once it is focused. Fun to read book"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A313SD544IGVXP"
                },
                "Date": "on December 4, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ULFP83B31D05"
                },
                "Date": "on July 17, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Whether he actually invented or contributed to furthering the thinking that brought us into our current world. After reading of his inventions, his thinking and theories you will look around and start seeing little pieces of Tesla's mind in so many everyday things we now take as necessary for living."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9FKUPFZZR6DS"
                },
                "Date": "on June 15, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I really enjoyed this book and the insite to his life. If your interested in Tesla, this is a book to check out."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JHBKCUZO7XG1"
                },
                "Date": "on April 23, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32ZIJRJJQU3V1"
                },
                "Date": "on March 29, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Prompt service and very informative book. It helpe with my system.  I would buy from seller again and recommend it to others. Product priced well."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJWARW9336JTO"
                },
                "Date": "on March 24, 2013",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "I loved his personal stories from youth, but then the book goes too much into technical details and it's hard to follow. an interesting read anyways. the publisher could have done a better job with the formatting of this book"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3F6Y8MPUBG3GI"
                },
                "Date": "on March 3, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book is recommended for everyone who wants to learn who Nikola is. It's a fun and educational book.  Great book!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HKKGIUJE03SA"
                },
                "Date": "on February 9, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Which is what makes this book awesome. If you don't get why it makes the book awesome, I feel bad for you.To the person who said he was arrogant- no s***. He has good reason to be. That's half the fun of the book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3102C5Y6A6YTI"
                },
                "Date": "on February 6, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Easy read. Interesting, comes with some illustrations. Some intriguing stories of Tesla's experiences and childhood. I enjoy biographies. For the price, why not? It can't hurt."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38WQS2NTE66HT"
                },
                "Date": "on February 5, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "If you know who Tesla was and his contribution to the civilized world of electronics then I do not need to say any more. This is not a technical book but an overview of his life and background material for his basic contributions. A little more content than WIKI info and easily readable. It's mainly written for an introduction to Tesla and his life."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26JYB0VBCAZZE"
                },
                "Date": "on August 11, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Quite an interesting man, all the proclamations made by him were very interesting. It is amazing that we know so little about him and that so many inventions were not attributed to him although he should have been given credit of some sort"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BD1VBO65NXXU"
                },
                "Date": "on October 13, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADCLB2EWYZYPZ"
                },
                "Date": "on April 5, 2015",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "This book is not as interesting as I thought it was going to be. I really want to know how his inventions work but this more like his diary. Oh well."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6I6Z8KJSK9VE"
                },
                "Date": "on March 21, 2015",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": "Too philosophical, not enough info about the inventions.  The inventions noted didn't explain there present day applications."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5JL6U11GJ5EX"
                },
                "Date": "on November 28, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "My Inventions Nikola Tesla came in a grouping of 3 books about Nikola Tesla were well heat sealed packaging."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A229AA5KTN6JII"
                },
                "Date": "on November 2, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I am as amazed by his mastery of the English language as I am with his knowledge of science and technology."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARG8IQ6JR3DQL"
                },
                "Date": "on October 7, 2014",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XKHB8Q6VM30P"
                },
                "Date": "on April 20, 2015",
                "Helpfulness": "",
                "StarRating": "1",
                "Text": "Very incoherent writing with a lot of ego.  Really couldn't ever get into this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GV8FG13Y93JF"
                },
                "Date": "on December 15, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Tesla was way ahead of his time. This is about some of his inventions and ideas."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Y44Z7ACUQ6Y6"
                },
                "Date": "on September 6, 2012",
                "Helpfulness": 0.6,
                "StarRating": "3",
                "Text": "An interesting read by one of the most interesting and icon figures of the turn of the last century. Tesla in his own words does not really help you understand him better, but gives insight into his own understanding of himself."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22JAKZERVM5KS"
                },
                "Date": "on February 23, 2013",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": "Beginning in the 19th century, Nicola Tesla invented most of the things that we took for granted in the 20th century, and now do in the 21st.  This book describes many of them, including the polyphase AC motor, the AC transformer, and radio."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LS4QPDNFV103"
                },
                "Date": "on January 24, 2013",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A194Q2Q3ZNK0D4"
                },
                "Date": "on April 25, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "arrived on time.  product exactly as described.  very satisfied."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALAR6WU0JQBRY"
                },
                "Date": "on November 17, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Tesla has never received the praise he so deservidly earned!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SGYGPGC0BX4L"
                },
                "Date": "on August 25, 2013",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": "I was hoping for a little more technical detail, the inventor explaining how the darn thing worked.  Or at least how he thought it did.  No doubt NT was an amazing person and you do gain insight as to how he thought, but wanted a little more technical beef. :-)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1A2EGUX88Y2MV"
                },
                "Date": "on January 2, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "love the book"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWHPYSMKQRLRG"
                },
                "Date": "on May 3, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Thumbs Up!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NERCAJOK2KK2"
                },
                "Date": "on April 11, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "great read"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AN8JD8P57J7TV"
                },
                "Date": "on February 3, 2013",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "I was disappointed in this short book about Tesla.  I fully expected and wanted to hear more about his inventions in detail but we only get a braggard's perspective of them while we learn about the little details of Tesla's life.  The book is titled 'My Inventions' yet reads more as an autobiography."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38GD9ELC55JD5"
                },
                "Date": "on July 18, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Genius"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALQNOSMQR8AFR"
                },
                "Date": "on August 1, 2013",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "He was a wierd dude.  It's kind of weak on biographical info and weak on details of inventions but definetly describes his weirdness.  Easy read worth cheap price only."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NXV8RTLIR5KC"
                },
                "Date": "on January 23, 2015",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": "it took for ever to get to me and it is a repeat of other book that I get in the bundle"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A314C88NUE2XU6"
                },
                "Date": "on March 10, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "reading this makes you wonder if this is all true..sort of what reading Sheldon Cooper's bio would be like...fascinating..really odd"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A155DEGCMZ5H5M"
                },
                "Date": "on January 2, 2012",
                "Helpfulness": 0.5333333333333333,
                "StarRating": "2",
                "Text": "Whatever merits Tesla might have possessed (and I'm willing to allow he was an unparalleled genius and incredible inventor) does not change the fact that this book is an incredibly long and flattering ode to his many self discerned abilities. Frequently he quotes great men who have praised him, or relates an anecdote that shows him in a great light, or tells us some tidbit which truly strains our credulity. I was extremely interested in Tesla's inventions and his methods, but details on these were sadly lacking. The book concludes with a grand description of his plan to transmit wireless power, which has never been realised, and is entirely impractical, though the reader would not be able to discern this through the excessive hyperbolae and complete lack of technical detail. In many ways, this book reminds me of Feynman's anecdotes, without even the slight humility which makes the latter palatable."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KKBBAAUI17RY"
                },
                "Date": "on December 28, 2012",
                "Helpfulness": 0.2857142857142857,
                "StarRating": "2",
                "Text": "I had a better opinion of Tesla before reading this short and lacking depth book. Look elsewhere for info on Tesla"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BTBPVKTSNA31"
                },
                "Date": "on August 1, 2013",
                "Helpfulness": 0.1,
                "StarRating": "1",
                "Text": "There is very little real content in this.  Tesla projects a very high opinion of himself that is not borne out in many cases.  He claims to have developed many things that he never did document and were never proven by others.  If you are tech savvy, don't bother with this."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/My-Inventions-Nikola-Tesla/product-reviews/1484127358/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "53"
    },
    "Salesrank": "#32,092",
    "Timestamp": "2015-05-24 13:22:17.134712",
    "itemurl": "http://www.amazon.com/My-Inventions-Nikola-Tesla/dp/1484127358"
}
