{
    "Category": "in Books (",
    "ListPrice": "$15.99",
    "Name": [
        "Dancing Wu Li Masters: An Overview of the New Physics"
    ],
    "OfferPrice": "$12.00",
    "Reviews": {
        "AverageStarRating": "4.1 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GCF1CLZMAH40"
                },
                "Date": "on February 3, 2007",
                "Helpfulness": 0.9523809523809523,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NF2Y5WSC4KM8"
                },
                "Date": "on May 9, 2000",
                "Helpfulness": 0.9578947368421052,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AR2DE47VCY1C8"
                },
                "Date": "on June 17, 2000",
                "Helpfulness": 0.9314285714285714,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on April 22, 1999",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I am a scientist who has taught physics my entire career, and was really impressed with this book.  It was given to me as a Christmas present by my daughter.  I did not get to it for a while, but when I did, I COULD NOT PUT  IT DOWN!  I never thought it was possible to explain quantum mechanics  without math, but Zukav did it in a marvelous way.  I would recomment it to  anyone who would love to come into contact with new ideas and concepts.  Truly a great book!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on November 16, 2000",
                "Helpfulness": 0.9318181818181818,
                "StarRating": "5",
                "Text": "Zukav explains the most complex principles of quantum physics in way that most anyone can understand.  He uses metaphors and beautifully written prose instead of complicated, dull, discursive, scientific jargon.  Instead of describing this subject from a strictly left brain approach his writing is from a  whole brain perspective appealing to both the artist (or in my case musician) and the scientist.  He takes physics to the brink of philosophy and beyond in an effort to describe the physics of the universe in spiritual terms.  I tried to read _A Brief History of Time_ by Stephen Hawking a few years ago and didn't get past chapter four.  After the education I received from Zukav in _Wu Li_, I was able to read and comprehend almost all of _A Brief History of Time_.  Give it a try"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EOB1L8RC6X91"
                },
                "Date": "on September 27, 2003",
                "Helpfulness": 0.9354838709677419,
                "StarRating": "5",
                "Text": "This book is THE book to read for those who are not familiar with complex math, but are interested in the basic principles of quantum physics. First, I must say that anyone who gives this book a bad rating has either not understood any of the material or not read the book at all. It covers all aspects of basic quantum theory from the first beginnings of it (Plank's constant, discovery of quanta through study of Black-body radiation; wave-particle duality, Heisenburg's uncertainty principle, Schrodinger's wave equation & wave functions, etc...) to relatively newer quantum theory (the Space-Time Continuum, Black Holes, Bell's theorum, quantum logic, etc...) as best as english (combined with articulate diagrams) can describe WITHOUT MATH. This book contains the best desciption and examples of Einstein's Special and General Theories of Relativity that I have ever UNDERSTOOD. Coupled with Zukav's amiable style this book is an extreme pleasure to read. One thing I found foresightful was that many parts of the book have footnotes that are written by physists who previewed the book and expounded upon the writing therein with by clarifying concepts for those who are familiar with physics and math already. 95% of this book is about understanding these new ideas (more specifically being led upon the road to experience and understanding rather than having things crammed into your brain just to be regurgitated into nothingness) and 5% (in the introduction and last chapter mostly) about how this \"New Physics\" coorelates to eastern religious views (NOT NEW AGE RELIGION) that have been in practice for thousands of years. The book comes complete with bibliography of all the literature Zukav has referenced in his own quest to understand quantum physics and the nature of reality and a extremely complete index that is very useful when you need it. Over all this book was relatively very easy to read (when it comes to science books) and I would recommend it to anyone who is curious about how reality is defined."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AABNRGHQUDQ85"
                },
                "Date": "on May 10, 2003",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A320NPLK237ZN4"
                },
                "Date": "on May 24, 2003",
                "Helpfulness": 0.9565217391304348,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1U111TQG06S22"
                },
                "Date": "on May 23, 2000",
                "Helpfulness": 0.8823529411764706,
                "StarRating": "5",
                "Text": "Being involved with Martial Arts for several years is what attracted me to  this title in the beginning. I had recently read Dr. Zukav's book \"The  Seat of the Soul\" for the second time in the space of two weeks, and I  found myself connected to the story. I wanted more. There was a reference  made to other books by Dr. Zukav in \"The Seat of the Soul\". So,  finding myself in one of the major brick and mortar bookstores, I sought  out the title \"The Dancing Wu Li Masters\" not being aware of  \"An Overview of the New Physics\" part of the title. Heck,(can I  say that in here), my thoughts about content couldn't have been further  from the mark. But not wishing to summarily dismiss a potential  syncronicity, I scanned through the preface and stumbled on various  separate passages that promised the following: no exposure to arcane  mathematics, a correlation of the history of 'physics' in a meaningful and  digestible way from Newton to Einstein and then some, and finally a  suggested relationship to 'The Physics of Eastern Metaphysical Philosophy'.  The last being my words for summarizing the amazing parallels Dr. Zukav has  woven into the story. I am not a scientist at all. Yet I feel more than  sure that I have a decent grasp, in my opinion of course, of the  fundamental differences between the classic definition of physics, the  important players there and the New Physics and respective players in that  space. I should probably pass some sort of test to demonstrate on what  classic scale of understanding I rate .... but I can tell you that prior to  Dr. Zukav's book, a fat zero is where I was. The grade matter's not  however. What does matter is the discovery of all that I have missed for  better than 20 years (I am pushing 49). Truly sad, almost appaling and yet  marvelous at the same time as the words better late than never pop into  mind. What sanguine impression could I leave with this review (tongue in  cheek here)? Perhaps this: If you have ever felt certain that science has  all the answers; If you have ever felt certain that religion isn't cut and  dry or that it definately is; If you have ever felt certain that there must  be something more, that this reality you experience everyday is all there  is; If you have ever felt certain that you needed more substance from which  you could build your answers to your searching questions, questions that  you had not even realized you could indeed ask, needed to ask, about why  'things' are as they are, including 'you'; If you are certain that you are  open, a seeker - then read this book. You are already interested, I hope I  didn't spoil it for you! Carpe Diem, Brutus."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VZM1FQM1M5NL"
                },
                "Date": "on October 30, 2005",
                "Helpfulness": 0.8666666666666667,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AID464VQP9Y70"
                },
                "Date": "on October 18, 2001",
                "Helpfulness": 0.7874659400544959,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EOB1L8RC6X91"
                },
                "Date": "on September 27, 2003",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book is THE book to read for those who are not familiar with complex math, but are interested in the basic principles of quantum physics. First, I must say that anyone who gives this book a bad rating has either not understood any of the material or not read the book at all [...]. It covers all aspects of basic quantum theory from the first beginnings of it (Plank's constant, discovery of quanta through study of Black-body radiation; wave-particle duality, Heisenburg's uncertainty principle, Schrodinger's wave equation & wave functions, etc...) to relatively newer quantum theory (the Space-Time Continuum, Black Holes, Bell's theorum, quantum logic, etc...) as best as english (combined with articulate diagrams) can describe WITHOUT MATH. This book contains the best desciption and examples of Einstein's Special and General Theories of Relativity that I have ever UNDERSTOOD. Coupled with Zukav's amiable style this book is an extreme pleasure to read. One thing I found foresightful was that many parts of the book have footnotes that are written by physists who previewed the book and expounded upon the writing therein with by clarifying concepts for those who are familiar with physics and math already. 95% of this book is about understanding these new ideas (more specifically being led upon the road to experience and understanding rather than having things crammed into your brain just to be regurgitated into nothingness) and 5% (in the introduction and last chapter mostly) about how this \"New Physics\" coorelates to eastern religious views (NOT NEW AGE RELIGION) that have been in practice for thousands of years. The book comes complete with bibliography of all the literature Zukav has referenced in his own quest to understand quantum physics and the nature of reality and a extremely complete index that is very useful when you need it. Over all this book was relatively very easy to read (when it comes to science books) and I would recommend it to anyone who is curious about how reality is defined."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Z1E38RS3T3PH"
                },
                "Date": "on December 8, 2001",
                "Helpfulness": 0.7901234567901234,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2E4LU2TMIJ5GW"
                },
                "Date": "on December 10, 2004",
                "Helpfulness": 0.8888888888888888,
                "StarRating": "5",
                "Text": "I did not have the problems that the last two or three reviewers had. The part of the book that mentions the Dancing Wu Lei Masters was an analogy. I happen to like analogies and I understood completely why he used it.  I also have a very open mind. Think of everything in this book as a theory, as a possiblity, as a chance and an excuse to stretch your imagination. The author, in my opinion has a way with words and breadth of vision which to my mind is a formula for some pretty exiciting writing. He is able to make associations that actually make sense (to me anyway).  I found his descriptions easy to understand and I had no trouble with the prose. You know I wish I could read a physics book and learn about physics but then there's the math thing...and is it me or are those books incredibly dry?  To all the scientist that read these reviews...of course this book isn't going to appeal to you....you know the math!! Some of us aren't blessed with that ability or the inclination. I am grateful to the writer of this book. I found it riveting, enjoyable and incredibly facinating.  The analogies made it fun and everyone knows the best teachers make their subject enjoyable and interesting. This author has definately done that for me. If you have trouble with abstract concepts and/or are offended by the integration of science and philosophy you may not want to waste your money and perhaps go to a college bookstore instead."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1J93EGDYK0IWA"
                },
                "Date": "on March 31, 2007",
                "Helpfulness": 0.9230769230769231,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMW6Q2PG5BI8A"
                },
                "Date": "on April 12, 2004",
                "Helpfulness": 0.8823529411764706,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UE48FJ4CHIJF"
                },
                "Date": "on August 27, 2001",
                "Helpfulness": 0.8823529411764706,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on November 22, 1998",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is the book I give people for Christmas, tell strangers in bus stations about, etc.  It really is a life-changing book, as gushy as that sounds.  It is for the intelligent layman, uses little or no math, but goes  very deep into an understanding of quantum physics, and links it in the  most intelligent and interesting way with eastern philosophy.  If you are  interested in the nature of reality, time, space, thought, matter, light,  intelligence, reality, etc, this is the book for you!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NUM3JIE6II0F"
                },
                "Date": "on March 20, 2004",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on November 10, 1999",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": "The mark of a great book, movie, play, piece of art, etc. is if it changes (for the good) how you view the world.  This book does this in the most amazing and fundamental way in that it clearly shows how you cannot fully  rely on you senses to interpret this world correctly."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2G8R4HU3ZWZ9R"
                },
                "Date": "on July 22, 2002",
                "Helpfulness": 0.9,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YFL6NW274MIA"
                },
                "Date": "on January 31, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BR6SE812ABY5"
                },
                "Date": "on March 18, 2006",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AINFVSQGK1SSD"
                },
                "Date": "on October 3, 2002",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 18, 2001",
                "Helpfulness": 0.8888888888888888,
                "StarRating": "5",
                "Text": "Maybe the criticisms below are warranted. I don't know enough about physics to say. But I DO know that I was scared to death of physics, never imagined myself opening a book with that word in the title...but I read this one, and learned about physics, and was pleased that the read was not intimidating. For a book about physics to keep me turning the pages is a major accomplishment."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2K4YD9XK824YR"
                },
                "Date": "on August 20, 2002",
                "Helpfulness": 0.875,
                "StarRating": "5",
                "Text": "Zukav gives us a sterling example of quantum physics in layman's terms with this book. Well written. He guides the reader through the amazing concepts of his subject with prime example, steadily stretching our imaginations to begin to grasp the principles that underlie our Universe, as currently understood. His prologue to Dancing Wu Li Masters is masterful in and of itself; artfully weaving mythos into current scientific standard, the summation of which is breathtaking: simple and true. I have handed this book to my friends and said, \"Just read the intro...\". They are hooked. This book is a 'standby' for me; always handy to pick up and open to any passage and have plenty to think about. It rests with Hawking, Capra, Castaneda and Chopra, all 'my' re-readable inspirations! It can be read en toto or in sections after the first reading. I am not a critic or a scientist, just an avid reader, and I had to contribute. Thanks!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HQ8RTAJYEUJO"
                },
                "Date": "on February 23, 2007",
                "Helpfulness": 0.7727272727272727,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADCGK1DOSHI6P"
                },
                "Date": "on June 26, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SRZQU1SZG4RR"
                },
                "Date": "on March 6, 2003",
                "Helpfulness": 0.8181818181818182,
                "StarRating": "5",
                "Text": "This is *the* definitive book to read for anyone seeking to understand the basics of quantum physics. Here is your guide to the particle/wave conundrum. Here is an explanation of two basic principles in modern physics: 1) the new logic of the relationship of subject and object and 2) the random changes which occur to objective properties. Zukav explains one of the most important discoveries of science, the Copenhagen Interpretation of Quantum Mechanics. He elaborates upon how and why ideas about reality, i.e. the experimental situation, differ from the experience of reality. Instead, probability replaces the absolutes of past science. The 'communication' of particles over the space-time continuum suggests a concsiousness to the particles. He discusses wave-particle duality, Max Planck's constant, Einstein's theory of the photoelectric effect, Pauli's exclusion principle, Lorentz transformation, particle physics,  Bell's theorem, and quantum logic, plus much, much more. Zukav's gift is to distill complex ideas and simplify them for inquiring minds \"who want to know\" but are \"afraid to ask\" or don't even know where to begin to ask. He connects metaphysical principles and science. He acknowledges that the use of words is often inadequate to describe the mysterious events of quantum physics. There is an unbroken wholeness to reality which when observed by individuals renders a loss of recognition to the interconnectedness of life. Quantum physics proves the interconnectedness of all reality in ways that only the mystics and spiritual masters described in the past. In fact, both scientists and mystics are beginning to use the same word descriptions ... This is an excellent book for those who dare to ask \"what's new in the world of science?\" Zukav has the ability to simplify complex concepts and link them to metaphysical principles in a very readable manner. Highly recommended reading! Erika Borsos (erikab93)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UCNI6CGW6013"
                },
                "Date": "on January 28, 2007",
                "Helpfulness": 0.875,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TYNI5HWQXZ7H"
                },
                "Date": "on April 23, 2002",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "If you're like me, an arm chair physicist in another line of work, you've tried and tried to understand recent developments in theoretical physics, only to stumble when you reach quantum mechanics.  Newtonian physics and relativity are fairly intuitive once you get the ideas, but quantum mechanics?  quantum electrodynamics?  quantum field theory?  Not easy stuff.  Zukav is the first author I've read who says \"Hey, if you're a lay person, don't sweat it.  Physicists don't really understand it intuitively either.  They're just equipped with the math to think it through.\"  Now you can relax in the knowledge that you're not dense, the subject is.  Thank you Mr. Zukav for making quantum mechanics accessible to the rest of us.  Don't let the title throw you.  Eastern philosphy plays a role in the narrative, but the book is about physics, pure and simple.  I highly recommend this book to anyone who has struggled to understand our view of the universe since Einstein."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Y9E9JRISI0W8"
                },
                "Date": "on March 10, 2004",
                "Helpfulness": 0.875,
                "StarRating": "5",
                "Text": "Wu Li Masters is more lucid than \"A Brief History of Time\" and \"The Elegant Universe\" combined in explaining Quantum Mechanics and Relativity, both of which are great books. Don't buy this book for a Eastern Religion/Physics connection (it's not very good), and don't buy this book to learn more about actual Wu Li Masters. Buy this book if you actually want to understand 20th century physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6HJ06Y4EFUDW"
                },
                "Date": "on June 7, 2002",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I am not a physicist.  I am not a budhist.  However, I found this book to be a wonderful journey into the realm of both.  Zukav strikes at the heart of modern science and reminds the Western world that it's all old news.  It was a challenging read, delightful at times, eye-opening at others.  If you like books by Hawking and Green, Zukav is the next step towards contemplating quantum mechanics and particle physics.  If you like the tao teh ching, this is also a must read.  In order to understand the beast of what is reality, it is neccessary to use tools appropriate per individual.  For the scientist that has become so dependent on data as to forget to question it's meaning, this is an important step in self awarness."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3E8QNDC7CV44"
                },
                "Date": "on July 17, 2009",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1U20CUTG6I28X"
                },
                "Date": "on February 27, 2000",
                "Helpfulness": 0.75,
                "StarRating": "4",
                "Text": "DANCING was a thought provoking read.  Zukav framed the vast cloud of quantum material very nicely.  He was able to do this without the use of math due to his insight into language --he accepted that math is no better  a language to describe physics than the metaphors, analogies and verbal  pictures of the written word.  I enjoyed his metaphor equating language to  the shadows on the wall of Plato's cave; that both physicists and  philosophy majors often mistake the shadows (language & math) for the  real world outside the cave.  It seems we must accept Zukav's premise that  there is no world to be seen outside the cave and we must all settle for  using the shadowy concepts of quantum physics to speak to each other with.  This will in no way diminish the spate of talkers (writers) who either want  to prove or disprove the nature of nature, dwell on the anthropic  coincidences, or allow God to take an offstage bow for this quantum clouds  of chaos we all must live in. Another great analogy Zukav gives us is the  line ( silver dots on photo plate) which shows up in the detectors of an  particle accelerator.  He claims this line does not necessarily show one  continuous flow of energy -- our minds must connect the dots. In this  startling way Zukav contends that the entire storybook of quantum mechanics  and classical physics is filled with mere dot pictures constructed by  people desperate to resolve inconsistencies (no doubt of their own  conceptual making). People are seen thus as dot connectors.  Physics is the  story of scientists putting on differing lenses which then determine their  principles, their theories, their laws, their world views and points of  view which we can then read and believe in at our peril.  Zukav sees  yesterdays nonsense as tomorrows hot theory. I paid small heed to Zukav's  overall proposition endeavoring to distinguish the dance from the dancer  and his simplistic attempt to liken philosophies of physics to Buddhism  because he didn't allow this bias to interfere with his straightforward  exposition of the physics.  There is nothing wrong with bias that is  clearly labeled as such."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on May 22, 1999",
                "Helpfulness": 0.7857142857142857,
                "StarRating": "5",
                "Text": "We have both the \"Tao of Physics\" by Fritjof Capra and \"Dancing Wu Li Masters\" in book and tape form.  My husband loves the \"The Tao\"  He is an M.D. and a scientist.  Me, I'm just a  woman, one who wants to know all I can about all I can. I can only do that  if I am not put to sleep by the material and its techno nature.  Zukav  makes it fun to learn about physics.  \"The Dancing Wu Li\" is  entertaining and just plain fun.  I highly recommend this book to all those  who feel they would like to have a deeper understanding of physics and the  nature of the universe - but have been reluctant to delve into the material  because of its technical nature.  The tapes are great too. Keeps you alert  driving because you don't want to miss a thing.  Way to go Amazon, what a  price.  Thanks."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GGHEP5RMOC04"
                },
                "Date": "on February 10, 2005",
                "Helpfulness": 0.7647058823529411,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2I4SUOZXVNU8I"
                },
                "Date": "on July 30, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TSSYH8Y0ZB74"
                },
                "Date": "on February 10, 1999",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I thought this book was excellent in the way it explained the new physics without over reliance on complicated mathematical models. The analogies given were effective. The concept of interconnectedness suggested by Bell's  theorem at the end was particularly interesting. The author mentioned the  similarities between physics and Eastern mysticism such as Buddhism and  Taoism. I would just add that Sufi mystics talk a great deal about this  same \"oneness\" to everything. In the Qur'an, God is quoted as  saying, \"Be.\" \"And it is.\" He later states, \"I am  the only Reality.\" One wonders that if everything is observer created  to some extent, then the ultimate observer may in fact be God. It is  interesting how science and religion are rapidly approaching rather than  diverging. To those of a spiritual bent, this is natural and welcome. To  those not so inclined, this must be truly disconcerting."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AANIJZA2WL1Y2"
                },
                "Date": "on November 20, 2001",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 13, 2003",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "this book explained in a simple way, many of the complex matters of the new physics and got me thinking alot.  this boook was not only educationally stimulating but spiritually as well, and i plan to pursue the topics of enlightenment and the concepts of the new physics with more books like this one.  i highly recomend it.  if i may also recomend, the tao of pooh by benjamin hoff."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALKYJB6QGLQ4S"
                },
                "Date": "on March 29, 2002",
                "Helpfulness": 0.7272727272727273,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HSQFYB2MNM9T"
                },
                "Date": "on February 26, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QA5HKW6JT8UI"
                },
                "Date": "on December 7, 2014",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YUSTW9OG0S6R"
                },
                "Date": "on December 31, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3J0ZNFKQF5RTS"
                },
                "Date": "on September 12, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GKF8FA8D2SB6"
                },
                "Date": "on August 11, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I am only half way throuh this book but alrady recomend it to anyone who wants wants to gain a new understanding of physics. I am no science guy and I undrstand what is being covered in this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8E8XHS5LN8BR"
                },
                "Date": "on March 26, 2007",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "I'm not sure I'm entirely convinced by the author's point of view, but he certainly succeeds in giving you a better understanding of QM and the philosophical questions involved in it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SGR7LE899LGG"
                },
                "Date": "on December 28, 2003",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "If you need a book that will explain, in a clear and detailed way, quantum mechanics, look no farther! Easy to read and fascinating. EXCELLENT!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QZH73OQCUGI6"
                },
                "Date": "on December 25, 2005",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "It seems that one of the reasons Zukav became popular is the \"new age\" feel of his books, which to some may be attractive enough. I liked this book in a sense that it made me curious and go back to the physics I studied in high school and then on to some more contemporary work on quantum physics. As a non-physicist, I found this an interesting and thought provoking experience, but with obvious flaws. There have been numerous attempts to find the bridge between the rational, scientific thought of the West and contemplative ancient Eastern wisdom. This book is one of many, but how much it succeeded in this attempt is up to you to decide. If it incites your curiosity and gives you a push to search and research, it'll be ten bucks well spent."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19OORKBG1VUGU"
                },
                "Date": "on January 9, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on May 25, 2001",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "This book was recommended to me from a leading physics' professor while I was his student.  The book remained on my list-to-read for long time.  Having read many popular science authors including Sagan and Hawking, I was interested in the book but was busy reading physic's papers written for physicists.  I picked the book up last week and once I got through the first part (which is a little remedial and dry), I couldn't put it down.  The book is a great review for people who are already knowledgable in physics and a superb book for the laymen.  The most interesting part of the book is the corellation of Buddhist philosophy and \"the new physics.\"  Just because this book is over twenty-years old doens't make it irrelevant, many of the topics covered are still being worked on today.  The most exciting information is that Zukav plans to write a book completely on the topic of Buddism and physics (although he sure has waited a long time).  This book also sparks an interest in the spirit of someone who has no interest in the Western religions but seeks truth through science.  According to this book the West is bringing forth truth using science while the East has brought forth the same through philosophy.  I would advise everyone to read this book with an open and beginners mind and relinquish all previous notions of what you think physics is."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on September 30, 1999",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "I've been looking for a long time for a book that gives a \"simple\" explanation of quantum physics. This is it. I finally have a basic understanding of the underlying concepts which I never really received from the other books that I read. This is a rare book. Very easy to read but conveys the essence of a very complex subject. The metaphysical stuff is generally contained to one chapter in the back and can be skipped. The big problem with this book now is that the material is now dated. A lot has happened in physics since this was written."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A353UAPCDFKIYD"
                },
                "Date": "on August 20, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 6, 1999",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": "If you are interested in the forces that lie in the center of an atom or the way in which matter can be created and destroyed in a single instant, read this book!  It covers Einstein's special and relative theories, the  great paradoxes that arise in present theory especially the wave/particle  theory of light, the startling realization that present quantum science is  beginning to resemble eastern mysticism and much more.  314 pages of  amazement.  The only drawback is that it is a little outdated (1979), but  it still covers very new territory for the reader who is unaccustomed to  advanced physics.  Oh another thing, no math equations!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJBVY9K7D1AZ4"
                },
                "Date": "on June 23, 2006",
                "Helpfulness": 0.7272727272727273,
                "StarRating": "3",
                "Text": "While I can appreciate Mr. Zukav's motivation for writing this book, he does to some extent become the victim of his own observation that we see what we wish to see.  That's not to say that the book fails to offer an interesting if limited summary of quantum mechanics/theory, but the philosophical point of view is difficult to reconcile with the inherently scientific and mathematical nature of the subject.  This may be my failure to adequately grasp the caveats and choices he lays out at the beginning.  If one subscribes to the idea of independent observer and external existence, then the book offers little satisfaction.  If one can embrace the idea of human experience being inexorably tied, even essential to the unfolding nature of the universe, then this book offers a wealth of possibilities.  As I see from most of the reviews, the book ultimately compels the reader to choose one perspective or the other.  After reading it, I find myself somewhere in between, contemplating the gap between what I think I know and the provocative, challenging enlightenment this way of thinking offers.  If you're looking for comforting facts, look somewhere else.  If you're willing to live with the uncertainty, jump in and enjoy this entertaining book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AAJ6DA21YAS9"
                },
                "Date": "on July 27, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I found this book an enlightening attempt to bring together the Eastern and Western views of universe, ways of life, and philosophies. Having Eastern background, and being educated and lived primarily in the West I relate very well with the subject matter and found the work rather ground breaking, and in a constructive way a demonstration of the \"one-bess' of the universe and universal thought. I strongly recommend this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38XHXKPDKHP8N"
                },
                "Date": "on June 5, 2002",
                "Helpfulness": 0.7272727272727273,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3N93DYYIFQWEA"
                },
                "Date": "on February 3, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is perhaps the most fascinating and thought-provoking book I've read to date! The author endeavors to explain quantum physics to the layman in terms that are at once comprehensible and awe-inspiring. If you are interested in how the Universe works, astronomy, quantum mysticism, and Einstein's theories, then this is a must-read!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9JSV6M5Q80Y5"
                },
                "Date": "on September 18, 2001",
                "Helpfulness": 0.75,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on September 2, 2000",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "The Dancing Wu Li Masters is very entertaining and accessible but it  should be understood that Mr. Zukav is by no means an authority on the  subject (Neither am I, mind you). First check out the similiar books by  Polkinghorne or Pagels or one of the many good books by Paul Davies.  These  men are REAL physicists!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AY7PGP25IKDS7"
                },
                "Date": "on July 27, 2007",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": "Read this book a few years ago and just bought it recently for my wife so she could understand what I was talking about sometimes, and to tie in with other reading she is doing that mentions quantum physics. It explains the basic concepts in clear terms, making much more sense out of a VERY abstract field. If you want to understand what it is about, this is a good place to start."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARKV8LX2MV106"
                },
                "Date": "on October 7, 2004",
                "Helpfulness": 0.6904761904761905,
                "StarRating": "1",
                "Text": "This book is a reminder of why non-physicists ought not to be in the business of explaining physics.  It might be easier to use physics to illuminate the Tao than Taoism to find physics.  In this context, modern physics is a specific description of all that is.  The Tao, on the other hand, is a generality which may be affirmed or denied by the specific but which does not encompass the level of detail needed to arrive at the specific.  This is why Gary Zukav so often loses his way. (Pardon the pun.)  He suffers from the standard American aversion for even the simplest mathematics.  As a result his description of the macro world, in which the interactions of forces and particles appear deterministic, are sometimes awkward and always inelegant.  Once we enter the quantum world of Einstein's dice throwing God, Zukav loses the distinction between physics and metaphysics.  The world is neither the predetermined clockwork envisioned by Descartes and his friends nor a collection of anthropomorphic particles dancing to the Wu Li Waltz.  Unlike Gary Zukav and his intended readership, I am quite comfortable with a universe that cannot be explained without random variables.  The Dancing Wu Li Masters might be satisfactory for those who need a spoonful of philosophy to make the physics go down were it not that the physics being swallowed is wrong."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 19, 1999",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "The clarity with which the material was presented helped me understand things I'd thought were beyond me.  I now have the confidence to learn more, and the desire to explore science (physics) with new eyes."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on September 4, 1999",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "If you want to learn about quantum physics but don't want to dive into the math, this is the book for you. Zukav explains physics like he is a master. Even if you know something about physics, this book is a great read. The  book is enjoyable and flows, keeping your attention throughout. I highly  recommend it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Y2ECQF6VF0LB"
                },
                "Date": "on August 4, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FCUX8OWWZIPZ"
                },
                "Date": "on November 27, 2007",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": "Probably the best science book Ive ever read, and certainly no better way to explain quantum physics than this. Stripped of all the math related to it, you'll have fun with this one!!!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HBR3AJ3VPAD4"
                },
                "Date": "on June 20, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2J7ZSMYL4X3GC"
                },
                "Date": "on April 5, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on December 14, 1998",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "5",
                "Text": "Get it.  Read it.  Reread it.  And then reread it again.  I don't know how the scientific community feels about this book (Leon Lederman, former director of Fermilab had some strong opinions about it) but it will open  the door on a seemingly complicated (and boring, depending no who taught  you in school) subject and let the light shine in.  If you are looking for  a Eureka! experience, this is definitely one way. It is kind of like  reading Be Here Now or The Electric Kool-Aid Acid Test (forgive the  reference to books about the Sixties) as it spins and winds and twists its  way through everything and just when you don't feel like you can put  anymore information in your head, it all makes sense and you want to shout  Hallelujah!  Books can do that.  This is one of them."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ABXSFKNZW9CC"
                },
                "Date": "on December 19, 2006",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "4",
                "Text": "This book is a very pleasant introduction to quantum theory.  It covers not just the concepts, but also something of the history of the people who came up with them.  If you're interested in the equations and such, this isn't the book for you.  If you're looking for some proof of a relationship btwn physics and eastern philosophy, that's not here either.  The Wu Li aspect seems to be the authors interpretation of what he's learned about quantum physics.  The rest of us may or may not draw similar conclusions, and I do not feel that the author tries to force any new age mysticism down your throat.  In fact, I feel like I've learned a fair amount about modern physics, but do not particularly appreciate any connection with eastern mysticism or new age philosophy."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35Y8UE42GW0EY"
                },
                "Date": "on November 14, 2002",
                "Helpfulness": 0.6764705882352942,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMX7JVMBOZJ16"
                },
                "Date": "on April 18, 2013",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "I am glad I read Wu Li Masters but I expected a little more.  I found some of the illustrations hard to follow but was enlightened overall. To digest the information thoroughly much time would be needed to study the demonstrations or illustrations and I did not want to spend the time to do that.  The author seemed to me to have put in much research for the book but some of it did not seem relevant to the topic presented."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACD7U8G6NTS55"
                },
                "Date": "on March 26, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I read this book years ago but somehow or another I lost my copy. Reading it again now I find it still the most informative Study in modern physics I have ever read. It provides the history, Discoveries, and theories From the last hundred years without the need of any mathematical understand. This is what makes it unique. I only wish someone could do the same for the other sciences and engineering."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 9, 1999",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I really wish I had read this before my first course in Modern Physics. It really adds perspective to DeBroglie, Heisenberg, Plank & Einstein's work. There are only few equations but the author is able to convey the  AWESOME implications implied by the new physics. Nothingness springs into  Being - Particles Dance - And then return to the infinite symetrical  vacuum. This book is a Mind-Opener!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RY34ZKWNWDF0"
                },
                "Date": "on June 14, 2013",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FL9EFR5TFAG1"
                },
                "Date": "on January 7, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Still the very best introduction to the mysteries of quantum physics. As Sir James Jeans said, \"not only is the universe stranger than we imagine, it is stranger than we can imagine. Gary Zukav brings that strangeness home in mathematics-free, clear language, and he does it like no one else. This book is a must read for anyone who claims to be educated."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FB9US4ZBR86H"
                },
                "Date": "on January 1, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "The title is a little strange, but the presentation is well made. They didn't teach anything about quantum physics when I was in school, but it's frequently in the news. In this book you can get a feeling of what physicists are discovering about our universe. The book was written many years ago but it's certainly not dated."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39A4K1K2WZILU"
                },
                "Date": "on May 13, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "If you are interesting in quantum mechanics, physics and beyond, this is an excellent book.  It's written in a manner that's easy for non-scientists to understand and it's so much more than just a book about science that don't let that prevent you from reading it.  This book could change your life!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 24, 1998",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "It'll mesmerize you with the simple truths we ignore. It opened my eyes and let me see  past the physics, the screwy and often-times  mind boggling so-called \"laws of nature.\"  The thoughts of Zukav will bring understanding as well as appreciation for our existence!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1O7V32ZL06L50"
                },
                "Date": "on December 23, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book is a favorite yet I have a scientific background. I love to learn how life works and this gives some secrets that I did not know about light, sound, energy, etc. I do not want to give it away yet if you want to learn about the dance of life, this book is for you."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 23, 1999",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "this book provides a new view of the physics.  It  makes me feel that physics is no longer being boring, difficult and abstract, on the contrary, it is  sensational and fascinating. It is an very interesting book, I  strongly recommend it to the people who love science."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3W4FFD3AEB7GV"
                },
                "Date": "on October 5, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "this book wanted me to be smarter.  Loved it!  Understood some of it and thought I did a decent job rereading same page to absorb the incredible depths of Zukav's incredible MIND! Why should one man have so much smarts!  enjoyed and then gave it away to a physicist."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A243COEVSDBTVH"
                },
                "Date": "on January 17, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGKPTMTR3UX1R"
                },
                "Date": "on May 7, 2012",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 26, 1997",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DXVAI08P00HD"
                },
                "Date": "on November 22, 2006",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SPY628KY1ZAN"
                },
                "Date": "on July 26, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Zukav's exploration of both the new physics and consciousness is intelligent and highly entertaining. I've read many books on the topic, including seminal works by Feynman, but the only one I truly enjoyed was Zukav's work."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LI8P7VU8UWPU"
                },
                "Date": "on July 24, 2011",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVU2SF3A87HIH"
                },
                "Date": "on January 8, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book is for you very intelligent souls who have always suspected how truly connected we all are: as in EVERYTHING !!  When quantum physics breaks it all down.....it's all about Energy....and so much more!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EC1IG3LOB0NF"
                },
                "Date": "on July 21, 2003",
                "Helpfulness": 0.75,
                "StarRating": "4",
                "Text": "Very nice and easy introduction to modern Physics which includes Relativity and Quantum physics and beyond. It is a nice book for someone who does not have Physics background but interested to know things."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJES5U622V7W3"
                },
                "Date": "on August 26, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A93UVAUFAOSKZ"
                },
                "Date": "on July 27, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is the best of several books that I have read on quantum mechanics and related topics for the non-physicist. The style is very engaging. No wonder this book has become a classic in the field."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Q4SRII0YC9KV"
                },
                "Date": "on November 18, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I love this book!  I've read many books on particle physics and, by far, this is the best one for a beginner (like me).  If you want to get a ground level understanding, this is the book for you."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8ZUR3SPQ0ZYQ"
                },
                "Date": "on March 20, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "I am enjoying the concepts of the book.  I cannot say I understand it all, but recognizing there is so much more to this world that what I can see has facilitated growth in my spirituality."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HS2PJ6TO6WG4"
                },
                "Date": "on April 15, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFMUNAQSN4PFW"
                },
                "Date": "on October 21, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book is a life-changing treatment of modern physics.  It changes how we think of reality, of what we are.  Well written, easy to grasp.  Everyone should read this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DTZXAV3ST34Z"
                },
                "Date": "on November 27, 2012",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "I really enjoy the concepts and understandable explanations of complex physics principles. Great for the general public to grasp and integrate these ideas about reality."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GXXZO10T44"
                },
                "Date": "on February 23, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "I read this is one of my book discussion groups. It's a very good book. It points out how quantum mechanics is aligned with ancient beliefs about the nature of reality."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IRG2D7RUFTMW"
                },
                "Date": "on August 13, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "What fasinated me about this book was how the 'spirit' is an incredible value to the World of Physics. Each chapter that I read, I was learning a new vision of physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NZGOH1IL2QJ3"
                },
                "Date": "on November 9, 2012",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "This is exactly what I was looking for, I have to admit having read Gary's \"Seat of the Soul\", how this book would read. I was very pleasantly surprised."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16FQQP1V8GFSN"
                },
                "Date": "on January 15, 2005",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "Taking a subject like Quantum Mechanics and explaining what it is all about is a difficult task. The author has achieved that difficult task without the use of equations and symbols. When I first started reading the book my initial impression was that it was going to be a whole bunch of philosophical mumbo jumbo. By the time I finished reading it (it took me a couple of months), I was very much impressed with Gary Zukav's ability to cover all the major aspects of quantum mechanics and in covering the contributions of the physicists behind quantum theory in an easy to understand language without having to resort to equations and symbols. My only gripe about the book is that every chapter is numbered as chapter 1 in order to make some point about Chinese philosophers. Many people are used to keeping track of which chapter they have read or are reading by remembering chapter numbers. But using a bookmark solved that problem for me."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWKVQQZKTRFAL"
                },
                "Date": "on January 14, 2008",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "One of my favorites along with The Tao of Physics. If you like discussions bringing Western physics and Taoism together you should enjoy this."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1F310BMEL0OYS"
                },
                "Date": "on June 5, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is a classic that everyone should read. I bought this book for a high school grad present and the recipient loved the book!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3V4R0R7RLW783"
                },
                "Date": "on January 10, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "A brilliant take on New Physics, this book is now considered a classic. Touches the heart of subject. Well written."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LE3YTEV3MCQV"
                },
                "Date": "on October 6, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7Y6AVS576M03"
                },
                "Date": "on August 4, 2001",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "1",
                "Text": "The amount of inaccurate information in this edition is finite but it does try to reach infinite proportions. This abridged edition should probably be thrown off a bridge. That would be pure enchantment as it states on the cover."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXCB4WMK52GXJ"
                },
                "Date": "on March 30, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I loved reading this book. I met the author completely by accident one day and he told me about his book. I didn't read it for several months afterwards but finally did and I couldn't put it down. As a physics/chemistry student I understand the principles covered in this book in great detail, and sometimes completely forget the \"30,000 foot view\" of why any of this is important. This book reminded me exactly why what I do is interesting, and for that I am grateful. Gary Zukav does an incredible job of mapping the new physics in an easy-to-understand fashion and I plan to read this book many more times."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32WPUXTXB820K"
                },
                "Date": "on January 18, 2002",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "4",
                "Text": "Such a great way to look at some of the most complicated material (to the average Joe). This book was able to show a lighthearted approach, sometimes comical, and bring \"Physics\" to a different level. Deems to be a great book for someone who has physics knowledge and wants to be amused; or for one who is intimidated by \"physics\" and wishes to have a better understanding."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Y729FFBZXC9O"
                },
                "Date": "on May 2, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 3, 2000",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I loved this book.  I really enjoy reading science that isn't dry.  This book did a very good job off helping you to understand the theory behind physics.  It was written for the layman, but some parts are more difficult  than others.  I plan on reading it again soon.  It primed me well for  physics classes.  It also has a more etherial side to it.  Aside from just  science, it was also theology. another book i must recommend for people  interested in this topic is -The Selfish Gene-.  I don't remember the  author's name, but it did for genetics what this one did for physics."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on November 17, 1997",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 29, 1999",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "Gary's book, even now, 20 years later, bridges that gap between the math and language proficient.  It shapes and defines the mathematically proven world of the physicist while still allowing the \"Physics as a Liberal  Art\" student to more fully appreciate the logic, and also the history,  of how mankind continually strives to assert creativity.  This is a truly  great book.  Buy it, read it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3418VP4V6WD6F"
                },
                "Date": "on May 14, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is a very well written book that explains recent advances in physics in ways that a non-expert can understand. It's also, and perhaps more importantly, a book about how we try to understand the world around us. It does this in an explicit way, using the new physics as it's medium, but also recognizes the spiritual exercise that is observing the natural world. I would recommend this book to anyone interested in physics, but also to those interested in the spiritual component of practicing science."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BRW7B0YP7A7S"
                },
                "Date": "on March 22, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHEW91ZUQDSKR"
                },
                "Date": "on February 25, 2004",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This has to be one of the best books to gain an overall history of the atomic era quantum mechanics and providing a low math general synopsis of what seems to be the totally irrational field of Quantum mechanics.  The author provides a little background on each featured scientist along with an excellent explanation of their part in the unfolding quantum mysteries. The author has an interesting style that makes the book an easy read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3J90Q0095SKI8"
                },
                "Date": "on November 25, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3I1J1K5Y8Q7PY"
                },
                "Date": "on January 26, 2014",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "1",
                "Text": "This book was largely a waste of time. I managed to force myself to read the first few chapters but then gave up. Author Gary Zukav tried unsuccessfully to wrap quantum mechanics into eastern philosophy. A book I would recommend instead of this one is: Quantum: Einstein, Bohr, and the Great Debate about the Nature of Reality ... by Manjit Kumar."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13FIFC9JTNAHK"
                },
                "Date": "on November 14, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The first book that gave me a comprehensible overview of quantum physics. It also compares the QP view of ultimate realty with that of zen Buddhism, and the results are fascinating.  This is not a lot of woo woo.  With all the advancement in research and technology that have occurred since its publication, the foundations of QP are the same, and I continue to recommend this book for quantum beginners."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2S3IFQX9SIHL1"
                },
                "Date": "on April 24, 1999",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CIAHOR65DBRA"
                },
                "Date": "on January 29, 2013",
                "Helpfulness": 0.6,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GM19C2G4NPBN"
                },
                "Date": "on December 17, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "If you ever wonder about quantum mechanics or quantum physics as I have always done, and care to take a glimpse into this wondrous world in a language written for \"normal people\", (non scientist people and without Einstein like brains, that is), then perhaps you should look over this great little paperback. It may surprise you. It did me!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Z165ZTGPL58Z"
                },
                "Date": "on June 7, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book has been recognized for decades as a masterpiece that broke new ground on understanding fundamental concepts of quantum and classical physics for the lay reader, and for introducing Eastern metaphysical and philosophical wisdom as insight to much we don't understand about  quantum theory.  Pick it up, it's not too late to learn."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7ZJV6RBFQVL2"
                },
                "Date": "on May 28, 2001",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The classic text on \"Zen and the Art of High Energy Particle Physics\".  Back before it was popular to write about this stuff, Zukav and Finkelstein set the stage for a mini-genre by drawing tight the strings (pun intended) separating eastern mysticism and quantum physics.  A must-have for any armchair cosmologist's library."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AROOVJWC9OJZZ"
                },
                "Date": "on March 17, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great introduction to the seductive world of subatomic physics. Simply written yet covers a wide range of complex thoughts. The perpetual fascination for connecting western science with eastern religion is a needless distraction. I prefer this as an introductory book of science rather than everything else this book attempts to be."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JFMZ2J9EGBTP"
                },
                "Date": "on November 12, 2012",
                "Helpfulness": 0.6,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VIOCJZ22JZXT"
                },
                "Date": "on June 25, 2005",
                "Helpfulness": 0.6363636363636364,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XK24SUT0CG38"
                },
                "Date": "on April 19, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book is a must read for anyone interested in quantum physics and Eastern philosophy.  This must be my 10th copy because when I learn about someone who hasn't read it I give mine to them.  Don't borrow this book from a friend get your own copy.  Needs to be read slowly and digested thoroughly."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 16, 1998",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "An outstanding effort in explaining the way in which the relatively recently discovered quantum world defines perceptual reality. Of note is the way in which the author demonstrates how two seemingly opposite philosophical structures (Eastern and Western) actually describe the same thing."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MKOFBFZ2VIL6"
                },
                "Date": "on February 12, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This one is not going to make a whole lot of sense unless you are into quantum physics and have an open mind and can grasp the science. I believe it to be an incredible explanation of the mysteries of the universe and the \"Intelligence\" that holds everything together."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AP8XJPTALMB10"
                },
                "Date": "on February 22, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31TV078P0GT2T"
                },
                "Date": "on November 30, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Gary Zukav really did his homework in researching the essentials of modern physics.  By the time you finish reading, the boundary between science and spirituality may be so clear as it once was for you.  At least that was my experience, and I am better for it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BFTIMV1263TU"
                },
                "Date": "on March 21, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I chose this rating because the author makes complicated material available to a person without scientific knowledge.  Also, he presents the information in an entertaining way. I recommend this book to anyone with the slightest interest in how our world works."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KCW7LDQIJ9D9"
                },
                "Date": "on April 10, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "great starter on subatomic particles,written about 1978 or so; it was suggested i buy this because so-called inanimate objects some times move w/o my doing anything. i bought this book in 1980 or so. this stuff is more bizzare than science-fiction!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEB6DSE8NCWU2"
                },
                "Date": "on May 22, 2001",
                "Helpfulness": 0.6,
                "StarRating": "5",
                "Text": "I've read the other reviews listed here, and am absolutely agahst that anyone could dislike (not to mention detest) this book.  Zukav delivers a powerful performance, dancing masterfully to link the seemingly unrelated fields of eastern philosophy and advanced physics.  Not only does he do so with great success, he also demonstrates both subjects independently of each other using easy-to-read language and clear, concise examples while never failing to address the wonder inherent in both topics of discussion.  His educational essays on physics and philosophy lead up to the grand climax in the last chapter in the book (I won't spoil the surprise, but the last chapter really blew my mind).  This book was the first book to turn me on to this kind of subject material, and I have since then begun to explore other works by Stapp, Hawking, Einstein, Feynman, and others.  If you're looking for meaning in your world, are curious about your world, or just want to know more about how your world works, this is the book for you."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXR1SRGSEECG5"
                },
                "Date": "on April 8, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I enjoyed this book because it is easy to understand and very enlightening. I wanted to learn about quantum physics, but I didn't have the time or patience for a very complicated book, so I decided to read this book. It's excellent."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GSIAVANOCHN5"
                },
                "Date": "on April 8, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Gary Zukav is one of those amazing people who has had several lives in one...and has taken his knowings of physics to a deeply spiritual level and profound in how he explains the complex to interested \"regular people\""
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIXU1DLMF9AWD"
                },
                "Date": "on October 3, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I had read this book prior to buying it from Amazon. I find the book very interesting and very informative. I don,t think most people would would, though. This subject matter is for the select few. I loved it!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PI7N0P0IXBWQ"
                },
                "Date": "on April 26, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "allow me to have the widest imagination ever. this book really opens up my understanding to the world, or rather, it totally wiped out the old understanding. which i dun know is a good or a bad thing."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BK9S4VLGUDCB"
                },
                "Date": "on December 20, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CRWKN4BNIB8K"
                },
                "Date": "on January 25, 2001",
                "Helpfulness": 0.6438356164383562,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TH2M8HINYSPR"
                },
                "Date": "on April 21, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I HAVE INSOMNIA AND FIND THIS BOOK HELPS ME SLEEP BY CHANGING MY THOUGHTS IN ALTERNATIVE DIRECTIONS. THIS IS THE THIRD TIME I HAVE READ IT. I AM PREPPING FOR GARY'S BOOK ON THE NEW PHYSICS."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SDR65YSNBZJN"
                },
                "Date": "on December 16, 2001",
                "Helpfulness": 0.6,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QI5MO6ZJAICJ"
                },
                "Date": "on February 21, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "took a very complex subject and made it simple to understand. Some details was necessary but sometimes the detail was a little bit too much for the reader related to the overall picture."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3E9YNSDY5ELI9"
                },
                "Date": "on December 13, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Awesome. Redirects your thinking from the ordinary world of chairs and cars to one where anything is possible. The philosophy of science made incredibly interesting and, yes, beautiful."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2F0PT4OD6YFU1"
                },
                "Date": "on January 13, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great book and received in perfect condition, in perfect time. This is a good seller. You will enjoy this book if you enjoy science and need to read it in simple, interesting English."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OCNY8W4QW4MK"
                },
                "Date": "on April 20, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Received many lessons in understanding physics and Buddhaism the connection was clear..  I have recommended this book to my grandchildren who are interested in Zukav's newer books."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1F1G4ATRQRL4G"
                },
                "Date": "on June 13, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book is great for the beginner who has some experience with Neutonian physics but is new to quantum ideas.  It is indeed a different world and this book is a great lynch pin."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJ15BBYXEKBRS"
                },
                "Date": "on August 4, 2011",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UIKZL1FHF6V5"
                },
                "Date": "on December 8, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Old favorite. Bought it to finish reading as my original copy was loaned out and never returned. Good exposition of the development of quantum physics for the everyday person."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AE3NDRNE0XJPA"
                },
                "Date": "on September 16, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A great book that postulates the struggle between science and religion may be coming to an end as high-energy physics appears to be proving the existence of God."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AD2626I76AYN6"
                },
                "Date": "on August 1, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Simply Outstanding. For anyone interested in Quantum Mechanics this book is a must have. This purchase was my second copy, as I literally wore out my first copy."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19DPRO1RFMEMW"
                },
                "Date": "on August 14, 2001",
                "Helpfulness": 0.6,
                "StarRating": "4",
                "Text": "As a physics major, I bought this book hoping to gain an insight into the strange world of modern physics.  This book is an excellent segway into more advance studies in Physics.  The later section of the book is also very philisophical, which is a welcome addition to a subject which has traditionally been very cut-and-dry, matter-of-fact.  It is a book which will make you awe at the wonder of the world in which we live.  Reading it once, however, is not enough.  It is the type of book that allows you to pick it up again in the middle, and re-read a concept that may have mystified you before.  I heartily recommend this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKD16A3FIRVKU"
                },
                "Date": "on March 30, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "On the simpler side of physics as ar as explanations go, but i think thats what the author meant to do and he does it brilliantly."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MP4HHICPKYMV"
                },
                "Date": "on December 3, 2014",
                "Helpfulness": "",
                "StarRating": "1",
                "Text": "This book is the every man's link to physics...as I was reading it, I kept saying to myself this makes so much sense! great read!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FHVNJ0LARN4L"
                },
                "Date": "on October 19, 2014",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": "This book is paradoxical: fine fluent prose with clear and complete explanations of modern physics phenomena, coupled with gratuitous inferences and groundless conclusions. It is well known that \"interpreting\" contemporary physics findings is a tricky matter subject to all kinds of pitfalls, both empirical and logical. As would be establishing parallels between with the ill named \"perennial\" philosophy of eastern thinkers or Wu Li Masters. Ignoring salutary caution in this matters could lead to where this book points to: a justified license to \"anything goes\", at best,  or some more \"fairy tale physics\" ( Baggot)  at worst; that is, ideology in the guise of science."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5CDYO7HCR9DD"
                },
                "Date": "on July 21, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Loved the book.  It was great.  Met all my expectations.  Would buy it again.  Thanks for stocking this book in your inventory."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALZ1ZAUF02QU6"
                },
                "Date": "on January 4, 2015",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "Seems to babble a lot. Difficult reading but I will eventually finish the book because it was recommended. Not my favorite."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CISMYADU6B7N"
                },
                "Date": "on August 17, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A very captivating approach to learning about physics! It's a  magical mystery tour, to borrow a line from The Beatles."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2V8B104P4EL67"
                },
                "Date": "on May 11, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LHREGFW2A8X9"
                },
                "Date": "on June 14, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The book was a little rough but the people were fantastic to deal with all the pages were there it was fine"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26SBCPF8QP20Z"
                },
                "Date": "on September 2, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is an excellent book.  A mixing of eastern and western philosophy and science.  Brilliantly done!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UP9ZY5P7YKK"
                },
                "Date": "on May 4, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Another winner.  The more you read the more you understand how to live that kind of life."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VF0KKOL9AXTU"
                },
                "Date": "on May 20, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "love it, a must read, bought it  so I can once in a while go back to it. highly recommend"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 3, 1999",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "If you like this book, then you'll also like \"The Bible According  to Einstein.\" \"The Dancing Wu Li Masters\" presents physics  in an easy to understand manner, but \"The Bible According to  Einstein\" makes science even more accessible. For example, the chapter  on the path formation of quantum mechanics is the most beautiful  and  comprehensible treatment that I have ever seen. Feynman, it turns  out,  discovered this approach."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CCL9ZVTXXUT3"
                },
                "Date": "on December 11, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "this book was interesting, not one I would recommend to a non-scienctific person"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2015JZ47CO78J"
                },
                "Date": "on December 6, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "read this many years ago....enjoyed reading it again.good"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31KMNWHY9DWCM"
                },
                "Date": "on December 17, 2003",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "I read this book back in 1984 or 1985 on the advice of my chemistry professor.  I simply was \"not getting\" the quantum physics.  It is an introduction to physics in the vein of Zen and the Art of Motorcycle repair.  I think this book should be required reading for Freshmen."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 3, 1997",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": "This 2 cassette abridged edition of this now classic work is a outstanding way to bridge the gap that almost every nonphysicist has with the truth that was initially exposed by scientists almost 100 years ago - quantum physics.  Zukav is a genius in his own right.  Where did he go after this. Why hasn't he written books explaining government and politics; sex, love, and marriage; desktop computers; and the other things that have baffled mankind for the last year or two? He certainly has the nack for being able to explain the previouly thought unexplainable. Not being a scientist has not hindered Gary in anyway, in fact it may have enhanced his ability to explain these truths to the \"common man\".  The fact that most people on earth have no idea of what governs the forces that govern their lives is sad. The fact that even the 1% of the world's population that has graduated from college has little understanding of these forces, even after almost 100 years since their discovery, is a damning expose of our system of education.  But if there ever was an effort to present this material to the masses then this would be the book that should be used. And a great way to expose the most people to the joys of discovery this book has to offer is through this abridged cassette set"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3M4S84AX0AF4O"
                },
                "Date": "on March 30, 2015",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": "Rather dull reading, with so much scientific jargon"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJNSR7D19KTU9"
                },
                "Date": "on January 11, 2013",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Mr. Zukav presents a lucid and engrossing narration of the evolution of physics. It is thought provoking and written in a style that is easy for a layman to  follow. My understanding and appreciation for the field of Physics were greatly enhanced."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GTOIX13PLVL6"
                },
                "Date": "on May 28, 2004",
                "Helpfulness": 0.6190476190476191,
                "StarRating": "2",
                "Text": "I read this book when it was new, and found it entertaining.  I didn't think much more about it after that.  Then I came upon a reference to it in one of Gardner's books concerning bad science.  Looking back at it knowing so much more now, I agree, it's borderline nonsence.  E.g. electrons don't \"think\" about making a choice about which way to go; they enter into superposition."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QQPBWRMA3O7J"
                },
                "Date": "on October 5, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Great book! Concepts explained beautifully!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3006WHOAYJRLI"
                },
                "Date": "on May 3, 2006",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20EEWWSFMZ1PN"
                },
                "Date": "on November 21, 2001",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3P8E8G31QACTS"
                },
                "Date": "on November 16, 2001",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DHC7PAQOBP0X"
                },
                "Date": "on August 13, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "EASILY READABLE AND VERY INFORMATIVE"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 11, 2004",
                "Helpfulness": 0.6086956521739131,
                "StarRating": "2",
                "Text": "be very careful of trying to understand quantum mechanics (and all facets of science, for that matter) in terms of it being \"like\" something else. QM/QEM is not \"like\" anything, it simply is itself, which is why it is one of the most difficult branches of science to apprehend. it is vastly complex, truly bizarre in some regards, but quite logical and beautiful in its equations. this book may be a decent book to spark a layman's interest in the subject, but it is vastly inept in describing anything. especially obnoxious are the constant assertions that science and faith are the same thing because QM states nothing can be known to have \"certainty\", sweeping aside the obvious logical flaw that faith is a type of absolute certainty. i recommend that to TRULY get a grasp on QM, one begins by reading books written by actual, real live (or dead) physicysts. i cannot argue against THIS book enough. the philosophical implications of QM ARE important, but not in this neatly packaged and trite fashion. look elsewhere."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABQVDKWU40G0V"
                },
                "Date": "on February 19, 2013",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": "This is a very basic introduction to quantum mechanics and spirituality which seem to be explorations of the same happenings/situations."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A59E1FH1IDR0X"
                },
                "Date": "on December 25, 2011",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "it is a fantastic book of a non technical view of modern physics, it was shipped very quickly and made it before the holiday"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33HTZ0E3MLTPK"
                },
                "Date": "on February 3, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Brilliant. Lovely prose."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1R0QX3174QB94"
                },
                "Date": "on April 6, 2010",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "This book was a challenging read as the author attempts to explain the basics of a very complex theories.  I found myself struggling to understand the differences between quantum physics, particle theory, the theory of relativity and other aspects of physics.  These theories have been discovered by some of the greatest thinkers of all time and thus not easy to understand.  While this made for a challenging read, I did learn the importance of keeping an open mind and thus made the book worthwhile.  Too often we allow a preconceived way of thinking to prevent further understanding.  This is one of the underlying themes of the book and interestingly enough is how a lot of the breakthroughs in physics/quantum mechanics were discovered.  The concepts can be applied to just about every aspect of learning.  Despite the challenges, this book is worth reading for that reason alone."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1J0BGE9EUZ62Q"
                },
                "Date": "on January 13, 2013",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Everything I expected and that's all I want to say or need to say.  Clicking on the stars is enough."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 8, 2001",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "This book should be required reading for any physics or science majors for first year college students.  It is also very beneficial to high school students who have a difficult time grasping physical concepts such as Einstein's Theory of Relativity.  Zukav has masterfully explained some of the most difficult theories in physics in a way that can finally be understood.  Anyone interested in the sciences would thoroughly enjoy the content of this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8TIGXOK4T9YL"
                },
                "Date": "on April 1, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Still a tough read"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15F7SK94EXMYG"
                },
                "Date": "on November 30, 2002",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JISJV8VVIEUZ"
                },
                "Date": "on August 17, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "good information"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 24, 1998",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Gary Zukav has written an outstanding book. Or maybe you could say that it is a journey. That is what I felt when reading it. As you turn the pages you feel your view of the world change. The more you read the more you want to read. The only reason for not giving this book 10 p is that Zukav explains the theories made by physicists BUT he does not explain the reasons and the ideas behind them. On the other hand there is a well detailed note table for the interested reader. Overall I would like to recommend this book to all the ones who are interested in learning the world itself."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQ8X60RD5WXC2"
                },
                "Date": "on June 7, 2004",
                "Helpfulness": 0.5833333333333334,
                "StarRating": "5",
                "Text": "There are not too many books that can satisfy everybody. This book is for the whole family- scientists, lay-men, the religious aunt and the rebel teenager can enjoy this book equally."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1F2PIWWBMEIX7"
                },
                "Date": "on March 17, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Execellent"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AU4D7PC396XDW"
                },
                "Date": "on February 10, 2015",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": "If you want to understand physics in general and QM in particular study math.  Without a strong foundation in math the best you can hope for is confusion but it is far more likely you will be the victim of delusion.  Like Zukav obviously is.  This is harsh but this book really riled me up--if you aren't good at math give it up and don't worry about this stuff.  It isn't for you."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IQ4FP0MO4SNC"
                },
                "Date": "on February 17, 2000",
                "Helpfulness": 0.5909090909090909,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WMLJAG7YV4RH"
                },
                "Date": "on May 31, 2013",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36MLWXEGZXP9P"
                },
                "Date": "on August 24, 2014",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": "I can only rate this book as nuts. Perhaps a person who accepts the Principle of the Primacy of Consciousness (that nothing exists outside my own mind) might like it, but there is nothing about the book I can say is good from a rational, cognitive point of view."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A81PJRD87K1A3"
                },
                "Date": "on January 22, 2014",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": "Zukav's other books were far better.  Perhaps he was \"warming up\" in this book? If you are a spiritual seeker, he is an easy read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MEN126468P3B"
                },
                "Date": "on February 8, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Very entertaining and informative! If you know nothing about physics, you will learn about it by the end of this book!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37DOOVMUSQ9DU"
                },
                "Date": "on December 7, 1999",
                "Helpfulness": 0.6048387096774194,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BL38SX47MEKH"
                },
                "Date": "on November 18, 1998",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": "very fascinating and interesting book that explains some of the more strange and amazing ideas and observations that have arrived with the advent of this \"new physics\"... excellently written (the point of  it was to write about all this left brain stuff from the right brain  perspective).  highly highly recommended."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YZDJU9CO19JL"
                },
                "Date": "on June 30, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "OK"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IZ0OTXYJFPU0"
                },
                "Date": "on November 2, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Arrived as described"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YZ0YXXF657YE"
                },
                "Date": "on November 17, 2013",
                "Helpfulness": 0.4444444444444444,
                "StarRating": "1",
                "Text": "It seems like the story behind this book is that, by his own account, he was in an emotionally volatile period of sexual addiction, motorcycles, anger, and experimentation with drugs when an unexpected introduction to quantum physics at the Lawrence Berkeley Laboratory initiated changes in his experience that led to this book (see wikipedia). I think this probably means that he met Fritjof Capra (author of The Tao of Physics) at a party and thought \"that's a good idea, I can write a book on physics and mysticism and the good thing is that I don't have to know anything at all about either subject. It'll be just like money in the bank\". And it is."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YEJWQFNPQL0P"
                },
                "Date": "on November 2, 2014",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": "AMAZING"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AL0TN042HAPX6"
                },
                "Date": "on February 17, 2014",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": "Aside from being somewhat out dated, it refers to eastern philosophy too much. Any is too much. To fill in the space for this comment, I am leaving this sentence."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MV7635LJT3N6"
                },
                "Date": "on August 31, 2013",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": "If you have an interest in this sort of thing,good place to start-the universe is a interesting place,try it,you'll probaly like it"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATEKS08QUAVT5"
                },
                "Date": "on July 6, 2013",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": "Was looking for something new to read: something to further open up my mind:and this was not it. This was boring!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AK8CS5KKPETE1"
                },
                "Date": "on April 27, 2008",
                "Helpfulness": 0.25,
                "StarRating": "2",
                "Text": "I tried to read this book, as I have really enjoyed all other books by Gary Zukav. This was the exception. I just couldn't get through the entire book, so maybe I missed the point or message of the book. It was not easy reading."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GW7UVPSLV1CH"
                },
                "Date": "on December 29, 2010",
                "Helpfulness": 0.5151515151515151,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5PV0T7W27QJ9"
                },
                "Date": "on January 11, 2009",
                "Helpfulness": 0.4166666666666667,
                "StarRating": "2",
                "Text": "Not my cup of tea at all. Zukav's general formula for the dogma in this book is of the form: (A <relationship 1> B) and (C <relationship 2> D), where relationship 1 and relationship 2 have the same name but different domains of discourse, therefore A = C and B = D. It's the typical charlatan's play on words, repeated many times - attractive only to the ignorant and the gullible. Don't let this be your introduction to quantum mechanics (or new-age philosophy). You'll be disapponted on both fronts."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A64SIP6SOJ1S7"
                },
                "Date": "on November 28, 1999",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "\"What we observe is not nature itself, but nature exposed to our method of questioning.\" Werner Heisenberg"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on January 16, 2003",
                "Helpfulness": 0.375,
                "StarRating": "2",
                "Text": "You'd be much better of spending your time reading the Tao of Physics by Kapra."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AVLVC3Y24TZ9"
                },
                "Date": "on November 5, 1998",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "This book gives you insights of things and possibilities you were never aware of before. It's true science-fiction. I think I'm more intelligent for having read it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18RFTKS9WVF3L"
                },
                "Date": "on August 16, 2006",
                "Helpfulness": 0.4166666666666667,
                "StarRating": "5",
                "Text": "Gary Zukav did an incredible job on this book. I bought the tape series as well. I recommend it highly."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RADX1PYEPSJ3"
                },
                "Date": "on January 8, 2012",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "The book was in worse condition than I would have expected.  THe cover had a torn off corner and the book looked more aged than I would have bought had I seen the book before buying"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SIHT6UNXCGAM"
                },
                "Date": "on March 11, 2003",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on September 26, 2001",
                "Helpfulness": 0.4473684210526316,
                "StarRating": "1",
                "Text": "After reading the first paragraph of this book, I determined that Gary Zukav has absolutely no idea what he's talking about.  He obviously has no physics training, and what he is in essence doing is trivializing physics.  Physics is not easy, yet he tries to sell it as something that's quite simple.  Many of the observations he makes and the conclusions that he draws are simply wrong.  There's no other way to put it: this book is absolute garbage written by someone who just doesn't have a clue."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NKFLKPJCOO7S"
                },
                "Date": "on August 31, 2008",
                "Helpfulness": 0.3157894736842105,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28BPGOGA7CSK7"
                },
                "Date": "on December 26, 2002",
                "Helpfulness": 0.32142857142857145,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BR7GRILA8A3Q"
                },
                "Date": "on February 25, 2009",
                "Helpfulness": 0.08333333333333333,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AI7FJKHXSA0W5"
                },
                "Date": "on June 13, 2006",
                "Helpfulness": 0.2903225806451613,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30K4TZ3L1Y8WT"
                },
                "Date": "on January 2, 2011",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": "I can`t review because I gave it as a gift. My Son wants me to read it now because he was very  impressed  . I sent another by same author--  \"the Seat of the Soul\" (I think)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33PC828YHM03G"
                },
                "Date": "on October 26, 2001",
                "Helpfulness": 0.20689655172413793,
                "StarRating": "1",
                "Text": "QUANTUM MECHANICS AND EASTERN PHILOSIPHIES HAVE NOTHING IN COMMON.  I AM NOT SURE OF THE AUTHORS KNOWLEDGE OF PHYSICS BUT FROM READING THE BOOK IT MUST BE LIMITED.  YES THE BOOK IS EASY TO READ BUT WHO WANTS TO READ A BOOK THAT PORTRAYS QUANTUM THEORY INCORRECTLY.  MY OPINION IS THE BOOK BY STEPHEN HAWKING IS MUCH BETTER INTRODUCTION.  I CANNOT REMEBER THE TITLE BUT IT SHOULD BE EASY TO FIND"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on August 25, 1999",
                "Helpfulness": 0.10526315789473684,
                "StarRating": "3",
                "Text": "I was conned into reading this book by a friend of mine(not any more).It is not meant for normal people.Though being from an engineering background  I found this book to be abstruse.My recommendation:dont read this book  unless you are marooned with it on a desert island."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 25, 2000",
                "Helpfulness": 0.288135593220339,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38DADN3SFUTNW"
                },
                "Date": "on April 5, 2008",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": null
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Dancing-Wu-Li-Masters-Overview/product-reviews/0060959681/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "224"
    },
    "Salesrank": "#31,058",
    "Timestamp": "2015-05-24 12:35:53.695801",
    "itemurl": "http://www.amazon.com/Dancing-Wu-Li-Masters-Overview/dp/0060959681"
}
