{
    "Category": "in Books (",
    "ListPrice": "$17.00",
    "Name": [
        "Pale Blue Dot: A Vision of the Human Future in Space"
    ],
    "OfferPrice": "$9.91",
    "Reviews": {
        "AverageStarRating": "4.6 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EC8P35005FB6"
                },
                "Date": "on February 5, 2002",
                "Helpfulness": 0.9956709956709957,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVM3XJAXFBN4T"
                },
                "Date": "on August 2, 2004",
                "Helpfulness": 0.935064935064935,
                "StarRating": "5",
                "Text": "I first read this book as a aimless 16-year old kid...now I'm an astrophysicist. It was Sagan's message of faith in science's role as mankind's candle in the dark, as well as his wonder for the universe that infected me, and spurred me to the path I'm on now. If you're not a religious fundamentalist and would like to open your mind to mankind's future in space as well as the wonders that await us in the cosmos, buy this book....or buy it for some teenager you know..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJDYDG7YZY9QL"
                },
                "Date": "on January 27, 2001",
                "Helpfulness": 0.9047619047619048,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2K1R1I4HP6MR7"
                },
                "Date": "on July 23, 2007",
                "Helpfulness": 0.890625,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DGSJUKT6FG9R"
                },
                "Date": "on May 17, 2000",
                "Helpfulness": 0.92,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GVKGSN6V1VTX"
                },
                "Date": "on August 19, 2006",
                "Helpfulness": 0.875,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HRLWJEM1PZ6K"
                },
                "Date": "on March 14, 2000",
                "Helpfulness": 0.875,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27GTQICA58XC9"
                },
                "Date": "on July 6, 2011",
                "Helpfulness": 0.9166666666666666,
                "StarRating": "3",
                "Text": "Be aware that the digital Kindle version does not include the pictures and illustrations that are found in the hardcover edition of this book.  It's a shame because this would have been a bonus for people who bought and downloaded this version (such as myself) onto their iPads. Why would they not include the pics?!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACTHTKLUGCYTG"
                },
                "Date": "on May 24, 2001",
                "Helpfulness": 0.8666666666666667,
                "StarRating": "4",
                "Text": "To the original version of this book I would have certainly given five stars; it is a wonderfully inspiring book, by a man who was not only a fine scientist but a great humanitarian, a man who had worked hard to persuade governments of the danger of 'nuclear winter'. Sagan's astute mind, and his compassion, is brought to bear on his vision of our futures in Pale Blue Dot. This is not a utopian vision, Sagan is certainly cognizant of human frailty and our propensity for violence: \"If we continue to accumulate only power and not wisdom we will surely destroy ourselves.\" It is, however, ultimately a hopeful vision, and one based largely upon what we know of our universe, the physics underpinning its behaviour. His thinking is thus more than merely speculative. When, however, I received my own paperback version...I found that all the photographs, images, and graphs - an important part of the book, still referenced in the index - had been removed from the text, hence the four stars, not five. These images in the original book had helped to elucidate what we had achieved already, our discoveries of strange new worlds, as well as what the author and others believed we might achieve in the future. The removal of this material, for reasons which I can only guess, is to be regretted. Would Carl Sagan have supported such editing of his work? What do you think?"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UM0CMKUTEGRY"
                },
                "Date": "on August 20, 2008",
                "Helpfulness": 0.7551020408163265,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GX0RFRS0GWRA"
                },
                "Date": "on July 24, 2011",
                "Helpfulness": 0.7647058823529411,
                "StarRating": "1",
                "Text": "This is actually a five-star book, one of Sagan's best, but this review is specifically geared towards the Kindle edition, which at this time includes none of the beautiful, essential photography from the original hardbound book.  While the writing is still composed of Sagan's great and wise words, the book is but a shadow of itself without pictures, and the publishers should be ashamed of themselves for omitting them.  This is a digital edition folks - it can and should contain multiple forms of media where called for, and there is absolutely no excuse for not reproducing the photography and illustrations from the original work.  Until they release an edition with pictures intact, I must give this a one-star review and steer potential buyers to the actual book, not the Kindle edition."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VG0RY3EUWZKB"
                },
                "Date": "on September 9, 2004",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 16, 2001",
                "Helpfulness": 0.7272727272727273,
                "StarRating": "3",
                "Text": "Mishmash of material lacks the scope and grandeur of Cosmos.  In effect it gives him an opportunity to catch up on about 15 years since Cosmos, but adds little beyond what was conveyed before.  And goes almost nowhere in making a good case for space exploration and a weaker one in support of his SETI project.  It hardly stands well on its own and even Sagan's usual comfortable style seems pale itself rather than stirring.  Not a failure as a book, but certainly not his best, and only for those who either like Sagan or want a survey of those years focussing on Sagan's ideas and contributions, which may not be fully objective or complete.  Get it at the library.  Both Cosmos and Demon-Haunted World are more worth reading."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on May 31, 1999",
                "Helpfulness": 0.7058823529411765,
                "StarRating": "5",
                "Text": "This book was the third Sagan book I read (the first was Demon-haunted world followed by Cosmos) and certainly, it is a most. Sagan portraits the future of mankind as a hopefully, brilliant one. A future that has been,  and still is, the dream of science fiction writers (and readers like me)  for years. It is hopefully to know that there are scientists who take that  picture seriously and encourage readers to believe that it is possible as  long as we want it to be possible.  But of course, Sagan snaps us in the  back and reminds us the dangers the technologies that might make that dream  come true will pose us if we are foolish enough to misuse them. And makes  us think about the state of humankind and, despite the fact that \"the  Universe wasn't made for us\" -as he put it- to remember how precious,  unique and importat we are. The Universe might be crowded of all kinds of  intelligent life. But certainly, there is only a human race.  This book  made me remember a quote by Isaac Asimov: \"The future of humanity is  in the stars, and that future is to bright to be lost by dumb and ignorant  superstition.\"  Two years and a half after Sagan's death, I still miss  him."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VX8EAU8I28Q3"
                },
                "Date": "on February 18, 2010",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IWJ5QVBQFEBM"
                },
                "Date": "on August 4, 2008",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RA5YYY6XN7YL"
                },
                "Date": "on November 13, 2001",
                "Helpfulness": 0.75,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26ST9OOY7D5MO"
                },
                "Date": "on July 7, 2011",
                "Helpfulness": 0.75,
                "StarRating": "3",
                "Text": "The information is compelling.  The style is conversational and easy to read.  But there are no pictures in the kindle edition.  I understand they existed in a print edition and they would have made this edition so much richer.  I'm really disappointed."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19DA5XJLBI2RU"
                },
                "Date": "on December 7, 2000",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "5",
                "Text": "Carl Sagan is one of the most brilliant thinkers of our generation and this book is an exclamation mark on a fruitful and alas, too short, career. This book is a sequel to the well-known \"cosmos\" in which, the author contemplates on the future of humankind on earth and in the farthest regions of space. As always, it is a riveting journey guided by the enthusiastic, humorous and eloquent Sagan who manages to leave the reader with a feeling of cautious optimism despite the many reasons humankind has to worry about its future. An excellent read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25CF4ZYNJOKF0"
                },
                "Date": "on January 3, 2015",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30N1Z1JUNDSCA"
                },
                "Date": "on September 16, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "There wasn't one dull moment in this book. It was written a few decades ago, but so much of the content is still relevant and fascinating. I am a complete novice and was able to follow it along with ease. Sagan puts all his topics in very simplistic form that anyone can understand and be intrigued by. Great read, I plan on reading much more of his work."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OHITJZJSENCZ"
                },
                "Date": "on March 15, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QO76RZO5FHMG"
                },
                "Date": "on November 17, 1998",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20H37LP26JZBA"
                },
                "Date": "on February 24, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Q5NSH53XQA9P"
                },
                "Date": "on November 24, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Consistent with Sagan's other work. He pushes you to think beyond your comfort zone and consider the larger picture. Great read and an existential reset!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LO2X9V1SIDOU"
                },
                "Date": "on December 6, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Carl Sagan has always been able to put into words, those things that cannot be explained by the rest of us. He was the most successful science communicator of the 20th century. Much of his writing is evident in the new \"Cosmos\" TV series, narrated by Neil Degrasse Tyson. And why not? The original \"Cosmos\" was his, and his influence is felt in this new series, as well it should be. \"Pale Blue Dot\" is a sweeping, humbling, description of the Universe, and our \"potential\" future in it. Along the way, he describes our triumphs, our failings, all the ways our species can become extinct. Or survive. The choices leading to either door are ours. We can use our technology either to destroy ourselves, or to ensure the survival of ourselves and our posterity. Sagan believes we can, we must, choose survival, and paints a compelling picture of all the ways humans can create homes on other worlds. All the while, never forgetting our heritage, our history. our humble beginnings."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CGK4R5RRF4RF"
                },
                "Date": "on August 17, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "In 1991 Carl Sagan convinced NASA to utilize the Voyager spacecraft in taking one last look at the planets before exiting the solar system.  From a distance of 3.7 billion miles our mighty planet is scarcely more than a tiny blue pixel.  This amazing photograph and Mr. Sagan's accompanying essay are among the most inspirational stories ever shared by our species, and serve perfectly to summarize our place in the universe.  This book builds upon these concepts to illustrate the fragility of the only home humanity has ever known, and explores in dept the possibilities that the human race might one day escape the confines of our planet on a journey to the stars.  Everything that has a beginning has an end, and one day our very sun shall die.  This book reminds us all that a one-planet species, is ultimately doomed to extinction."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OM11AJBFA48"
                },
                "Date": "on November 17, 2011",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21QZZNPJXCPME"
                },
                "Date": "on November 30, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2A272R1E5TT9K"
                },
                "Date": "on May 15, 2013",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VQ0A96ZPYIA0"
                },
                "Date": "on May 27, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "This book was engaging. Perhaps I have the benefit of 20 years since its publication to think about what it means today. The first part of the book was very informative and interesting. The second half or so seemed overly speculative. That may have been the intent but it seemed less organized than the beginning. At any rate, the speculations are certainly interesting to consider as they are important for reasons we see all around us."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OELL3P63PJPH"
                },
                "Date": "on May 26, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Amazing food for thought. One of the best books I've read. Gives you an eye-opening perspective both on your life and your place in the Universe. Highly recommended!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12DES1KVWK7KR"
                },
                "Date": "on February 5, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I enjoyed reading this book as I find his writing skills are skillful in that he has the ability to present very complex issues in such a manner as most all level of readers may comprehend.  There were are few chapters in which I felt he \"rambled-on\" a bit too long, but I still enjoyed his perspectives on the many topics presented."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UMN8U98O7H2F"
                },
                "Date": "on January 3, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "just finished this book. SPACE IS AWESOME. Kind of textbook-y, but filled with fascinating content. I sat there and looked things up on Wikipedia while reading. Because the book is about 20 years old, so many of the missions that had JUST blasted off when the book was printed have now come to fruition and made incredible discoveries."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALSJ5JQPC3A82"
                },
                "Date": "on February 27, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I thought this book was really great. Even though it was published twenty years ago, it still feels relevant and fresh, and in some places author Carl Sagan forecasts issues we have in today's society (like growing concern over climate change). The science is accessible to a layman without being dumbed down."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27EVWDXBC7OG4"
                },
                "Date": "on July 17, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11JMMUU3WH034"
                },
                "Date": "on November 13, 2010",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PWAYJUS2D2PP"
                },
                "Date": "on August 23, 1998",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "Written and communicated in the way that only Carl Sagan could.  A great  communicator - a great book - it shows the correct prospective that all  human beings should have about our exsistance on this planet."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AG7R3MMF8QLDT"
                },
                "Date": "on August 1, 2011",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16YCLRKOU0EV3"
                },
                "Date": "on March 9, 2005",
                "Helpfulness": 0.6363636363636364,
                "StarRating": "5",
                "Text": "The title of this book refers to Earth- all that our planet is in the big scheme of things is a Pale Blue Dot, as photographed by the Voyager spacecraft, departing our solar system. It's very humbling. Sagan went before his time, and didn't even get to see the landing of Mars Pathfinder in 1997, but that mission was renamed \"The Sagan Memorial Mars Station.\" Whereas Cosmos talked about the past and future of space travel, this book talks about the future. It's written 20 years after \"Cosmos\" so builds upon what that book says. It used many charts and interesting pictures and graphs. This is better than \"Cosmos\" in my opinion, and is my favorite book ever."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LXGIF90A9XPD"
                },
                "Date": "on April 3, 2000",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "A suburb well rounded take on all the basic major aspects for the human future in space that also manages to stay grounded in reality, except possibly some of the parts on terraforming, but every field needs its visionaries.  Also interesting is the reactions of people to Sagan's usual  bit on the nature of humanity, some people balk quite violently when faced  with their (and that of their fellows) ignorance, arrogance and cosmic  insignifigance.  I suppose that's only natural, but Sagan also offers an  alternative to our stupidities in rational understanding and wonder at the  universe, even though Sagan himself acknowledges that he is hardly an  unsympathetic and indifferent observer to humanity and is hence sometimes  swaed by our prejudices and failings.  As for the final word on the design  arguement for a cosmic creator, which is brought up in Bale Blue Dot: we  are proudcts of this universe, its logical then that as a survival  mechanism we would see the universe in a way that made sense to us and  stimulated our minds to fruther interact with our enviroment, its how the  human species survived in the past, and things are more complex now, but it  is still how we survive.  In fact Sagan makes that very point somewhere in  this and (more so) in his other books."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LAUTFW07PCLJ"
                },
                "Date": "on February 18, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I love this book! My personal favorite Carl Sagan book. It is full of information, insight, & though provoking notions. Anyone interested in science, space, & philosophy should get a copy, because it does not disappoint."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AF68EJQ5PRISP"
                },
                "Date": "on April 21, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "So good to get a picture of reality from the 90s. You have to constantly remind yourself that the book is 20 years old as some things really haven't changed (or have gotten worse) and some things have advanced so much!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JP11RY6GUMLC"
                },
                "Date": "on March 17, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Reading this amazing book today in 2015 and knowing how far we've come since its writing is truly amazing.  Human missions to Mars are almost a realty. Excellent read !"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AL1UII1C3SGQX"
                },
                "Date": "on August 20, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This should be required reading in all schools.  It is a vision of reality and that which is rarely thought of -- our planet is small and life is very short."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on January 31, 1998",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I thought that this was a great book. I am really into cosmology but I decided to read this book and thought it was very interesting about all the planets."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27AA63MN5RTOH"
                },
                "Date": "on July 11, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Just a great story about the wonders of space.  If you watched Neil Degrasse Tyson's remake of Cosmos, you will love this and Sagan's ideas and quotes."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQM78U96W5XA4"
                },
                "Date": "on June 21, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "The reason I rated as just good is because this edition is just text. It's still an awesome read. Carl Sagan was and still is an inspiration to me."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XQDBGIJK5QVL"
                },
                "Date": "on March 12, 2000",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "After having just watched the movie, \"Mission to Mars\" it is obvious the Sagan's impact on scientific popular culture is growing exponentially.  Movies such as Contact, Armageddon, Deep Impact, and even  (regrettably) Rocketman, have been shaping public perception of our species  future in space.  I believe Sagan has been responsible for this recent  explosion in the interest of space.  Of course I realize the findings of  the \"supposed\" fossilized Mars life has played a huge part in  this as well.  Sagan is magnificent in his ability to pull the reader in  and open his/her mind to the truly important things in life - truth,  discovery, and skepticism.  This book is a truly a steeping stone in our  pursuit towards the ultimate question - where are we going?  Space the  final frontier."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1F3M7AB83ICG5"
                },
                "Date": "on December 28, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "My son requested several of Carl Sagan's books for Christmas.  They arrived in perfect new condition and my son was very excited to receive them."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2X448FTEEFDI3"
                },
                "Date": "on November 11, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Poetic and profound. Beautifuly written. Also check out the audiobook read by Carl Sagan himself which is available on YouTube."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 24, 1997",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Pale Blue Dot is certainly one of the most inspirational books of our time. Sagan puts into perspective our conceided and embarrassing behaviors as earthlings. But from this realization of our own ignorance he somehow manages to be eternally optimistic and positive. My greatest fear is that this book will not reach the ones that need enlightment the most: Our young, our ignorant, and our deviant. Can you imagine someone reading Pale Blue Dot, then going out and committing a violent act?  Can you imagine someone being racist after reading this book? It would be hard to phantom! Sagan is at his best in this highly interesting and enjoyable journey into the future and ourselves"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LUCFGU9HGM"
                },
                "Date": "on December 5, 2012",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WFW1MOIMXNOY"
                },
                "Date": "on January 15, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Carl Sagan has always made a great book of info and it is a shame it has ended, hopefully others with pick up the cross"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEZVPWRMYKCZ7"
                },
                "Date": "on May 28, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "An absolute must-read for everyone. Carl Sagan's inspired work is something that can in turn inspire the rest of us."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFAGTKTK53OMB"
                },
                "Date": "on October 14, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Very inspiring, well written by a person who really was a great man in his profession and as a fellow human"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I0SMC0R2IJTX"
                },
                "Date": "on May 14, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Sagan at his best what more is there to say everyone should read this to learn more about our planet"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on September 15, 1998",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "With a style only Dr. Sagan could have exuded, Pale Blue Dot is simply the  finest book devoted to the future of space exploration.  Not only does  Sagan speculate on the future of our space program but covers the events  that have contributed to our understanding of space and the universe.  The  first three chapters should be mandatory reading for high school students.  Sagan helps us discover our place in the universe and enlightens our senses  with his unrivaled literary style."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on January 31, 1999",
                "Helpfulness": 0.6,
                "StarRating": "5",
                "Text": "It wasn't long after reading this that I learned Sagan had been ill. When he died, I was literally heartbroken that someone with such aspirations for humankind would never see his beloved species reach the stars. This is the  kind of book to read when your faith in mankind has been tested; it will  renew that faith."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A318EUY1KECR6F"
                },
                "Date": "on June 29, 2012",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26T1DAQOLIFKE"
                },
                "Date": "on May 21, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Ordered on vacation and it was waiting on me when I got back. Great book, fast shipping!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2P2CT2K2NL7LW"
                },
                "Date": "on October 29, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I enjoy all books by Carl Sagan. If you are a cosmos junky like me this book is a must."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A237XX0WVUY6OB"
                },
                "Date": "on March 18, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A MUST READ!!  Sagan at his best.  Everyone on our planet Earth should read this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16J281SJ9QXIQ"
                },
                "Date": "on May 2, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I enjoy the book. Took me a while to get into it I appreciate his view on the cosmos"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NRM9XUAA61KM"
                },
                "Date": "on March 23, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Even though written a generation ago, it still resonates with the issues of 2015"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UIXWH33O5R7J"
                },
                "Date": "on August 3, 2011",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on May 22, 2003",
                "Helpfulness": 0.6,
                "StarRating": "5",
                "Text": "A must read. This somewhat overlooked book is one of Sagans best. The descriptions of findings from the voyager missions, such as data on Neptune and its moons, are hypnotizing. Also great discussion on deprovincialization in the early parts of the book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1O1MEZAUDFURQ"
                },
                "Date": "on December 25, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This was a gift and it arrived on time.  Person I ordered it for loved it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKUMUPAEOXU37"
                },
                "Date": "on April 14, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "I have most, if not all, of Carl Sagan's books in my library. That photo of the Earth from beyond the orbit of Neptune is one of the most moving illustrations of our little \"life boat\" of a planet that I have ever seen. Is it available separately, in a frame-able form? I would love to hang it on my wall, next to my copy of the photo of Earthrise as seen from lunar orbit."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8QKTAH6SM2W6"
                },
                "Date": "on April 30, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent book providing a great perspective of  our place in the cosmos."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ID6Y5EHWIOF4"
                },
                "Date": "on December 18, 2012",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "That's the kind of thinking/reading which everyone should be wondering about. Everyday life is full of wasted acts, thoughts, guided by prejudice and egos. Try living every moment of your life without forgetting WHERE you actually are. On an infinitesimally small speck of dust, rotating around a middle size star !! If that does not make you think, nothing will !!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FTCD371EW19J"
                },
                "Date": "on May 13, 2014",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": "Carl Sagan instills in us the recognition that in the unimaginable vastness of space and immensity of time, our mother-earth is an  infinitesimally small dot - and certainly not 'unique' - in the universe. Yet he inspires us with a feeling \" we humans are capable of  greatness \"  and points to human future which lies beyond the earth. Simple jargon-free language."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RFRU3T1PQAHK"
                },
                "Date": "on November 26, 2013",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": "a little dated, a bit bloated but still fun.  Nowhere near as good as his earlier books, but a little thought provoking.  Not a lot."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Q1H3VVYKD62Y"
                },
                "Date": "on October 19, 2013",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJR1ASSTQCYST"
                },
                "Date": "on September 14, 2013",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Z70P113OPT39"
                },
                "Date": "on June 11, 2013",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Certainly a great deal of technology has changed and we have collectively increased our knowledge of the solar system since this book was written, but even with that Carl Sagan's unique way of describing the magic of the universe never gets old. He is able to touch on the wonder we all have about space. I highly recommend this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AC1OJJ9WJCTV7"
                },
                "Date": "on March 18, 2013",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "No other human being will ever have the same impact as Carl Sagan. that being said this book absolutely gorgeous and should stand alone as the example of just where the earth and man stand in the grand scheme of things."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHD101501WCN1"
                },
                "Date": "on April 12, 2008",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HKXVTI958KQ1"
                },
                "Date": "on March 28, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "inspirational book!  it puts the world's troubles in  perspective."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATFXP41MTB5LP"
                },
                "Date": "on May 10, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I could barely put this book down and it was fantastic to read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MWICRPOPZD6W"
                },
                "Date": "on August 25, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Looks like a good read. No pictures in the soft cover, however."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFHRW4X1MMQCD"
                },
                "Date": "on March 17, 2013",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MP7I4GX6UMCS"
                },
                "Date": "on August 7, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Read this 30+ years ago. Loved it then. Loving it again now."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RD4EOZRF7UJ9"
                },
                "Date": "on April 13, 2006",
                "Helpfulness": 0.5714285714285714,
                "StarRating": "5",
                "Text": "This book really focuses on something I believe is of uttermost importance for human kind: our long-term survival as a species and the essential role of space exploration. Many ideas and facts presented in Pale Blue Dot have already been expressed elsewhere, not least in science-fiction, but here they are collected and presented to us in a formidable way, with the focus on the potentially new era awaiting us where we would finally quit our Earth cocoon and start expanding through the Universe. As a scientist, I believe that this is a realistic view even if it definitely won't happen in our lifetimes. Sagan gives very convicing arguments why it is necessary to take the first steps in this direction: now, without delay!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VTFNS1EKOJRO"
                },
                "Date": "on December 20, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A very interesting study for the general reader"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TUBYG7WG1FR7"
                },
                "Date": "on January 1, 2012",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AM79J6RQPBOM5"
                },
                "Date": "on May 18, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I like this book it was a great purchase!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A250XU4W3L5QYM"
                },
                "Date": "on January 3, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Lots of pictures and this is a huge book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32W5RZRXWST0"
                },
                "Date": "on March 8, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great read, we are lucky for Carl Sagan."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZOKXZ0EL19R5"
                },
                "Date": "on October 16, 2012",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "As Carl Sagan completes his Journy through the Cosmos he takes you full circle. I highly recommend Carl Sagan to anyone who is cirious about science or just our place in the great Cosmic ocean."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QJR56ICNHDQX"
                },
                "Date": "on October 10, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "Interesting, but somewhat speculative."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FCB1BCMMY57C"
                },
                "Date": "on March 3, 2014",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIRR36G62J3HO"
                },
                "Date": "on May 14, 2013",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "this book is definitely one my favorites of all time. a book that links our history and social concepts to science and space exploration with words that are poetic by carl sagan."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 18, 1998",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31TL0DN1CNG8B"
                },
                "Date": "on August 24, 2013",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Loved the book. Easy to read, informative and inspirational. Your kids will like it you will love it. Every time I read it I feel proud to be a human and a scientist."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SBED6Q478211"
                },
                "Date": "on January 26, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A342DASBI02266"
                },
                "Date": "on January 21, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Still just 35 pages or so in."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FSEQHNAXIQ78"
                },
                "Date": "on August 23, 1998",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A300SS8U62SM3G"
                },
                "Date": "on April 11, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Pale Blue Dot is Well written and thought provoking.  The pictures bring it to life. He discusses history as well as the future."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35YMQ6IX6YL91"
                },
                "Date": "on December 23, 2012",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Carl Sagan was one of the great mind of the 20th century, he made the point that we are just a speck in and ever change cosmos."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on August 6, 1998",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "One of the best books I have ever read.  Pale Blue Dot belongs on the list of classics that every school child should read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7LXSE6AA8MSN"
                },
                "Date": "on July 11, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "This book through science and the power of \"Free Thinking\" places us in a place beyond imagining. In the vastness of space here we are mortal humans traveling on spaceship earth hurtling through its vast darkness.It is a very eye opening experience  finding where we fit and just how full of ourselves we as humans have become. After reading \"Sagan's\" most important passage of us on the \"Pale Blue Dot\" it  is clear that we are just a small paragraph in the multitude of pages in the book of time. For me personally, it opened up many more questions of which currently there are no good answers for my pea sized brain.It brings a clear and concise picture of for some how  Religion and thoughts of a Omnipotent \"God\" came to be.This read throws a wrench into the works about that kind of irrational thinking and forces one to rethink that position. Science and men of science have showed us the path.We need to look to where it leads.And with that we can find ourselves and our place in the \"Cosmos\"."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on December 19, 1997",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "This is a book that is for men, women, and teenagers; in fact, it is a book meant to be read by all of humanity.  Pale Blue Dot's subject, the future of humanity, is imaginatively explored and it gives good insight into the future of the human race.  If you do not like science fiction this book will open you up to the future and perhaps make you understand science fiction fanatics.  If you like Science fiction this is a great book to read because all of science fiction is based on the science facts of today and yesterday which this book explores."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on May 18, 1996",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Pale Blue Dot stands on its own in broadening every reader's knowledge and curious wonder about our own environment and where we fit into the vast cosmos as a whole.  However, readers familiar with Sagan's earlier writings will profit from the foundations they provide.  Beyond being highly informative, this book challenges us humans to prepare for the day (eventually inevitable) when our earth is no longer able to sustain us.  If we wish to survive as a species, we'd better start planning now for a secure future elsewhere in the universe"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3S5QV71QTDRU5"
                },
                "Date": "on August 25, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great book, a must read"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PO9XPU4ALKO6"
                },
                "Date": "on November 26, 2012",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AF5F3RMV0FBUN"
                },
                "Date": "on November 5, 1997",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "This, by far, was the greatest book I have ever read. It provides such a deep understanding of our could-be future in space, that once you've started reading it, its hard to put it down. The theories contained within it are so radical, yet when he explains it, they seem so attainable. He really convinced me that we need to push on in space not only to, as he says, fulfill our neverending desire for new lands, but also to keep us alive and thriving, as we are now."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NS525IA4VAX0"
                },
                "Date": "on April 13, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Amazing, eye opening."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on April 3, 1998",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on December 5, 1996",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Carl Sagan has done it once again. This book is filled with eye openning photographs of the heavens, explanations of past missions thorough our solar system, and how science can prove our fears of the unknown irrational. Sagan addresses such thought provoking subjects as religion and science, the existence of life in the universe, and the dooms day asteriod. Pale Blue Dot is a  must for anyone interested in the future on mankind"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GX8AYX6RROM9"
                },
                "Date": "on March 29, 2009",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2W9AS0UWQF71N"
                },
                "Date": "on March 30, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Liked it very much."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3E1TTHMO6IRXL"
                },
                "Date": "on September 24, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "excellent read ..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26B5PDNNTMFMQ"
                },
                "Date": "on December 26, 2012",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Not only is the book attractive to look at when received, but the content inside gives a person reading it deep thoughts as to how small we are in the utter vastness of the universe at hand. Carl Sagan puts forth such descriptive information that keeps you wanting to read more. Robotech, a series of animated movies was also written by Carl Sagan in his future outlook of man's next step into the centuries to come. Overall, I encourage more people to read his work, as it inspires us to think beyond the mundane things around us and think in more objective terms of our reality. While Carl is not with us physically, his work continues on and still enchants."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UANDYC9XBV0H"
                },
                "Date": "on November 12, 2013",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CFM6E653ZY5L"
                },
                "Date": "on November 27, 2009",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I really enjoyed the beginning of this book when he talks about religions and supernatural claims and how they inhibit our species to progress. Reading Carl Sagan's books feels like coming up for air for the first time in a long time. The only issue I would postulate would be that it was written in 96', so it's a tad bit out of date. For example, the number of moons described that orbit Jupiter and Saturn is out of date and a few more other notions, but the majority of the book is still relivant."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on August 17, 1999",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Carl Sagan continues to impress readers with Pale Blue Dot.  This book captures the readers imagination and fills your mind with the typical Carl Sagan genre of revolutionary thoughts.  His true genius is brilliantly  displayed in this book!!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A138BZ0ASOB0J1"
                },
                "Date": "on September 14, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASQSW1X7IULLU"
                },
                "Date": "on September 11, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "This is a fantastic book that outlines space and challenges of living in outerspace. There are great chapters on terraforming planets and provides justifications for funding space exploration. Carl Sagan has a amazing writing ability which lulls you into a sense of immersion. While the writing is definitely advanced and often requires a dictionary on hand, the ideas are mind expanding. A must read for any space enthusiast."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34LLCJPPPNV4W"
                },
                "Date": "on April 16, 2012",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "I did not know that this was not the book with all the pictures also. I was buying it for a friend, (A scientist who wanted it because he read it many years ago, and loved it !)  Then when I saw that the big book he wanted,with pictures and the writings, it cost $58. little high for me.  So I decided to give him the book anyway and tell him where he can order the big book, that he loved as a young student, many years ago !"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16L9C84UB1QJZ"
                },
                "Date": "on February 19, 2009",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMWL7BL6SXNWK"
                },
                "Date": "on July 27, 2008",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36JV16OL04TPU"
                },
                "Date": "on January 3, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Carl Sagan's Pale Blue Dot is an enlightening and enriching read, the original book has great images that cannot be duplicated in ebook or Kindle versions from what I have read, which is a shame. If you really want to enjoy this book try to get an original copy, as a digital version without the images will be lacking for sure. Sagan references many if not all of the images in the text of the book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28C5N9G0MM3ID"
                },
                "Date": "on December 8, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great book"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A364RRYVVUG8AA"
                },
                "Date": "on November 10, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I love this book. I was recommended to take this edition because of the stunning photographs, and was not disappointed. In this book, Sagan introduces us to our home, shows us around our planetary neighborhood, and shows us the stunning beauties of the space around us. It's inspiring to see how far we've come and how far we have yet to go in our journey into space."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XIRK8WCGR6CF"
                },
                "Date": "on January 10, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JUXYVD3UU228"
                },
                "Date": "on January 14, 2014",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "However the content is quite a bit old and outdated, given that this book came out quite a while ago"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KWHKJ2R61SJU"
                },
                "Date": "on December 10, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Carl Sagan was a prescient dreaming giant with forward-tipping vision beyond the average citizen.  \"Pale Blue Dot\" a journey of a futurist thinker.  Well worth the time to read this small, but powerfully constructed, book.  Carl at his unfettered best."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FYG5NNB1BEMO"
                },
                "Date": "on November 17, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "As good as Carl Sagan gets. His awe inspiring vision for humanity magnifies for me the loss of his passing."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1N3WAMKRO381R"
                },
                "Date": "on November 15, 2013",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2M5DMEJ8IWXBX"
                },
                "Date": "on November 9, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "A great book by an awesome human being. This book shows the greatness of the vastness of the Cosmos and the fragility of our world."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27AMVR5A69U0U"
                },
                "Date": "on March 12, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Written very clearly, a little sarcastic towards believers of a God, doesn't matter, but very well written. Very inspiring indeed."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMX400U028ZLO"
                },
                "Date": "on February 8, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I wish I had lived next door to Carl Sagan or better yet maybe he would have let me bed down on this couch so I could have actually talked with him as much as I wanted to. I think he was one of the greatest thinker's of our time. Those that can't accept him are those with closed minds. Blue Dot tells it like it is, like it or not."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DKJG8CM1BHQU"
                },
                "Date": "on February 2, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Um livro excepcionalmente bem escrito, intrigante, inspirador, instigante e, sem dúvida, capaz de fazer qualquer voltar a tentar responder àquelas perguntas básicas sobre quem somos e para onde vamos."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LY0HN0P34U92"
                },
                "Date": "on January 21, 2013",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "A very good book written by Carl Sagan, that offers information and another perspective of our place in the universe, but we need to take into consideration that some of the information in the book is not up to date since it was written in the early 90's and a lot has change since then."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34S44X01QTW0Q"
                },
                "Date": "on November 17, 2012",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Once I saw Carl Sagan's TV documentary \"Cosmos: A Personal Voyage\" I knew I wanted to read his books. His style of explaining the things that surround us and intrigue our senses for ages is rather parental than scientific-like. Throughout the book I felt like I'm riding aboard the Voyager and had a chance to explore each planet in every detail. I recommend it to each individual who wants to unravel the mysteries of our Solar system."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QMON8S78HZIS"
                },
                "Date": "on May 18, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Good book"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BEJLXXEFR8OU"
                },
                "Date": "on May 12, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "good book"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8Z03LN6EV5RY"
                },
                "Date": "on February 6, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "thank you"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APEGGPL1M05Z"
                },
                "Date": "on July 7, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "The book came shipped in a nice plastic wrap, thankfully since it was shipped during an all day downpour.  Was the product I wanted and the condition of the book is also what the vendor had described it as.  Pretty much a brand new book for a percentage of the price!  The book is also great for people who look into the stars as well!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FYHZH88WARBF"
                },
                "Date": "on August 18, 2011",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AN3BXJ62IDLO1"
                },
                "Date": "on April 10, 2014",
                "Helpfulness": 0.5,
                "StarRating": "1",
                "Text": "I bought this book to replace a copy I lost. I was very disappointed that this copy does not have any of the pictures that were in the original :("
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2L1YLJEKPHFFI"
                },
                "Date": "on January 5, 2014",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35HOF5WN05MP6"
                },
                "Date": "on January 24, 2012",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ETEAQS8EQCFI"
                },
                "Date": "on March 24, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Beyond what other reviewers have written:  IMHO the world would be a much better place if everyone would read Carl Sagan's collection of writings especially during their formative years. Pale Blue Dot is a great place to start your odyssey."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EVNUEOC7Z3QU"
                },
                "Date": "on December 12, 2011",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Perhaps some of the greatest nonfiction I have read. Sagan is continuously captivating and presents a plethora of prodigious arguments. Highly recommended for anyone remotely interested in astronomy and the universe."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VFA6QJTQMGBR"
                },
                "Date": "on October 31, 2011",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I read this after being blown away by A Demon Haunted World. This is hands down one of the most inspiring and humbling books that I have ever read. I will definitely be returning to it for another read through."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39NA9TICJRHFH"
                },
                "Date": "on December 30, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "No one writes like Carl Sagan. He can explain all the complex, and mind-blowing concepts about the universe in a way that everyone can understand. Read it cover-to-cover in just two days. Couldn't put it down."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OB8JSBV2W692"
                },
                "Date": "on March 22, 2013",
                "Helpfulness": 0.5,
                "StarRating": "2",
                "Text": "Mr. Sagan talks about voyager photos but has none in the kindle book and has no links to the photos.  Disappointing!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16ZY82SME1P5B"
                },
                "Date": "on October 4, 2012",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Carl Sagan was more than a great cientist. He was a artist of worlds and Plae Blue Dot is one of the most beautiful and cientific information a human been can read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4QFV1DQEWI6A"
                },
                "Date": "on January 5, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Carl Sagan is a cultural icon, and for good reason. Pale Blue Dot is a tremendously poignant, readable journey through where we have been and where we are going."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FQ676XSZ1W35"
                },
                "Date": "on December 1, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Incredible, thought provoking book. This brought me to tears and sent chills down my spine. It also can change your entire perspective on life! Need I say more?"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2C8JL4FE7S83H"
                },
                "Date": "on July 22, 2013",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "I purchased this book because I thougth  it was a hardcover edition but it's not. I want you to tell me what could be done to receive the hardcover edition."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AW2VAQDU4U16J"
                },
                "Date": "on April 27, 2012",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "This book is absolutely beautiful.  Just like new -- filled with nice \"crisp\" pages and beautiful pictures.  It is a treasured part of my book collection."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6FCOMACAJ5PA"
                },
                "Date": "on January 18, 2011",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "For me, it is far better to grasp the Universe as it really is than to persist in delusion, however satisfying and reassuring. - Carl Sagan"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BE6FXUQO3AX3"
                },
                "Date": "on March 30, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "This book is one of the very best reads I ever done. Carl Sagan was a wonderful writer. This book will hold your interest cover to cover."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21BTVVGQAFR4S"
                },
                "Date": "on November 29, 2012",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Wow, great read and follows the TV program of the same title.  Fine photos, and the usual Carl Sagan spirit of adventure and wonderment."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MJMYLRTZ76ZX"
                },
                "Date": "on July 17, 2003",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DOGO7B00WIQD"
                },
                "Date": "on September 3, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I was religious for the majority of my life, and knew little about the scientific world, this is a great eye opener to start with."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AR99WTRJSAXX6"
                },
                "Date": "on August 28, 2012",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Amazing, very interesting, could not put the book down once I started. Changed my whole perspective on how I view life on earth."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1B1MKD0YWG35R"
                },
                "Date": "on June 2, 2013",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RO71UQ2ZG7MG"
                },
                "Date": "on January 5, 2012",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Great shape... prompt shipping  made a great gift for my grandson... will use this avenue again to find carl sagan books"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVD1R6B47423T"
                },
                "Date": "on April 8, 2014",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "This was bought for my son and he really enjoyed this book. He will and this too his collection of great books to read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARYDH3D2GGPTD"
                },
                "Date": "on April 23, 2015",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18G42TL983Q2W"
                },
                "Date": "on March 22, 2000",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": "This was the first of Sagan's books I read, and it's wonderful. The image of the Earth as a \"pale blue dot\" and the \"You are Here\" painting are haunting and give perspective. You'll never think  of your country or your life in the same way... and that's just the first  chapter!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1E2CLPZIA86LP"
                },
                "Date": "on January 5, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "ok"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AN8BVKNIX37HY"
                },
                "Date": "on April 21, 2014",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": "Be done with it. Everyone needs to experience Sagan. The sooner you do it the better. The better you will be and the better you will see where you fit in to the big picture."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PWAYJUS2D2PP"
                },
                "Date": "on August 23, 1998",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": "Kept you thinking throughout the entire book and keeps you thinking as you  drive to work or eat your dinner.  Just a great great read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1800O3TV5GWMV"
                },
                "Date": "on April 27, 2015",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Great product, and a great seller!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JTC17GT8XONO"
                },
                "Date": "on April 18, 2000",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 2, 1998",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "This book is one of the best I've ever read.  The  chapters are engrossing and awe inspiring.  The accompaning photographs and illistrations make this a must read for anyone who has ever had the slightest interest in what we can accomplish if we have the vision.  Of all the Sagan books I have read, this one tops them all."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12F50QDQE828X"
                },
                "Date": "on August 12, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "very nice"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8UWD30ZY9E92"
                },
                "Date": "on August 27, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Still reading it but it's a great book. I like that he provides evidence as to why the religious beliefs that the universe is 6000 years old and that Earth is the only planet with life are wrong. He provides concrete evidence as to why evolution is factual. Nobody beats Carl Sagan."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LCPDGSKAXZ7L"
                },
                "Date": "on November 2, 2001",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": "This was the first Sagan-book I read and I was 14 at that time. I can't say I really understood it then, but it simply CHANGED my life. Now I am 18 and this book is one of the most important things in my life till now. I can't say if it's as good as Cosmos or it's better or worse than it, as it depends on your taste, but I myself think at least it can be fairly linked with Cosmos. A must-read to everyone who are interested in the Space age and its short history. And what I want to note is that if you can afford Hardcover, buy that. Not paperback. Although the text itself is not different, to understand the 'vision' and 'pale blue dot', Hardcover will be far better. For me, I bought Paperback first, but at the end I had to brought both of them!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DQ2DFHJ35ZUK"
                },
                "Date": "on July 7, 2014",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": "Thanks"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on January 9, 2000",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 31, 2001",
                "Helpfulness": 0.375,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on September 9, 1999",
                "Helpfulness": 0.25,
                "StarRating": "5",
                "Text": "Carl is gone from us now, but his mind is still with us, reaching into the heaveans, beconing us to follow..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A327XRHDKCHBSF"
                },
                "Date": "on December 7, 1999",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": "Carl Sagan's finest point is stating that the universe does not require a creator for the universe to be as we see it today...the reason why i am stating this is because many people today believe a designer is necessary  without trying to look for the truth themselves"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1303BQ4PJ7EYM"
                },
                "Date": "on July 24, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Carl Sagan's prophetic book"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37NEFZG5ROF7N"
                },
                "Date": "on November 13, 2013",
                "Helpfulness": 0.4,
                "StarRating": "1",
                "Text": "I am sure the book will be inspiring, I have not finished reading it, but the Kindle version does not contain the images......DISAPPOINTED!! Why spend a premium on an ebook that does not contain the images.  You would think the Kindle tablet would be a perfect medium to show case the images.  In the first chapter Sagan goes into a beautiful prose describing the image from Voyager II looking back at Earth and there is no accompanying image...BOOOOOO!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LJQN8H1AD8HE"
                },
                "Date": "on October 25, 1999",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "this book was a really adventure like all the carl sagan books it was easy to understud and i really enjoy it. this book is for all ages no one is too  young to read it"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 12, 1999",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Carl Sagan has done it again.  This may be the most complete and knowledgable book I've ever read on our universe.  It covers every planet and its' environment, how the planet's environment came to be, and where it  may be going.  It covers man's exploration of space and time, from  satellites to shuttles.  More on future technological development of  nuclear directioning of comets and asteriods.  I strongly recommend this  book to anyone who is interested in our solar system and beyond.  The name  'Pale Blue Dot' comes from a story told by Dr. Sagan of when the Voyager  was passing Mars.  Sagan recommended NASA to turn the satellite around and  take a picture of Earth from such a great distance.  NASA questioned him  for it would appear to be a pale blue dot and a virtuosly useless picture.  Sagan explained to them that man needs to see Earth from another  perspective, so we might get an idea of exactly how insignificant we are in  such a vast cosmos."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1G2A4EDLU6WHJ"
                },
                "Date": "on March 12, 2000",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "The book kept me interested, and was quite enlightening.  It made me think about the relationships of the space program and the future of space exploration."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AW6O8HZKMSXZU"
                },
                "Date": "on January 21, 2004",
                "Helpfulness": 0.375,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5Z2ETMIZ4GXX"
                },
                "Date": "on January 3, 2007",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "This was very interesting reading.  Carl has a wonderful way of relating science, technology and his vision in very understandable language."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29QZZUCOZQSAS"
                },
                "Date": "on July 27, 2001",
                "Helpfulness": 0.23076923076923078,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10UUSHRTNNUXQ"
                },
                "Date": "on March 28, 2002",
                "Helpfulness": 0.3181818181818182,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10UUSHRTNNUXQ"
                },
                "Date": "on March 28, 2002",
                "Helpfulness": 0.2857142857142857,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on August 9, 1998",
                "Helpfulness": 0.15,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALRRY0JF5CL0U"
                },
                "Date": "on February 24, 2012",
                "Helpfulness": 0.25,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZHPI79I2UTI7"
                },
                "Date": "on February 11, 2014",
                "Helpfulness": 0.10526315789473684,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NJ49L6YEZO4T"
                },
                "Date": "on December 6, 2004",
                "Helpfulness": 0.21818181818181817,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJ44L72HZMYDK"
                },
                "Date": "on December 21, 2003",
                "Helpfulness": 0.0975609756097561,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on November 24, 1999",
                "Helpfulness": 0.08108108108108109,
                "StarRating": "2",
                "Text": "The first couple chapters are filled with the usual Sagan illogical naturalism.  I never understood how he could hold to such a irrational philosphy and yet push critical thinking on everyone (See Demon-haunted  world).  His best contradiction was proclaiming design and complexity in  the universe, yet denying the need for a designer.  He seemed to forget  logic states \"chance\" has no power and that the Big Bang  logically points to the need for a transcendent creator."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Pale-Blue-Dot-Vision-Future/product-reviews/0345376595/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "195"
    },
    "Salesrank": "#9,032",
    "Timestamp": "2015-05-24 13:20:37.169911",
    "itemurl": "http://www.amazon.com/Pale-Blue-Dot-Vision-Future/dp/0345376595"
}
