{
    "Category": "in Books (",
    "ListPrice": "",
    "Name": [
        "5 Steps to a 5: AP Physics B and C"
    ],
    "OfferPrice": "$4.38",
    "Reviews": {
        "AverageStarRating": "4.3 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3U97C4G7QLV23"
                },
                "Date": "on April 17, 2006",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "1",
                "Text": "Last year I used only this book to test out of AP physics B. I got a 5 on the test, so clearly the book did a great job. However, this year in physics C, I am finding that this book is awful, particularly for electromagnetism. It gives no examples using ampere's law and its covering of induced emf is absolutely awful. The circuit examples it gives are too simple and the practice questions never require the calculus derivations (such as ones using Gauss's law) that are covered on the C test. I would use it again any time for physics B, but am truly dissapointed that it is also advertised as a book for physics C."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18P9T8Z1V4G14"
                },
                "Date": "on August 26, 2006",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10E2440TZOOK7"
                },
                "Date": "on July 14, 2006",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book is awesome -I'll admit like the authors I prefer a more conceptual way of doing physics.  Since in my opinion if your students don't really understand the ideas behind the math, they aren't physicists but mathematicians. So if you love Paul Hewitt and want to make physics more 'phun' than this book is for you. And if you ever get the chance to take AP physics training from Greg do so. His AP workshop was the best PD I have ever attended."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOV5SJZOXHWBS"
                },
                "Date": "on April 15, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I teach chemistry and physics at a medium sized rural high school in Kansas and have one or two AP Physics students every couple of years.  Our program spreads the course out over two years and we spend the last two months in review using a prep book.  I used this book for the first time with a student, admittedly a very bright student, last year and he scored 5's on the Physics B and both Physics C tests.  He rated it as excellent and so do I."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IHC8SVYKWRGP"
                },
                "Date": "on January 24, 2005",
                "Helpfulness": 0.7777777777777778,
                "StarRating": "5",
                "Text": "This book is clear, easy to understand, comprehensive, and actually entertaining.  Because it was written by a former AP Physics student and an AP Physics teacher, the material is perfectly geared towards students' needs, and the authors know how to keep the reader's attention.  The practice problems are challenging but not too hard, and the diagrams and side notes are often laugh-out-loud funny.  Above all, after using this book I feel much more prepared and confident."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UUDEJT98BOXJ"
                },
                "Date": "on April 27, 2006",
                "Helpfulness": 0.75,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATXXN4XOFX4VQ"
                },
                "Date": "on March 17, 2006",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWQ7K1GP3ZICN"
                },
                "Date": "on March 16, 2007",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "For those who do not wish to reread a physics textbook, this is your best point by point review book for the AP Physics B exam. I'm not sure how helpful it is for C takers however because the main focus of this short book is on the Physics B. Buy at your own risk."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2N88HYLI4A9LF"
                },
                "Date": "on January 30, 2005",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "This book is fantastic.  Reading it is effortless and fun.  It logically organizes the material you must know and prepares you for the test experience itself.  The presentation is crystal-clear.  The authors heed Einstein's insight: 'You do not really understand something until you can explain it to your grandmother.'"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FKKPEN7684AT"
                },
                "Date": "on May 11, 2009",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "When I first got this book, it looked ok. The material covered in sections is good for physics B. I recommend that if you take physics C however to not get this book and rather get the princeton edition that has covers only physics C. The material is sometimes however hard to understand when applied. The test questions however are a huge downside to this book. The test questions are ridicously hard and aren't exactly up to date with the actual AP test. The questions also involve a lot more calculation with the brain in the multiple choice since you cannot use a calculator and is basically an overall review of the book only if you read it. If your going to do the AP test at the end, warning, it is basically a combination of all the tests questions at the end of each chapter."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HD1SSHY37OZ3"
                },
                "Date": "on June 10, 2009",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "It's a create reference for physics. It helped me prepare for the AP exam and I felt confident while taking it. Just remember: stick to a schedule and don't cram! The book came new and in quickly with no issues."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A140UFXMB0658B"
                },
                "Date": "on September 20, 2009",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book is very helpful.  My friends and I are using it along with our class instruction."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1D2E715T6H00T"
                },
                "Date": "on December 30, 2004",
                "Helpfulness": 0.25,
                "StarRating": "5",
                "Text": "I look throught a pre-publishing manuscript of this book and it looked really great. If you are studying for the AP Physics exam, this book will be really really useful to you. (Highschool senior)"
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Steps-AP-Physics-Greg-Jacobs/product-reviews/0071437134/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "13"
    },
    "Salesrank": "#1,517,880",
    "Timestamp": "2015-05-24 13:13:20.199767",
    "itemurl": "http://www.amazon.com/Steps-AP-Physics-Greg-Jacobs/dp/0071437134"
}
