{
    "Category": "in Books (",
    "ListPrice": "",
    "Name": [
        "Black Bodies and Quantum Cats: Tales from the Annals of Physics"
    ],
    "OfferPrice": "",
    "Reviews": {
        "AverageStarRating": "4.3 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A176DBO7IPY9L1"
                },
                "Date": "on January 10, 2006",
                "Helpfulness": 0.9090909090909091,
                "StarRating": "5",
                "Text": "Never in my wildest dreams did I think I would ever understand the first thing about string theory, much less about cosmic microwaves-- but eager to improve my brain a bit, I recently picked up a copy of Black Bodies and Quantum cats. Now, thanks to this immensely enjoyable book, I am happy to report that for the first time in my life I might actually be able to hold a coherent conversation about these and more. By presenting some of the most challenging ideas imagineable within cultural (and even pop cultural) contexts, and writing about them with wit and humor, Ouellette has done the near impossible -- she's made physics fun for the lay person... fun, and, dare I say, maybe even a little bit sexy. I imagine that even if you did have a better grasp of physics than I did prior to picking up this book, you would find it to be an extremely entertaining, smart, and very humorous refresher course."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NC5BMF6QWC5B"
                },
                "Date": "on April 4, 2006",
                "Helpfulness": 0.8421052631578947,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATTPNQREHQ5UO"
                },
                "Date": "on March 23, 2006",
                "Helpfulness": 0.875,
                "StarRating": "5",
                "Text": "I studied physics in school, but I still enjoy reading popular physics books for fun from time to time (I know, what a nerd!). One of the best things about this one is the inclusion of fascinating historical insights that bring people like Tesla to life (on the page anyway). \"Black Bodies and Quantum Cats\" is a fun read that is ideal for casual science fans and budding scientists alike. I highly recommend it, and I am going to give copies to all my nieces and nephews to show them that physics is much more than equations on a chalk board."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A197WW3SPUIE8Y"
                },
                "Date": "on April 21, 2006",
                "Helpfulness": 0.7777777777777778,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A71YG4NCP9JJ7"
                },
                "Date": "on February 13, 2006",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "5",
                "Text": "I've read a number of \"popular science\" books and would rate this among the best. The variety of topics covered make it an ideal resource for science teachers as well as a good pick for gym-readers and others that get frustrated with the amount of time and effort required to follow many popular science books. Ouellette's style is entertaining and her enthusiasm for discovery and understanding is contagious. This book is a refreshing detour from those that require 250 pages of background reading before you reach the main topic."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1H81GEYIBO418"
                },
                "Date": "on April 20, 2006",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CWZGQQ2447SQ"
                },
                "Date": "on April 19, 2006",
                "Helpfulness": 0.6792452830188679,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10TLB4XZRQSLZ"
                },
                "Date": "on August 19, 2012",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14IYOCL2UYCHM"
                },
                "Date": "on April 26, 2011",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "2",
                "Text": "This book was strongly recommended to me in my search for something accessible regarding quantum physics. However, like others reviewing this book, I'm bothered by the factual errors  in the first few chapters regarding elementary facts about telescopes, microscopes and lenses. The President of the American Physical Society's insistence in the factual accuracy of the book and the author's similar insistence in her foreword make them all the more irritating. Even the Penguin editor should have caught these boners. How can I feel confident when she gets to a discussion of the Copenhagen interpretation of quantum physics?"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EAV5HR71NJ60"
                },
                "Date": "on July 1, 2006",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2L32G18Z0X7E4"
                },
                "Date": "on November 30, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "If you are interested in Physics, but not entirely sure what it's all about, Jennifer puts things in layman's terms, and helps you see it in perspective.  I cannot vouch for her accuracy in all the topics as I'm not an expert, but definitely interesting and you'd be inclined to find out more on your own.  I've also purchased her book, \"Me, Myself and I\", which is about genes and more.  She's surely one of my favorite non-fiction writers."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JILF2CYZ777U"
                },
                "Date": "on May 26, 2009",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is a GREAT product. I absolutely love this book. I first checked it out from the library and fell in love with it and had to order it. I found a great used copy on Amazon. It came in excellent condition (as promised), great price, and was delivered very quickly. Jennifer is absolutely brilliant in the way that she conveys the complex ideas of physics/quantum physics into a digestible and practical manner. EXCELLENT READ!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3C0380R9NMLHD"
                },
                "Date": "on March 24, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A226UJFHHN5SU"
                },
                "Date": "on October 6, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This was required for my physical science class. It was fantastic. Gave it to my sister in high school and think everyone can use it. Puts tricky complicated science theories into real-world scenarios and very understandable. Many ah-hah moments! Would recommend for everyone."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IPM23IJ8Q3L4"
                },
                "Date": "on March 10, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AINKSB9CZVZFL"
                },
                "Date": "on September 11, 2009",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book not only educates you on the world of physics, it's also full of fun historical facts that lead up to that world.  I would recommend this book to anyone who has an interest in learning about the inner workings of the physical world around us... or to those who have a propensity to tear things apart to see how they work!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24K6D09MSJSL3"
                },
                "Date": "on March 1, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Amazingly Awesomely funny and educating.  I had no idea that Science was as beautiful and easy to understand as a Matisse painting.  Would love to visit a gallery of books like this displayed because it's real art when handled by Jennifer Ouelette.  All the sellers get bravo too!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6ILK3FXYH595"
                },
                "Date": "on March 24, 2008",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "This is a great book that skims the surface of a number of physics topics. The author does a great job explaining each topic in an easy to understand manner, then continues to go more in depth, while still being understandable for the average reader. Being somewhat of a physics buff myself, I found the light heartedness of the book refreshing. Far different than reading Hawking or Greene, but equally as interesting. Don't miss Jen's blog!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FRHR70XGWV94"
                },
                "Date": "on March 13, 2006",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": "This is a delightful and playful weaving of seemingly unconnected fields of study to explain the universe through physics for non-scientists.  Very intelligent and very touching."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FI6EHLNIAAE0"
                },
                "Date": "on July 5, 2006",
                "Helpfulness": 0.2,
                "StarRating": "1",
                "Text": null
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Black-Bodies-Quantum-Cats-Physics/product-reviews/0143036033/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "20"
    },
    "Salesrank": "#634,690",
    "Timestamp": "2015-05-24 13:24:22.220690",
    "itemurl": "http://www.amazon.com/Black-Bodies-Quantum-Cats-Physics/dp/0143036033"
}
