{
    "Category": "in Books (",
    "ListPrice": "$72.95",
    "Name": [
        "Electrodynamics of Continuous Media, Second Edition: Volume 8 (Course of Theoretical Physics S)"
    ],
    "OfferPrice": "$53.34",
    "Reviews": {
        "AverageStarRating": "4.3 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ABABZIT5EAW7"
                },
                "Date": "on July 23, 1998",
                "Helpfulness": 0.8888888888888888,
                "StarRating": "5",
                "Text": "This is the Volume 8 of the famous Course of Theoretical Physics by L. D. Landau and E. M. Lifshitz. All serious students of theoretical physics must possess the ten volumes of this excellent Course, which cover in detail and rigour practically all the branches of theoretical physics. The Volume 8 treats the subject of the electromagnetic fields in matter, or the macroscopic electrodynamics. The book contains all the basic theory of macroscopic electrodynamics, discussing at the same time some more specialized and very interesting topics. The discussion is rigorous and very detailed, with clarity of exposition. There exists also in this book chapters not usually found in other similar books, such as the chapters on the dynamics of magnetic fluids, the theory of the interaction of fast particles with matter(for example, the Cerenkov radiation), the macroscopic theory of superconductivity and the theory of diffraction of X rays in crystals. There exists a little appendice!  on curvilinear coordinates, which serves to auxiliate the reader in the mathematical calculations. Moreover, the authors discuss in a very elegant manner mathematical methods for solving problems in electrostatics, such as for example the method of conformal mapping. Certainly one of the best books on macroscopic electrodynamics!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D7XC7USJ9X7J"
                },
                "Date": "on October 2, 1998",
                "Helpfulness": 0.8095238095238095,
                "StarRating": "5",
                "Text": "In the beginning there was ether. Then Maxwell discovered his wonderful equations and Einstein, drawing inspiration therefrom, discovered Relativity. There was no longer an ether. Thank God! For, before, every electric, magnetic and optical phenomenon was supposed to be explained by properties of this ubiquitous ether. For a brilliant account of the physics of the ether, read \"Aether\", by Maxwell himself, at the Encyclopaedia Britannica (not the present edition: go to*  and look at the Classics). Since Lorentz it became fashionable, and sensible, to, first, derive all properties of the electromagnetic fiel in vacuum, and, then, to introduce matter and the complications which appear (and which give rise to most of the beauty of the world). This wonderful book deals with these complications, and shows the beauties that come out of them. This is a high class text, the reader being supposed to know all of basic physics, including, of course, quantum mechanics. Thermodynamics is used lavishly for static or quasi-static situations, providing depth and cohesion. Did you know that you cannot, in this age of new materials, concoct one with electric permittivity (the familiar epsilon) smaller than one lest you violate the second law of thermodynamics? The chapter on electromagnetic waves is superb, with the best treatment of light dispersion to be found anywhere. Did you know that you cannot produce a transparent material which would disperse light in a different sequence of colours than that of the usual glass prism lest you violate causality? You have to read this book. Grab your copy while you can find it. One never knows."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZO9ONDMMDJ9X"
                },
                "Date": "on July 17, 2006",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "What can I say? There are 9 copies of this book in the library of my university and 8 of them have been checked out. The only one left is a reserved copy. And right now it's in the middle of a summer vacation! So many things that I want to know can be found in this book: the difference between Kerr effect and Faraday effect, the magneto-electric tensor, magnetic symmetries of crystals... etc. The explanations are usually very compact but extremely clear. Once many years ago I was frustrated at being unable to find a \"physicist's description\" of the galvanic cell. Finally, after searching many books and papers, I found a most satisfying explanation, exactly the way I needed it, in this book. It is an invaluable \"reference\" (but not textbook) for researchers working on material science, light-matter interactions, and related fields."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AH1WSPYP9M87N"
                },
                "Date": "on December 5, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EDH9Y1DOGYPK"
                },
                "Date": "on January 11, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Great book - plain and simple. Edition was in nearly perfect shape too, so no issues there. Go for it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26BP4GDQXEQFK"
                },
                "Date": "on June 11, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "LLP is the gold standard for our understanding of the electrodynamic properties of matter.  Although Jackson is the most common textbook, I prefer LLPs succinct style that focuses only on essential points."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2L57GRVCB6EDV"
                },
                "Date": "on November 29, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A classic. Super useful. Doesn't exactly fit well with most texts used these days for grad EM, but has some really useful sections."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31GIHXVM0W1RB"
                },
                "Date": "on March 30, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent Seller! Recommended!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3M1ROXYDEHUW4"
                },
                "Date": "on March 6, 2015",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "The printing is bad. Like they did it on a old newspaper."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LM649MLPAVQM"
                },
                "Date": "on December 27, 2014",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": "The spine was wrinkled when I got it. :\\"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on May 15, 2000",
                "Helpfulness": 0.3,
                "StarRating": "5",
                "Text": "It the best. I mean the whole course. If you can read Russian buy the original book - they are very very cheap (hardbound): a couple of dollars."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2V32AAESFQGCP"
                },
                "Date": "on March 26, 2006",
                "Helpfulness": 0.19047619047619047,
                "StarRating": "2",
                "Text": "This book has few uses.  The book is so abbreviated that you need two other books to understand it.  The one useful feature of this book is the problems with solutions, but even those take a lot of deciphering."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Electrodynamics-Continuous-Media-Second-Theoretical/product-reviews/0750626348/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "12"
    },
    "Salesrank": "#378,394",
    "Timestamp": "2015-05-24 13:06:50.554474",
    "itemurl": "http://www.amazon.com/Electrodynamics-Continuous-Media-Second-Theoretical/dp/0750626348"
}
