{
    "Category": "in Books (",
    "ListPrice": "$16.50",
    "Name": [
        "Quantum Physics and Theology: An Unexpected Kinship"
    ],
    "OfferPrice": "$14.85",
    "Reviews": {
        "AverageStarRating": "4.2 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BT6DA9W09M7X"
                },
                "Date": "on June 19, 2007",
                "Helpfulness": 0.9714285714285714,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HDGOCO2FI22Y"
                },
                "Date": "on May 10, 2007",
                "Helpfulness": 0.9024390243902439,
                "StarRating": "4",
                "Text": "John Polkinghorne is one of the most complete theologians in the Anglican Communion - if not in the whole Christian Church.  Using the Church's long established three way approach to understanding scripture, he reads his bible, considers,seriously, the history of its interpretation and thinks profoundly about what it all can mean.  All though the essay uses complex issues im both physics and theology it provided me a major helping of food for thought.  It is one of those texts that can be read again and again."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VQVQU2O8JC1Q"
                },
                "Date": "on August 18, 2009",
                "Helpfulness": 0.9090909090909091,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3K8P092HLHNBF"
                },
                "Date": "on July 3, 2008",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "5",
                "Text": "John Polkinghorne has written a book that will surprise and challenge many of its readers.  In a neatly written and cogently argued case, he shows that there are many more similarities than one might have suspected between the goals and methods of the quantum physicist and those of the Christian theologian.  He writes as an expert in both disciplines and his text is free of wild overstatement and contrived polemic.  This is a book that charms and inspires and conveys a sense of authentic wonder at the astonishing creation of which we are a part."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A208XOXQ8KL31Y"
                },
                "Date": "on November 12, 2009",
                "Helpfulness": 0.8888888888888888,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XLOKGH00JTF5"
                },
                "Date": "on June 4, 2010",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2P6JIBEFSCBX1"
                },
                "Date": "on March 19, 2008",
                "Helpfulness": 0.7777777777777778,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22URH6WZC3WX5"
                },
                "Date": "on April 17, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ULNGQLDV0FTI"
                },
                "Date": "on May 25, 2011",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2A73ZM9KVJ339"
                },
                "Date": "on February 22, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UDP1KIBN3ZQA"
                },
                "Date": "on May 1, 2012",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2S2ZPBNMOBN25"
                },
                "Date": "on February 28, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Y7OWNNHA68QH"
                },
                "Date": "on April 23, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Quantum Physics and Theology: An Unexpected Kinship is an excellent discussion of epistemology, which is the \"theory of knowledge especially with regard to its methods and validation.\" (Oxford Pocket American Dictionary of Current English) In this short clearly written book Polkinghorne (JP) begins by dealing with the question of truth, an issue fundamental to our understanding of the world. His discussion ranges from the modernist belief in objective truth to postmodernism which teaches that the truth of a subject varies according to the believer. Namely, that there is no universal truth. JP presents his understanding of this tension as an idea called \"critical realism\". Having defined his assumptions, he begins his analysis of two very different subject areas, Christian theology and Quantum theory, in their search for truth and in the similarity of their methods and problems. A quick list of the topics included in the  comparison contains 1. Moments of enforced radical revision; 2. A period of unresolved confusion; 3. New synthesis and understanding; 4. Continued wrestling with unresolved problems; 5. Deeper implications.  He discusses each of these areas in depth  from the point of  the  quantum scientist which he was for 25 years and the ordained priest in the Anglican church. What I, a believing Christian and a follower of scientific knowledge, have gained from this book is the ability to refute scientific dismissal of the development of theological thought as so much wishful thinking and blind obedience."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SF3GA2G6FRT0"
                },
                "Date": "on November 17, 2007",
                "Helpfulness": 0.6923076923076923,
                "StarRating": "5",
                "Text": "The book is easy to read even though the complexity of the theme it works. Polkinhorne explores the connections between science and religion, making his point clear and easy to understand."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FD3JIH38XVS0"
                },
                "Date": "on May 25, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Now this book required my serious devotion to the reading, a bit beyond my common understanding but the net result of the read was one that comforted by system of beliefs."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QE58KRN5940G"
                },
                "Date": "on January 21, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I purchased this as a gift for a pHD physical, organic chemist."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YY8OYV1EDMWW"
                },
                "Date": "on April 23, 2015",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "It was an okay book.  Not much else to say as a result."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YZ5IE0B06PPQ"
                },
                "Date": "on December 5, 2013",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Polkinghome explains this quandary of science and Christianity, while rather technical, in a more clear and concise manner, than I have ever read. He sees both sides of the story, because he has lived both, and lands on the Christian side."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5IM43TUD0E0H"
                },
                "Date": "on January 12, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A287ZN8L5QYVCO"
                },
                "Date": "on July 8, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Excellent. The best to date."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8S4BC3P61CCC"
                },
                "Date": "on July 18, 2011",
                "Helpfulness": 0.4,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11APEAOK8ZBA2"
                },
                "Date": "on December 10, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "good book"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MEZFKA87BXKL"
                },
                "Date": "on February 1, 2009",
                "Helpfulness": 0.375,
                "StarRating": "4",
                "Text": "A cogent presentation aligning axiomatic postulates of nuclear physics beside correlated entities of the Trinity. An enlightening exposure attributing light features with Light features lending theological application to the \"theory of everything\" both physical and spiritual."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16PAPHBESDMID"
                },
                "Date": "on October 4, 2013",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "3",
                "Text": "The book \"Quantum Physics and Theology\": An Unexpected Kinship is a good read however it is hard to understand how can John Polkinghorne can be part of a local earthy religion like Christianity and link it to quantum physics astronomy or sceince. You would expect any one with intelligence of a physicists to at least partially comprehend the vastness of the universe. There are over a trillion galaxies in the universe each with approximately 200 billion stars with planets. Even if two percent had intelligent life there would be sixty sextillion (10 raised to the power 21) earth like planets in the universe. So all those earthly religions are zilch in this vast scale of things. For a believer like John Polkinghorne one would expect a more broad view of religion rather then be obsessed with Christianity. Would Mohammad be the only prophet in the universe. Would the chosen people just be on this earth. Would God send his only son to die for the sins of the people on this earth. The vastness of the universe is a humbling experience: In his book \" Pale blue planet \"Astronomer Carl Sagan related his thoughts on a deeper meaning of the photograph of planet earth by voyger 1 spacecraft: \"From this distant vantage point, the Earth might not seem of any particular interest. But for us, it's different. Consider again that dot. That's here. That's home. That's us. On it everyone you love, everyone you know, everyone you ever heard of, every human being who ever was, lived out their lives. The aggregate of our joy and suffering, thousands of confident religions, ideologies, and economic doctrines, every hunter and forager, every hero and coward, every creator and destroyer of civilization, every king and peasant, every young couple in love, every mother and father, hopeful child, inventor and explorer, every teacher of morals, every corrupt politician, every \"superstar,\" every \"supreme leader,\" every saint and sinner in the history of our species lived there - on a mote of dust suspended in a sunbeam. The Earth is a very small stage in a vast cosmic arena. Think of the rivers of blood spilled by all those generals and emperors so that in glory and triumph they could become the momentary masters of a fraction of a dot. Think of the endless cruelties visited by the inhabitants of one corner of this pixel on the scarcely distinguishable inhabitants of some other corner. How frequent their misunderstandings, how eager they are to kill one another, how fervent their hatreds. Our posturing, our imagined self-importance, the delusion that we have some privileged position in the universe, are challenged by this point of pale light. Our planet is a lonely speck in the great enveloping cosmic darkness.\" I believe John Polinghorne should be expected to do better."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AF0E6WC5CAQ65"
                },
                "Date": "on July 16, 2009",
                "Helpfulness": 0.4523809523809524,
                "StarRating": "3",
                "Text": "John Polkinghorne explains things well and this book has inspired me to read another book of his about quantum physics (without the theology). But the juxtaposition of physics and theology in this particular book made for an awkward read. Polkinghorne's theology is pretty old fashioned. His belief in a literal resurrection and other \"miracles\" is pretty disconcerting. I can understand arguments that make the case that the potentiality of quantum reality alludes to a general sense of the Divine. But shoehorning biblical scripture and traditional Christology into the mix simply doesn't work in my view."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34GSUZS8F3Z71"
                },
                "Date": "on December 4, 2012",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31FJ89JQ445SW"
                },
                "Date": "on May 9, 2011",
                "Helpfulness": 0.15151515151515152,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32ENLNRSM1NZG"
                },
                "Date": "on March 7, 2009",
                "Helpfulness": 0.09523809523809523,
                "StarRating": "2",
                "Text": null
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Quantum-Physics-Theology-Unexpected-Kinship/product-reviews/0300138407/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "28"
    },
    "Salesrank": "#52,234",
    "Timestamp": "2015-05-24 13:00:18.146148",
    "itemurl": "http://www.amazon.com/Quantum-Physics-Theology-Unexpected-Kinship/dp/0300138407"
}
