{
    "Category": "in Books (",
    "ListPrice": "$17.99",
    "Name": [
        "The Cartoon Guide to Physics (Cartoon Guide Series)"
    ],
    "OfferPrice": "$14.34",
    "Reviews": {
        "AverageStarRating": "4.3 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 8, 1999",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I have a degree in Physics from 37 years ago and picked this book up after browsing for a few minutes. The book is GREAT, OUTSTANDING, FUN TO READ, WELL ORGANIZED and EXPLAINS a lot about the every day physics we live in.  This book is a must for students interested in learning more about physics.  I am going to buy a couple of other titles by this author for my library."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OTXAIOE5ETEW"
                },
                "Date": "on June 28, 2000",
                "Helpfulness": 0.9130434782608695,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36KYAFX5L9QH6"
                },
                "Date": "on October 19, 2001",
                "Helpfulness": 0.9130434782608695,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on January 12, 1999",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "If you haven't seen these Cartoon Guides before, you are in for a treat! They are a FABULOUS way to teach science. This book covers a broad range of physics from Mechanics to Electricity and Magnetism. But the whole book is  a cartoon that creates most enjoyable reading. Whenever I get one of these  books, my preteen asks to borrow it! (He's also learned genetics this way).  Although it does not contain experiments as such, the presentations of  scientific history and principles are great. Definitely a necessary book  for older children, teachers and professionals...from The Science  Spiders(TM) Newsletter"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21J6ORR0T72L1"
                },
                "Date": "on May 31, 2004",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "It makes all the physics concepts and math in my high school physics class easy to understand. If I were on a textbook adoption commitee, I would buy class sets of these. Cartoon Guide cuts the nonsense and filler of your average high school physics and goes straight to the heart of the matter in a way that is accessible yet not at all dumbed down. Thank you Mr. Gonick for helping me get an \"A\" in physics! I was using a classroom copy. Now I will buy my own for when I go to college."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1S3C5OFU508P3"
                },
                "Date": "on April 16, 2003",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWLFVCT9128JV"
                },
                "Date": "on July 5, 2006",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GF2864MIW7HU"
                },
                "Date": "on September 17, 2005",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "This is essentially a comic book, yet it is able to communicate the fundamental laws of physics taught in an introductory high school physics course and some taught in college such as relativity.  Overall, the book is enjoyable and humorous.  However, the constraints of actually teaching the material through the drawings do impose on the humor sometimes.  The book is accurate, as far as I can tell, and allows one to gain some understanding on how things work, from how the tides come about, to the motion of a gyroscope, to the Theory of Relativity.  One disclaimer that I must add, that should be obvious, is that unless you are sufficient in mathematics (genius) you will not know all the consequences that come out from these laws other than the ones provided to you.  I would have to recommend this for people over 12 years old, those who want to learn a little physics in a fun and entertaining way."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on May 31, 1998",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Larry Gonick is amazing.  I've read a number of his \"cartoon guides\" and this one didn't let me down.  I happened to read it while taking a highschool physics class.  It was great--I kept thinking \"Oh!  *Now* I get it!\"  I think that this is an excellent supplement to any \"official\" textbook or class: the textbook will give you the math problems, etc., and the Cartoon Guide to Physics will allow you to understand the concepts behind them."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SJ20LV092VFU"
                },
                "Date": "on November 3, 2006",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DT83UP3LATP1"
                },
                "Date": "on April 28, 2012",
                "Helpfulness": 0.875,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DSF8VIOWQ8W8"
                },
                "Date": "on July 26, 2005",
                "Helpfulness": 0.875,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on April 23, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I believe that my physics career began with this book about thetime I was in fourth grade.  I really liked it and I didn't find themath to be too hard.  Besides the main point that it got across (atleast to me) was that science was interesting.  If you are an educator for students anywhere between the third grade and eighth grades this might be a good book to have on your shelf.  Though ... the lower end of this spectrum probably wont be getting as much out of it due to a general lack of mathematical understanding."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on December 24, 1998",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book is filled with outstanding point of view. The most satisfied thing is the emphasis on the role of Galileo. And the explanation of relativity is fantastic! I cannot remember better one. I strongly recommend  this book to my clever students. Thanks to Larry Gonick!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACSM3GLZIA2QW"
                },
                "Date": "on July 5, 2008",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A327EGTDRM4ZYF"
                },
                "Date": "on May 8, 2000",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": "This book is excellent! Not only are there no errors of fact, it explains difficult concepts simply."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 12, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book far outreaches the realms of physics.  It was more than just a book, but an awe-inspiring revelation which has irrevocably changed my life.  Before I met Gonick, I was just an ignorant titmouse, but now I am a rat.  Thank you Gonick"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AV9NROST0UMG4"
                },
                "Date": "on January 5, 2007",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2F2ACH1UYKC09"
                },
                "Date": "on June 11, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "The book is excellent and on par with other Larry Gonick Cartoon Guides. The part on electromagnetism, however, is boring (to the author's standard), as if the author had gotten tired before finishing the book. I also wish there was more on quantum and relativistic theories."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5JBRJ1XFBUUP"
                },
                "Date": "on June 22, 2014",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "If you are struggling with first semester Physics, this book might help you understand some parts of it. I do not recommend it as your sole book, but as a supplement to a textbook it might help some people, particularly high school students."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FMFB96F13WBL"
                },
                "Date": "on December 3, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17TDUBB4Z1PEC"
                },
                "Date": "on June 5, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book was one of our text books in my introductory physics course in college.  If you are struggling with general physics, this book is for you.  It breaks everything down into easy to understand explanations and the illustrations are very helpful in visualizing the concepts presented.  I've been referring back to it for years now.  It has also helped me in studying for the MCAT, to review physics concepts that I had forgotten."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CEZE4TRJXRD1"
                },
                "Date": "on July 7, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book actually deals with some tricky stuff. I read it over the summer before I took my first difficult class in physics, and it helped a lot. I even referred to it over the course of the year. This is probably as good as a cartoon book on physics can get."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15P5LVB6D5HO5"
                },
                "Date": "on May 10, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3N1RSG27UH4ZS"
                },
                "Date": "on March 21, 2011",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "My son who is 14 loves this book. The only missing element is any actual applications such as experiments. We do like the drawings and everything is laid out in an easy to read manner."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UFMYVSOASQ0V"
                },
                "Date": "on January 13, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PXFN464B1SSB"
                },
                "Date": "on August 21, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Great book for understanding the basic concepts of physics related to engineering or the biological sciences."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32UQBYI7F2ZZR"
                },
                "Date": "on April 20, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I bought this to use with my 10th graders math he is using life of Fred Elementary Physics and really enjoys it but when I ask him about what he is learning I have no idea if he is right or not so really I bought this to explain to me a non-science thinking person what he is studying. I have to say it is very interesting and I read two chapters in one setting and I fell that I understand better what my son has been trying to explain to me. I think I will have him read it also so that he can use references from it to tell me what he is learning. I think this would be great for homeschoolers from 7th grade and up. Or to help if you are taking a high school physics class."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12MWCAII8KDTA"
                },
                "Date": "on December 21, 2007",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29ES5PXIOSU9H"
                },
                "Date": "on November 13, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A214W34F0Z78MX"
                },
                "Date": "on March 15, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I was fortunate enough to have Dr. Huffman as a lecturer in college physics.  He made the subject come alive in the lecture hall.  In this book, I can almost relive the experience.  This is a well constructed, enjoyable presentation of basic physics; and for me a great refresher.  I can now carry on conversations with my physics teacher friend and throw out terms like slug and parallel series with ease.  Thanks again Art."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QN1ZB5A8E7DL"
                },
                "Date": "on November 7, 2009",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I had to get this book for my Intro Physics class.  It's a good book and it's great at getting the basic ideas across.  It's not your average text-book by any means though.  It's truly the same as reading a cartoon strip.  The font is scribbly and there are characters sort of explaining everything along the way.  It's a descent book and there actually are some funny moments."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11G5FIL5IBRMS"
                },
                "Date": "on December 8, 1999",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A book on physics, that is easy to read and understand.  It is has a subtle humor that is very good.  This book is so good that I have recomended that it be used as the text for an elementray physics course.  I  have found this book to be a greate gift for non technical people, such as  politicans."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BQGJ7J9A7LUA"
                },
                "Date": "on December 2, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "The book's content is \"okay\" and I'd probably go 4 stars on that alone. However, it's all printed on very poor quality paper, like a newspaper, so the ink smudges easily and the pages have absorbed every bit of skin oil they've ever been in contact with."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WYHBP2Y9Q4IM"
                },
                "Date": "on August 25, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Made purchase to see if I could use it as a classroom read for my basic physic students. Illustrations are easy to understand; appropriate for high school. Assignment change: switched from physics to ecology; will keep book in room for free-open reading."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3A5UFV4RWFIEP"
                },
                "Date": "on March 6, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This book is great as a pre-class book. I wish I would have had this before I got halfway through my class. It is entertaining and informative. It dumbs a lot of stuff down into phrases I can remember. Book came quickly and was in perfect shape."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TEM6IUC7RQ1C"
                },
                "Date": "on December 20, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I heard arguments about why centrifugal force does not exist when I was in college but never resolved it in my head until I read this book.  That was a lot cheaper than going to college and makes me give this book a high recommendation."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TLR4ZNBL2GJU"
                },
                "Date": "on June 19, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great for adults too!  I enjoy reading this book with my daughters because they are interested in the topic and it refreshes my memory of all the things I've forgotten over the years (as well as learning a bunch of new stuff!)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AF5XA66WZMYRE"
                },
                "Date": "on June 11, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book keeps everything in prospective and simplifies physics to the most simple level. I used to do physics not knowing how everything works, or whats going on. This book actually helped me understand how physics works."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3L3QM6M75OEVM"
                },
                "Date": "on October 31, 2009",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book is very useful to get an overview of the different concepts presented in Physics, but it is not a stand alone text. The cartoons are funny and memorable though."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANZXHTAB190Y4"
                },
                "Date": "on May 21, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I like the style of the writing. It's a nice book for beginners or \"idots\" to understand the complicated concept through the beautiful explanations in this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VCSQY4FM6ENY"
                },
                "Date": "on January 29, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "It is not as interesting in material or as attractive as his usual books, but the 14 year old is reading it.  If I had seen it, I probably wouldn't have bought it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FZ57GAUBT8GI"
                },
                "Date": "on February 3, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABMWKX6EJRHLQ"
                },
                "Date": "on March 11, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Good product for students having trouble withphysical aspects of physics.  Rather simpleinits approach but works for the students I tutor"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30QH6G2FP10KN"
                },
                "Date": "on April 17, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book is an intertaining approach to learning physics, it is an easy to read book and hard to put down and yet you learn so much"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1M5KRVMD7XEC4"
                },
                "Date": "on October 8, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I don't love it, but it was a good present for our grandson.  He is a physics major in college now and he still enjoys this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22OLPEKJY02PC"
                },
                "Date": "on October 26, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "An excellent Physics guide, in cartoon format.Good examples and graphics that don't distract from the point at hand. Recommend!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32DKOR1U0FOFD"
                },
                "Date": "on October 15, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Very simple and funny way to understand basic concepts. It gives you ideas for explaining concept to your kids and students."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OUFJ0NWBA9VO"
                },
                "Date": "on June 5, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is exactly what I was looking for. Simple principles in basic English. I leisurely read this book, and I love it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HMZGJ7BQBT4R"
                },
                "Date": "on August 7, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This is almost cheating the kids. They love because it's relaxed. All learning books should be like that - fun."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HX3YJGHT2YKC"
                },
                "Date": "on March 19, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Where were these books when I was a kid? These books are fun to read and easy to understand, Thanks Larry!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2B2I15P2JQK3F"
                },
                "Date": "on June 30, 2009",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Simply enough this book has a great review of general physics that leaves out things you want remember-it has simple formulas that you can recall just because of the funny pictures. You can take physics in high school, and higher level courses in college, but unless you're a physicist, or nuclear engineer, you're not going to remember much. This complex cartoon explains the essentials that govern our surroundings, and just why they happen.. for everyday life this is all you need. Great book, loved it!!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ESG0H5ZTDBZG"
                },
                "Date": "on February 26, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "My 10 year old son, who one day aspires to be a rocket scientist, loves this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KS4795K6X4HC"
                },
                "Date": "on November 24, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Best textbook for school i ever bought"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 16, 1998",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "this book breaks down the basics of physics in easy illustrations. do not look for the humor of larrys other books, however who ever said physics would be fun."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9FPDPKS3F5YX"
                },
                "Date": "on January 19, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "It's very useful for my students!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALNF6Y7NZXCAW"
                },
                "Date": "on December 16, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Good fun and learning too."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KKRHU05ZWZML"
                },
                "Date": "on August 11, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "great for physics help"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CEW1WASKH1LE"
                },
                "Date": "on October 5, 2001",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": "Great popcorn read for the armchair physicist.  If you are a fan of the wonderfully illustrated Gonick's Cartoon World History, you'll be a little disappointed by the quality of illustrations in this work.  However, it's still an informative and fun read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXE7DGN6K6724"
                },
                "Date": "on September 7, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Just a must."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYV4KIIUM2419"
                },
                "Date": "on February 18, 2012",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "...know squat about physics...and even after getting this book, still don't..Gonick throws formulas at you almost from page one...I got lost right off the bat...Gonick's history books and his enviroment book I am quite fond of, but this one..not so much.."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AX2NFEN1YIN31"
                },
                "Date": "on July 24, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Fun way to learn the basics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AU5AMGERWZYXC"
                },
                "Date": "on July 7, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Very easy to understand."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22I2CPVUAJ17J"
                },
                "Date": "on January 25, 2011",
                "Helpfulness": 0.42857142857142855,
                "StarRating": "2",
                "Text": "I got this for our 5th grade son after he hoovered up cartoon history of the universe and cartoon guide to genetics (both great). This book was unfortunately way beyond him, and on reading it myself I'm surprised at Gonick's approach here- this is basically an introductory college physics book drawn in cartoon form. I'm not sure what audience this would appeal to. In terms of appealing to kids with physics, Carl Sagan and Cosmos still do it best."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BQMV9YN9G6NX"
                },
                "Date": "on July 20, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "excellent"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A94NTHZNCP1O7"
                },
                "Date": "on August 3, 2005",
                "Helpfulness": 0.42857142857142855,
                "StarRating": "4",
                "Text": "Organization was just like a physics text. Sections were good and funny, but it did not take the subject much further than a standard high school text."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1415X27K6HEQB"
                },
                "Date": "on March 8, 2013",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "It is a very funny book but must know how to apply physics to get the jokes that it tells"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWGXLGNZ5U9T9"
                },
                "Date": "on February 25, 2000",
                "Helpfulness": 0.44,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VVK4JXP19X71"
                },
                "Date": "on April 30, 2010",
                "Helpfulness": 0.26666666666666666,
                "StarRating": "1",
                "Text": "This book contains a plethora of amusing cartoons but the word guide is very misleading.  This book does not contain any useful information for anyone seeking guidance or helpful hints about physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24JRXX06WNWO9"
                },
                "Date": "on February 28, 2009",
                "Helpfulness": 0.0625,
                "StarRating": "1",
                "Text": "I bought 3 of Larry Gonicks cartoon books History of the universe, Cartoon guide to Physics and Chemistry. All 3 books are very difficult to read. I took intro physics in college and yet I found Larry's books difficult and uninteresting. I found that the same for History of the universe as well as the Chemistry one by the same author. I bought it 3 months ago, took 1-2 read and left it on the shelves untouched. A complete waste of money. Will be happy to get rid of it at half price. greatplaces@yahoo.com"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SS02EYXQIUO2"
                },
                "Date": "on January 4, 2013",
                "Helpfulness": 0.047619047619047616,
                "StarRating": "1",
                "Text": null
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Cartoon-Guide-Physics/product-reviews/0062731009/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "71"
    },
    "Salesrank": "#7,093",
    "Timestamp": "2015-05-24 12:24:39.304248",
    "itemurl": "http://www.amazon.com/Cartoon-Guide-Physics/dp/0062731009"
}
