{
    "Category": "in Books (",
    "ListPrice": "$50.55",
    "Name": [
        "Introductory Physics with Algebra as a Second Language: Mastering Problem-Solving"
    ],
    "OfferPrice": "$43.97",
    "Reviews": {
        "AverageStarRating": "4.6 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANQOSVYH0H2U9"
                },
                "Date": "on December 13, 2006",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVMLMV2SSPY65"
                },
                "Date": "on January 18, 2011",
                "Helpfulness": 0.9166666666666666,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NPI44KN0N10E"
                },
                "Date": "on November 13, 2009",
                "Helpfulness": 0.9090909090909091,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2B9M9ZHXKFSP7"
                },
                "Date": "on December 17, 2010",
                "Helpfulness": 1.0,
                "StarRating": "2",
                "Text": "I made the mistake of thinking that this book would be comparable to the Organic Chem as a Second Language which is EXCELLENT! I tried this book along with my physics textbook and it completely led me astray. I spent way too much time with this book which makes the processes more complex than necessary. The book also does this annoying \"Now you try\" with really stupid examples which just takes up pages. I am a fan of supplemental learning materials and this book is nothing but fluff. Skip it otherwise you'll spend valuable study time trying to get into it. This is not even close to the quality you'll get with David Klein's Orgo as a Second Language."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2677KQPR4DOY0"
                },
                "Date": "on May 27, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Each section gives a problem as an example and gives you step by step methods of how to approach and solve a problem.  There are some sections that focus only on how to setup problems, but most are integrated within the examples given.  It is a very useful tool to use when trying to break down tough questions.  The hardest obstacle, when given a problem, is determining the physics and setup behind it.  This book does its job well and is worth every penny."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2C9CESN8FCH3I"
                },
                "Date": "on May 22, 2007",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": "This book will walk you through every step of solving a physics problem; it shows you how to use the information you're given to set up an organized solution. Definitely an essential tool to any general physics student!!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3E1NUE2M30RZ1"
                },
                "Date": "on May 15, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Physics is a demanding subject and the problems can be overwhelming... With Physics as a Second Language, I was able to understand concepts as well as how to solve the problems by breaking them down into easier to solve components! The book was a great addition to my normal text, which I hardly had to read.  Not only was this book easier to understand but it had better method of illustrating problem solving technics! I would recommend this book to anyone that is going to take Physics, if only for a reference or as an addition to their normal text!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVJRUSYJRL4NF"
                },
                "Date": "on January 6, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I ended up using this problem solving book as a substitute for my actual physics text book. This book was easy to follow, all of the steps describing how to solve a problem were clear and well organized. The diagrams were great, and I would highly recommend this book to anyone taking any Physics course!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3W3QGPOQLYR5S"
                },
                "Date": "on December 29, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XO102N1SLT5P"
                },
                "Date": "on May 11, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I originally took the Calculus based physics and had to drop out because I didn't know how to set up the problems.  While calculus is required for the higher physics, calculus doesn't guarantee that you will do well in physics.  I couldn't do the physics even though I have an AS in math.  This book shows how to set up the physics problems, which I had a hard time doing in the calc. based physics.  I strongly recommend this book because it will show you how to set up the physics problems, which I think is the most difficult part of physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25JAFU1TPBJJ2"
                },
                "Date": "on December 17, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This practical guide to problem solving was exactly that. It laid out the steps and required the reader to practice and step through the problem solving process in a clear and intuitive manner. It was my go to guide throughout the semester and my textbook collected dust, as did the other physics guide I unfortunately purchased. I know that I would have struggled through the semester without it. I highly recommend it!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A395MDCSMXKX5A"
                },
                "Date": "on July 28, 2011",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "The workbook was helpful for the first half of the Physics I course I took. It didn't really get into the end topics such as heat, simple harmonic motion, etc. Overall I would definitely suggest it for someone taking this course. I needed help in the beginning mostly with learning how to approach kinematics and force problems. This book did a good job of teaching me how to do them."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34IW1PA7AI759"
                },
                "Date": "on December 18, 2007",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": "This book was so helpful. I originally took general physics and I was so lost. I ended up dropping and the following semester took the intro course with this textbook. If it wasn't for this book I wouldn't have finally understand physics so well. I went from getting F's to achieving A's. The book lays out step by step how to tackle a problem and throughly explains why its approached that way. Very helpful. Thanks to this book I actually understand physics!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AV4QM4M0AJXS"
                },
                "Date": "on September 25, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Great supplemental book.  Walks you through many of the problem types and provides an easy, systematic method for solving them.  Picks apart tricky language used in so many physics problems and translates it into terms that are easily understood."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1V9SK4FF4DL2J"
                },
                "Date": "on December 12, 2007",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "Excellent tool for any physics student. Loucks breaks down problems by getting you to approach them piece by piece and unlocks the mystery of physics word problems in the process.  This book can be used on an individual basis if you're a student or as a help aid for an entire class if you're a professor. Covers linear velocity & acceleration, vectors, projectile motion, force & newton's laws of motion, circular motion & centripetal force, gravitation & orbits, work & energy, impulse, momentum & center of mass, angular velocity & acceleration, torque & equilibrium, and angular motion.  A worthy buy.  I got a 97% test score when I used it and a 74% test score when I didn't."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MM9Y2FNYPR06"
                },
                "Date": "on May 19, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "There are only so many ways you can solve certain types of physics problems, and this book shows you all of them! It is perfect for both the people who just want to take a basic physics course AND those who want to continue into more complex, calculus-based physics. Lots of examples, thorough explanations, and very well organized. A must have for physics students!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A144JC7SLGEX2D"
                },
                "Date": "on May 14, 2007",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "I have been using this book for the spring semester and i was just amazed by how easy physics was. It served as an instructor when i got home, the book does not just give you how the solution to a similar problem but it also outlines on how to approach any general problem in that category. i.e. it lays down the thought process, which i believe is critical in solving the physics problems. It was amazing that i was able to average an A in the class, thank to this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AOMWJGUB8ZXO"
                },
                "Date": "on February 6, 2008",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "I really couldnt imagine taking  my 1st semester physics without this book... it is almost like a universal solutions manual.. that helps you find the solution to any problem. Explains theory and problem solving techniques without being too wordy. I would reccomend this book to anyone taking physics... period!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A80IGLMN9X610"
                },
                "Date": "on January 21, 2008",
                "Helpfulness": 0.6,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3U4YQNEA2NMAH"
                },
                "Date": "on February 5, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Wow! For that price, I really can't complain much. I would recommend this to anyone who is interested in this product. Thank you again!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DF1NK6KQKSO4"
                },
                "Date": "on April 8, 2013",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": "Ahh physics! I thought this book would help me grasp the content of physics better than my textbook, since this was the first time I have ever taken a physics class. But, I very was disappointed. It actually made it more confusing for me. We are 3/4 of the way through our semester and now I understand the process the author was trying to convey.  Unfortunately, the author stops at a certain chapter. So, by the time you are a stronger physics student, you can t even use the book anymore. What a disappointment! Don't waste your money!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3645I2SBTQKZ2"
                },
                "Date": "on May 14, 2007",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "I took an intro physics course, and this book was offered as the secondary text. Our main textbook was worthless, and this one was very helpful. It is full of example problems. Its focus is examples, not theory, so if you're the type of learner who needs to see how a problem is done to understand it, this book is perfect for you! I wish more courses offered books like this, with lots of concrete examples. Thanks, Stuart!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UPZLV75RYPUO"
                },
                "Date": "on March 24, 2010",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I am another former ARC student who had the opportunity to take Beginning Physics from Professor Loucks, in Spring 2006, using a \"beta\" version of this title as the class textbook.  It explained all the relevant concepts clearly and succinctly and provided an excellent foundation for my future calculus-based physics courses.  I've hung on to the printed-out version of the text in a binder for reference and for sharing with anyone I need to explain the concepts in question to; eventually I'll probably get a hard copy and I advise anyone who hasn't had the opportunity I did to do the same."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2W03VWUUMN41P"
                },
                "Date": "on May 13, 2008",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": "Stuart E. Loucks has written a time honored cult classic publication explaining all you would ever want or need to know about the wonders of modern day physics.  I would highly recommend this book to people of all ages, races, religions, and genders.  I wish I could say I had one favorite part of the book, but every part tingled my senses with witty and highly intelligent phrases like \"Now You Try It!\"  This book is a great read for all, and at only $28.95 it sure is a steal.  Mr. Loucks is a great teacher and he loves to give out extra credit!"
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Introductory-Physics-Algebra-Second-Language/product-reviews/0471762504/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "24"
    },
    "Salesrank": "#245,582",
    "Timestamp": "2015-05-24 13:41:18.054278",
    "itemurl": "http://www.amazon.com/Introductory-Physics-Algebra-Second-Language/dp/0471762504"
}
