{
    "Category": "in Books (",
    "ListPrice": "$11.95",
    "Name": [
        "Particle Physics: A Very Short Introduction"
    ],
    "OfferPrice": "$9.65",
    "Reviews": {
        "AverageStarRating": "4.3 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XFKWAR5STF0"
                },
                "Date": "on October 24, 2004",
                "Helpfulness": 0.9387755102040817,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36K2N527TXXJN"
                },
                "Date": "on June 6, 2009",
                "Helpfulness": 0.9130434782608695,
                "StarRating": "5",
                "Text": "One of the most intriguing and fascinating scientific stories of the 20th century has been the incredible advance in our understanding of matter in its most fundamental form. In a nutshell, the 20th century has seen the vindication of the atomic hypothesis: all of the nature, the matter and even the interactions of matter, can be reduced to a finite number of indivisible particles. It turns out that atoms, the original candidates for irreducible particles as their name suggests, are in fact composed of a myriad other particles which to the best of our knowledge and understanding are truly fundamental. Furthermore, we have discovered many other particles that cannot be found in an atom, and many of those turned out to be composites of other fundamental particles. Considering how many different kinds of these extra-atomic particles were discovered, it is quite remarkable that we were able to reduce this \"zoo\" to just a few basic ones. This book presents an interesting and accessible account of how we managed to get to this point. The book presents both the experimental and theoretical developments in Particle Physics that has led us to the point where we are at. The book is intelligible to anyone who has any interest in the subject, and it doesn't require any special mathematical knowledge. And yet, like most books in this series, it does not condescend to the reader but tries to educate him and bring him up to the latest in our understanding of this fascinating field. All of that makes this book an enjoyable and worthwhile read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VXVH4P85N73K"
                },
                "Date": "on November 16, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZJWKVHIAY2TB"
                },
                "Date": "on February 24, 2013",
                "Helpfulness": 1.0,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3Q0JVGY4TQ9YY"
                },
                "Date": "on May 7, 2007",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "3",
                "Text": "In an introduction to a topic, one expects lots of figures to explain just about every topic.  This book, and indeed the entire series, generally has rather few figures.  The series also, generally, focuses on the historical development of the topic and not necessarily on the current understanding of the topic.  Therefore, the series sacrifices a better explanation of our current understanding to explain who thought what and when.  Nonetheless, this book serves adequately in the capacity of a \"very short introduction.\""
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Z5UBRTCCTTDW"
                },
                "Date": "on August 30, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFVROUVTT63XM"
                },
                "Date": "on August 13, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JB9MZMHP8XAT"
                },
                "Date": "on February 11, 2009",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OGH504L9ZCRH"
                },
                "Date": "on September 20, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OMLLMV9A8EHP"
                },
                "Date": "on May 19, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EU5QK3N6HIAX"
                },
                "Date": "on April 20, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IMH5FOSTIF2Z"
                },
                "Date": "on March 11, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Very well presented information describing the fundamentals of prticle physics. This text provided me with the background to advance to more complete writings and be able to understand them."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADILK1PD1KW4V"
                },
                "Date": "on September 6, 2012",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "I found this small book clarifying for me working in a totally different field but with an interest in physics far beyond what we learned at the Gymnasium. The Feynmann diagrams appear quite intuitive. I would like to see an updated version with a chapter on the Higgs boson now probably found at CERN."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17SOKF4JF7JHF"
                },
                "Date": "on January 7, 2015",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FZA04N27DQX7"
                },
                "Date": "on August 6, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Frank is a great writer and scientist. He gives good simple explanations of the subject without resorting to a series of formulas. He starts off by explaining atoms. They are not like what we learned in school as miniature solar systems. They are a cloud of electrons around a very very tiny nucleus, with a tremendous amount of nothing between. He describes in detail Baryons - Protons and Neutrons; Mesons - Quarks and Anti quarks.  Later things get a bit heady when he describes Sparticles, Strangeness, Baryon Resonance, Leptons, Rho, Omega Phi, Pion, Etas, and Charm Quarks. (But hang in there, it gets better.) He then goes into how atoms were built up from the big bang. Finally the subjects at the end cover, Super-symmetry, Mass and the Higgs, Quark Gluon Plasma, Antimatter and Matter and Future questions. He truly explains things with understandable language."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AD5E41KLIJGG2"
                },
                "Date": "on August 21, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "When the book arrived, I said \"It's small and only 160 pages looks like an easy read\". I guess there is no such as easy reading in physics for non-scientists. It's not difficult, but there is just so much basic information that I didn't know about. It's small enough to put in my pocket when I go to the park with my beach towel. I can read a chapter and ponder it. He explains everything clearly, and it is actually very fascinating. For beginners to particle physics, I would recommend going to the Wikipedia article about particle physics, and saving and printing the purple, green, red and yellow chart with all the particles; and cutting, saving and printing the chart with the 61 particles. The Particle Adventure is also a great free beginner website."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IF7A5BHAZIW0"
                },
                "Date": "on June 8, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "I frequently found the book to be without flow or development, often wondering how the author drew his current conclusion.  I believe that a lot of the problem is with the complexity and confusion of the topic, but it also seemed as though parts that should have been there were either never written or edited out.  Maybe some topics currently don't lend themselves to very short introductions."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IU9VPCBKZPE8"
                },
                "Date": "on May 6, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30QH6G2FP10KN"
                },
                "Date": "on October 3, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book is clearly written in an easy to follow and understand fashion, for the beginner who is just starting out."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APJST3K9M5JKR"
                },
                "Date": "on August 10, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The VSI series offers short, informed and up-to-the-minute surveys of complex fields of study.  This is an excellent example of the format."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVEP204LGT2J6"
                },
                "Date": "on May 1, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A wonderfull book, quite clear and very good for people looking for the first steps in Particle Physics. I would recomend it to high school students."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A303GWBAY3L5ZB"
                },
                "Date": "on February 5, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SM0YVXR00H36"
                },
                "Date": "on January 4, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is great for an introduction.  Glad I got it. is topic anyone interested in this topic would find this very helpful."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36RK0LIG9NVJJ"
                },
                "Date": "on November 15, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I find that Prof. Close is a remarkable  storyteller, even at such as particle physics! If I were a nuclear physicist I would consider this book my  `vade mecum`. I urge that everyone , and anyone , should buy this delightful tome, although it is a little wonder!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATXY8UYDN3EKO"
                },
                "Date": "on October 29, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Simple to read and interesting explanation.  Not as deeply explained as I wanted- but a good clear approach to the subject matter"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MEX46BPAAA1E"
                },
                "Date": "on October 29, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Very accessible reading that I would recommend to anyone. You don't have to be a physicist to understand this book. Yet it is very informative and reflects the current state of particle research."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2506B90C6F55N"
                },
                "Date": "on May 3, 2010",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This small 100 page book was just enough info for me on particle physics.  I'm not interested in the heavy math, just to understand the characteristics of the particle families and how they interact.  I enjoyed it, a good, simple read.  I would try another subject in this same series."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28X6XZRHVESEK"
                },
                "Date": "on February 13, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Writing style and clarity for a lot of the details would get two stars. It did cover a lot of ground in a reasonable manner, though, and that makes up for the deficiencies. It'd be fantastic if this was Short instead of Very Short."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AX2ZLAQ55XR9J"
                },
                "Date": "on December 14, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NAOBIXGFQXNZ"
                },
                "Date": "on January 18, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Frank Close is wonderful at creating these \"Short Introduction\" books on various aspects of physics in a way that fascinates and informs without overwhelming."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JSFZTVF8ILV6"
                },
                "Date": "on May 1, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Wonderful! Clear, uncluttered, broad, historic and narrow hen it needs focus. Great economy of words for physics and cosmology enthusiasts."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXV0VROO4ORBF"
                },
                "Date": "on January 8, 2005",
                "Helpfulness": 0.6,
                "StarRating": "5",
                "Text": "very good for a basic introduction to a most fasinating subject. This books takes this subject, which very intresting and wonderful, can be made terribly dry by a bad writer, and puts it forth in its true glory. I highly reconmend it to anyone whos starting out in physics, or to educators seeking a basic introduction to use in a highschool class room."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZKNGL20FBK2I"
                },
                "Date": "on October 27, 2009",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "It helps to have a little knowledge of chemistry and physics but overall a very good introduction!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CO0VFAQHZ61C"
                },
                "Date": "on December 23, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great book for the topic.  The topic is boring, but this book makes the best out of it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7DFLRZG223C9"
                },
                "Date": "on August 9, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent review book for those with a bit previous knowledge of high-energy physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21NNAR8SZ0TO4"
                },
                "Date": "on January 17, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Informative, very good source for a \"nonphysics\" person."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A223JWD3COWCG1"
                },
                "Date": "on August 24, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOE17HCQ3Q9EN"
                },
                "Date": "on October 23, 2013",
                "Helpfulness": 0.5,
                "StarRating": "2",
                "Text": "If you want a quick overview of Particle Physics, with specific names, this might be useful. If you want details, go elsewhere."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VUKKGJFFJ76O"
                },
                "Date": "on May 21, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I was very satisfied..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CMA8NGO2RZVS"
                },
                "Date": "on December 7, 2012",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UZ3VZS16H639"
                },
                "Date": "on May 15, 2015",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": "A mistake"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AO378088I5NZ7"
                },
                "Date": "on January 9, 2013",
                "Helpfulness": 0.4,
                "StarRating": "3",
                "Text": "I didn't care for the small size of the book.  I didn't realize it was a miniature size when I bought it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A44MMWG18H8QI"
                },
                "Date": "on May 7, 2011",
                "Helpfulness": 0.14516129032258066,
                "StarRating": "1",
                "Text": null
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Particle-Physics-Very-Short-Introduction/product-reviews/0192804340/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "43"
    },
    "Salesrank": "#186,650",
    "Timestamp": "2015-05-24 13:04:56.842963",
    "itemurl": "http://www.amazon.com/Particle-Physics-Very-Short-Introduction/dp/0192804340"
}
