{
    "Category": "in Books (",
    "ListPrice": "$18.99",
    "Name": [
        "The Science of Star Wars: An Astrophysicist's Independent Examination of Space Travel, Aliens, Planets, and Robots as Portrayed in the Star Wars Films and Books"
    ],
    "OfferPrice": "$15.03",
    "Reviews": {
        "AverageStarRating": "4.1 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1S3C5OFU508P3"
                },
                "Date": "on February 5, 2005",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YP29Z99X12L6"
                },
                "Date": "on January 11, 2000",
                "Helpfulness": 0.9230769230769231,
                "StarRating": "5",
                "Text": "Let me start out by saying that I could hardly put this book down. Once I started, each chapter made me starve for the next. The book, as the title suggests, offers a scientific look with amazing theories and explanations  to some of the concepts in the movie, \"Star Wars.\"  For example,  one may ponder the existence of aliens and the ability to travel at light  speed--or even faster! Well, this book provides a thorough look at these  questions giving an opportunity for some very accomplished scientists in  such fields as physics and statistics to share their views and offer a  hypothesis. I especially enjoyed the chapter on 'The Force.' Here I found  it incredibly interesting. For there is not only a physical scientific look  at this phenomenon but also a parapsychological view, fusing physics,  psychology, metaphysics and even quantum mechanics together.  In  conclusion, this book is an asset to anyone who has pondered the many what  ifs... in life. A great read as well as a perfect look at the blending of  \"Star Wars\" with science, the human experience and the human  mind. Great Work."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on August 24, 1999",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book is written in a readable way that touches on many of the major topics brought up by physics. I think it is a great starting point for those of us that wan't to leap into physics. Being thirteen I have to give  her credit for making the book understandable, quantum mechanics is pretty  hard to explain and it takes someone who knows what she's talking about to  do so. It has brought me to the point where my mind begins to understand  things, and starts asking questions! It has furthered my desire to be an  astrophysicist and is quite a good book!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SOWAFG3JIEL5"
                },
                "Date": "on September 25, 2001",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 14, 2000",
                "Helpfulness": 0.8,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6RWOAJJYP41U"
                },
                "Date": "on October 17, 2000",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "I loved this book.  Like all Star Wars books I read, I could barely put it down.  The only reason it's not perfect is that the whole Star Wars series is very loosely based on science, so this book really has a very shaky fundamental basis.  The fact that Jeanne Cavelos can write a great book around this weak foundation, though, is a testament to the skill with which the author writes."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24MUVY5WN32BR"
                },
                "Date": "on April 10, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I was born on Star Wars day, May 4th, so I am a huge fan of everything having to do with Star Wars.  It may be a coincidence.  \"They say May the fourth be with you\" instead of the famous quote from the movies, \"May the force be with you\".  Anyways, I had to read this book once I saw it on the shelf.  I have seen every movie a thousand times, and I have all the movies on DVD and VHS.  I thought I knew everything about Star Wars until I started reading this book.  I realized that I did not know why and how everything happened or may eventually happen.  The book also explained if we humans in the 21st century could make droids like C-3PO and R2-D2, lightsabers, ships that go faster than the speed of light, and much more.  The Science of Star Wars is a fascinating book, full of information into the \"whys\" and the \"hows\" of the Star Wars universe.  My favorite chapter was the chapter that explained the Force using what we understand right now about physics and biology.  The only bad thing I have to say about the book is that the author explained things in a way that I could not really understand.  The book was well-written, and the information that was in it explained very well, but hard to understand for a high-schooler that has not even heard of half of the things mentioned in the book.  All-in-all, I give this book a five-out-of-five stars."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1M0YAZ6JV488Z"
                },
                "Date": "on March 14, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Though Ms Cavelos' book has been out for quite some time, I still find myself revisiting it a couple times a year. For any fan of Star Wars, this book brings home some of the practical science used in the telling of the SW tales, but also looks ahead to how technology portrayed in the films might become reality in the future. She attemps to explain how light sabers might work, how people ran remain standing on a spaceship no matter which angle of flight it is taking, and, importantly, resolves the Kessel Run \"parsec\" goof Lucas made in the cantina scene :)  If you have an interest in science and science fiction, this book is a must-read. Cavelos deftly and with a considerable helping of good humor, explains how the fictions in SW might have actually worked, and how some, well, would likely remain fiction. In so doing, again, I find that her writing style coupled with her intelligent arguments are discussions I enjoy going back to from time to time. Pick up a copy of this book - you won't be disappointed."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YVZPMDSV15ZV"
                },
                "Date": "on April 11, 2011",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33N05GF31KN8N"
                },
                "Date": "on August 31, 2000",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "I am not a huge, or even big Star Wars fan (heck, I didn't even like the  first one), but I loved this book.  A great concept, very well done.  I  could not put it down."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AN9TLUKFAJHP8"
                },
                "Date": "on July 9, 2000",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38TGAB5U0E55G"
                },
                "Date": "on March 23, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book was a real joy to read. Any person that has a love for science or the Star Wars franchise and a hunger for learning more about them will love this book. The way Jeanne examines the possibility of our society becoming of that seen in the Star Wars films is fasinating. Those who have not seen any of the Star Wars films will be compelled to go watch them. And those who have lost the love for science or Star Wars films will feel it renewed. This book shows a whole new look into how the aliens of Star Wars came to be. It examines how one day the human race may have colonies on other worlds around the universe, and how we will be able to find the right planets for humans to thrive on. This book is great for people of all ages for the fact that it's very easy to read and is very likely to leave you satisfied and hungry for more. It is also a great book for teachers to apply in their classrooms. This book in no way will keep you bored. I recommend this book to anyone who enjoys to read."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 16, 1999",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book is the probably the book that will drive me to my final career choice of either robotics or astrophysics. Over two days of reading it, I am almost done reading its 250 pages. I strongly recommend it to anybody  who can read decently. It is not written at an astrophysicist's reading  level -- I am a high school freshman and I understood it. Dr. Cavelos makes  wonderful analogies that have driven me to understand the workings of  gravity and wormholes -- concepts that in the past have always gone right  past me. It should be required reading in physical science classes."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LGC70MWXM6C9"
                },
                "Date": "on June 10, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 21, 1999",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This has been the most interesting and well written book that I have ever read.  It explains complex and very abstract concepts in a way that ordinary people can understand.  I am very impressed with her and cannot  wait for her to write another book like this."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ECOD5MPEHAF1"
                },
                "Date": "on June 24, 2000",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A106MB2IVYFRWR"
                },
                "Date": "on January 16, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I love good science.  This is unique in that explains complex notions in a lucid way but with out talking down to the reader or being dumb. I appreciate that."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RHEBQSBJZ6F2"
                },
                "Date": "on February 14, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "great book for any fan on the background for the ideas Star Wars used."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 15, 1999",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on August 10, 1999",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "4",
                "Text": "SOme of the sections in this book were easy to understand and interesting, others were confusing, and some was kinda stupid.  The planet section isn't the best, but it sort of builds it all up.  The alien section was good,and  I understood it.  The droids was possibly the best part.  The starship and  weapons part was fascinating, but I didn't get all of the faster than light  stuff.  Of course, I'm not even in high school yet.  Explaining the force  was kind of stupid.  It isn't real, it wasn't mean't to be real, and it  defies all science."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMVR8BOIR80Z8"
                },
                "Date": "on June 14, 1999",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "This book is an examination of the scientific factors that drive the Star Wars movies. While the author did her homework on the 4 movies and really knows her science, the book has a tendancy to draw conclusions from JUST  the 4 movies. Several points  the text tries to explain have already been  explained in the other Star Wars comics, novels, and sourcebooks. And while  a few references are made to the Star Wars Encyclopedia, other details that  would clear up some questions posed by this book aren't in the movies but  in the afore mentioned works. While the book does go a long way towards  explaining the movies it seems to focus more on the advances of simply OUR  planet than the advances in the Star Wars galaxy. This, however is no  reason not to read this book. It is well researched and I learned a lot  from it. All in all  worth it for the casual reader who has only seen the  movies but for the die hard Star Wars fans like me (geeks in other words;))  it seems a bit empty. But that does not diminish the quality and  readability of the book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LCYZJ5OZ5DVW"
                },
                "Date": "on November 28, 2007",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on August 30, 1999",
                "Helpfulness": 0.20588235294117646,
                "StarRating": "1",
                "Text": "The world of Star Wars is a very interesting one, but there is no reason to show how one theory or another agrees with everything George Lucas created.  Lucas did not look to science for his ships, weapons, aliens, or  The Force, and science is not \"trying to catch up with Star  Wars,\" as the author posits.  The science of the book is very  interesting and well-written, but the subject matter is not one that  requires a scientific explanation."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 3, 1999",
                "Helpfulness": 0.15384615384615385,
                "StarRating": "1",
                "Text": "Other than the chapter on the Driods, this book is not worth your time.  Better to read Kip Thorne.  How the author could have taken such interesting subjects and made them some uninteresting is somewhat amazing.  Don't read this!"
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Science-Star-Wars-Astrophysicists-Independent/product-reviews/0312263872/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "24"
    },
    "Salesrank": "#399,604",
    "Timestamp": "2015-05-24 13:09:19.130127",
    "itemurl": "http://www.amazon.com/Science-Star-Wars-Astrophysicists-Independent/dp/0312263872"
}
