{
    "Category": "in Books (",
    "ListPrice": "$18.00",
    "Name": [
        "Failure Is Not an Option: Mission Control From Mercury to Apollo 13 and Beyond"
    ],
    "OfferPrice": "$16.20",
    "Reviews": {
        "AverageStarRating": "4.6 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAVPLX7WT9MTR"
                },
                "Date": "on March 30, 2000",
                "Helpfulness": 0.9726027397260274,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21EUN73NMV30C"
                },
                "Date": "on April 10, 2000",
                "Helpfulness": 0.9838709677419355,
                "StarRating": "5",
                "Text": "Gene Kranz provides the reader with a remarkably vivid account of what it is like to be behind the scenes of Mission Control.  From the initial procedures he wrote for the Mercury program, to the clipped voices of  controllers working a spacecraft contingency to the sometimes abandoned way  they let off steam off-console, Mr. Kranz brings you an accurate and very  readable account of the MCC.  From my own experiences of 20 years in the  MCC, this book provides a very personal glimpse in how we continue to work.  For the reader who remembers growing up with the highs and lows of the  space race, this book will rekindle all the emotions of the time and fill  in many of the blanks that can only come from an insider such as Mr. Kranz.  \"Failure Is Not An Option\" should be required reading for any  one currently working at the MCC, and for anyone wanting to learn more  about what it took to put a man on the moon."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on April 6, 2000",
                "Helpfulness": 0.9666666666666667,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A80T5TLCN06A5"
                },
                "Date": "on April 9, 2000",
                "Helpfulness": 0.9512195121951219,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37F1G84K35FCZ"
                },
                "Date": "on April 6, 2000",
                "Helpfulness": 0.9473684210526315,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I0422Z9IK7OX"
                },
                "Date": "on September 24, 2000",
                "Helpfulness": 0.9090909090909091,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2V1YF399FYYLE"
                },
                "Date": "on February 23, 2002",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYQHQQDPDMMUS"
                },
                "Date": "on July 30, 2001",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30NLZEZ2RCWZ4"
                },
                "Date": "on August 31, 2000",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": "Failure is not an option is not for your average folk.  I seriously doubt  that the average person on the street could make it from beginning to end.  However, if you are a space-nut, or just are really yearning for the good  'ole days of Apollo, then you can't go wrong with this book.  I've read  just about every book every written on the Apollo program, and while the  astronauts' books are much more interesting than Gene Kranz's,  \"Failure is not an option\" will not disappoint.  Mr. Kranz allows  us into a very private part of the space program.  Most people know the  stories of the astronauts because we've been allowed, through a free  society, to witness every step they have taken.  However, there were never  very many stories told about Mission Control during that era.  After you  finish this book, you'll start to realize that the astronauts had it easy!  Most of the more mundane details are left out of his book, but Mr. Krantz  slows things down during the first lunar landing, describing every detail  he could remember.  The entire book is extremely exciting and you won't  believe the career of Gene when you are done.  He was definitely at the  right place at the right time to have one of the most spectacular careers  possible.  I bet he looks back now-a-days and wishes things had happened a  bit more slowly for him to appreciate it more.  He did so much in such a  little time.  This book is a must-have for any space-enthusiast, but will  probably get a bit slow for anyone else.  Thank you Gene!  Now, when is  Chris Kraft's book coming out?"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HWS0SBJLHF6D"
                },
                "Date": "on November 15, 2000",
                "Helpfulness": 0.9,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YRV8ICHSL41F"
                },
                "Date": "on April 21, 2006",
                "Helpfulness": 0.8888888888888888,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BDIUFM1HIOX4"
                },
                "Date": "on May 9, 2000",
                "Helpfulness": 0.8888888888888888,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on April 13, 2000",
                "Helpfulness": 0.78125,
                "StarRating": "3",
                "Text": "A fairly good description of the manned space program up to the end of Apollo from the Mission Control side, this book still leaves the reader wanting greater perspective on the overall effort to reach the Moon.  Yes,  the writing is unpolished, but the style does capture the man who played a  critical role in the early years of the NASA Mission Control--Gene Kranz is  a true American original.  There is little new material here, but there are  a few interesting anecdotes.  More discussion of the post-Apollo era would  have made this book a much better tome.  Furthermore, some of the criticism  of NASA today is a bit off base.  The NASA of today is a much different  place than the one Kranz was a part of in the Cold War era, and warrants a  different vision than the space agency of 30 years ago.  I enjoyed this  book, and recommend it for space buffs.  A better book for the casual  reader, however, is probably \"Moonshot\" by Deke Slayton and Alan  Shepard."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXW6OPMOTLC0F"
                },
                "Date": "on March 29, 2005",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 31, 2001",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VKMUJG8DBODG"
                },
                "Date": "on May 29, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TWEUBVNTCQIG"
                },
                "Date": "on September 1, 2000",
                "Helpfulness": 0.875,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NT3HJYYHYCA5"
                },
                "Date": "on September 15, 2003",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJDOJANK50QJV"
                },
                "Date": "on January 26, 2001",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DI8O46IQMC2O"
                },
                "Date": "on June 13, 2011",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Gene Kranz is one of those people \"who were there\" and helped to write the history. That itself is the reason why to read this book and it is a must for all of you who are interested in history of the space program. The book covers the Mercury to Apollo period of US space program during which Kranz served as a flight director. I expected more of a technical insight into NASA mission control business of that era but - and here comes the important part - the limited portion of technical details is compensated more than sufficently by expression of the passion shared by all people involved in the program at that time. Truth of the matter is, that passion was (due to my opinion) the most important thing on America's ladder to the Moon. It is very inspiring book, sometimes I felt the goosebumps when I realized how much is this passion missing in today's world. Although it is a cliché, when I was reading this book I had to ask \"where the world could be, if all the people think and work in the same way as those Americans did back in that time\". So, read it. Probably you won't become an expert on 50's and 60's mission control but you will have a lot to think about. For me, it is a mark of a really good book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3T4AAIFXG8FD4"
                },
                "Date": "on August 19, 2000",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11JMMUU3WH034"
                },
                "Date": "on October 5, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AKQMOH85TFGH"
                },
                "Date": "on February 4, 2002",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1J9H7WI6OO1JU"
                },
                "Date": "on October 21, 2001",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3N1W09W050B0Q"
                },
                "Date": "on July 18, 2000",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABX7SEE84DMLU"
                },
                "Date": "on August 22, 2005",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1J1QS7I60O018"
                },
                "Date": "on August 14, 2005",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on September 22, 2000",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "5",
                "Text": "I NEVER write in my good books, but while reading this one, I was constantly underlining things that I wanted to remember or revisit. This fascinating book is more than just another view of our space program. It is filled with Mr. Kranz' thoughts on things such as inner courage and outward composure, staying ahead of the curve, never settling for anything but one's best in all things great and small, as well as the many noteworthy technical details of the controller's eye view of one of our nation's most courageous endeavors.  I also got from this book a metaphoric way to look at life's detours, by observation of how the mission control people had to totally rewrite the plans as unexpected things occured along almost every mission: you don't have to let the mistakes or bumps along the road throw you off, just write a new mission plan and procede from there until your goal is reached! Mr. Kranz' book also spoke of humility, thankfulness for the miracles in life, giving credit to talented hardworking people when it is their due, respect for those that you learn from, and allowing conflict, if it arises, to be just another way to hash out the best answer.  His experiences also illustrate how to learn from everything that you do and see, taking various pieces of wisdom from here and there, to make yourself into the person that you want to be, and achieve the goals that you want to achieve. You really can see his ultimate career in NASA unfolding as he gained experience from certain events that took place in his life. As for the writing style of this book, I loved it. As G.Gordon Liddy said, \"He writes like he talks, all heart and no B.S.!\". That says it all. I got very choked up reading Chapter 22 and the Epilogue and fully agree that our country has done some awesome things, but yet now is content to ponder the past and not concentrate on charging boldly into the future and making new dreams happen.  Well, I can't say it better than anyone else who has enjoyed and reviewed this book so I'll just say, thank you Mr. Kranz for writing your book, the wait was definitely worth it! :-)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1L0ZS6CQ9R87E"
                },
                "Date": "on July 8, 2002",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AN3FY24HGD23Z"
                },
                "Date": "on February 19, 2001",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "This book should have been subtitled: \"Mission CONTROLLERS from Mercury to Apollo 13 and Beyond\" because it's the story of the PEOPLE in mission control, not an explanation of how mission controllers do their jobs.  If you accept that, you won't be disappointed with the book that Mr. Kranz has written."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30ZIGG3JM3YSH"
                },
                "Date": "on October 29, 2000",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NHGEF8M4GJTY"
                },
                "Date": "on July 5, 2006",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37MEWE9J3K0YI"
                },
                "Date": "on September 12, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CFJF9S29CFKT"
                },
                "Date": "on December 12, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A80HSYQYS2JX0"
                },
                "Date": "on July 10, 2000",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "If you're like me, the everything about the early days of space flight is captivating.  I've read other accounts of this time period, including the incredibly in-depth michener novel \"Space\".  What you don't often  see is the view from the controller's booth.  You don't see that often  there was absolutely no data or voice communications between early  spacecraft and the ground.  You don't see the months of drills that Mission  Control would stage, only to encounter problems that they could never have  dreamed.  Consequently, this account is a good read, and I enjoyed it.  You  may occasionally get bogged down by Franz's desire to name almost every  person he can think of, as well as the endless acronyms.  The jacket makes  a big connection with Apollo 13.  It is misleading because the book is far  more comprehensive than that.  Despite these shortcomings, I found it hard  to put down and eye-opening."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on May 17, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4KZZ60UWTD2D"
                },
                "Date": "on June 19, 2001",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Mr. Kranz is a true American hero - and he represents the kind of hard work and dedication that took America to the moon in only 8 short years.  Perhaps if today's generation was as focused as Gene Kranz was during the Cold War, we would have fewer inexcusable mistakes - like the kind that destroyed Mars Climate Orbiter, Mars Polar Lander, and the X-33. Mission controllers are an underappreciated group at NASA; Kranz represents the best they have to offer."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AC24H4N4HYNU5"
                },
                "Date": "on August 7, 2004",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Everyone else has reviewed the technical and historical aspects of this book, which I also found enthralling.  However, a side benefit is that it can also be seen as a great how-to book on leadership.  The Mission Control \"mission statement\" and the struggles that Krantz went through to lead the fledgling agency are a great study in teambuilding and the power of visionary leadership through integrity.  I've posted the Mission Statement by my desk at work."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23R3EOZ837242"
                },
                "Date": "on September 13, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DBIVLWZJTNUY"
                },
                "Date": "on September 17, 2001",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "As a \"space Junky\" I love to learn about the early days of the space program.  Its awesome to read about the way NASA started and all the risks and worries of our first space pioneers.  Gene Kranz writes in a matter of fact way but provides first hand experience that I doubt you'd ever read anywhere else!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KK6BSJIRB8MF"
                },
                "Date": "on May 1, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20JSLNO952J0H"
                },
                "Date": "on January 22, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D1NSB3FMPTMM"
                },
                "Date": "on January 29, 2012",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GZKHEQWTS4Z5"
                },
                "Date": "on May 17, 2001",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "This account from Gene Kranz should be considered one of the comprehensive mission operations viewpoints from Mission Control (the other being Murray/Cox \"Apollo, the Race to the Moon\")for the Mercury, Gemini and Apollo era...many new \"insider\" gems are presented here for the casual manned spaceflight reader or the spaceflight buff, all told in \"rah-rah\" patriotic prose. To say that Kranz's heart was and always will be in Mission Control is an understatement. After reading this, his whole life, it would  appear, is centered around his role as Flight Director. And what a life it was! Uncommonly unique details of the mission planning, training and performance abound here...reading of the training for Apollo 11, how the 1201 and 1202 computer alarms while performing powered descent were simulated on the last training day prior to the mission were priceless...nowhere would you get this level of detail (unless another Flight Director [other than Chris Kraft] writes his memoirs) and the unique telling of it. Kranz's opinions of his controllers and Flight Director peers are also unique in that no-one else could submit what it was like working with these people and for this program day-to-day like him. This is a quick and easy read with lots of unique information that should be counted with the many existing accounts that are \"required\" manned spaceflight reading."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJT4O8SHSNKNP"
                },
                "Date": "on July 11, 2002",
                "Helpfulness": 0.75,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADXVZUT1HHW2M"
                },
                "Date": "on January 16, 2007",
                "Helpfulness": 0.75,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18W51P4L4UFXB"
                },
                "Date": "on February 6, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QBO7HCRBVJQJ"
                },
                "Date": "on September 15, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3M94CHMT9KJSV"
                },
                "Date": "on October 15, 2000",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "2",
                "Text": "I'm \"into\" space and have enormous respect for the author.  The book covers the most exciting events in recent history and should be a page turner.  It's not.  I found it mind-numbingly boring.  With a few rare exceptions, the book reads like a poorly written diary.  I was amazed at the brief coverage of Apollo 1, even though I know the author must agonize about it still.  I wish he had put more of what he really felt into the effort."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3E877M731ZO99"
                },
                "Date": "on April 26, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LKAHPLH5BVDI"
                },
                "Date": "on July 27, 2000",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "To me this book is a very good book it keeps me wanting to read his book.  I have read many other spaceflight books but this one tops them all.  It is great to see a flight director writing a book because i am and 19 year old  and i have read and i have watched all the NASA movies i have a huge  collection of all of the Apollo missions at home.  To me Gene Kranz book  just justifys what goes on in mission control and what happens behind the  kurten.  To me when i read the chapter about Apollo 13 it just told you  that a mission controller will go to any lengths to save the crew even if  he is the Flight director i am almost done with the book but to me if you  go out and buy this book you will be on the edge of your seat the whole  time.  The first time i started to read i didnt want to put book down.  To  me it touched something in my heart that told me this man went from the low  man on the totom pole to what he was and in my mind is still today and that  is the flight director.  That to me is my opinon on his book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RLDVADOZD9OA"
                },
                "Date": "on August 21, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1E4REA11S1126"
                },
                "Date": "on July 9, 2000",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25ZQOFDC29DY2"
                },
                "Date": "on March 25, 2006",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Having been interested in this period of the initial years of the space program, I was hoping to gleen more insite into events and people during this period. I was not let down as some of the details and specifically the difficult logistics of operations was layed out and described. All this without the technology that we have today for satellite communication/Internet etc. Superb description of the Apollo 11 landings and mindset for success of the Apollo 13 events, showing the stunning and legendary team building abilities and decision making insites of the period. Worth reading for anyone interested in those years of Space Exploration."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29T2BW76HTJLA"
                },
                "Date": "on August 17, 2004",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is a well-written account of the space program from the perspective of a mission controller.  The author does a great job of telling the \"behind the scenes\" story of each Mercury, Gemini and Apollo mission.  In the end, I was left with a profound feeling of respect for the men and women who worked together using technology that was, by today's standard, ancient to put men on the moon and bring them back safely.  I was also left with a deep feeling of sadness that my children are unlikely ever to experience the awe and pride that we as a country experienced as we watched their achievement unfold."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37PEL10Z3VHLK"
                },
                "Date": "on April 2, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Don't let your knowledge of man's mission in space stop with the viewing of Apollo 13 in a movie theater. This book gives great insight to the people, the policies and the efforts required for the amazing accomplishments of the US space program. The writing is solid and the personal input of Kranz brings the stories to life. In addition, Kranz shares ideas and practices which are applicable in everyday life, both personal and professional. This book should be required reading for all in order to make sure that we still utilize our capacity to dream, to plan, and most importantly, to act."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3A0AUKVRHDZGZ"
                },
                "Date": "on April 24, 2002",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Gene Kranz not only helped to bring home the Apollo 13 crew, he was part of Mission Control from day one.  He explains in detail how he and many others \"wrote the manual\" for space flight operations.  You realize how critical it is to be perfect when you're a flight controller, and a bad day at work could mean death to a crew thousands of miles away.  Kranz tells his story in such a way, that you don't have to be a mathematical engineer to understand how we really pushed our luck in achieving our ultimate goal...  The Lunar Landing."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UYPCV6FVZH1Y"
                },
                "Date": "on December 11, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Okay, I think we can all agree that Gene Kranz isn't the most polished writer in the world, but he was a first class flight director. He doesn't dive much into personal details except for the occasional note about his growing family and the fact that the white vests were his wife's idea but he does a job of describing the culture of Mission Control in NASA's early days. From his first encounter with the Mercury astronauts (\"Yeeee-haw!\") to Apollo 13 and beyond, he takes us behind the scenes to show us what it was really like."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AB10W5FUXWAJ"
                },
                "Date": "on February 22, 2002",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "I read this book and Chris Krafts books together. They are very similar and I am giving them the same review. If you had to choose one, I would go with Kraft's book since he was at the space program from the very start. But both these books give a view of the space program from Mission Control's perspective. While not quite as interesting as the astronauts, it is still very interesting. As an engineer, it makes me yearn for a time when an engineers work was part of something bigger in the nation's consciousness."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QVD9K16N5RQ2"
                },
                "Date": "on March 31, 2002",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Oh, yeah, Gene, this is how a book on the program should be written.  A satisfying mixture of people, events, and technical information that kept me reading from start to finish.  As a child of the program (my father worked for the space program from 1956 until 1970 and loved every minute at Cape Canaveral/Kennedy Space Center), I found myself looking for names of people I knew or asking my dad \"did you ever meet...?\".  I highly recommend it to whoever is interested in early American space flight."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARTL65R2I6YS2"
                },
                "Date": "on January 23, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A131DCC3CW5X0B"
                },
                "Date": "on April 25, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Even if this book would maybe not appeal to those not deeply in love with the Apollo Era, I found it very engaging and fascinating. Mr. Kranz found just the right balance between technicalities and personal anecdotes to tell the story of the unsung heroes of Mission Control. His first-hand account of key events like the first landing on the moon and the last days of the Apollo program brought literally tears to my eyes. A real treat to read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZGLZZELQ0IG0"
                },
                "Date": "on August 5, 2004",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I thought Gene Kranz did a fine job of re-living the space race from Mercury to Apollo. His remarks and recall put you right in the control center and his accounts of some of the more interesting moments make you appreciate everything that test pilots and astronauts went through in those early years. If you have want a great account of the space program, the early years, this is the book you won't be able to put down."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on January 21, 2003",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I thoroughly enjoyed this book, particularly since I was born in 1965, and as a result was only vaguely aware of all the events that led to landing a man on the moon.  The contrasts between now and then, particularly in computers and communication give you an even better appreciation for the ingenuity and determination of astronauts and mission control alike."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 16, 2001",
                "Helpfulness": 0.75,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Z8C058GBR97D"
                },
                "Date": "on December 27, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book details the human and machine story of the early space race. Gene Kranz was there from the very beginning, and right in the thick of it. Detailing some of the hair-raising experiences the crews and mission control teams went through, the book makes absorbing reading for someone who is even only slightly interested in space technology."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AH7N6S0PXB918"
                },
                "Date": "on December 24, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I've read this book many times and I've given hard copies of it as gifts to colleagues moving on to management positions three times.  This book is about leadership, teamwork and work ethics. I'm not quite sure what the four people who gave it one star expected it to be. It was written by a test-pilot and an engineer...not Walt Disney."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVVNIS5I5FQKW"
                },
                "Date": "on November 29, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36P632KZ6K2JB"
                },
                "Date": "on June 9, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAXP0CHZ2W5BQ"
                },
                "Date": "on December 25, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I lived through most of the events the author recounts, and, at the time, they seemed to be pretty neat adventures.  The advantage of age and Gene Kranz's detailed descriptions made me realize how daring, brave, and trusting, the first astronauts were!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APUOUCG7PI545"
                },
                "Date": "on April 17, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A97G6GC8S1WP"
                },
                "Date": "on December 12, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OGMFKY7XL5PH"
                },
                "Date": "on November 3, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YC390Q0UL9XE"
                },
                "Date": "on October 18, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19JGZ4HOJRS0V"
                },
                "Date": "on September 19, 2009",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GPGBHBI6T2HJ"
                },
                "Date": "on January 20, 2009",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIKVLU1HAV0ZQ"
                },
                "Date": "on June 30, 2008",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIKVLU1HAV0ZQ"
                },
                "Date": "on June 30, 2008",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SYMCC1A6GQ4X"
                },
                "Date": "on November 25, 2007",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3M6OPF77FYFK4"
                },
                "Date": "on March 21, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "It was another time....Gene Krantz was 36 when he directed our landing on the moon.  The engineers in mission control were in the mid-20's.  An amazing story to read - you can apply a lot of what they did to everyday life.  These folks were heroes."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FQ6C9NUCXIML"
                },
                "Date": "on April 1, 2002",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Not a typical \"author\", but written in a style that keeps in moving. Read this or give this away to get motivated - especially if you are facing issues \"you can not solve\". Because you can !!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16SLRTWKTVOO2"
                },
                "Date": "on May 31, 2000",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "In some many books about the US Space Program, the focus has been on the Astronauts.  This book gives you a great idea of what happened on the ground.  A very good read, written by a MCC a true Space Hero."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APNEWBDRKN2W3"
                },
                "Date": "on July 3, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MYEIP7WTC3N6"
                },
                "Date": "on June 13, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Gene was one of the few NASA controllers during the early space program. He was like a concert director, except that this concert had to achieve one of the most difficult things in the world at that time, to send men to the moon and return them safely to earth. This is an autobiography of a person that is a true patriot, a true honest man and a true engineer. This book connects you with the limitations and capabilities of that era, but it has plenty of suggestions that apply to these days on how to build your team, how to select them, how to work with them. They knew the flights and ships were the most complicated things on earth, but they had built around them all the expertise and networking to figure out the problems that they couldn't foresee ahead of time. The experience gained in only a few years, of a person that handled the Apollo 13 crisis in the best possible way, it's a great lesson, you can learn a lot from that. And just to honor those astronauts that gave their lives for the space program, that are truly pictured across the book, I recommend this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AUTOCQR86NHC"
                },
                "Date": "on October 26, 2009",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OLZDXGW288BW"
                },
                "Date": "on April 23, 2000",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Most of the books written about the early days of the space race and the dramatic race to the moon focus on the astronauts and their feelings upon being part of the program, with their autobiographies, and biographies written by Apollo historians, such as Andrew Chaikin's \"Man on the  Moon.  However, this book by flight director Gene Kranz offers a new  perspective on the missions, as he explains how the dramatic events in the  void of space were handeled by mission control in Houston-Alan Shepard's  Freedom 7 flight, John Glenn's Friendship 7 flight, the first lunar orbit  on Apollo 8, the first lunar landing on Apollo 11, and the \"successful  failure\" of Apollo 13.  The story of these missions have been told  many times, yes, but not in the eyes of a man in mission control.  The book  is not high literature, as the sentences are short and choppy, but that is  not likely to concern a space buff reading this book.  Overall, this book  is a unique and new perspective on the early days of the space program."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACBUOLYVW7OAJ"
                },
                "Date": "on February 11, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CC2CRU24E44X"
                },
                "Date": "on November 24, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "Tone deaf planning and editing.  This is more of a diary or historical account than a non-fiction story.  Easily half of the text of any paragraph or chapter is a litany of names and people who were part of the team.  The \"story\" -- the successes-failures and near misses seem a minority of the book.  I would estimate that most people want to read about the missions themselves, not the endless training and names and schedules of those in mission control.  The book succeeds but only on the effort of the reader who has to endure all the \"extraneous\" stuff to get to the topics of interest.  This is Kranz' book.  No doubt this is the book he wanted to write.  He's going to fairly significant effort to give credit to others.  He comes across as a humble man who understood the moment in history but has no interest in claiming the spotlight as an individual.  But I grew tired of all the minutia sparingly interspersed between the \"meat\" of the book - at least IMO."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YEB04DHU96FZ"
                },
                "Date": "on April 20, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is a must read for anyone interested in first hand details of the Mercury, Gemini and Apollo programs, especially those personally involved. Kranz is about 10 years my senior and Gemini was underway when I graduated from college and began my engineering career in the Propellants Section of Saturn V Launch Operations at KSC. After facility activation and the second unmanned Saturn V (AS502) launch I moved to Houston and worked at JSC as a Space Suit Engineer for ILC Industries through the remainder of the Apollo program. So I saw it first hand from both the launch vehicle and astronaut viewpoints. Many books and articles I have read about this incredible period in American history do not get the facts straight and the exhilarating/dejecting emotions involved but Kranz personnel knowledge and writing skill nails it in this book. As a matter of fact his account so parallels my own that I am using it as a guide to write my memoirs. A great read and historical reference."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33JI03TISMD8C"
                },
                "Date": "on May 29, 2000",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "Stuck in an airport, I searched the bookstore for a good book...little did I know I'd stumble onto this gem.  As a sleepy 3-year-old when my parents woke me to see the moon landing, I grew up, knowing little about the  America's newborn space program...I figured this book would tell me some  interesting stories...and it did! It might be hard to imagine action behind  a desk at Mission Control, but I couldn't wait to hear more stories after a  description of the first launch. Although sometimes over-detailed in who  did what between the launches, and sometimes it seemed like a Senior Class  yearbook in it's roll-call lauding, I was really hooked on hearing about  the program.  I highly recommend this to anyone who is even remotely  interested in flight, and to those who like a good book. It's like The  Right Stuff meets Yeager meets Apollo 13."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MCDMCE1QJIP3"
                },
                "Date": "on April 14, 2001",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "You liked the movie Apollo 13? Well, this guy lived it. Nothing is candy coated here, this is the nuts and bolts of what it took to get men into space and an insight into the real meaning of the word \"leadership.\"  It is fashionable to cull phrases like \"Failure is not an option\" and insert them into business manuals for people selling widgets and nick-nacks. Well, when people like Gene Kranz were inventing space flight from scratch, they knew men's lives were at stake, not some quartley profit figure. And by the way, just like \"Play it again, Sam\" ... Mr. Kranz never did speak the words you heard in the movie. But read this book and find out what he did say and what it was like to really make a difference at a time when America was filled with young people who wanted to do great things. He's a true American hero and this book is a treasure and an inspiration."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A286WR8T3QWTFH"
                },
                "Date": "on July 2, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANFTDRMTUK5DY"
                },
                "Date": "on November 4, 2000",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "I just finished it and I am very glad I bought the book.  Gene Kranz had one of those amazing careers, being there when \"the right stuff\" was required of him, and delivering it with competence and humility.  His narratives of the Mercury/Gemini/Apollo missions are wonderful, in my opinion, but even better, his fine character as a man comes through very clearly.  Giving 110% at all times, trusting in his abilities to inspire and lead his flight controllers, and his bottom-line reliance on God, are traits that should be admired and cultivated in all people.  The only part of the book I felt uncomfortable reading was the last chapter, where he laments the current absence of the pioneering spirit that kept him and his peers going, mission after mission.  I hope his testimony helps inspire a revival!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16VWGP62D6KSH"
                },
                "Date": "on October 30, 2000",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "From the days of John Glenn, to mankind's success with Apollo 11 and America's success with the return of Apollo 13 through the end of the Apollo program, Gene Kranz has not only viewed history from his console at Mission Control he has lived every moment.  In frank, no nonsense terms Kranz take you into \"the trenches\" of the Manned Spaceflight Center. In prose as sharp as his crew cut he tells the tale form the viewpoint of those who vicariosly rode with the astronauts from the Mercury Seven, though the last steps on the moon with Apollo 17.  We will always remember when Armstrong and Aldrin set foot at Tranquility Base, but mankind never remembers the support crew behind such achievement. Kranz does! and this reader is grateful."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A265S2Z6U63RBU"
                },
                "Date": "on February 22, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MP0SVZQZ2EOX"
                },
                "Date": "on November 17, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Did you grow up glued to a black and white TV watching your heroes, our first Astronauts, like I did? This book tells much of the \"back-story\" including how we got there, and the few things we know of that went wrong, and some things that almost went really bad that we never really heard about, like Apollo 11 almost crashing to the moon instead of landing as planned. and some other quiet \"close-calls\" that could have changed everything. If you liked the movie \"Apollo 13\" with its emphasis on the true behind-the-scenes engineering and technical teamwork that kept everyone alive, this book details that and other events it without getting too technical - it keeps things on a \"spaceflight for non-science majors basis. Thank you, Gene Kranz and those who labored on these projects, you guys are heroes also!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27NMC45LSBUS6"
                },
                "Date": "on May 10, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Some very interesting facts about missions that almost went wrong as well as a first-hand account of the amazing rescue of the Apollo 13 astronauts from a man who was there from the first Mercury flights through the last landing on the moon.  The book gets a little wonky at times (the author, Gene Kranz, has a background in test piloting and engineering), but the details about how control of the missions was established underscore the incredible achievement that the American space program was.  People who who yawned when Barack Obama essentially canceled the space program will get a feel for a different America; a country of true hope and promise that delivered the single most amazing feat of technology the world has known and the importance of leader of vision rather than division in making it happen."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19KFQF4MAP9X3"
                },
                "Date": "on November 24, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I know Gene and it was great to hear this story from his perspective. A great book.  Definite great buy."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34GYU6EVJWVQW"
                },
                "Date": "on January 17, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39UQRTKFK0LI2"
                },
                "Date": "on August 14, 2007",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "While I confess to being a lifelong space buff, this book is the first of many memoirs I have had the pleasure of reading from the actual men and women who participated in one of the greatest adventures in human history.  I read it nonstop from the moment I brought it home, and have reread many sections of it numerous times.  I believe it is a useful historical record of the golden era of the space program, but also holds many lessons for those who find themselves in formal or de facto positions of technical leadership in all types of organizations - churches, consulting firms, technical contractors, manufacturers, and probably many others with which I am not personally familiar.  Thank you Mr. Kranz for all you have shared!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A120MT4EOEP9N1"
                },
                "Date": "on July 30, 2009",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CGK4R5RRF4RF"
                },
                "Date": "on March 17, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "It is the efforts of men like Gene Kranz that made a manned moon landing possible.  Reading his account of the Mercury missions through Apollo and beyond offers a brilliant glimpse at the sort of no-nonsense determination that allowed America to come from beyond and claim the ultimate victory in the space race.  With half the PHD’s on the planet working in our space program and steely-eyed ex-military men like Kranz it charge the impossible dream of landing on the moon suddenly became an inevitability.  Getting to see the familiar story of the space race from the perspective of one of the most important ground crew leaders offered a refreshing experience and a story that you cannot put down."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAD1C35206I38"
                },
                "Date": "on May 28, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SO35FG1Z25GT"
                },
                "Date": "on May 24, 2009",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "First, I will say do NOT read this book without also reading Flight: My Life In Mission Control by Chris Kraft. The two of these books go hand in hand and what one leaves out, the other fills in. Kranz focuses more on the technical side of the missions, and all the problems they encountered. His account of the Apollo 1 fire is haunting. Kraft on the other hand gives a lot more personal/personnel details. He tells you who was good to work with and who was not and why. This book was a VERY enjoyable read and I HIGHLY recommend it to anyone that has even an ounce of space interest...because after you finish it, you'll be looking for more!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QXDS13HDIZ6W"
                },
                "Date": "on June 24, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Well written and with an egoless positive attitude Gene shows us how Mission Control made our space program successful. Awesome! Definitely a must read to balance out your knowledge of the early space program which is likely mostly based on the astronaut's point of view. No doubt, the astronauts had their \"pink skin\" on the line and made a huge and the most visible contribution to the success of the program but Gene exposes the incredible dedication, sacrifices and contributions Mission Control employees made not exposed well elsewhere that made the program successful and saved the lives of the astronauts many times. READ IT!!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJ23KSFB9NGJH"
                },
                "Date": "on March 24, 2003",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "I picked up this book out of interest in the Apollo program (thanks to Ron Howard and Tom Hanks).  I just wanted more details, but found out I have an interest in the entire space program.  This auto-biography of Gene Kranz's years at NASA reads like a well-written novel.  It's a great first hand account of the early years of the space program.  From Mercury to the final days of Apollo, this book is a fast paced thrill ride from start to finish.  It shows the unwavering intelligence, engenuity and shear willpower of the American people."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4QEXIYC30IS5"
                },
                "Date": "on September 29, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is such a great book. I found myself sweating along with the members of Mission Control in every episode -- Mercury though Apollo.  The technical detail is especially appreciated by those of us who are engineers or have worked on critical projects like the NASA programs.  I know that some were not happy with the publication of this book.  It showed how close to disaster we came on so many missions.  Still, it left me darn proud to be an American.  Our astronauts and people behind the scenes at Mission Control are true Amercian heros.  Well done, Gene!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QSI37FRAR16R"
                },
                "Date": "on January 1, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This was a great book about the history of mission control.  It sheds light on all the missions, and shows just how much the astronauts depended on mission control.  I had never considered that mission control had practice missions, with problems thrown in to see how they and the astronauts would react and handle them.  They were under great pressure when things went wrong, and they handled things very well, keeping the space program on schedule.  I have new respect for them, and their part of getting the USA to the moon."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5TVJ62C03GGH"
                },
                "Date": "on March 30, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A great read.  In the same way the \"Right Stuff\" gets into the heads of the pilots this book gives a view into the minds, hearts and souls of the people working mission control - from Mercury through Apollo.  Unashamedly proud to be an American Gene Krantz delivers a powerful and insightful view of the people behind the scenes who helped win the race to the moon.  He also delivers a call to America and the world to reach for goals larger than ourselves and once again embrace the mission of exploring the stars."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11MKSCXTJWDK0"
                },
                "Date": "on October 28, 2008",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29XXJHNVVQK8W"
                },
                "Date": "on August 19, 2009",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A114YYYPPXQ908"
                },
                "Date": "on August 4, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "This book was very interesting from a historical standpoint.  However, there was so much technical information, it read kind of like a technical manual at times.  There also wasn't a lot of personal stories; it was mostly just a chronology.  At times, this book seemed like a NASA PR piece.  Everybody was great at what they did; they were all geniuses in one way or another.  That got old after a while.  If you're looking for inside dirt, this is not the book for you."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EHJOLM46T10L"
                },
                "Date": "on May 17, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "As an engineer, I really enjoyed this personal account of the early days of the space program, showing how perseverance and exacting determination produced astonishing feats of human accomplishment, using limited knowledge in the face of the unknown.  Whether you are interested in professional teams, technology, or history, this book offers a wonderful impression of a special time in our technological past, and leaves the reader longing to reach for their own stars."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HEW0ZY07XEXY"
                },
                "Date": "on April 14, 2015",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "This book is an extensive in-depth look at the history of the space program, written in a chronological format.  It's a very rewarding read in that it reveals Kranz's absolute passion for his job.  However, it's also heavy in an engineering, science, and military perspective which makes the book very precise, full of detail, and sometimes a tougher read.  If you can grind through the lengthy procedural reviews, some of the details are really special."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17P1KAMJMA0CO"
                },
                "Date": "on May 20, 2008",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Gene's memories from the first halting attempts to launch rockets into space through the successfull Apollo moon program paint vivid pictures of what happened inside the space agency on a non-technical level in building the space program.  Good review of challenging and motivating people to envision the what-if and do it step by step.  Small references to lack of vision in senior leadership of space program after the Kennedy moon goal was achieved."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AMLZXW8PPSHK"
                },
                "Date": "on August 3, 2008",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20LJESI2DB14Z"
                },
                "Date": "on March 22, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The book takes a close look at the classic age of space exploration. The trails, tribulations, dizzy heights and personalities that drove man to the moon in just 10 years. Kranz shares the energy and passion required to over come the massive technical complexities and obstacles of that journey. No need to be an engineer or scientist to read this book, the text is a page turner. Faced with the Kennedy deadline, the book title says it all."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALLZVFSDQB94F"
                },
                "Date": "on June 13, 2000",
                "Helpfulness": 0.625,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A388J1PRUUOGBV"
                },
                "Date": "on April 12, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is less of a page-turner than my last book on space flight (viz, Lost Moon), but it is well-written.  It reads like a history, but includes the personal dimension as well.  America's early days--prior to satellite communication and modern computers--are the initial setting. It's an amazing account of Kranz and his teammates' successes and failures, as they seek to put a man on the moon."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16MQFL0V3TJUO"
                },
                "Date": "on August 9, 2009",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "Good -- but not great read about early years of space flight.  Kranz had such a tremendous, front-row seat to the people and challenges of the day -- I was hoping for more stories and insights that we're not already part of our collective memories.  Gene Kranz is  truly an American hero and his accomplishments should make us all proud.  Where are the next challenges for our space program?"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IRK2CMWARJ22"
                },
                "Date": "on October 31, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I really didn't know how much went on behind the scenes. I remember the different programs from the first Mercury thru Apollo as my husband insisted our kids watch all the tv coverage of each mission, but was amazed at all it took to get there. My hat is off to all the space pioneers and Gene Kranz for telling such a great story or. I guess for documenting  history. Well done."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A77DEZH3J4SAH"
                },
                "Date": "on November 25, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Excellent book. Well written about the inner circle at ground control. Only minus is the lack of pictures. In a biography it is usually nice to break up the story with some pictures from the life of the man in question. Other than that, this is a book I would recommend to anyone interested in the origin of manned space exploration. Gene Kranz did not fail in this book either."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EMR0F59UGZ4M"
                },
                "Date": "on January 21, 2011",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A222MLD10Z358E"
                },
                "Date": "on August 18, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "An amazing story told from the other side of the fence, not from a hot shot pilot but from the men that were critical in ensuring safety and success were achieved where no others could. Amazing narrative, slightly bogged down at times by the enthusiasm for everything technical, this story goes on to finish in great form and left me wanting more. Well worth the read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TWLBAPP22ZQ9"
                },
                "Date": "on April 5, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Very inspiring. In this first person account which includes the good, the bad and the ugly, I marveled at the dedication of so many. Their commitment to their goal and refusal to accept less that perfect out of themselves in inspiring. The leaders that took us to the moom seem to have disappeared as quickly as the end of the space program with Apollo 17."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MFCNSAHTPJT0"
                },
                "Date": "on June 26, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I lived through the Gemini and Apollo era as a kid and remember Gene Kranz at the console in Houston.  It's really great to read about all the behind the things that went on.  I'm amazed with the lack of technology how they pulled off all they did without more major failures.  A testament to a time when the US was tops in technology and personal pride!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A339UZPA9TR2G0"
                },
                "Date": "on November 10, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent story of how the engineers and guys behind the astronauts put Americans in space.  Gene Krantz takes the reader from empty office spaces and no idea what they were doing, to putting a man on the moon and, later, dealing with the Apollo 13 crisis.  The book is great from both a space history and leadership/crisis management perspectives."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APXUHBYR32YOS"
                },
                "Date": "on March 30, 2000",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "Gene Kranz is a legend and rightfully so.  Although best known for his role as flight director for Apollo 13, he was with Mission Control from the beginning and as a result set the high standards that continue to this day."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2N20M6XXS67ZJ"
                },
                "Date": "on December 29, 2009",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "We actually bought this book as a gift for my father-in-law who was in the USAF during this time.  We had the opportunity to hear Gene Krantz speak at an event recently, and were intrigued by his book.  The combination of the book and hearing him live really gave an amazing account of the event - many more details than we had ever heard before."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A240W7T1TQEHXP"
                },
                "Date": "on September 4, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book made me grateful that people like Gene Kranz were on hand, setting high standards for themselves; often having grueling schedules and high anxiety situations, but training themselves to keep their eyes on the ball--some magic mix of training, education, intuition, and guts.  Very impressive.  THANKS to all who did this vital work!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IZW2LN68Q8K7"
                },
                "Date": "on November 12, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I've read a fair number of books on Apollo specifically.  But I never realized how much problem solving was done on a routine basis by mission control.  This book gives an insight on how much mission control made success or survival possible on every space flight.  The level of training and the personality type required also become evident."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A256YP6OEL32TL"
                },
                "Date": "on July 7, 2002",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Gene's account provides historical background to the development of the backroom operations of the space flight, thing that he made glamorous. His TV appearance on the Apolo 13 was more forceful, the book is subdued and at time repititious. On the whole it's a readable account, particularly for those who are trying to round out the events."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARNCAK212PXZ"
                },
                "Date": "on July 4, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I somehow thought this book would be stuffy and a bit boring or anylitical because it was written by a flight controller.  It is anything but!  Easy to read and humorous in many asides.  He tells a story of one of the coworkers riding a horse to work!  Very personal and also very good historical record of the events of the period"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1W566E2YFA00"
                },
                "Date": "on July 22, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book provided a unique, inside Mission Control viewpoint from a giant in space exploration. Gene Kranz and his flight control colleagues were the brains behind the flash of the astronauts... taking America to accomplishments only dreamed of by other nations.  This is a must-read for all space geeks like me1"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QVQ59NM2AOHH"
                },
                "Date": "on January 18, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I am proud of the achievements America has achieved in space. This Book strengthened these impressions further. I learned much about the three programs that led us to the moon. I wanted his thoughts on the Challenger since he was in Mission Control at the time, but he did not give us his thoughts on that."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQVVRK3IEAMNZ"
                },
                "Date": "on January 25, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJY3JVG2PNW2R"
                },
                "Date": "on October 9, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RIJU9ERQ8GF6"
                },
                "Date": "on March 5, 2008",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This is a really interesting read, and a must have if you have any interest in the space race at all. This is a book with a lot of detail about each mission that Gene Kranz was involved in, and is interspersed with some neat personal information about his family. Buy it and enjoy it!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DSA3S7SV1S00"
                },
                "Date": "on May 3, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This was a great read, at first I thought this was just going to be about the Apollo 13 mission, but this covers from the Mercury program through the Apollo program and a bit beyond. The book is well written and it was a great story, I had a hard time putting it down."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JPXIA6WKL2JJ"
                },
                "Date": "on December 31, 2010",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Wow, a fantastic book from a living legend!  I never had the priviledge of meeting Mr. Krantz when I was working for NASA.  Too bad!  A must read that leaves all the other books about the human space program in general and Apollo in particular in the moon dust."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29OTMPSWQBFHW"
                },
                "Date": "on April 3, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FQ57A2MX9T93"
                },
                "Date": "on May 14, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I love history and history about our \"brave and true\" makes reading this book even better.  I would recommend this book to everyone who love God and County!  These Americans were the bravest and the best and we could use some more heros like them!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33JI03TISMD8C"
                },
                "Date": "on August 31, 2001",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3G2TQ65FUHPFF"
                },
                "Date": "on November 9, 2009",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZWO35ZWDZ4B5"
                },
                "Date": "on December 9, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Outstanding autobiography of the man who saved the Apollo 13 mission from total disaster that led to the crew's triumphant return. An excellent lesson in leadership that should be required reading for anyone aspiring to a leadership position."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CL2PDM9BLRV"
                },
                "Date": "on April 19, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAF1TJBM69K4Q"
                },
                "Date": "on April 3, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Very well written. Outstanding history lesson. \"Flight\" did a great job on his description of characters and his vocabulary was very entertaining. If you love the space race era, then you will truly enjoy this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZQAI23WU680"
                },
                "Date": "on February 17, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19SPM4Y7A8OHN"
                },
                "Date": "on August 23, 2001",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3E3Z0XMQB3HNN"
                },
                "Date": "on July 19, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Although he is not a great writer, which makes it more real, I thoroughly enjoyed this book.  Felt like I was getting the inside track of the early space program as I watched over his shoulder in Mission Control."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AT7D9D5CZEQI6"
                },
                "Date": "on November 28, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "A bit disappointing, as I had hoped for more in the way of stories and anecdotes. It reads more like a procedural history of the Gemini and Apollo eras at NASA. Interesting, as such but not very entertaining."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFQGYXJW4XD86"
                },
                "Date": "on January 30, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Engaging from page one and it just keeps getting better from there. Gripping tales from the birth of the space race. You can feel how this group ignored the troubles of the day to pull the feat of a lifetime."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FELYSQNL0OAW"
                },
                "Date": "on December 24, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This book was very well written and I was very surprised at how hard it was for me to put it down. Without giving away anything I whole heartedly agree with his beliefs and position stated in the afterword."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GXRU3M22GWY1"
                },
                "Date": "on May 9, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "It's a long read that's worth every page! It's the best book on leadership I've read. It would also offer great insight to people who work with complex systems in the condition of significant uncertainty."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3S25T9W6ISDZX"
                },
                "Date": "on January 18, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5IION6HI5J53"
                },
                "Date": "on October 11, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This book was worth the time to read. I enjoyed it very much and I recommend it to anyone interested in reading about our countries fight to be the first on the moon. Mr. KRANZ tells it like it is."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8KRMP4EUNRBX"
                },
                "Date": "on December 8, 2008",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent account of the backstage of America's Space Program, you could really fill the atmosphere inside Mission Control,and the contribution made to it's success by a miriad of unknown Hero's."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GJL3YZ0EJE2L"
                },
                "Date": "on January 25, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "lots of details about what really happened those days, it is a real account of how really hard was for men reach moon, I felt the emotions of those men proud of their jobs, I loved the book"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CIDYKUX05YWP"
                },
                "Date": "on September 12, 2010",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Focus, discipline, support. It isn't happening in America the way it did then. This is a must read for anyone who wants to view the US from the perspective of its 'Golden Age'."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AID7Y8DD8JB"
                },
                "Date": "on April 23, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent Read - a must for anyone who was interested in the space program in the early.  Gene Kranz & Kris Kraft were household name when the Mercury Program was alive."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DZMGBW5VFDZ5"
                },
                "Date": "on April 29, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is a fantastic book. You want to keep reading and reading and asking for more. I actually met the author Gene Kranz and had him sign it. HIGHLY recommend the book"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33RA0FO6YXW6J"
                },
                "Date": "on March 13, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great book on our space program! I highly recommend this fast paced very honest look at where we've been. Get it for your library. Gene Kranz is a terrific author!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UY3UL7B6LK5L"
                },
                "Date": "on May 13, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Incredible book about the start of our space program, though the Mercury and Apollo years, by a man who KNEW!  Well-written with great detail and very insightful."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5FIHN7CEG42I"
                },
                "Date": "on September 14, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Very detailed, very thorough, and an excellent learning tool.  Makes you feel as if you really knew Mr. Kranz, his team and the astronauts and their experience."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1R41M384P5RZ2"
                },
                "Date": "on January 9, 2007",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I enjoyed reading this eye opening book.  I've read others about the space program and it's interesting to see the different perspectives of the men involved."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PBST3N5XPRC8"
                },
                "Date": "on April 4, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16V22A73IQC76"
                },
                "Date": "on May 22, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "If you are interested in America's space program, you will love reading this book. Gene Krantz's knowledge and insight made for a most interseting read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AC6N1E3PK01E"
                },
                "Date": "on June 21, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I ordered the book after watching Apollo 13 movie.  I was surprised at the history in the book along with the human emotions.  It is a wonderful read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CXQ24V8V9EF9"
                },
                "Date": "on August 6, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Bought this for my husband and he has enjoyed it.  Reminds him of just how dedicated the pioneers were and how many problems NASA had to work through."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A124OI117U1Q9G"
                },
                "Date": "on October 29, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Excellent book about our space program in easy to understand language.  I now appreciate it more since one of my former student went into space also."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2G8DPASGVKZU"
                },
                "Date": "on July 8, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent book. Well written. A great \"behind the scenes\" account of the Apollo program, first hand, by one of the people who made history!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29P9KAFIUBR82"
                },
                "Date": "on November 9, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Wonderful read on the inside history of the US Space Program.  Kranz has a simple, but eloquent writing style that put me right in mission control."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21RUTRHCE213T"
                },
                "Date": "on January 3, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Mr. Kranz does a great job of telling the story of the Apollo Age.  Just as I remember it.....but with the extras that we did not know about."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1U9DG9GOVSKC1"
                },
                "Date": "on April 15, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Imagining people going to the moon with technology of the 60's is a difficult thing. This book tells the tale with the eyes of Gene Kranz."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30O8J36C9K1S8"
                },
                "Date": "on December 7, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A342OG44VOZYE2"
                },
                "Date": "on November 7, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "great insight into the moon shots - really enjoyed Gene's views of the intimate details. This should be part of your collection of books"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13GX0YEZV831Q"
                },
                "Date": "on January 22, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UPCCXEG62SCI"
                },
                "Date": "on August 1, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Thoroughly enjoyed the book even though it's a little long. Mr. Kranz insight into those crucial days at NASA were awe inspiring."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVBMF95U0F841"
                },
                "Date": "on August 13, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Have followed the space program since the 60's.  Both happy and sad to read the \"behind the scenes \" of the glory days!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WDVPATKWIDBR"
                },
                "Date": "on July 28, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "He knows more about flight control and flying experimental aircraft as any person on earth.  This books a winner...a don't miss"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3T0IWDGV9AGK5"
                },
                "Date": "on October 23, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I've always been a Gene Kranze fan. This book certainly did not disappoint me. After reading this book I admire him even more."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DGH2CL5LPOHY"
                },
                "Date": "on November 23, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Lots of good behind the scenes information and detail into what it takes to do a space flight. Totally enjoyed reading this."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AS3LLGHI52RUO"
                },
                "Date": "on October 13, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "My dad worked on the Atlas through the Space Shuttle. The history of my youth..thanks to all who was part of that history."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1INDDNG4AF7NZ"
                },
                "Date": "on July 22, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Fantastic story, of life on NASA. Who loves grat's time of mission space. Gene is fantastic personality in the world. Tks."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVBHW63X7DKCU"
                },
                "Date": "on February 11, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Well written Informative  book.! Like you were sitting right in the control center.  A book  you don't want to put down.!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WUUMJALCPDCL"
                },
                "Date": "on April 14, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "ordered this for my husband and thought I'd have to pull it from his hands to get him to set it aside to go to sleep."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QF88I5JJLA7Q"
                },
                "Date": "on April 1, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This was a great read.  A very good \"behind the scenes\" look at the early space program.  Highly recommended!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKMXIYU7GMQPG"
                },
                "Date": "on March 26, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2K0X0R48JTTJA"
                },
                "Date": "on December 10, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Fascinating insider's look at NASA, reads at times like a poignant memoir, other times like a riveting thriller."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25C6W7YL3IV16"
                },
                "Date": "on November 24, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great read. I'm not finished with it yet but it's been interesting and fun to read. yay. three words needed. yay"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IKKVLJBNMUJ4"
                },
                "Date": "on November 4, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A fantastic book, packed full of information from the expert point of view of one in charge on the ground"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18CDFQ1W9KOVJ"
                },
                "Date": "on December 9, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great book!  I read it for a class I was taking. It definitely piqued my interest in the space program."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYN3EOVA4T3D3"
                },
                "Date": "on October 7, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Interesting and informative about \"the other side\" of rocket launches and trips in space."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NI4DB8TSK4F1"
                },
                "Date": "on September 2, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Bought it for my husband who is a great admirer of Gene Kranz. Very informative and a great read"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UZ7ZZ59F7TK7"
                },
                "Date": "on December 30, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book gives a whole new view of the space program, it was hard to put down. I recommend it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TIDFGBA9MB7K"
                },
                "Date": "on January 17, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I was surprised at how much I liked this book. It is easily one of my top five favorite books."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7N78DFJDP69K"
                },
                "Date": "on May 24, 2000",
                "Helpfulness": 0.5714285714285714,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A95O39BWCXUZW"
                },
                "Date": "on January 24, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This si such a great book and it is so nice to be able to download it to my many devices."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CYN0N9TUTKGO"
                },
                "Date": "on January 23, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": ". This book came quickly .  and in good condition . . I am already a few chapters in. ."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A251512G3L7UDJ"
                },
                "Date": "on December 13, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A real thriller, even though I had followed the NASA program on the news."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AVC59N5KKES5"
                },
                "Date": "on May 7, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Full of information you cannot get anywhere else that I know of."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NAN8WZKEYTSK"
                },
                "Date": "on December 20, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "If you grew up during the space race this is a fantastic book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19BDU4WJTOLEC"
                },
                "Date": "on October 29, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Very detailed account of the early days of the Space Program."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LDO43KPFU9I4"
                },
                "Date": "on February 28, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I wonder if he knew Admiral Rickover.  Both are my Heroes."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AC5OSUGNQVJ5A"
                },
                "Date": "on June 9, 2000",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Mr. Krantz tells it like it is, the difficulties in running a space program on a very tight deadline to get a man to the moon.  This book does an excellent job of showing some of the effort that took to get Neal  Armstrong and Buzz Aldrin (plus others) to the Moon.  A must read!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27R5F5VYBE73N"
                },
                "Date": "on May 4, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Anyone who loves the space program will love this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FYCEYTSFWE27"
                },
                "Date": "on November 1, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Bought a signed hard cover as a gift. Amazing book."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on May 29, 2000",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "I think that This book depicts a real life account of what really happened in the space program from someone who was there. If you like reading books that tell the whole story about the space program then you must read this"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IBP0WQMFNI04"
                },
                "Date": "on February 20, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A must read for any space program enthusiast."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2523W3DRK80GD"
                },
                "Date": "on August 14, 2000",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Having worked at the Johnson Space Center for 12 years I really enjoyed  this book and even learned a thing or two.  This is one of those books were  you keep saying just one more chapter (at 2:30 in the morning)."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3Q3MEZ2VR272G"
                },
                "Date": "on March 16, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent work by extra ordinary person"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16ODAWDMUC189"
                },
                "Date": "on August 6, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Nice book. Condition was very good."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A179B8ZQZ7RW87"
                },
                "Date": "on December 8, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great book and leadership example!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMJTH12MWELYT"
                },
                "Date": "on November 3, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Great read about the Moon program."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OYOL7QC653I"
                },
                "Date": "on March 16, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Well written and informative."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AIUYZ1V7P5C4"
                },
                "Date": "on July 25, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great read.  Gene is a stud"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A201WUL15LJOW1"
                },
                "Date": "on June 21, 2000",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4RXLXRJ63GDP"
                },
                "Date": "on January 24, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Super book a must read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EEDXQFKT5PEE"
                },
                "Date": "on February 5, 2004",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ULCA1L6XJNT1"
                },
                "Date": "on May 1, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellant read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A247EJQP4WRFT1"
                },
                "Date": "on November 24, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "True American"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MU8V32XT0H6W"
                },
                "Date": "on November 6, 2011",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I highly recommend this book on our space program. The author shows that our success came from the dedication of the men and women of our great nation who strived for excellence above all else.  A quality that is needed more than ever in our nation today if we are to solve our nation's problems and become the leaders in the world again.  As President Kennedy said we do these things not because they are easy, but because they are hard.  We need men and women like that today."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LOQVC6OSJ3SO"
                },
                "Date": "on July 17, 2001",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "I first learned about this book after I saw Apollo 13. I was inspired by Kranz's (Ed Harris in the movie) zealousness to bring our asronaughts home. I then purchased this book. As I got into it I found that I could not put the book down.. There is NEVER A DULL MOMENT.. somthing always seems to go haywire.. and when it does, The good ol boys at mission control with the skill of the astronaughts do their damnest to fix it. a Truly awe inspireing book not only for space buffs but for any one who needs a good pick er upper. A true tribute to our Space Program. Kranz inspired by Kennedy's words \"ask not what your country can do for you .. ask you can do for your country\" and \"We choose to go to the moon - in this decade and do the other things, not because they are easy but because they are hard.\" A true Patriot Kranz is. I wish there were more people like Gene Kranz out there. I salute you Gene Kranz!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFU8E9IBUCP1T"
                },
                "Date": "on February 20, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "EXCELLENT!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DBIVLWZJTNUY"
                },
                "Date": "on January 16, 2002",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "I really enjoyed reading this book.  It was especially fun to read this book and then watch the movie \"The Dish\" as they complement each other quite well!  In addition to the events at Nasa, this also doubles as a semi-biography of Gene Krantz, also interesting, but not what I was expecting!  All in all this is a great read representing a unique period in American history."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MNB9PF4QMK9P"
                },
                "Date": "on March 1, 2006",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KCX8GN7SGRYD"
                },
                "Date": "on June 30, 2007",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AJBTJKFLBFIV"
                },
                "Date": "on April 1, 2014",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "I was hoping for something a little more technical but it was still very interesting.  It is told from the perspective of mission control."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UQ8B9X2XITBX"
                },
                "Date": "on January 14, 2007",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KC0Y4T0BF2J9"
                },
                "Date": "on July 19, 2003",
                "Helpfulness": 0.55,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3919E5NRACUP7"
                },
                "Date": "on September 18, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZGVE4FSVGAG9"
                },
                "Date": "on October 22, 2005",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Fantastic book for any \"space cadet\".  When read with \"Flight My Life In Mission Control\", you have the true story of NASA when risk was accepted, not avoided."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DAYE7LHMU6GV"
                },
                "Date": "on June 3, 2014",
                "Helpfulness": 0.25,
                "StarRating": "2",
                "Text": "Waay too detailed for me.  Half the time I don't know what's being described because it's too technical, and even the parts that move are mediocre.  I am 1/3 of the way through and regret my buying decision."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LAILBLM51TNT"
                },
                "Date": "on December 29, 2014",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "book was in good condition it was already signed"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 19, 2000",
                "Helpfulness": 0.25,
                "StarRating": "5",
                "Text": "arguably the world's greatest engineering achievement."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WLWJ5SE9GZEK"
                },
                "Date": "on September 16, 2002",
                "Helpfulness": 0.36363636363636365,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WNFOAYMQAKCS"
                },
                "Date": "on March 15, 2007",
                "Helpfulness": 0.2,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AXFV7ZHZ2HJU"
                },
                "Date": "on April 13, 2011",
                "Helpfulness": 0.36363636363636365,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 3, 2001",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "I loved this book, and if you like well-written, illuminating stories about the space-race, you will too.  It sheds some light on the current state of NASA today."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1W9GI2Z9K610N"
                },
                "Date": "on March 9, 2001",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Gene Kranz writes a novel amazing intriuging and completely  absorbing.... can we believe it??? The theme is one of true life total NON-fiction shows his passion towards his work and his totall amazement of what man has done in the time they were givin the plot to go to space in the time that they were given to do so.  Many people helped in the effort and we acheived our goal in space and in life we did what we set out to do and many people revel this curious amazement. Many people were involved in this amazing race towards space and the moon and beliieve it or not wa actually made it in the time we were given to do so.  Can we believe this its amazing and completely inspiring this has been T-BONES REPORT"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7FR85NVONFBG"
                },
                "Date": "on April 1, 2005",
                "Helpfulness": 0.19047619047619047,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QD3T4BYOEUTW"
                },
                "Date": "on May 23, 2000",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "In the book Coffee Will Make You Black, by April Sinclair, the lead character Jean  Stevenson, Stevie to her friends, tells in a narrative perspective of her adolescent years, growing up in Chicago in the 1960's.  The book is like Stevie's diary.  She tells you her experiences with boys,  girls, love, sex, popularity, school and racism in a comical and  to-the-point fashion.  The book is a quick, easy, fun read that hooks you  from the start.  It deals with very realistic issues that are fun and  interesting to read about.  The book makes you feel like you are part of  Stevie's chaotic life.  She gives you the opportunity to share her deepest,  darkest, secrets.  On a scale of 1 to 10, I would rate the book an 8.  I enjoyed reading it greatly, and finished it in one day.  I liked reading  it because it dealt with issues that I deal with.  It tells of Stevie's  hard times with boys, other girls, sex, love, popularity, which are all  important to me now as a freshman in high school.  It didn't take very  long to get into the book because the first page is a humorous anecdote  about a boy asking if 12 year old Stevie is a virgin.  Stevie, confused  with the meaning of virgin, goes home and asks her mamma.  The whole book  is little anecdotes like the one above so I liked it from the start.  The  book isn't very short yet the words and vocabulary are very easy and simply  written so stumbling over big words is not a problem.  Nothing very big  happens in the book, it stays rather monotone throughout.  Something I  found a little hard to understand was the slang.  Since Stevie is growing  up in the sixties in Chicago, there are bound to be differences in slang  but overall the read is easy.  It may be hard for younger people to read  this book because they might not get what some of the terms mean.  This book reminded me of many movies about teenage-hood.  Like American Pie  or Election.  I have never read another book by April Sinclair but I  enjoyed this book and will read other works by this author.  In class we  have reading groups where there are four groups of five kids and each group  reads a different book.  To decide which book to read the teacher read the  first pages of every book.  I enjoyed the first page so I signed up to read  this book.  Since the book is written from a females perspective, I think  that girls would relate and enjoy reading it more because it deals with  female issues. I can imagine a guy not understanding the complete intent of  the author.  The book is very funny so I think that the reader should have  a good sense of humor, and maybe someone that grew up in the sixties could  relate to an even greater extent.  \" What does `coffee will make you  black mean mama?'  `The old folks in the South used to tell that to  children so they wouldn't want to drink coffee.  The last thing anybody  wanted to be was black.\"'  This quote is from page 111 in the book.  I  chose this quote not only because it is obviously the line in which the  title of the book comes from, but because it also represents the feelings  about different races at the time.  I don't get why people ever thought  that darker skin made a difference.  Personally I think all racism is  ridiculous and that this quote is very interesting.  To think that back  then the children were told that in order to stay lighter they shouldn't  drink coffee is ridiculous.  It shows that back then they weren't proud of  their skin color and would do anything, like not drink coffee, to stay  lighter.  I wonder if maybe this saying was also to keep kids from just  drinking coffee.  Maybe they didn't want the children to drink too much  caffeine.  In any case being darker was the worst thing imaginable.  I hope  that this quote shows a little bit of how the book is written.  This is a  more serious moment in the book but I thought it was important.  I hope you  enjoy it as much as I did!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10SJ7CVA53BMG"
                },
                "Date": "on March 20, 2005",
                "Helpfulness": 0.18421052631578946,
                "StarRating": "1",
                "Text": "Read Craft's book instead. It's the same series of events, better written and much more interesting.  I found myself skipping the build up to Apollo 13."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2X7E64M7ECGHP"
                },
                "Date": "on September 23, 2001",
                "Helpfulness": 0.21568627450980393,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on April 10, 2000",
                "Helpfulness": 0.18181818181818182,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on April 8, 2000",
                "Helpfulness": 0.10256410256410256,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WTALTG4E1AFS"
                },
                "Date": "on May 8, 2001",
                "Helpfulness": 0.18518518518518517,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JLP11D3RI8BN"
                },
                "Date": "on January 16, 2012",
                "Helpfulness": 0.005917159763313609,
                "StarRating": "1",
                "Text": null
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Failure-Not-Option-Mission-Control/product-reviews/1439148813/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "248"
    },
    "Salesrank": "#16,781",
    "Timestamp": "2015-05-24 13:03:43.559605",
    "itemurl": "http://www.amazon.com/Failure-Not-Option-Mission-Control/dp/1439148813"
}
