{
    "Category": "in Books (",
    "ListPrice": "$72.95",
    "Name": [
        "Quantum Mechanics, Third Edition: Non-Relativistic Theory (Volume 3)"
    ],
    "OfferPrice": "$53.34",
    "Reviews": {
        "AverageStarRating": "4.3 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HHMPWS6O6S1D"
                },
                "Date": "on April 13, 2005",
                "Helpfulness": 0.9583333333333334,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D7XC7USJ9X7J"
                },
                "Date": "on July 18, 1998",
                "Helpfulness": 0.9473684210526315,
                "StarRating": "5",
                "Text": "If you study on your own (and you should!), there is no better companion. Landau's (and Lifshitz') knack for developing simultaneously the mathematics and the physics of quantum mechanics reaches here unprecedent levels. Both the theory and the applications are masterfully developed. The chapters on angular momentum, with the definitive introduction to, and application of, spinors, the study of symmetry, including a very lucid introduction to group theory, the treatment of the Thomas-Fermi atomic model, of the Periodic Table, the incredible appendix on the so-called special functions... On retrospect I realize I have been reading this book since it first appeared in English, always learning, always delighted with it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ABABZIT5EAW7"
                },
                "Date": "on July 23, 1998",
                "Helpfulness": 0.9375,
                "StarRating": "5",
                "Text": "This is the Volume 3 of the famous Course of Theoretical Physics by L. D. Landau and E. M. Lifshitz. All serious students of theoretical physics must possess the ten volumes of this excellent Course, which cover in detail and rigour practically all the branches of theoretical physics. The Volume 3 treats the subject of non-relativistic quantum mechanics. It contains a large amount of subjects, is very detailed, rigorous, and contain topics not usually found in other textbooks, such as for example the theory of symmetry, the quantum mechanics of polyatomic molecules and topics relating to the nuclear structure. It still contains a mathematical appendice on special functions used in quantum mechanics, which makes the book practically self contained. No better textbook on quantum mechanics can be recommended to the physicists. Certainly the best book of all time on quantum mechanics!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZDPQA6FLY8XM"
                },
                "Date": "on May 10, 2000",
                "Helpfulness": 0.9285714285714286,
                "StarRating": "5",
                "Text": "Landau was a great teacher. The whole series is perfectly organized and the material is divided into pieces of reasonable size which can be swallowed one after another. The reader can appreciate the beauty of every single piece of knowledge. I recommend this series especially to those  readers who already have some general knowledge of maths and physics and  who are able to study for themselves; it is also a very useful reference  for professionals. The volume on quantum mechanics has taught me a lot  about the structure of nuclei, atoms and molecules (in fact also about the  chemistry) - and also about the symmetries and the special functions  encountered in the field of quantum mechanics. Feynman's lectures on  physics are also great (albeit alternative) but the course of Landau and  Lifshitz is a standard for anyone looking for the best presentation of  physics by 1960s."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UE1QI5GJLUO3"
                },
                "Date": "on May 20, 2001",
                "Helpfulness": 0.95,
                "StarRating": "5",
                "Text": "Superb exposition. Detailed, all-encompassing & (surprise !)- deep. Pedagogically seductive, intellectually satisfying, philosophically thought provoking. A step-by-step sprawl, contains vast material not usually found in other textbooks (or, if found, clumsily presented). Being a blend of intuition and rigor, this is the book to learn Quantum Mechanics from & to revisit it when in quantum dire strait."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZTXYX8OB9DLC"
                },
                "Date": "on June 2, 2005",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I've read this book 5 years ago and still use it sometimes today.  One more time L.D. Landau tells us about how to get a firm grasp on Physics: first, learn something about more advanced mathematical methods you will need, and try to master them, then use them to derive in few pages the Physics you were used to derive, on a confused way, in lots of pages. Simply said: try to derive things from a unified point of view, with as few basic (but powerful) concepts as you can. Or, say it in a different way, use the right instruments, everytime ! I'd recommend this book to everyone who wants to gain a deeper and original understanding of the subject: you will find everything you need inside it. Some of the insights I've particularly appreciated: chapter V, VI, VII (the best treatment I've found of WKB method in QM), XVII. A good idea, if one wants to use it for a first grasp/course on QM is to use it together with another book: I'd recommend J. Sakurai, W. Greiner (vol. I+II), F. Schwabl, or S. Gasiorowicz (be careful using the latter if you're studying to be a physicist some day: Gasiorowicz can be very helpful for an introduction to basic aspects of QM, chapters 1-5, but close the book once you have finished chapter 6 !)."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IDMMCOD43EPF"
                },
                "Date": "on July 31, 2006",
                "Helpfulness": 0.88,
                "StarRating": "3",
                "Text": "I have received a 2005 printing of this, and the print quality is terrible, often unreadable in complex mathematical expressions.  I purchased some other books in this series about 10 years ago, and their print quality was fine.  So my advice is not to buy without being able to check the print quality first."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AHFSZZ78D09Q"
                },
                "Date": "on July 29, 2007",
                "Helpfulness": 0.8823529411764706,
                "StarRating": "2",
                "Text": "It is really a shame to have such a classic text with a typesetting that makes much of the mathematics almost unreadable.  For example, the authors often use either a tilde, hat (carat), and dot (period) on top of operators, sometimes in combination.  These are so badly rendered that you have to derive their identities from the context of the surrounding discussion.  Frequently parts of characters are missing as if an old typewriter with a worn ribbon were used. I have 2 other volumes in this series (Mechanics and  Statistical Physics Part 1) which do not suffer these defects.  My 2-star rating is in no way a reflection of the contents nor the authors, which get 5 stars (based on the prose and the equations I CAN read)."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AICHMMNSL40Y"
                },
                "Date": "on July 23, 2012",
                "Helpfulness": 1.0,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVD9LHU8BX5S9"
                },
                "Date": "on September 5, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16GAIJJE39T1S"
                },
                "Date": "on May 27, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 2, 2000",
                "Helpfulness": 0.7619047619047619,
                "StarRating": "5",
                "Text": "This whole series is excellent however, I must warn those of you who have little prior mathematics/physics experience--this is not for you!  For everyone else, this is a gem of a series."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A152ETX4WG80KG"
                },
                "Date": "on May 12, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Kindle version of Landau's course of theoretical physics contains many typo.  Quantum Mechanics is not an exception.  Be careful to read kindle version of this book.  Compare it with the printed version, if possible."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OVKF4TV0LTT8"
                },
                "Date": "on September 22, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The book is an excellent reference for graduate students and show the mastery of Lev Landau (Noble laureate in Physics). It is a very good way to learn quantum mechanics. The only down side is that it is not very explanatory."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18IB4U61JD9E0"
                },
                "Date": "on October 4, 2009",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "4",
                "Text": "I like all Landau books, but in quantum mechanics I'd rather see more Bras and kets than wave functions."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QRBZLXHHBYSM"
                },
                "Date": "on November 13, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Wow, Landaus' book is just amazing.  A great read.  His whole series is just fabulous.  I have read most of his books and have to admit that Russian physics is well outstanding because of this."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LJ0CIC4CPENU"
                },
                "Date": "on August 24, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AD35PEERXX9QF"
                },
                "Date": "on November 19, 2010",
                "Helpfulness": 0.625,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CE0YDVMBZCRI"
                },
                "Date": "on January 31, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Why pay $150+ for Griffiths when Landau & Lifshitz is just $40."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEL6WC6H451UJ"
                },
                "Date": "on October 5, 2008",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "This is a great book to reference if you already have some mastery of Quantum Mechanics.  Does not who any math, but has many illustrating and difficult examples."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3USBRPM7TMR1D"
                },
                "Date": "on July 27, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "All fine.  No problem."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38NSWK7MEWOUE"
                },
                "Date": "on March 6, 2008",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "If one wants to understand Quantum Mechanics then she or he should read this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2X91FMHWWQQG4"
                },
                "Date": "on November 7, 2013",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": "The equations in this text are unreadable in the Kindle edition.  They look like they were made with Microsoft Word equation editor in 1997.  Furthermore, there are several equations with absurd mistakes, \"In particular, the operator f^{-3} is called the inverse...\".  Oh, REALLY?  These must surely be transcription errors, not in the print version of this classic text.  Don't buy the kindle edition."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30996U3WGNTUK"
                },
                "Date": "on March 16, 2007",
                "Helpfulness": 0.16666666666666666,
                "StarRating": "5",
                "Text": "There are no words to express the amazing clarity of this book.  I came across it at the library.  I only have a passing interest in science but, despite the high level at which this book was written, this book helped me understand that there are things in this world called electrons that don't have a velocity or a path in the classical sense.  It also helped me to understand that there is something about looking that creates a bigger uncertainty in the thing you want to see the closer you try to see it.  When I die, I'll be one of the few that truly understood this amazing physics of our world thanks to this book.  I cannot understand the whole book, but that is not the fault of the book.  It is written for very specialized individuals thinking on a very high level.  Some examples are included, but I suspect they are unnecessary as the exposition is superb.  It is truly a work of art."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2B3C6AIRZCHZZ"
                },
                "Date": "on May 15, 2013",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": null
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Quantum-Mechanics-Third-Non-Relativistic-Theory/product-reviews/0750635398/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "25"
    },
    "Salesrank": "#70,198",
    "Timestamp": "2015-05-24 13:06:56.728428",
    "itemurl": "http://www.amazon.com/Quantum-Mechanics-Third-Non-Relativistic-Theory/dp/0750635398"
}
