{
    "Category": "in Books (",
    "ListPrice": "",
    "Name": [
        "Schaum's Outline of Physics for Engineering and Science"
    ],
    "OfferPrice": "",
    "Reviews": {
        "AverageStarRating": "2.8 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2V4VW1HR0KQ2V"
                },
                "Date": "on January 16, 2005",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 28, 2000",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "I taught calculus-based physics to undergraduates, and I recommended this book to my students as a study aid.  The solved problems are an excellent tool for learning.  Very useful book."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 23, 2000",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "3",
                "Text": "This book contains interesting problems and the author seems to know his Physics. However, the book appears to not have been proof read, or perhaps the author is expecting students to find the errors and perhaps inform him of them. The problem with this is that most students are using a book of this sort to help them understand physics. But when the answers cannot be relied upon to be correct, the student must know the subject as well as the instructor to easily catch them. Hours of confusion can result for the beginner. Some of the errors are unforgiveable. On page 42, equations 4-6, the velocity y-component and x-components are reversed. Worse and more subtle poblems occur. The author states on page 45 that a projectle launch at a 45 degree angle results in the missle range being twice the maximum height of the projectle.(true) Then, in problem 4.5 at the chapters end, he attempts to prove the angle is 63.4 degrees.(an error)In general the errors are too numerious to easily list in this kind of forum. This book should have been cleaned up before it was released to the public. I wish you well!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 5, 2000",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "Although this book was very helpful as a supplement to my college engineering physics course, Browne makes several mathematical errors in his practice problems.  I recommend buying the book because it's a huge help in understanding calculus based physics, but be on the lookout for the errors in the answers.  There are usually at least 2-3 per chapter."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13136X9MIJ2TC"
                },
                "Date": "on September 21, 2002",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AHFSZZ78D09Q"
                },
                "Date": "on November 26, 2005",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "1",
                "Text": "The exposition is fairly engaging, and the problems are interesting.  However, the answers to many are clearly wrong.  For example, in SP 14.14 on pg 179, one can easily see that the answer given is not even dimensionally correct.  I would estimate 10% of the problems have incorrect answers.  I stopped reading after chapter 14.  Too much time is wasted on such problems, only to find YOUR answer WAS correct.  I doubt the book was ever proof-read; any physics graduate student worth his/her salt would have caught these errors."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LNUVQCDEBIGF"
                },
                "Date": "on April 17, 2007",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2E3F04ZK7FG66"
                },
                "Date": "on December 24, 2005",
                "Helpfulness": 0.7777777777777778,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1O85G7TQJB7R7"
                },
                "Date": "on November 8, 2003",
                "Helpfulness": 0.75,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17NE6IEPBU65M"
                },
                "Date": "on March 8, 2006",
                "Helpfulness": 0.8,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18LQJDD7PPRKZ"
                },
                "Date": "on April 16, 2007",
                "Helpfulness": 0.8,
                "StarRating": "2",
                "Text": "I'm just an engineering student, so what do I know?  Well, I will tell you this much: there are a lot of errors in this book.  Someone else wrote a review that said these errors are a good way to learn.  This person was also a practicing physicist!  I'm still learning and I don't leave much room for interpretation when something is incorrect. I automatically assume I'm wrong because I'm still learning.  This is overkill, but there are a LOT of errors so don't throw caution to the wind.  This book also explicitly states that you should understand some \"obvious\" things.  If I did, I'd stick with my textbook!  Not completely useless, but can be frustrating."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18SLTQZNAH8MW"
                },
                "Date": "on September 26, 2005",
                "Helpfulness": 0.8,
                "StarRating": "1",
                "Text": "As other people have stated, this book has many errors in every chapter. Not just with the solutions to problems but also in some of the equations and ideas. How can you learn from a book when you can't trust what the author is saying?"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29YC6QSXSPPKV"
                },
                "Date": "on May 24, 2005",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OVBORF8VES9Q"
                },
                "Date": "on November 4, 2007",
                "Helpfulness": 0.75,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XCWB0PYNQDZF"
                },
                "Date": "on September 30, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book is great. It helps you understand difficult topics in such an easy and quick way. It gives you lots of practice problems and solutions to each one. They help you solve problems the easy way."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 21, 2003",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "Do not be fooled by those who declare that there are errors in this book.  I have worked through many Schaum's books and am yet to find an error; however, because of the extreme complexity of some physics problems, it may seem that there are errors in the text.  Every time this happens, I get really technical and eventually find the solution to match the solution given in the book exactly.  The Schaum's series is very easy to read and understand, but a certain amount of patience is required."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OVXAYW75B2WN"
                },
                "Date": "on June 29, 2013",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AGKA7EAI1WEY"
                },
                "Date": "on April 9, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AN8UQ2NAVZ1E"
                },
                "Date": "on May 28, 2009",
                "Helpfulness": 0.5,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28HVJGDDG5STN"
                },
                "Date": "on June 1, 2008",
                "Helpfulness": 0.5,
                "StarRating": "1",
                "Text": "The book was engaging in the fact that in presented challenging problems and helped the reader work through them but by chapter 10 I just couldn't take all the errors and had to put it down.  There are numerous misprints for example problem 5.8 They set the problem up correctly but then clearly wrote the wrong answer (56,000 x 0.05 is not 2300).  They misprint the number 34 with a 134 in problem 5.12 but then solve correctly, 5.17 they subtract m2g from m2a incorrectly but the next line reverse it.  problem 5.19 when taking the derivitive of a sin they write the answer as sin, but the next line change it to cos.  This is all very confusing if you are just learning the material, and the mistakes are everywhere.  It becomes very time consuming to check and recheck answers just to find the book was wrong.  This is the first schaum's outline I bought and will not buy another."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NFFDNXRM7YEW"
                },
                "Date": "on December 18, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I first saw this book in the library, and went on amazon to purchase this book for my personal reference. this book has helped me in school."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3B3D10S3SHYFF"
                },
                "Date": "on January 6, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "this book helped me a lot.  i have to say it cleared up a lot of confusing things and gave good examples"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JYGIYL1YHRCL"
                },
                "Date": "on January 10, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Fast shipping and the best prices. thank you.."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20QDTMH73U5F7"
                },
                "Date": "on May 13, 2015",
                "Helpfulness": "",
                "StarRating": "1",
                "Text": "not easier"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AU5OLJ1F8XHTD"
                },
                "Date": "on December 3, 2010",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": "I know this book is intended for review and brushing up on concepts and/or extra practice problems. But the actual material in the book was so broad it bordered on being incorrect at times. The conceptual sections were worthless. And the questions were extremely easy, not great for studying, if that's why you're looking... don't get it."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Schaums-Outline-Physics-Engineering-Science/product-reviews/007008498X/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "25"
    },
    "Salesrank": "#344,589",
    "Timestamp": "2015-05-24 13:34:09.463776",
    "itemurl": "http://www.amazon.com/Schaums-Outline-Physics-Engineering-Science/dp/007008498X"
}
