{
    "Category": "in Books (",
    "ListPrice": "$41.95",
    "Name": [
        "Physics and the Art of Dance: Understanding Movement"
    ],
    "OfferPrice": "$35.64",
    "Reviews": {
        "AverageStarRating": "5.0 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TIL1PC2ZE97B"
                },
                "Date": "on November 20, 2005",
                "Helpfulness": 0.9473684210526315,
                "StarRating": "5",
                "Text": "The question of how a knowledge of the science behind the movement of the human body helps students of dance learn to dance better is always discussed.  Like the author, I too am both a physicist and a ballet dancer.  I have found that the most important thing to learn in ballet is the imagery that works for you, and sometimes science can actually get in the way.  Take walking for example:  if we had to analyze ever movement in walking we would never be able to move.  I should also point out that science still does not thoroughly understand walking, let alone dancing!  Still, it is helpful in some places to understand, at least a little, what is happening in a movement or static pose.  This book does a surprisingly fine job of covering most of the pertinent topics and some topics you would not have thought of asking about.  I liked the fact that the author does not over simplify some topics, which is often done in elementary explanations.  Science usually tries to abstract and simplify in order to explain phenomena, but this can lead to problems.  Take, for example, the case of static balance on a point.  If you approximate the human body as a rigid body, it is impossible to explain stable equilibrium on a point.  Rigid bodies can only achieve unstable equilibrium over a point.  But human beings are not rigid!  In ballet, we can achieve stable balance over a point for an indefinite period of time(it is very difficult and rarely seen in performance but often in ballet class).  This book actually mentions this and explains how it is done.  It even includes a discussion of how much a cushioned floor will reduce shock to the dancer's joints.  Many illustrations and photos are also included.  This is the best book available on this subject, and for those who want to explore this topic further, this is the best place to start."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2S3TYL7I859F8"
                },
                "Date": "on October 27, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIZ4DGNYW1WZN"
                },
                "Date": "on May 23, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I bought this book for my home schooling, ballet-dancing daughter. She is actually learning the principles of physics without complaint because she can relate the science and mathematics with practical application. She is 14 yrs old and grasping concepts on a college level."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GPXW8F4CREFY"
                },
                "Date": "on May 8, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book made a great gift for our daughter who is a member of her college dance company.  We gave it to her following completion of her first college year.  She loves the book and it has become part of her reference library."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VDPUYSE8FMIE"
                },
                "Date": "on May 25, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "As a physics professor and one who discusses sports, I find Laws book beautifully written, very well thought out, and beautifully illustrated.  It is a fun read and informative."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A150Z6UBEGBGL1"
                },
                "Date": "on September 14, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "clear"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVVJF1LPKZ44D"
                },
                "Date": "on August 5, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Super"
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Physics-Art-Dance-Understanding-Movement/product-reviews/0195341015/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "7"
    },
    "Salesrank": "#741,178",
    "Timestamp": "2015-05-24 13:02:12.220660",
    "itemurl": "http://www.amazon.com/Physics-Art-Dance-Understanding-Movement/dp/0195341015"
}
