{
    "Category": "in Books (",
    "ListPrice": "",
    "Name": [
        "Physics for Scientists and Engineers: Vol. 2: Electricity and Magnetism, Light (Physics, for Scientists & Engineers, Chapters 22-35)"
    ],
    "OfferPrice": "$5.49",
    "Reviews": {
        "AverageStarRating": "4.1 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EEBE82C3HYRD"
                },
                "Date": "on March 11, 2003",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 19, 2003",
                "Helpfulness": 0.875,
                "StarRating": "2",
                "Text": "The Tiper physics textbook, while excellent for an engineering student, lacks much of the theoretical rigor desireable in a physics curriculum. A great many of the problems at the end of the chapter prove to be remarkably simple, and boil down to hunting through the book for the right constants and the right equation to plug into to find the answer. Actual problem solving skills are not developed for a physicist. The chapters on circuits, while excellent for electrical engineering majors, are almost a waste of time for a physics major. Even though the textbook is very thorough with what it teaches, it does not teach at a very high level nor does it prepare physics majors for more difficult future classes. Having used the Kleppner and Kolenkow Introduction to Mechanics textbook for Intro. to Classical Mechanics, shifting gears to something as trivial in difficulty as the Tippler for Electrostatics just leads to frustration over spending more time finding the right constant than actually solving the problem."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADQU1Q6VKWN42"
                },
                "Date": "on April 23, 2000",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Any physics textbook would be a good one in the hands of great teachers. However, without a teacher, Tipler's physics probably will not be the good choice. His way of thinking physics has a very unique personal  characteristic: simple sentence contains deep meanings but does not have  clue to follow. Yes, it is an introductory text, but an introductory text  should, I think, explains concepts in a way that is easy for others to read  and understand. It should not confuse the naive physics majors but to help  them make the basic ideas more clear and familiar. In an advanced point of  view, his texts are excellent because the ideas require a considerable  amount of thinking. It might have been a great intro. physics series if the  sentenses are more concise and \"elementary\"!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2T1A688IYIK98"
                },
                "Date": "on October 18, 2000",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": "I am a Physics major who finished my classical physics sequence and Tipler's volume of Classical Physics text is fantastic. Volume 2 focuses on Electricity, Magnetism, and Light.  The text is clear, the problems are great. The biggest advantage to this text is its format.  It has great pictures and amazing examples.  Here is what makes Tipler's text in my mind better than Serway or H&R.  There are numberous examples reflecting the problems set on the end of the chapter.  many of these examples also are \"try it yourself\" examples, which has suggestions on one column, and the equations on one. Every example Tipler spells out the concept in words and puts the equation next to it. This builds on problem solving techniques, the hardest part of beginning and learning the introductory physics discipline.  Other things worthy of note for TIpler is his subtle references to Modern Physics, indicating more is on the way in terms of the way we understand the universe. Overall, Tipler is fantastic.  I highly reccomend his textbooks, He even has a Modern Physics text is the best in its class like his classical physics text. (remember a good book is never a substitute for a good teacher)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TR0IGUGPYEEY"
                },
                "Date": "on November 28, 1999",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "I use both H&R and Tipler side by side.  Tipler's explanations can be very valuable in H&R's shorter moments but H&R has the upper hand in Light and Magnetism.  Tipler's approach in this area is simply not deep  enough and leaves the reader unable to answer many basic questions.  However, the illustrations are elegant and useful which make this book  worth considering for any reference shelf."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 10, 2003",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book is incredably clear and well-written. The illustrations are beautiful and the sample problems are illuminating. It's especially good for developing an intuitive understanding of the basic physics equations, without making the kind of committment the Feynman Lectures demand. I thought it was excellent preparation for the MCAT as well."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38UMAAXHSU2S8"
                },
                "Date": "on January 13, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "First of all, i use Tipler physics books as a supplement for extra practice for my ap physics class. This means that i don't really read the explanarions in the chapters, but rather go straight to the problems. Having glanced over some explanations, i feel tipler does explain the concepts well with very good pictures that illustrate the ideas. My favorite are the worked out problems in the sections, because i found they helped me familiarize myself with the type of math involved and generally just what to do. Also, in the back of the book, for the answers to problems, they also show which \"sample problems\" they refer to, which is really hepful. Only flaw I could find is that there should be more explanations of the steps rather than just showing the steps."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4XY53BW3TPLP"
                },
                "Date": "on November 3, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A FINE BOOK FOR UNDERGRAD PHYSICS"
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Physics-Scientists-Engineers-Electricity-Magnetism/product-reviews/1572594926/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "8"
    },
    "Salesrank": "#904,948",
    "Timestamp": "2015-05-24 12:59:07.158936",
    "itemurl": "http://www.amazon.com/Physics-Scientists-Engineers-Electricity-Magnetism/dp/1572594926"
}
