{
    "Category": "in Books (",
    "ListPrice": "",
    "Name": [
        "The Non-Local Universe: The New Physics and Matters of the Mind"
    ],
    "OfferPrice": "$19.99",
    "Reviews": {
        "AverageStarRating": "3.7 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A251DDT8LWEKYR"
                },
                "Date": "on July 7, 2000",
                "Helpfulness": 0.9305555555555556,
                "StarRating": "5",
                "Text": "Non-locality and quantum entanglement are neither delicate nor rare  events. Quantum non-locality is not rare and does not disappear. The  Universe operates according to the principles of complementarity at all  scales - Kafatos and Nadeau established the particulars of this verity with  extraordinary adroitness in their watershed book \"The Conscious  Universe.\" The concept of non-locality as an implicate attribute of  the material world is borne out by three pieces of impeccably documented  science which are only now becoming generally known. Nicolas Gisin and his  colleagues at CERN proved that Bell's predictions regarding non-locality  were precisely correct. The positron-electron pairs they separated with a  Potassium Niobate crystal and shunted through 15 kilometers of fiber optic  cable, automatically re-oriented spin and polarity instantaneously to  maintain net-spin values of zero when one of the particle-pair was  accelerated through an electromagnetic field, to seven decimal points, in  repeated trials. The effective rate at which the information transfer  occurred between the particles is calculated to be at least 10 to the nine  times faster than the speed of light. Second, Vladimir Poponin has  demonstrated in his work with the DNA Phantom Effect that every molecule of  DNA exerts a non-local field effect on the material locale surrounding it,  which persists for up to 30 days after the DNA molecule source has been  removed. The importance of Poponin's work is that it proves unequivocally  that among living organisms, non-locality operates simultaneously with  chemo-synaptic neuronal processes at all scales and in all living things.  Finally, Donald Eigler's work at IBM's Almaden Lab's proves that non-local  holographic field effects operate in all things as an intrinsic attribute  of matter at atomic and sub-atomic scales, regardless of whether the  materials are organic or not. In \"The Non-Local Universe,\"  Kafatos has simply opened the lid to this Pandora's box by providing an  epistemological model which is carefully thought out, clearly articulated  and reasonably constructed. His model is absolutely right on the mark and  deserves to be read by anyone who is willing to look at this aggregation of  unimpeachable evidence with clear scientific detachment."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SDE0S9G6Y1JD"
                },
                "Date": "on November 28, 2000",
                "Helpfulness": 0.9333333333333333,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A180Q8A4K4KVER"
                },
                "Date": "on September 22, 2000",
                "Helpfulness": 0.9166666666666666,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1V46T5BBOGQR9"
                },
                "Date": "on July 20, 2001",
                "Helpfulness": 0.8421052631578947,
                "StarRating": "4",
                "Text": "I am not a scientist.  I have never read clearer explanations than in this book about the Michelson-Morley experiements, or the Double-Slit experiment, or Bohr's atom, or finally, the concept of non-locality.  If you are a fan of Michio Kaku, or John Gribbin, or Brian Greene, et. al., and if you are patient and work hard, you will love this book.  But the authors, unlike Gribbin and Greene, do unfortunatly use the proverbial turgid prose.  They never use a one-syllable word when a four syllable word will do.  They would be an English teacher's nightmare.  I could easily see them describing a \"cow\" as a \"lactating bovine mammal.\"  In the end, though, their ability to teach is so strong, their exposition (if not their prose) is so clear, I highly recommend this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A223XFO9YC9VX4"
                },
                "Date": "on April 4, 2000",
                "Helpfulness": 0.7804878048780488,
                "StarRating": "4",
                "Text": "This book is far superior to such popularizations as \"The Tao of Physics.\"  It is clearly written, is not tendentious, and modest in its proposals.  What is really refreshing is their sticking so closely to a  really realistic epistemology.  Their essay into the way a complementary  approach illumines other areas of science as well is again careful, modest  and convincing.  For one who IS a metaphysician it is refreshing to see  they do NOT make moves in that direction but stay within the limits of  their own discipline."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3B6QWY2BG1WMN"
                },
                "Date": "on December 8, 2008",
                "Helpfulness": 0.8125,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7UMC95YCRGTS"
                },
                "Date": "on January 12, 2001",
                "Helpfulness": 0.7894736842105263,
                "StarRating": "5",
                "Text": "Enticing and most suggestive work connecting the recent 1997 empirical confirmation of nonlocality suggested by Bell's theorem, and the realm of both biology and postmodernism. The author's begin by suggesting the classical problem of Cartesian dualism is to be resolved by this new view of mind in relation to physics. While there is certainly a gateway to a new perspective on this tragic division, it is not clear how the broader confusions of ethics and values can enter either the classical or postclassical views of physical systems, yet the basic insight seems fruitful indeed on the way to a new synthesis. The book weighs in with Bohr's Copenhagen perspective resolving the long debate with Einstein. The book then proceeds to a provocative consideration of the limitations of current Darwinian theory, still enmeshed in the classical paradigm, concluding with a hope this new unification will help to heal the two cultures divide. I am always left to wonder quizzically at renewed hopes of finally bridging the Cartesian divide, for the problem is in part one of false terminology, and the lack of self-perception, more than self-division. The great Indian 'metaphysics' of Samkhya never had this problem because instead of two entities, it had three, all material. The division of mind and matter is a confusion of terms, and thus not open to solution by physics, a most debatable point itself, to be sure. None of this really negates the very fruitful connection now shown between mind and physical reality demonstrated in the new physics. Excellent book, one way or the other. May be read Kant also. Cf. also, Quantum Reality, Nick Herbert The Ghost in the Adam, P.C.W. Davies Appearance and Reality, Peter Kosso Quantum Dialogue, Martha Besser"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DA6TWWPYU8IR"
                },
                "Date": "on December 29, 1999",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "If you are not careful this wonderful book will Bohr you to death with CI, but The Non-Local Universe explains very well, the well traveled paths of new science. Thank goodness for the Undivided Universe and thinkers like  David Bohm, B.J. Hiley as well Jack Sarfatti exploiting the potentials of  nonlocality.  These new frontier thinkers have scouted a universe that will  allow Nadeau and Kafatos to expand on the very fine work recorded in this  book.  The matters of spirit are in this book and the authors bravely  respect the connectivity of this massless domain to the manifestations of  participative science, religion and mind.  In this book you cannot miss the  concept, time came before creation and the emergence unfolding in this  whole undivided process was guided by a wonderful observer. The good news  is this book is very informative, accurate and expandable. When the  insights of Bohm are fully unfolded in the next addition we will have  discovered the potential of the wheel once more.  This is a must read!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AP1VZAQVYTONB"
                },
                "Date": "on November 29, 1999",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "Absolutely brilliant. One of the best written and most enthralling books on physics, history, and the philosophy of science. A must read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13M2RYJ4DGQB3"
                },
                "Date": "on January 19, 2000",
                "Helpfulness": 0.6842105263157895,
                "StarRating": "1",
                "Text": "Unfortunately this book propagates the same  misinformation as many other bad science books such as \"The Tao of Physics.\"  These books make a big deal about the nonlocality of quantum physics and about quantum  entanglement and the experiments that have proved quantum entanglement. All  of this is true. Unfortunately they mislead through omission.  Nonlocality  and quantum entanglement are very delicate and very rare events.  A  physicist doing an experiment has to work very hard to keep a quantum  entangled system separate from the rest of the universe. Once the system  interacts with the rest of the universe, the quantum entanglement vanishes.  This is a well-known fact that all first year physics grad students learn.  (I should know, I'm a physics professor.)  So the whole conceit of the book  is wrong.  While quantum nonlocality does occur, it is actually very rare  and disappears quickly--this is experimentally verified as well--and so the  notion of a totally connected universe is a lie and a cheat."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14HFU0L07YVHY"
                },
                "Date": "on November 30, 2006",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book describes the new physics of quantum entanglement and how human consciousness can emerge along with the natural world from the indefinite existence of quantum particles.  The intimate collective of all life on earth is described and how evolution proceeds more from cooperation than from competition.  The book ends with a description of the danger faced by the environment from pollution.  The magician can come to understand how her/his own consciousness is integrated in the totality of life on earth, the collective of human experience, and the fabric of spacetime."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14YUS9BRI0MMK"
                },
                "Date": "on November 26, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QEF8DJVMP00W"
                },
                "Date": "on November 4, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DPARBUJQKJ2A"
                },
                "Date": "on June 11, 2013",
                "Helpfulness": 0.6,
                "StarRating": "1",
                "Text": "I was really looking forward to the book but found it immensely disappointing.  The writing is impenetrable.  It reads more like a PhD thesis written by someone who is impressed with his/her own knowledge, than a book designed to be accessible to the layman.  To make sense of this book you will have to have read and be familiar with a range of philosophers and philosophies.  For example, you'll find sentences such as: \"...The modes were identified with labels such as ... Lacanian psychoanalytic theory, Marxist criticism, Afrocentrism, ... Latourian sociology.\"  This is just not very informative to the casual reader. I have advanced degrees in technology and frankly, found this book mind numbingly uninformative.  Investigate Nick Herbert or Brian Greene if you are interested in non-locality.  If you enjoy philosophy and have a good grounding in it, by all means, have at it!  Others have found this book exciting, but I think if you're investigating quantum non-locality and come from a technical background, this is not the book for you, unless you have insomnia, in which case it might be perfect."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OQFWWW8KP18T"
                },
                "Date": "on April 11, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "An important book that I am glad to have read! It is tough going in places, and gets somewhat disorganized later. I skimmed sme and didn't understand some, but I think it is about as clear as the subject permits."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1D1P9JQKWW8N"
                },
                "Date": "on October 31, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent all the way around. I would buy from them again. Very satisfied overall."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CUOE5BBJY2F"
                },
                "Date": "on March 9, 2000",
                "Helpfulness": 0.6304347826086957,
                "StarRating": "5",
                "Text": "The peculiar thing about skeptics of non-local consciousness is that they fail to mention the experiments which verify the human's minds connectivity to quantum events. It's well known that sub-atomic particles react  differently when viewed by human consciousness and do so even through time.  So there is a direct link between the mind and so called \"material  reality\". Those who claim otherwise haven't researched the realm of  quantum physics or are frightened or put off by it's almost  \"mystical\" like quality. Everything is made of atoms which in  turn are made of sub-atomic particles which in turn just happened to be  affected by human consciousness. To proclaim that the mind and reality are  seperate is absurd since the mind affects the foundations of reality."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJXNKF84FIKT2"
                },
                "Date": "on October 25, 2014",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": "Consistently confusing while evading clarification, could easily be misunderstood and at times I thought that was the author's intent."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on August 24, 2002",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XH9KTKRND03G"
                },
                "Date": "on March 20, 2000",
                "Helpfulness": 0.3888888888888889,
                "StarRating": "4",
                "Text": "Robert Nadeau does a good job stating the case for non-locality. However, at the end of the day, locality and non-locality are simply points of view. You can priviledge one only by marginalizing the other (like setting up your experiment to see a particle or a wave). I hope that proponents of the  local reality point of view are not suggesting John Stewart Bell, author of  the mathematical proof for non-locality, was a liar and a cheat."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 27, 2000",
                "Helpfulness": 0.4,
                "StarRating": "5",
                "Text": "In the absence of a close-ended, conclusive (and ultimately supersymmetric), causal proof of the existence of matter independent of the consciousness which would (and is trying to) observe it, it seems premature  to presuppose there is one: yet this is the presupposition that has  remained absent of proof.  Why? The non-existence of matter a priori, fills  in the \"explanatory gap\" and parts company with the Freudian  paradigm. Recent research from an interdepartmental centre in a Roman  university also demonstrates new experimental evidence for (non-)locality  and quantum theory. For anyone more interested in truth-finding than  truth-seeking, \"The End of Time\" by Julian Barbour (typo  corrected paperback from amazon in the UK), and \"The End of  Science\" by John Horgan are a pair that come to mind."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23V9MQWIQ1D90"
                },
                "Date": "on February 28, 2011",
                "Helpfulness": 0.14285714285714285,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AO8UURFVSDI9H"
                },
                "Date": "on December 15, 2001",
                "Helpfulness": 0.16666666666666666,
                "StarRating": "1",
                "Text": null
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Non-Local-Universe-Physics-Matters-Mind/product-reviews/0195144082/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "23"
    },
    "Salesrank": "#899,837",
    "Timestamp": "2015-05-24 13:13:46.877382",
    "itemurl": "http://www.amazon.com/Non-Local-Universe-Physics-Matters-Mind/dp/0195144082"
}
