{
    "Category": "in Books (",
    "ListPrice": "",
    "Name": [
        "Relativity: The Special and General Theory (Dover Books on Physics)"
    ],
    "OfferPrice": "$9.95",
    "Reviews": {
        "AverageStarRating": "3.9 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WB7712KRT758"
                },
                "Date": "on March 10, 2000",
                "Helpfulness": 0.9699248120300752,
                "StarRating": "5",
                "Text": "There is no doubt that Albert Einstein has been one of the most brilliant minds of the past century. His major contribution to science was the special and the general theory of relativity, which gave a new dimension to  that we call today \"Modern Physics\". Many people feel frustrated because  when they try to understand relativity, they find some authors that expound  in their books a complex arrangement of equations referring to the  mathematical part of the theory, namely, the books are accessible for  people with certain levels of knowledge (that is the case of engineers,  physicists, mathematicians, among others). Nevertheless, perceiving and  anticipating this situation, Albert Einstein wrote this book (more than  fifty years ago) whit the purpose of exposing the special and the general  theory of relativity in such a way that anyone can understand it. I this  sense, I think, Einstein succeeded because despite the shortness of the  book, the same covers the most important aspects of relativity in a clear  and concise form. Moreover, the book has appendixes where the author makes  reference to some interesting subjects like the problem of space and  relativity, the experimental confirmation of the theory, to name a few. If  you have decided to learn something about relativity, and you do not have  vast knowledge in physics and mathematics, I sincerely recommend you this  book. On the other hand, if you were a reader looking for more technical  information (mathematical foundation of general relativity), I would choose  the book \"Gravitation\" written by Misner, Wheeler y Thorne. This text  represents an encyclopedia about general relativity."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2D7UY7BJ3OPFE"
                },
                "Date": "on November 2, 2010",
                "Helpfulness": 0.9501915708812261,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D7XC7USJ9X7J"
                },
                "Date": "on December 24, 2001",
                "Helpfulness": 0.9680851063829787,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 20, 1999",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "The reviewer of April 13 from Moscow, Idaho says this is not the book to read unless you already understand the theory.  Maybe fair enough.  It was written when Einstein had achieved youthful fame, though, not in his  dotage, if he had such a thing. It may be a little more difficult for the  translation, but not much.  Contrary to some reviewers, it is not that easy  to follow, and if it seems like an easy read, you probably haven't  understood it.  There are many books written since where it is probably  easier to learn about special relativity, to say nothing of the basic ideas  of general relativity.  But once you have started to get the hang of  things, this book is a masterpiece of exposition!  It allows one to follow  Einstein's actual thought process in arriving at these theories -- pretty  much by a process of pure thought -- more or less in the steps he probably  took himself.  There is not a word in the exposition that was not carefully  thought out. So, learn the theory somewhere else and then read this book --  you'll understand the theory better for reading Einstein's book -- or read  this book first, keep going back to it 'til it starts to make sense, and  maybe consult some other, more \"user-friendly\" textbook at the  same time.  Einstein claims his book allows a lay reader with only high  school math to understand relativity.  To which a friend of mine replied  \"Yeah, if you have an IQ of 800\".  To which I say, have patience,  keep thinking about it and going back to it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2583AWDHMMWY2"
                },
                "Date": "on September 25, 2010",
                "Helpfulness": 0.967741935483871,
                "StarRating": "1",
                "Text": "Do not buy the copy of this book with ISBN 978-1452841212 !!! You have been warned! The equations which are set out as images (ie any that require more than simple typesetting) have not been printed, and the text just shows the file name instead eg. eq1.gif. I can't believe that they're selling this book! The other copies are ok from what I have seen on the preview pages."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CG09GKHGVW22"
                },
                "Date": "on February 21, 2001",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMQPWUQ5Y6I9H"
                },
                "Date": "on February 27, 2000",
                "Helpfulness": 0.9259259259259259,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2W8L0BA7I7Z1R"
                },
                "Date": "on December 6, 2000",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UQGI34WCUPH4"
                },
                "Date": "on May 6, 2002",
                "Helpfulness": 0.9444444444444444,
                "StarRating": "4",
                "Text": "While reading the reviews I noticed something.  The special case was considered well written, while the general theory was considered difficult to follow.  There is a simple explanation to this, Leopold Infeld (protege of Einstein's) helped in the rewriting of the Special Case, his English was much more fluent than that of Einstein.  Infeld was also a superb teacher, as such he had a fluency and a rhythm with words that is easy to follow.  I highly recommend any of Einstein's writings but also caution you as to his readability... On the other hand Einstein recognized this and coauthored with Infeld, (or rewrote with him previous writings), as such I highly recommend that you get those books coauthored or written by Leopold Infeld."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Y7EDZE7EU055"
                },
                "Date": "on March 9, 2001",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DWG10K1FHL37"
                },
                "Date": "on February 20, 2002",
                "Helpfulness": 0.9285714285714286,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SFTMZMKZ4IT"
                },
                "Date": "on July 22, 2006",
                "Helpfulness": 0.9285714285714286,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VYU5IAMTJ3R7"
                },
                "Date": "on August 19, 2006",
                "Helpfulness": 0.9230769230769231,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35OEZZJIM22U9"
                },
                "Date": "on August 10, 2007",
                "Helpfulness": 0.8157894736842105,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AW07SB2RZ7GNK"
                },
                "Date": "on April 29, 2000",
                "Helpfulness": 0.9230769230769231,
                "StarRating": "4",
                "Text": "This book, written by Albert Einstein, is about the concept that changed our approach to physics and to the universe.  This book requires a lot from a reader, in which the reader will probably have to reread passages all over again to grasp the math behind this theory. The math isn't difficult,  it's understanding how it leads to the theory that requires a lot of  thinking.  I would recommend this book to anyone interested in the theory  of relativity from Einstein's approach. However the reader should have a  minimum of understanding of the theory before attempting to read this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A106TZO4J5G1WQ"
                },
                "Date": "on October 26, 2010",
                "Helpfulness": 1.0,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Y5ERIKQBEMSP"
                },
                "Date": "on August 24, 2005",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HGJJIDED7AP6"
                },
                "Date": "on May 1, 2003",
                "Helpfulness": 0.85,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KJO5VP4K3CHU"
                },
                "Date": "on June 12, 2010",
                "Helpfulness": 0.9,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 3, 1998",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book is truly a scientific gem. Not only did the brilliant Einstein envision the theory of relativity, but he also felt compelled to inform non-scientists by writing this \"less\" technical explanation of his theory. The book's section on Special Relativity is not too difficult to grasp. However, having some basic understanding of algebra and classical mechanics is helpful. On the other hand, the section on General Relativity is quite profound, requiring the reader to imagine new concepts of space and time that are alien to one's sense of reality. Indeed, I had to read this section several times and I'm still not sure if I completely understand it. However, this is more of a function of my imagination skills rather than Einstein's literary abilities. For he uses an abundance of familiar terms and analogies to simplify the understanding of some of the more \"unusual\" implications of General Relativity. I would not recommend this book to someone averse to technical subjects. However, I do recommend it to those wishing to learn the basics of relativity theory."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36LABGIH4PIV4"
                },
                "Date": "on January 20, 2004",
                "Helpfulness": 0.9,
                "StarRating": "4",
                "Text": "I've used this book with my high school students - very slow going. You can definitely understand the issues involved in relativity, even as a layman, from reading this book, but THIS IS NOT AN EASY READ! A mature, dedicated reader will get through this book. I'm proud of my high school students for struggling through this book, but readers at that age mostly do not have the intensity to really appreciate it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38DDM9FUAF4H1"
                },
                "Date": "on January 21, 2009",
                "Helpfulness": 0.9,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on December 23, 2002",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OPVE2YYXZF4V"
                },
                "Date": "on December 22, 1999",
                "Helpfulness": 0.8461538461538461,
                "StarRating": "4",
                "Text": "Einstein's theory of relativity is still about the only advanced science theory that I am able to fully understand. His book is the Bible of Relativity, unfortunately like the Bible it is a bit difficult to understand because he is not very fluent in English and although correct he  uses words which we modern English speaking people are not familiar with.  He is so long and drawn out that one often loses concentration and forgets  the start of a topic before getting to the end. This is why I took off one  star. If I were to rate Einsteins genius  as a ten, then Hawking and others would be a one!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARKL8PLBDB4T5"
                },
                "Date": "on February 7, 2012",
                "Helpfulness": 1.0,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FTI86WAVJOLG"
                },
                "Date": "on February 6, 2008",
                "Helpfulness": 0.8461538461538461,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DVHA0H3E08SL"
                },
                "Date": "on November 2, 2011",
                "Helpfulness": 1.0,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATLYOQPZMT0JM"
                },
                "Date": "on July 7, 2011",
                "Helpfulness": 0.875,
                "StarRating": "1",
                "Text": "In the free Kindle version, equations and diagrams are non-visible gifs. Waste of time to download and try to read text without them (at least in my reference frame).  The $0.99 Kindle version has the equations and diagrams in a quite readable form.  I don't know why Amazon even lists the free version; all it does is frustrate."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32HEH9BZ1B0KY"
                },
                "Date": "on November 28, 2004",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11PK1S08IPLOA"
                },
                "Date": "on May 23, 2007",
                "Helpfulness": 0.75,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2O2SSXRYBVTX3"
                },
                "Date": "on January 4, 2005",
                "Helpfulness": 0.8,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VXVH4P85N73K"
                },
                "Date": "on March 16, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3U72YGMJKXP0K"
                },
                "Date": "on November 27, 2004",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A309EHJNLF8ORQ"
                },
                "Date": "on December 29, 2002",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A194SLMDCUR9C4"
                },
                "Date": "on September 17, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Einstein wrote the papers contained in this short book around 1920. I was actually looking for a more mathematical exposition on these subjects, especially on General Relativity. There is almost no mathematics in this book. However, I was very pleased with it, because the explanations are so clear and easily understood. Einstein hits the mark on teaching the basics underlying his phenomenal theories, and, according to him, he leads us through this exploration in the same order in which he himself conducted his investigations. If you want to find out more about these subjects, you won't be disappointed in this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3I3G6MGH20DWD"
                },
                "Date": "on January 5, 2007",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 20, 2003",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "How better to learn and appreciate Einsteins theory's of relativity than from his own words.  I read this book senior year of Highschool and found it quite engaging.  There are some mathmatical prerequisites for understanding everything, but nothing that should keep anyone from understanding.  These were the theories that changed the view of the universe and should be known by a wider base of people."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GF1VLA3UMAPJ"
                },
                "Date": "on March 27, 2005",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "PROFESSOR EINSTEIN PRESENTS HIS THEORY IN A VERY STRAIGHTFORWARD DISCUSSION, USING SIMPLE GEOMETRIC ANALOGIES, QUITE CONDUCIVE TO UNDERSTANDING THE BASIC CONCEPTS. HE LEAVES NO \"GAPS\" IN HIS STEP-BY-STEP EXPLANATION OF THIS OTHERWISE-INTIMIDATING THEORY. I BELIEVE A CHILD CAN  NATURALLY UNDERSTAND SOME OF IT BECAUSE OF HIS PATIENT AND CLEAR PRESENTATION. THIS KIND GENIUS SENT ME HIS BOOK IN 1951, AUTOGRAPHED AND WITH A LETTER TO ME AT AGE 17. HE DID, HOWEVER, SAY THAT THE BOOK IS NOT SIMPLE. TOO OFTEN WE ARE AFRAID TO OPEN OR BUY A BOOK BECAUSE THE SUBJECT SOUNDS SCARY. A FINE BOOK FOR YOUNG OR OLD AND A REAL CONFIDENCE-BUILDER. YOU MAY BE SURPRISED AT WHAT YOU LEARN AND UNDERSTAND!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AE8XLOF8HH3XC"
                },
                "Date": "on September 1, 2007",
                "Helpfulness": 0.7692307692307693,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HLSPVXTVU08E"
                },
                "Date": "on December 28, 2012",
                "Helpfulness": 1.0,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YW7GNAAZE8WA"
                },
                "Date": "on January 13, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Appendix 4 & 5 are missing!!! The book's copyright has expired, it is available on project Gutenberg for free. The only part still subject to copyright is appendix 5, that Einstein added at a later date. This edition is missing both appendix 4 and 5."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KJO5VP4K3CHU"
                },
                "Date": "on September 18, 2007",
                "Helpfulness": 0.8,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HJL230IVQXI2"
                },
                "Date": "on August 15, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "If you are interested in understanding the basic concepts of Relativity Theory, even if you have little mathematical background, then read this book. If you are a student or technical person that wants more of a \"plain text\" supplement to a technical course or presentation, then read this book. I read it many, many years ago when I was 14, and it had a profound effect on my outlook from that point onward. I labored over several topics sometimes for a week, but then, I was 14! When I finally finished it - I read it again! My point is that the text is well written, the concepts are at times a bit difficult to grasp, but the explanations are very understandable, and if you understand basic algebra, then what little math there is - a few equations essentially - will be quite clear. The main reason I even suggest the algebra is to better understand the relationships expressed within those equations. Bottom line - it is an excellent and \"gentle\" introduction to relativity and definitely worth reading! Enjoy."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on April 14, 1999",
                "Helpfulness": 0.7777777777777778,
                "StarRating": "2",
                "Text": "I hate to be the only one to not give the book \"5 stars\", but this is simply not the best book to buy if you want to learn the theory of relativity.  The book is certainly worthwhile if you want something simply  because it was written by Einstein, but God bless him, the old guy just  couldn't put the idea accross as well as many modern authors.  Maybe  something is just lost in the translation, I don't know..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1J93EGDYK0IWA"
                },
                "Date": "on October 21, 2006",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "5",
                "Text": "Interestingly, Einstein wrote the most lucid and easy to understand explanation of relativity theory.  It is concise and it hits the mark!  I don't know of any better explanation of relativity theory than by the man who created it.  This is a masterpiece!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACBD7PZ3UTD2W"
                },
                "Date": "on December 24, 2012",
                "Helpfulness": 0.8,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on November 27, 1998",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "The author of the theory of relitivity offers a clear explination of this complicated concept.All mathematical and technical aspects were clearly defined.Anyone interested and attentive could easily understand this  book.Although short in length,it requires the reader to ingest the  information slowly in order to obtain its full value.I would not recommend  this book to anyone who has not graduated high school."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1A6150D9550E5"
                },
                "Date": "on March 28, 2014",
                "Helpfulness": 1.0,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39ITQZHDEQ3XV"
                },
                "Date": "on August 19, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "In this book, Einstein is able to move you through his patterns of thought  in the most elegant way. he has the ability to make a complicated and  difficult physical theory, flow like water in to your brain. reading this  book gave me insight into our world and the mind of a great man. Read this  book if you enjoy thinking."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARM7DXCA11ZY9"
                },
                "Date": "on February 22, 2011",
                "Helpfulness": 0.8,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3380CVF8HOBJ0"
                },
                "Date": "on November 17, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I've just read the comments about the typos / translation issues, and went back to check my copy (2011 reprint, blue night sky cover). All the typing seems OK and I can't find any typos in it, all seems OK. This edition isn't available as a Kindle so probably a different publisher."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6QMY5WPTVAT1"
                },
                "Date": "on March 7, 2015",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IY2BPPI3WCN"
                },
                "Date": "on December 17, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LBGP1WX1X6HR"
                },
                "Date": "on May 29, 2014",
                "Helpfulness": 1.0,
                "StarRating": "1",
                "Text": "On a really dense and complicated book such as this one, a single paragraph missing could make it really hard do understand. But I found that pages 97, 98 and 99 are simply missing. I have tried to read it from both cloud reader and iPhone, and the same content is missing."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DDA8Q3NWT0BC"
                },
                "Date": "on October 23, 2012",
                "Helpfulness": 0.8,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1O6SDKKJWKQS6"
                },
                "Date": "on July 4, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Actually, it's easier to understand than you might think.  The math is minimal and very straight forward.  The intro by Nigel Calder is neat reading in itself.  If you don't want to wade into the gory details, this is a great overview written by the man himself."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 29, 1998",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "What can you say about einstein's relativity? well a lot.  Einstein spearheaded the revolution of physics with his annus miribalis (1905) papers.  You can't study physics without reading this book and taking in  its profound effect on the universe as we know it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARCBN66BE3YOE"
                },
                "Date": "on March 4, 2000",
                "Helpfulness": 0.8,
                "StarRating": "4",
                "Text": "This is a very interesting book. Time is required to make some sense of the issues in the book, but if you're reading this review you're probably interested enough in making time. Time, time and more time. I would have liked it if there was more mathematics in the explanations. If you are not  mathematically minded this is a good read."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on January 21, 1999",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "An interesting and in-depth view of relativity.  A slight mathematics background is very helpful with understanding some of the equations.  The concept is clear and well articulated.  It leaves you wanting a deeper  knowledge of physics and Einstein."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 27, 1999",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "The ideas may be hard to comprehend at times, but this work illuminates the real genius of Albert Einstein.  If for nothing else this read allows you to get into the mind of a genius and see how he thinks.  Definately  worth while."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WJXUWSXCJ98T"
                },
                "Date": "on November 7, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1P0ZB4YAA312R"
                },
                "Date": "on November 28, 2002",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A242ZU36MIXTXW"
                },
                "Date": "on December 16, 2014",
                "Helpfulness": 1.0,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ES2Y39C3OQKF"
                },
                "Date": "on September 29, 2012",
                "Helpfulness": 1.0,
                "StarRating": "1",
                "Text": "Often the text is difficult or impossible to read. In some of the equations, entire variables are illegible. A different edition would probably be a better choice."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BYRMAKG4GNCO"
                },
                "Date": "on December 6, 2006",
                "Helpfulness": 0.7272727272727273,
                "StarRating": "3",
                "Text": "This edition (three Rivers press) has quite a few typographical errors in the equations (for example: page 46 footnote, page 43 error in equation, page 50 error in equation). This detracts from Einstein's beautiful, clear writing. The newer Routledge edition fixes all the errors."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HGJJIDED7AP6"
                },
                "Date": "on May 1, 2003",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FHAMLNGHCFU7"
                },
                "Date": "on May 10, 2006",
                "Helpfulness": 0.7,
                "StarRating": "4",
                "Text": "I have rated this book four stars, not because I feel that it is well above average but not spectacular, as that would normally indicate, but because I do not feel qualified to rate it and wish to have as little effect on its average rating as possible. I am a reasonably intelligent, reasonably well-educated individual with a good facility for numbers. Still, this book was well over my head. If you're planning a career in Mathematics or Physics, this book is probably necessary to your education, but unless you're truly brilliant, don't be surprised if you need qualified instruction to understand it. But if you're simply an intelligent, curious individual with a desire to comprehend Einstein's theories, don't be surprised if you can't make hash of this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACYTP9FX05C8H"
                },
                "Date": "on December 7, 2005",
                "Helpfulness": 0.6923076923076923,
                "StarRating": "2",
                "Text": "Even though this book is marketed (and meant) as an accessible exposition of relativity theory, with the considerable advantage of being by Einstein himself, it is not as easy to read as the presentation may imply. Einstein says in his introduction that his reasoning will demand no more than high-school knowledge of the relevant subjects. Maybe this was true in his time, but nowadays the book demands way more than that. I'm myself a grad student in the field of literature and I simply couldn't follow the presumably basic mathematical demonstrations Einstein relies upon to make his points. Some concepts are also less than obvious for the non-specialist ('galilean coordinates'?). This is not to say that the book itself is not good, but that it is targeted at a readership which is not necessarily trained enough to benefit from it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26F1657YRE5TZ"
                },
                "Date": "on March 28, 2015",
                "Helpfulness": 1.0,
                "StarRating": "2",
                "Text": "I'm only 20 pages in, but I've already encountered numerous misprints and flawed phrasing. Considering the nature of the subject of this book, anything other than precision will only compound any sense of confusion, or lack of understanding. I'm sure there are other books much more apt to explain Einstein's theories. I'm not sure who edited this book, but it is awful, and a near waste of money. I would not recommend this book to others."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30E1NNKCPPZPQ"
                },
                "Date": "on June 5, 2007",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "This is a good, concise exposition of general and special relativity from the man who wrote the book. However, it will be above the heads of some... If you're interested in reading this book, I'd suggest looking for it in the library to see if it's really the book for you.  Or even browse the text in a bookstore before you buy.  If you think you'll need a course in Calculus, find a review of the theories that you can follow."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on November 5, 2002",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book was written beautifly! I would reccomend this book to anyone interested in relativity. Now, this book is a lot easier to understand than many other books on this same subject, but this book is difficult and does require some patience and concentration. Einstein writes this with a voice that entices the reader. This book is an absolute must have for anyone even remotely curious about relativity."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMIF43X0Z1AME"
                },
                "Date": "on October 27, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Even if you only wanted to know more about Einstein, this is an excellent read. I read indepth for understanding and learning for my reading pleasure. This book offers a very interesting insight to history. I purchased this after several CBC broadcast (Ideas) of Albert Einstein and found him so interesting that I wanted to learn more about his theories and what led him to his conclusions."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RY0XPYQPYNYJ"
                },
                "Date": "on September 12, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I like very much this book because it is a classic of the Physics, a bestseller indeed!. IAlthough I'm not an specialist  about the theme, I can submerged into the original ideas of Professor Einstein and his collegues and the steps they followed to construct such an amazing Theory. I hope someday (why not) to understand the whole thing! It is a book to have it for sure."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2C0UBF85AUQC6"
                },
                "Date": "on December 15, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "It was good to read the theories by Einstein. Admittedly, I had to reread things more than once to grasp their concept, but I am not a physicist. He does a great job attempting to explain with everyday examples. If you are a casual fan of physics and the like, I would recommend this book for you."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Y6C3S2U890I0"
                },
                "Date": "on December 1, 2012",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "... you already have a backgroundof studying the two theories.  I do not think this is the place to start for total novices."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PAGGH9T3EBT5"
                },
                "Date": "on October 24, 2012",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "I have had earlier (free) e-versions of this book but the all lacked the illustrations and equations. The 99¢ was well worth it. You can trust that Einstein didn't short change the reader when he dumbed it down for those of us that don't know differential geometry and other high falutin' math."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KE3JBO3KQX2O"
                },
                "Date": "on May 28, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AF3X7J0XC391L"
                },
                "Date": "on January 20, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Lawson's translation of Einstein's description of his theory of relativity is still the primary translation as far as this reviewer is concerned.  It is clear and well-presented.  This one is difficult to find but well worth the search for anyone interested in the special and general theories of relativity from Einstein himself."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14L9HJHMWBTJ8"
                },
                "Date": "on January 30, 2015",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1K5HQ1ULNXJ83"
                },
                "Date": "on May 20, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "The book is nice review of past events, however it should have contained the relavant equations with the backstory. There is a need to explore in the general science population the general theory equations, I believe an oppurtunity lost for this book. It is a good read however, enjoyable."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANAZKD6Q0Q61Z"
                },
                "Date": "on July 12, 2007",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "This is a very short book and is quick reading.  I have read other books with better explainations of relativity.  I didn't like the writing style --  it was translated by an Englishman in the early 20th century so the sentence structure doesn't flow like normal reading."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on January 29, 2002",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "This book is great for those who are interested in the Theory of Relativity without getting involved too much in the mathamatical aspect.  It is written very well, and shows that Einstein was capable of writing a piece that is easy for just about anyone to understand."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FDB5ZMVJYANF"
                },
                "Date": "on July 28, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "This is a good book. It did annoy me that while reading he writes \"like was discussed in section XXVI\", It would have been easier to read, for me, if he could just write out the name of the section. I recommend this to anyone who is interested in is topic."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYD34LZ0MO4WX"
                },
                "Date": "on April 20, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OJW07GQRNJUT"
                },
                "Date": "on June 9, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OJW07GQRNJUT"
                },
                "Date": "on June 9, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JG5E0N4984ZC"
                },
                "Date": "on November 25, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This was one of the first Kindle downloads I purchased. This particular book is an easy, calm read that honestly can be understood by most. Very entertaining and informative at the very basic level of understanding. Go for it!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on August 10, 1998",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book takes what could arguably be deemed the most influential work ever and makes it accesable to everyone.  It is as if this is really the book the creator wanted to write most and belived in the most.  HIGHLY RECOMENDED"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PE2FA0BVY8AW"
                },
                "Date": "on November 8, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AC1OJJ9WJCTV7"
                },
                "Date": "on March 18, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "While a certain few individuals can appreciate this area of interest this book is well and simply explained for the matter discussed it uses very little math and does a good job with a difficult subject."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29YLZB4JPK4U0"
                },
                "Date": "on January 22, 2000",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "The book written by Albert Einstein himself totally explains The Special and General Theory of Relativaty. It is entertaining to the physist with a phd., the student of physisc and the common reader."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 22, 1998",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This capital work of one of the most brillant scientist of the 20th century is written in this way that every high-school student can understand the base of Relativity. A must-have book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AG8JQ1BK8TKBM"
                },
                "Date": "on August 11, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "After reading books by Hawking, Kaku, Greene, and others on the topic, none are more lucid as Einstein himself in describing relativity to the non-physicist."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25TKXP6U37JEO"
                },
                "Date": "on July 30, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36JRQJZ0PZEKT"
                },
                "Date": "on June 14, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Very cool read that for me was enjoyable. Of course I spend most of my career launching missiles and rockets....so it was fun for me."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VL60MRJ1N1AN"
                },
                "Date": "on June 13, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "was in near perfect condition. cannot wait to start reading it. from what ive skimmed through so far seems like a pretty easy read"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKJ84PRQQC7E1"
                },
                "Date": "on February 22, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Relativity 101, by The Master.  Very readable, in fact a pretty fast read.  And there's magic in reading Einstein's own words.  But you probably won't get much out of it unless you've got a basic understanding of classic (i.e. Newtonian) physics, e.g. action/reaction, inertia of rest/motion, gravity, etc., and high-school level math (fairly simple algebra, incl square roots but not quadratic equations).  But that's not asking a lot.  With that you'll get through Special Relativity OK.  (Although weeks later you may find yourself thinking, \"Now run it by me again how the Speed of Light relates to billiard balls, and how in heck Mr. Einstein figured that out?  Guess I need to reread it.\")  General Relatively is a trickier kettle of fish, which took A.E. an additional decade to come up with.  YMMV, w/r/to understanding that (having read Hawking's \"Time\" helps).  I highly recommend this book, in any case."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JRO3FON1SXB2"
                },
                "Date": "on May 30, 2011",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "This was really great reading. I explained the theory in layman's terms. I highly recommend it for students and adults alike."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FA9M6LQN50LA"
                },
                "Date": "on May 5, 2015",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A234KUM064EGHL"
                },
                "Date": "on March 17, 2009",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is relativity explained by Einstein himself, without using math.  There might have been a plain English explanation that is slightly more crisp, however, would you not want to read it from the master himself?  The special relativity section is especially clear, and detailed.  Almost all the important ideas were explained well there.  The section on general relativity is rather brief, and gives you the sense that it is just a flavor, not the full story.  Yet it gives you enough to be very interested.  The English translation from German could be better, but it really does not make it inexplicable.  Those who complain that the translation could not be understood probably would not understand the book even if it is translated better.  All in all, I would recommend reading it after some other exposition on the subject.  After that, this is an excellent piece of food for thought."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGMKFWUQEEZUQ"
                },
                "Date": "on December 31, 2001",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A123DJBI3YE8I0"
                },
                "Date": "on May 17, 2015",
                "Helpfulness": "",
                "StarRating": "1",
                "Text": "What Einstein wrote is awesome - but this version of the book by Emporum Publishing (brown cover with sketch of Einstein) is incredibly frustrating to read.  They obviously used optical character recognition (OCR) and then disgustingly failed to proof it for the hundreds of errors that exist.  Obvious typos are throughout the book.  The formulas throughout the book have errors due to the failure of the OCR to accurately pick up subscripts and super scripts and faithfully reconstruct the formula.  Commas and periods are helplessly swapped and make the sentences confused and frustrating to follow.  How any publisher can live with themselves after such disrespect to the author is beyond understanding.  And then to do it to such a great man is disturbing.  Don't buy from Emporum Publishing!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YNRYKCI5VBAY"
                },
                "Date": "on September 3, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "It seems as if at least two or three books are published every year to explain the concepts of special and general relativity to the public. I haven't encountered another one as good as this. Contrary to widespread misconception, Albert Einstein was not an exceptionally expert mathematician. His justly deserved fame rests on the fact that he had an incredible intuition for physics, and a willingness to think the unthinkable whenever that seemed to be where the physics led. So it's not surprising that he could explain both the concepts of special relativity and those of general relativity in clear, simple language suitable for the non-technical reader. The result is a masterpiece, especially the discussion of general relativity."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39ZULR3VVKJHG"
                },
                "Date": "on December 30, 2001",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book is probably the best place to start in understanding the theory that revolutionized science. It is lucid enough for practically anyone to understand. I should know, I'm still in junior high school and I understand it. Einstein conveyed the nature of his own genius into a prose that clearly explained nearly all there is to know on the basis of modern physics. The Cosmological Supplement was, in my opinion, the most interesting part. Natural science is an amazing branch of knowledge and some even say that physics is defined as the only true science. I reccommend this book to all readers who are interested in Einstein's work and even those who don't have a clue. It is all just basic science."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on May 12, 1999",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "Though the book maybe was not a linguistically correct, the theory is.  Einstein's theory has been tested and retested hundreds of times in the past eighty years and it has never once failed yet.  Also, time and not  just the clock, run slower as the observer speeds up.  Experiments  performed with atomic clocks; one being on earth and the other flown on a  rocket ship show that.  Each clock uses the same radiactive element that  has a known decay rate.  The one that is flown on a rocket or spaceship is  space runs slower than the one on earth, in other words the element decays  slower than the one on earth."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1870A8UO9PHI4"
                },
                "Date": "on August 28, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is a great classic book - fun to try to follow Einstein's logic and find that you don't have to be a genius to do so - just stubborn and willing to re-read sections that don't stick the first time. That says something about his intellect and the essential simplicity of the marvelous design of our universe.  However it was aggravating though that the \"readable equations\" mentioned in the title of this kindle edition are practically UNreadable due to the use of a ridiculously comparatively small font with which they are presented.  Very poor editing creates a nuisance for the reader who is otherwise greatly enjoying the voice of Einstein the teacher"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XJI13JNZXNMZ"
                },
                "Date": "on January 6, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I am researching Einstein's special theory of relativity basis and this book by Einstien provides more of a complete set of information. I am aware that Einstein's world view was different as his view of the cosmos was much smaller. In his day technology had not developed to view the cosmos and find trillions of Galaxies. They thought many of the sparking were stars; but in reality they were whole galaxies. With that view he projected other theories about space travel that were in error. Thus, one should examine his special theory of relativity as well. Dr. Ronald Cutburth, Management of engineering science operations, Engineering Scientist."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A157FOVSYCNC94"
                },
                "Date": "on January 5, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is truly an amazing book. The clarity and simplicity with which one of the greatest mind of all ages presents his theories is astounding, almost as astounding as the theories themselves. Since I've done quite a bit of reading and thinking about particle physics in the past few years, I felt confident that I could tackle this text .I  discovered that Einstein made that task so much easier with his simple yet profound explanations. I could kick myself in the ass for not having read this earlier. A must read for anyone interested in physics and the world around us that is free from a lot of superstitious nonsense."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KSN77RILJCB6"
                },
                "Date": "on March 19, 2012",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATB6XG8PA9LVB"
                },
                "Date": "on November 23, 2010",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "1",
                "Text": "I have an old copy of this book with different publisher and would like to buy a new copy as a gift for my brother. When I got the book, I am so disappointed with its printing quality. The font sizes are different in different pages, and some of the lines in the letters are just not visible. Instead of giving my brother the new book, I would rather giving my copy even though I has already written all over it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34MIFFGKD2E1H"
                },
                "Date": "on November 4, 2009",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31MKAPX8WMVN8"
                },
                "Date": "on March 27, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Well, it’s a classic, so I won’t venture any comments about the content itself (when you buy such a book, you are perfectly aware of what is to be expected; though I’m curious what the translation is worth). What surprised me in a positive manner was the readability of the equations. Even the more complex ones are clearly visible—there are no deciphering troubles with the subscripts and superscripts. I’ve read some excerpts from this book some time ago and now I’m glad I have the opportunity to read the whole thing."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HC34DZE5A864"
                },
                "Date": "on January 9, 2007",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "4",
                "Text": "Long on my list of must-reads, I finally got this for myself. After hearing a lifetime of comments and reviews about these theories, it is a good thing to go straight to the source. The roots of relativity are suprisingly simple and may be understood through the thought experiments described within. It is also enjoyable to try to decipher Einstein's personality a bit by reading between the lines."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LMYXJ7O9R2HL"
                },
                "Date": "on March 25, 2014",
                "Helpfulness": "",
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on November 5, 2002",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book was written beautifly! I would reccomend this book to anyone interested in relativity. Now, this book is a lot easier to understand than many other books on this same subject, but this book is difficult and does require some patience and concentration. Einstein writes this with a voice that entices the reader. This book is an absolute must have for anyone even remotely curious about relativity."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on September 1, 1998",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6GBAJ02EM32V"
                },
                "Date": "on March 15, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "There is no way to simplify the strikingly complex, but when taken in, this truth starts to consume you.  The harsh reality of Einstein is that his simplest idea is way out beyond my already stretched out head!  But the brain, even one as dull as mine, is a remarkable gift, let your mental skiff drift into these waters, see if they don't start a hunger in your life, it is, after all, a big ocean?"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3K6AS016FPLQG"
                },
                "Date": "on July 31, 2010",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Caveat - The equations are written in a very small font and thus on the kindle edition are next to impossible to read.  I should indicate that I'm reading on a Driod.  Thus, readers using other viewers might not have a problem.  If it were possible to zoom into the equations, this would not be an issue, but as far as I can tell on the driod you can't zoom in."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13MR8MBGYCIAT"
                },
                "Date": "on June 16, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "Although the basic concepts of relativity and space-time are nicely illustrated in the early parts of the essay, I personally struggled toward the end as he delves into more detail.  I would recommend this book as a starter for anyone interested in pursuing the difficult understand of the theories of relativity as this rather short white-paper deals with the subject in a very concise, straightforward presentation.  I will probably go one step further now and read a more contemporary presentation of his theories (facts)."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A208NX07SBW228"
                },
                "Date": "on June 13, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A352I41THL9WMT"
                },
                "Date": "on May 22, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Who is this guy Einstein???  I think he might be onto something... I wish I had paid attention in my college physics book..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATYY74AGWM8K0"
                },
                "Date": "on April 7, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Can't get any more authentic than the Master's Words directly.  Surprisingly coherent examples used by Einstein to put his theories into understandable concepts."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NPMRL08B0A64"
                },
                "Date": "on April 4, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KMXKTLPS41LR"
                },
                "Date": "on March 25, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I am an engineer rather than a physicist. I read the book because I was curious about how Einstein would write. I have read through the book once. I was amazed by his logic. I had read that Einstein did only thought experiments. I was amazed at his ability to put physical significance to Lorentz's equations. I will be rereading the book!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JSVOATN4O06N"
                },
                "Date": "on March 22, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NJTZEQ75NT9O"
                },
                "Date": "on March 3, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Good book, haven't read it all, but jus skimming through it, I've liked it thus far. Besides it wasn't expensive"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UAA2BH8YDXKW"
                },
                "Date": "on November 11, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This is the real deal, if you are a theoretical physics junkie this is your one stop shop.I hope to re-read it and fully understand the theory later on."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1130F4HNWMJMX"
                },
                "Date": "on November 8, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "It shows in simple terms why it is what it is. Simple thought experiments lead you to the inevitable result."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EBSKTFEBFL65"
                },
                "Date": "on May 19, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This gives a very interesting description of how I suspect Dr. Einstein viewed the world while trying to solve one of the most difficult scientific mysteries of all time.  Truely fascinating."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CO6YKJ92948A"
                },
                "Date": "on May 4, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "lots of examples and the kind of thought problems Einstein used to create the theory.  tough reading at times but worth it.  this is an explanation of the math that changed the world."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EVA0TGJQZMKC"
                },
                "Date": "on April 29, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Einstein's way of looking at the problem is of interest, but sometimes hard to follow.  He has very great imagination."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3S9RAMX7BTAES"
                },
                "Date": "on November 7, 2012",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": "Languge used to explain his case difficult to understand in the extreme. Following the mathematics very difficult. This book written for scientists and mathematicians."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GAWY78F0BSHV"
                },
                "Date": "on October 20, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I had some difficulty understanding this book but finished it in awe of the man.  He was doing his work with his mind alone and did not have even one physical thing to use as proof."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZN3FYL2OQSAL"
                },
                "Date": "on October 6, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "What is there about reading a book which represents a true innovation in theoretical physics? This book is as fascinating now as it was when I first read it decades ago. I must admit that this tome is not everyone's cup of tea, but if you have any interest in physics or history as it retains to science then this is the one for you."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AX4VCNTBAZ7A9"
                },
                "Date": "on October 6, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4FFCNYGUUKLU"
                },
                "Date": "on March 21, 2014",
                "Helpfulness": "",
                "StarRating": "1",
                "Text": "This is just a copy and paste printing of the public domain portion of the actual published book.  No appendixes. No translator information.  No publisher address information.  No copyright information.  This book is completely useless as a reference in your own writings because there is no way to reference it in a bibliography."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 9, 2004",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "What better person to here about relativity than Einstein himself?  This is a great book for anyone interested in relativity.  I do have one problem with this book--it's a crappy translation, even taking into account the fact that it was written in the dialect of Great Britain.  The language is too lugubrious for my taste."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UD4NMOX5FFID"
                },
                "Date": "on May 9, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I'm using this book to inspire me and also as a blue print as I write my book on author Ernest Hemingway and my theory that he may have lived most of his life with lead poisoning. Its years in the making, but I have found this book by Einstein himself who delves into his own theory of relativity is insightful."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12VII57FDTRCD"
                },
                "Date": "on May 23, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "incredible information. takes a lot of effort to follow his train of thought to the end, but man when you start to understand his words for the deep meanings they represent, it can have a big impact. it took me 3 or 4 reads before feeling like I started to get it, so don't give up!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHSOM1DO4EIU8"
                },
                "Date": "on January 18, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Similar to \"The Principia\", by Isaac Newton, \"Relativity\", by Einstein, is way above my ability to read and comprehend (without the help of cartoons).  It's nice to have around as a reminder that humans are capable of great leaps of thought and insight."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NVCPFLU1LA4S"
                },
                "Date": "on August 27, 2013",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "1",
                "Text": "This copy of The Special and the General Theory is missing text (the author's notes), the formatting is horrific and the equations are all low quality images (pixels and anti-aliasing clearly visible)."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MQUOWPOLVYHQ"
                },
                "Date": "on October 21, 2011",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This book does a very good job giving a brief introduction to the topic especially if you have not seen it before.  However, this is only a conceptual introduction and if you want to take it to the next level you will need to follow up with something else."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VBRHLHWVPG4E"
                },
                "Date": "on June 21, 2000",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Written by Einstein himself, this book gives excellent insight into special relativity. The book doesn't cover much on general relativity though. I guess that would have meant a lot more math than he wanted to  include in this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31K4FNEZR8ZC1"
                },
                "Date": "on May 11, 2014",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": "I bought this book to try to follow the logic and the formulas.  The wording is OK but the formulas are very badly presented.  Whoever copied them did not know the difference between a subscript and a prime mark.  Don't buy it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14021CONL5KL1"
                },
                "Date": "on November 6, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The book takes you through the thought process of getting to Relativity theory in a non mathematical description and it is very readable.  It is similar to A Brief History of Time (Hawkins) in its approach to explanation."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WWKILNB5WEHO"
                },
                "Date": "on April 19, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book is interesting and uses a lot of thought experiments or conceptualizations.  Written by Einstein himself about his own theory and presented at first almost like a dialogue a Greek play between two people."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEQ4INEXNJZLV"
                },
                "Date": "on September 13, 2008",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BTJFFY5I9YSO"
                },
                "Date": "on September 5, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I finally got a chance to understand special relativity.  I am still trying to work on the general relativity. It seems denser and I probably will be spending a lot more time to understand it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A320AYS8XL3FZW"
                },
                "Date": "on August 26, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is one of the first books on my list. My goal is to take over the universe. My cousin brain just wants one planet but that's not enuf for me being the white lab coat mouse that I am."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AK9ZCNS2XR54"
                },
                "Date": "on January 17, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "My husband had been looking for this audiobook for a long time and was thrilled with it. It explains the Theory of Relativity in terms that are understandable (well, almost!)."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LEAE54VUWJU6"
                },
                "Date": "on February 11, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I understand Relativity! Not really, but this book does a great job of explaining conceptually what pertains to the topic. Would recommend this read to any thirsty mind."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYYJMDSKTYORU"
                },
                "Date": "on November 6, 2007",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This edition of Einstein's Theory of Relativity is excellent. It provides a streamlined organization of the parts of his concepts, and has tasteful and helpful styling."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25DJKHT2Y4MHZ"
                },
                "Date": "on August 25, 2003",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10993ETJGGYCS"
                },
                "Date": "on April 29, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14FK46E8WIXD1"
                },
                "Date": "on April 15, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "what's not to like about albert Einstein! a wonderful little book packed with lots of information. not always easy to understand but very great none the less."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VUE1NKBW11U6"
                },
                "Date": "on October 11, 2013",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": "I have an older copy of this book with more material in it!  What kind of book doesn't have an ISBN number and publisher info in the front matter?"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A82O8VAR4924F"
                },
                "Date": "on February 7, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "For all you epistemological warriors out there, this book is a must read.  It is approachable, down to earth, and absolutely exciting."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A178PHI2WHE8B3"
                },
                "Date": "on January 3, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Easy to understand.  I was a great opportunity to have some pictures and images to guide the reader through some of the explanations."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2P676T87J2CWX"
                },
                "Date": "on October 1, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Excellent conceptualization of the Special and General Theories with reference to the importance of Galilean/Newtonian mechanics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2A6WHPTCGWVHH"
                },
                "Date": "on March 2, 2012",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": "Einstein himself wrote a 1918 paper which is not generally discussed, and which basically agreed that parts of the special theory were contradicted by the 'twin paradox'.  The theory is pushed so hard in some quarters that any contrary thoughts are simply quashed.  The special theory, especially the thought that their is no such thing as absolute space, is, in my view, simply wrong.  Many have written on this subject, for instance the Australian, Builder, but they are ignored by establishment science, which is not science at all but rather politics, and dirty politics at that.  That is not to say the Einstein was like that, but rather those who support his theory for political reasons."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AD2871D0DKXS0"
                },
                "Date": "on February 14, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is an awesome book. Einstein describes his theory much better than any book I have read. He makes it simple and clear."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PXK9BHSMYESR"
                },
                "Date": "on February 2, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABZFR1XKO6XQT"
                },
                "Date": "on December 16, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Good Read. Definitely one of the best works. Interesting from the beginning till the very end. This is a must read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EWTYMZ1Q1JUR"
                },
                "Date": "on March 17, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "fascinating, an exquisite look into the mind of perhaps the greatest preeminent genius of the past millennium!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVY43ELUV11XB"
                },
                "Date": "on January 19, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "My grandson was so excited to receive the book and couldn't wait to show his teacher and discuss it with him.."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HGJJIDED7AP6"
                },
                "Date": "on May 1, 2003",
                "Helpfulness": 0.6,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BGI1L3170ED7"
                },
                "Date": "on May 28, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "What more can be said, it's Albert Einstein! Anyone who likes science should have this one in their top 10!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31XG71I93K5NQ"
                },
                "Date": "on December 27, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "An excellent translation!  You can almost imagine the Master explaining his ideas, personally, to you."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2I5MRFS819IGO"
                },
                "Date": "on June 4, 2013",
                "Helpfulness": 0.5,
                "StarRating": "2",
                "Text": "Einstein is giving a lecture, and with blackboard graphics.  The text is fairly easy to follow, but the graphics, ie: the formulas he uses to go along with his narrative, are in such small font that they can not be read without a magnifying glass; in many instances they are no more than a pixel blemish on the screen.  And the readability of those formulas is necessary to give understanding to his explanations.  E-books might need some upgrading before they are fully accepted by the scientific community."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HYWBCLB10TG4"
                },
                "Date": "on April 7, 2014",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30M42SOR4Z2QB"
                },
                "Date": "on August 7, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "Does a decent job of explaining the basic tenet of the relativity theory.  A good start."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PML9M10VRNOT"
                },
                "Date": "on July 27, 2014",
                "Helpfulness": "",
                "StarRating": "1",
                "Text": "The book contains the base of the Theory but nearly nothing of their construction."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A168BBPE0JGDFU"
                },
                "Date": "on November 12, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I'll need to spend some time on this, even as simple as it's supposed to be."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A170C1WRQA3HEJ"
                },
                "Date": "on December 25, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Can't do better than getting relativity from \"the horse's mouth\"."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMN71AQ68VRZW"
                },
                "Date": "on September 29, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Purchased for my 11 year old son. He is enjoying this book tremendously."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FQPMNC5XGEYZ"
                },
                "Date": "on March 12, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Amazing book... Def. recommend this to just about anyone!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29EOSD4M5WI42"
                },
                "Date": "on November 18, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "very difficult to understand.  At times I was just lost."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AONMTGS00YTK7"
                },
                "Date": "on July 8, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great book words of wisdom from the man himself"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1L5PM0IE9TIPH"
                },
                "Date": "on June 22, 2014",
                "Helpfulness": 0.5,
                "StarRating": "2",
                "Text": "I was so hopeful that this book, written supposedly for the average person, would educate me about Relativity.  I couldn't understand any of it, and I have PhD in a science!  Nice try, Einstein, but you are no Steven Hawkings."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6HW0L3DBOBZ8"
                },
                "Date": "on April 9, 2013",
                "Helpfulness": 0.5,
                "StarRating": "1",
                "Text": "The font, spacing, equations, images are completely terrible. Some equations cannot even be read. I need to buy another version from another publisher. You should not buy this unless you already hate physics..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KFQP9P7JHQOZ"
                },
                "Date": "on February 24, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Written in language anyone can understand."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24OH487BG5WLL"
                },
                "Date": "on August 12, 2013",
                "Helpfulness": 0.5,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZIA1KGOSOC27"
                },
                "Date": "on April 4, 2013",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "It was everything I expected and more..... I did, however, expect more mathematical formulas within the text but, overall, it satisfied my inquiry into a fundamental work of 20th century physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AD4KXOETYERZ4"
                },
                "Date": "on May 22, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Very clear for special relativity"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Q2I2IJSVZW9R"
                },
                "Date": "on December 10, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Straight from the horses mouth !"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AED2A2982HQFU"
                },
                "Date": "on October 5, 2013",
                "Helpfulness": 0.5,
                "StarRating": "1",
                "Text": "Very bad book quality. Full of spelling mistakes. Did the editor read that book before publication? Was it really written by Albert Eienstein himself???"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38K57PBT3IF7W"
                },
                "Date": "on June 2, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Einstein is cosmically more intelligent, then I will ever be relatively close to.  Yet dancing with that greatness improved on my own life."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AN8QIOIY0S61"
                },
                "Date": "on March 18, 2013",
                "Helpfulness": 0.5,
                "StarRating": "1",
                "Text": "The equations are illegible low res images. Crucial text is mangled. Charging $10 for this shoddy thing is a criminal act."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27DKLQ2VA7WYF"
                },
                "Date": "on January 28, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "great my daughter loves it"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACSWBXWY2KBOD"
                },
                "Date": "on May 26, 2001",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 4, 1998",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YIDXZDMWBZ3L"
                },
                "Date": "on October 26, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "excellent quality."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TW5IVY1WPL4Q"
                },
                "Date": "on December 28, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Very hard to read"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AT6AQJKPRW1P"
                },
                "Date": "on July 20, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "It is very good"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PYLT8NKRKOXS"
                },
                "Date": "on September 24, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Good Print."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26Z4KN6C60AHW"
                },
                "Date": "on March 26, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "great item"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SRPDTCEALBNE"
                },
                "Date": "on July 30, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Great book"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AN4CYF6VHGZ47"
                },
                "Date": "on February 9, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Enjoyed this book, it was not too difficult to read, it is an excellent copy. I would recommend this book to everyone."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RGD8EKOF9O3V"
                },
                "Date": "on December 21, 2012",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I have reas this several times to be sure I understand the theory  It is good exercise for the brain"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A225FSQV4HRQGF"
                },
                "Date": "on September 1, 2012",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "This is an amazing book on Albert Einstein. Not only is the text good, it keeps me going. I recommend this to historians. I loved the sample."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36HQ8KVW1FT50"
                },
                "Date": "on August 23, 2011",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Maybe I'm a retard but I just don't get the whole Quantum Physics thing.  Well this book is excellent.  It describes it well.  It is still not an easy topic but at least it's written in a way that the average person can begin to comprehend.  I strongly recommend the book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I81FQNWPI0G7"
                },
                "Date": "on May 30, 2013",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": "This entire publication is riddled with grammatical and typographical errors, a true testament to its poor editing. The writing is also nonsensical and cumbersome, possible due to poor translation or authorship. I would not recommend this reading for anyone attempting to learn more about Einstein's theory of relativity. Explore other avenues."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AY0XEYMURCEK9"
                },
                "Date": "on November 29, 2003",
                "Helpfulness": 0.5454545454545454,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A69JVFCH22PB0"
                },
                "Date": "on January 4, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "great !"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MOWQXE6YLA7C"
                },
                "Date": "on March 24, 2006",
                "Helpfulness": 0.5625,
                "StarRating": "2",
                "Text": "Attempting to understand this book, (Which Einstein claims he wrote in a way people can understand...) makes me wonder what the value of knowledge is if you can't explain it to anyone. The concepts I can understand, ONLY because I had other sources to explain them to me before buying this book. The problem is that he uses excessively long sentences which frequently jump around. More often than not, I get completely lost before the end of the sentence. Another problem is the fact that the language is somewhat flowery. (**Imagine for a second, trying to understand the topic of relativity with the indirect, flowery language that Shakespeare used---this book is not that poetic, but it's just as indirect. Physics, in general is simply not the place to be indirect, especially when attempting to explain a complicated subject in a way that's comprehensible.) He doesn't seem to make even remotely simple statements. Instead, the meanings of the sentences are watered down, and because of their excessive length (*I read a single sentence that was 6 lines in length), I get lost. I would not recommend this book to anyone other than Einstein himself, and if it is necessary for you to read this book (for school or personal accomplishment), for your own sake, keep a LARGE bottle of Asprin, and one of those ten-pound unabridged dictionaries near-by. >>Instead of this book, I would recommend \"Black Holes, Wormholes, and Time Machines\" by Jim Al-Khalili (It's very easy to understand, though covers complex topics...and I, personally, could not put it down.)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37HUD5KUS6E94"
                },
                "Date": "on January 8, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "...Einstein's own articulation of his relativity theories is as good as any other -- and better than many other -- subsequent articulations, and this book is a MUST READ for serious AND casual physics students!  READ IT, you will be glad you did!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVGX7ZHDKOGKB"
                },
                "Date": "on December 23, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZHRIB0Y7ZXM3"
                },
                "Date": "on October 7, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "good"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UX73MYPU5HQW"
                },
                "Date": "on January 19, 2006",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": "This is still an excellent intro to the subject, though some of the material is obsolete, of course. Since it was written the definition of the constant c has changed from \"velocity of light\" to \"speed of light\". Velocity includes direction and speed does not, so the \"problem\" Einstein had to address in chapter XXII no longer exists. The velocity of light changes direction due to the bending of light by gravity in General Relativity, but the speed of light, c, remains constant."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AP4ZYH4VMR5VK"
                },
                "Date": "on March 28, 2015",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "This was a reasonable presentation of the special and general theories. I am in the process of drafting my rebuttal now."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EPMMAW0EPFE4"
                },
                "Date": "on April 12, 2014",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": "Unreadable bad formating I wish I would have red the reviews. Do not buy this book. There are others that are better."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PCCQ1WJZMXJ2"
                },
                "Date": "on February 10, 2013",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "3",
                "Text": "Since my math skills are very weak I'd have done better with a book geared more toward my level of knowledge of math and science."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A130NLU86L9JHK"
                },
                "Date": "on August 10, 2009",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "The book was in perfect condition when it arrived.  I couldn't be more happy with it!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BDY15VLUOB2J"
                },
                "Date": "on February 11, 2002",
                "Helpfulness": 0.4,
                "StarRating": "3",
                "Text": "Einstein's explanation of special relativity left me feeling warm and fuzzy, but when he moved on to the general theory, things took a turn for the worse. I'll be the first to admit that a failure of information flow from Einstein to me is most likely a problem on the receiving end. However, in this case, Einstein completely left out important parts of the theory. It was as if he tried to explain a bicycle by describing the front wheel. Perhaps he felt that explaining the whole bicycle without leveraging concepts from elsewhere in physics and math was not possible. That may be true, but it doesn't change the fact that reading this book isn't going to give you a very clear understanding of the general theory of relativity."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CDB11A78ROO8"
                },
                "Date": "on July 8, 1999",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I would like to take a minute to thank Audio Scholar for abridging Relativity to audio.  I thoroughly enjoyed the abridged audio novel and was very happy that I could share it with my 18 month old son who  gets to listen to it to as one of his bedtime stories.  I would like to  encourage Audio Scholar to produce more of these types of edutainment audio  programs on tape or CD. I love listening to scientific books on  my way to work and also love to share them with my 18 month old son as his  bedtime stories.  Actually I initially started buying them for my son and  then got hooked on them myself.  Now we both get to enjoy high quality  educational entertainment!  In addition the high level of clear  announciation in the Audio Scholar work is fantastic, it really helps my  son to learn new words, concepts and the organization of the english  language.  More than he would ever obtain in normal everyday speech. I do not have time in my busy daily schedule to read very much, but do I have five  hours a day to listen and learn. If you make it I will support it. Arnold D  Veness"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BENL7BDZYTGU"
                },
                "Date": "on November 19, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I'm working my way through it."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 1, 2003",
                "Helpfulness": 0.4,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PY6KDUWDPRE8"
                },
                "Date": "on June 30, 2013",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36OXAACJNMFVP"
                },
                "Date": "on January 8, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I've been trying to read the original paper for this theme and finally i get it!!! thanks amazon for this oportunity!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2H0BSHI96ZS35"
                },
                "Date": "on January 3, 2015",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": "Not Good"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27JHIAWMKBK44"
                },
                "Date": "on January 25, 2013",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "I will try to understand this by myself. If you are not familiar with numbers and physics you must buy the For Dummies book, to understand this."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NY7HOITU4C7V"
                },
                "Date": "on December 31, 2000",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "This is a Theory that started a envolution not only in physics and math but humanity  to. Albert Einstein was so head of his times i,m very facinated by him physicist are like Magician of reality and another thing a good Physicist is a good teacher of physics. For Laymens read other scienctific books before this one like Brian Greene's The elegant universe to get the full ideal of Relativity  i dont know if i should but this down or not but go to bartleby.com to read the book for free online"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on May 21, 1999",
                "Helpfulness": 0.2,
                "StarRating": "5",
                "Text": "I was absolutly bowled over by the magnificent theorys that einstein portrayed in his study the shear magnitude of this piece of work left me quivering in my little cotton socks!i am absolutly thrilled that  you have  published this book and it has, quite frankly made my life more inriched  and compleate!Its a jolly good read and being a proffessor of quantum  Physics myself at cambridge university i can quite understand the  complexity of the theorys produced in the stunning piece of work you are  all jolly good chaps and i will be pleased if i could meet ip with the  authors at next years boat race. thank you again. best wishes to all the  boys at the boating yours faithfully Cha Cha Dimagio PhD gsa bof"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2B0F9K8FFMJQJ"
                },
                "Date": "on March 13, 2013",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "This book is a little harder to understand than the book I just read: 'Relativity, A Very Short Introduction'.  It tends to be a little boring but I don't want to criticize the genius who wrote."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38TQMAZDGZ8Z0"
                },
                "Date": "on August 1, 2013",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": "It wasn't interesting.  Maybe you have to be in the mood for intellectual babble in order to read it.  Honestly the book started to annoy me and that is why I put it down."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on May 26, 1999",
                "Helpfulness": 0.2857142857142857,
                "StarRating": "5",
                "Text": "yes you can get a bannana milkshake in this damn country so stop complaining and go and find your nearest pizza hut."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BTFDNUFPZWIL"
                },
                "Date": "on October 2, 2005",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26MBEIOCW1HAB"
                },
                "Date": "on September 18, 1999",
                "Helpfulness": 0.375,
                "StarRating": "3",
                "Text": "A great book for a person already well edjucated on the topic. The vocabulary alone will make a less edjucated reader have a dictonary beside them through the course of the book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3Q914Q6D8V6ZY"
                },
                "Date": "on March 6, 2013",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": "the synopsis mentioned that it was an easy reading for the layman!? well i read it as saying a university math skill is the format."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADJVRMSJQCPJY"
                },
                "Date": "on August 24, 2013",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": "Mr Einstein \"stole\" the formula, the full exercise and the Nobel Prize from OLINTO DE PRETTO, Italian Professor of Mathematics of the International University of Perugia who registered the full formula and exercise twice in 1902 and 1903. Don`t believe it, seek infos about this in internet.(Einstein-De Pretto)"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on August 23, 1999",
                "Helpfulness": 0.27906976744186046,
                "StarRating": "1",
                "Text": "This book is a failure. Einstein was a great scientist but a bad writer. The book is difficult, boring, and opaque to the unscientific layman.For three years I've been trying to get a book to teach me the two theories of  relativity (General and Special) and I'm always disappointed: There must be  a scientist out there who knows how to write ! Or maybe not."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on August 23, 1998",
                "Helpfulness": 0.15625,
                "StarRating": "1",
                "Text": "I believe Einstein had a language problem. As an example, please pay  attention to his demonstration of relativity of simultaneity. He mixed up  [seeing by the observer] with [occurrence at the origin]. Therefore  Einstein had no right to say that the two events did not occur  simultaneously when the observer did not [see] them simultaneously. Let us  say, we saw an explosion(A) of a star in 1998, and it was recorded that  there was another explosion (B) many years ealier. An observer on earth  could only say that he saw B earlier and A later; he could not say B  exploded earlier and A later; nor could he say B and A did not explode  simultaneously. Einstein's demonstration of his relativity of simultaneity  was therefore neither convincing nor fundimentally sound.  Einstein's  language problem could also be seen in his free switch between the words  [clock] and [time]. A clock may and can slow down, but can time slow down?  Unless we get this language problem cleared up I believe Einstein's theory  will remain controversial."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on April 3, 2000",
                "Helpfulness": 0.07692307692307693,
                "StarRating": "5",
                "Text": "His friend Bertrand Russell was too!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4J6ZABMYLANK"
                },
                "Date": "on April 26, 2007",
                "Helpfulness": 0.034482758620689655,
                "StarRating": "2",
                "Text": null
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Relativity-Special-General-Theory-Physics/product-reviews/048641714X/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "234"
    },
    "Salesrank": "#715,686",
    "Timestamp": "2015-05-24 13:31:45.905265",
    "itemurl": "http://www.amazon.com/Relativity-Special-General-Theory-Physics/dp/048641714X"
}
