{
    "Category": "in Books (",
    "ListPrice": "$18.99",
    "Name": [
        "Barron's AP Physics 1 and 2 (Barron's Ap Physics B)"
    ],
    "OfferPrice": "$14.35",
    "Reviews": {
        "AverageStarRating": "3.0 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A109SG8UJB8QDP"
                },
                "Date": "on March 8, 2015",
                "Helpfulness": 0.9090909090909091,
                "StarRating": "3",
                "Text": "From a glance, it looks like the problems reflect what AP will be producing for both Physics exams this year. I will update this review later reflecting the actual aid this book has provided me. HOWEVER, while looking over the preface and study tips in the book with my instructor, it is lacking the importance of UNCERTAINTY AND THE \"PARAGRAPH-LONG RESPONSE\"; hence my reason for only 3 stars. Unlike previous exams, uncertainty will be a VERY important part of both of the exams. For more information about the two components, go on the AP website of Physics 1. AP has produced two documents explaining what these two new components are and their significance."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2W97XWBYERR2B"
                },
                "Date": "on April 26, 2015",
                "Helpfulness": 1.0,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A305GROGLSUEXW"
                },
                "Date": "on May 4, 2015",
                "Helpfulness": 1.0,
                "StarRating": "1",
                "Text": "I bought this book just for the AP physics 1 test, and quickly reviewed all of the essential chapters. When comparing to my friends \"5 steps to 5\" book, this 'Study Book' completely skipped over essentials and provided almost no information for certain subjects, such as rotational Inertia, Angular trajectory, Voltmeters and Anemometers, and standing waves. It mentioned what these topics were, but did not help me understand any of them and expected me to already know this information. To top it off, many examples and questions in the Practice test were filled with miscalculations or straight out wrong, completely throwing out all the physics formulas learned while not explaining how they did it (One example is question 24 Pretest 1 AP 1). I strongly recommend that you don't purchase this book, and go for 5 steps to 5 or another decent brand. If you don't believe me, fine, but that'll be your loss of money when you realize how bad this book really is."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BNKOERXF8KH4"
                },
                "Date": "on May 5, 2015",
                "Helpfulness": 1.0,
                "StarRating": "2",
                "Text": "This book is actually not bad but the letter answers given for the practice tests are often incorrect.  The answer description is correct but it doesn't match up with the letter selected.  If you understand physics it is easy to see the wrong letter is given, but for those trying to make sure they understand it is highly confusing.  I'll be reluctant to buy ANY Barron's book again as they do not seem to have any sort of errata out correcting the problems."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3B4M1B6256ESM"
                },
                "Date": "on May 6, 2015",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "I brought both Barron and Princeton for my AP Physics 1. I think that Barron did much better in the new Physics 1 after taking the test. At least it's not a rehashing of Physics B book like Princeton. It seems that most of the Free-Response questions are easier in the real test except for the experiment. But you should notice that there are some errors in the practice."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2C3ZAS8PIFFJD"
                },
                "Date": "on April 30, 2015",
                "Helpfulness": 0.75,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SV4G0H6T6G5"
                },
                "Date": "on April 9, 2015",
                "Helpfulness": 0.75,
                "StarRating": "1",
                "Text": "The solution explanations skip important steps, the terminology is strange and the way the equations are messed around with to come up with an answer are typically far too unnecessary. Like in kinematics, typical equations are fine, but the book uses all sorts of weird stuff that just makes things more confusing."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIWXXYVNQHVSU"
                },
                "Date": "on April 4, 2015",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A203EKJSAZRO48"
                },
                "Date": "on May 21, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Good book, but there are some errors in answers."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASSG5DT7VBY6S"
                },
                "Date": "on April 13, 2015",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "the book is great so far, as i expected"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKII7KJK1OX93"
                },
                "Date": "on April 20, 2015",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": "Daughter likes this book!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOMFVMHZCRHGM"
                },
                "Date": "on April 1, 2015",
                "Helpfulness": 0.25,
                "StarRating": "2",
                "Text": "I use it for self-study AP physics 1 and 2. However, there are many calculate mistakes and typo in the book. Some of the conception lack of explanation. I try to connect to the publisher, but failed."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1M9J9QWHM4CYN"
                },
                "Date": "on March 30, 2015",
                "Helpfulness": 0.2,
                "StarRating": "5",
                "Text": "very helpful"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1V0IC98XZ4VKB"
                },
                "Date": "on March 2, 2015",
                "Helpfulness": 0.3684210526315789,
                "StarRating": "2",
                "Text": "According to this book, Electric Fields are covered in AP Physics 1. I believe this is incorrect. What other mistakes are in there? I have only had it for 2 days"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3M486REKJWHQX"
                },
                "Date": "on March 20, 2015",
                "Helpfulness": 0.14285714285714285,
                "StarRating": "5",
                "Text": "Exactly what my daughter needed for class!"
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Barrons-AP-Physics-Ap/product-reviews/1438002688/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "15"
    },
    "Salesrank": "#12,581",
    "Timestamp": "2015-05-24 12:25:01.295491",
    "itemurl": "http://www.amazon.com/Barrons-AP-Physics-Ap/dp/1438002688"
}
