{
    "Category": "in Books (",
    "ListPrice": "$19.95",
    "Name": [
        "Atomic Physics: 8th Edition (Dover Books on Physics)"
    ],
    "OfferPrice": "$15.80",
    "Reviews": {
        "AverageStarRating": "4.9 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D7XC7USJ9X7J"
                },
                "Date": "on July 23, 1998",
                "Helpfulness": 0.9722222222222222,
                "StarRating": "5",
                "Text": "Max Born was one of the fathers of quantum mechanics, a great physicist and a cultivated gentleman. His \"Atomic Physics\" has been around since a long time, but is still the best place to find out why do we really need to replace Newtonian mechanics. This book studies every kind of phenomena which puzzled the physicsts of the early century, like thermal equilibrium of radiation, photo-electric effect, the Bohr model of the atom, specific-heat irregularities, cohesion forces among molecules, etc. Then he shows how quantum mechanics correctly describes each one of them. This is done in a pedagogically very effective way: the ideas are explained in the text, while the more formal derivations appear in a large set of appendices. These are gems of precision and concision, precious by themselves. My favorite one is the derivation of the Van der Waals forces (between molecules), which he shows to be essentially quantal, as they are due to the zero-point energy of the ! quantum harmonic oscillator. One of the great text-books of this century."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUU89A0J5KNVQ"
                },
                "Date": "on June 30, 2005",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZ6ALGGFVHJ50"
                },
                "Date": "on August 5, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "When we see how much quantum mechanics pushed our civilization and how bad  it became explained on 'modern' textbooks it is a relief to find out that  this book is still published and affordable. A must for anyone interested  in the subject or needing to understand it with the help of one of the  fathers of QM."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZTXYX8OB9DLC"
                },
                "Date": "on May 15, 2002",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Well, this is probably not the most up to date text but it is still one of the best. The book is a collection of topics (Atomic Physics, Solid State Physics, some of QM, some of classical Physics, Statistical Thermodynamics), which are explained in a short, simple and clear way. This is also a great book for those who are familiar with QM: they will find an excellent collection of topics that are just outlined on other standard QM textbooks. Moreover one can learn a lot from the original way M. Born approaches important subjects in Physics (how to recognize the Physics in every concept, for example). This is a book everyone interested in Physics should have in her/his library."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SLLML7XWCLDN"
                },
                "Date": "on July 5, 2005",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I used this book many years ago to prepare for my preliminary exams (pre-PhD exams) in modern physics. Although it's dated (ca. 1950), that doesn't matter very much. The strong feature is that it discusses the content without getting into a lot of formalism, and gives the historical connection between different aspects that one is not likely to see in the usual text books."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SS3NEO4OKSV0"
                },
                "Date": "on November 6, 2009",
                "Helpfulness": 0.875,
                "StarRating": "5",
                "Text": "This book on Atomic Physics is in its eighth printing for good reason. Its a five star book and I have evaluated against a college level, more detailed equivalent.  This book has a balanced level of dialog, illustrations, graphs, charts and theoretical formulas to understandable explanations.  I would recommend it to anyone interested in the subject. It will become your Bible. PS: I am retired and seventy+.  CFC"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CHLU7D7TZ52W"
                },
                "Date": "on December 1, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is a wonderful book to read if you have an advanced degree in math and physics. The latter is needed to understand it completely. It's probably also a wonderful book to read even if you don't have an advanced degree in math and physics, for it does actually penetrate the equations and reveal the physics hidden within them. It is telling of the calculus-centric view of its era, that the author uses Fourier transforms, separation methods for PDEs, perturbation theory, and other advanced analysis tools, without flinching, but shies away from simple algebraic methods as being 'mathematically too advanced.'"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SELHGTVV0Y8D"
                },
                "Date": "on May 5, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is still the best overview of quantum physics ever written.  I am still getting value re-reading (for the fourth time) this masterful text 60 years after I first bought the seventh edition, as an honours undergraduate.  Born, as a great teacher, separates the difficult math out to the nearly 40 appendices, leaving the bulk of the book (300+ pages) to readily discuss the real physics of these phenomena.  If you hated calculus, this is still a great book because only simple algebra is used in the text's body.  Although a theorist, Born does an excellent job of summarizing the experiments that led to the necessity of moving beyond classical mechanics.  Born does not shy away from the central controversies surrounding QM and clearly presents the usual standard arguments (the \"Copenhagen Interpretation\").  If you are still an active researcher (as I am) you'll find numerous nuggets throughout the book, including the very detailed mathematical appendices.  Every physics student needs to own this text."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A335COIA55ISBY"
                },
                "Date": "on August 20, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Reading this book, you have to love Max Born for his physics insights, sense of history and his communication skills.  First written in 1935, updated in 1969 and republished by Dover in 1989 the book starts with chemistry that was worked out in the 1800s regarding molecular combinations and the theory of gases, setting the stage for gas discharges, energetic charged particles, models of the atom and the nucleus. Using calculus sparingly, most mathematical formulas and explanations are easy to follow up to sections on matrix mechanics and wave mechanics where explanations are more complex but still quite clear, with 41 appendices having deeper mathematical treatments.  Born explores the atom, the nucleus and all constituents known during his time, with reference to well known and lesser known experiments.  The book is rich with illustrative drawings and exemplary data. I first bought this book over 50 years ago and still keep it on my bookshelf as a work of beauty."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABVQJXVP9MSQR"
                },
                "Date": "on July 15, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Amazing book"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KD4T0CV1RFR7"
                },
                "Date": "on February 10, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I know this book from my student days and found it to be an outstanding primer on atomic physics.  While it is generally more advanced than my 14 yr old grandson can fully understand, there is enough here that gives him a basic grasp of the model and a foundation on which he can build."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZ19HJADWTIGZ"
                },
                "Date": "on August 2, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AOOO1WLT6UU9"
                },
                "Date": "on June 21, 2013",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": null
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Atomic-Physics-8th-Dover-Books/product-reviews/0486659844/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "13"
    },
    "Salesrank": "#443,489",
    "Timestamp": "2015-05-24 12:26:43.702211",
    "itemurl": "http://www.amazon.com/Atomic-Physics-8th-Dover-Books/dp/0486659844"
}
