{
    "Category": "in Books (",
    "ListPrice": "",
    "Name": [
        "Art and Physics: Parallel Visions in Space, Time, and Light"
    ],
    "OfferPrice": "$5.99",
    "Reviews": {
        "AverageStarRating": "3.8 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Y67BEMZMU7SD"
                },
                "Date": "on February 16, 2006",
                "Helpfulness": 0.9772727272727273,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 25, 1999",
                "Helpfulness": 0.8918918918918919,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35IYKFDG1LUZ3"
                },
                "Date": "on April 22, 2000",
                "Helpfulness": 0.8780487804878049,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1G2FZWVNQ30NG"
                },
                "Date": "on January 22, 2003",
                "Helpfulness": 0.9411764705882353,
                "StarRating": "5",
                "Text": "If you're looking for a hardcore physics textbook, go elsewhere. If you're looking for a hardcore art textbook, go elsewhere. Mr. Shlain is not trying to impress you with infinite depth of knowledge in the field of physics nor art. Instead, he suggests that from often unrelated fields there exists an emergence of similar conceptual breakthroughs throughout history. This book is an attempt at making the sociological bridge between art and physics, and provides examples to further this suggestion."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TIFOJXT355Q5"
                },
                "Date": "on February 10, 2003",
                "Helpfulness": 0.9333333333333333,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NO2L7HSV6CCI"
                },
                "Date": "on August 31, 2000",
                "Helpfulness": 0.782051282051282,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MTF17UI0UTL7"
                },
                "Date": "on June 23, 2005",
                "Helpfulness": 0.9090909090909091,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AW3JCCBJ58F56"
                },
                "Date": "on July 26, 2000",
                "Helpfulness": 0.782608695652174,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TOEWTN4FRW7J"
                },
                "Date": "on February 4, 2003",
                "Helpfulness": 0.875,
                "StarRating": "5",
                "Text": "Art and Physics intrigues from the beginning when the three concepts of space, time and light are introduced - - obviously subjects basic to both art and physics.  The common thread the author has identified in these disciplines may not be apparent to a reader devoted to one or the other.  A humane observer discovers the commonality.  He further breaks out beyond the concepts of cause and effect, beyond gravitational pull, beyond linear time/mind, beyond all the dualistic traps that still retain most of our mundane \"realities.\"  His insight into the message of artistic imagery is bold and reflective.  C. G. Jung would have applauded this book for its synthesis of image and empiricism.  Seeing what Monet did to dissolve time, what Manet did to free space, what Pollock did to crack open the void where inspiration enters - - these are lasting new views of the power and message of artistic image.  Science has been our myth of meaning.  From Plato to Euclid to Einstein and Bohr, the pull of discovery becomes clearly singular - - the \"uni\" in universe. The timeliness of  Dr. Shlain's premise lies in the urgent search for balance by anyone skewed in the conflict of apparent opposites.  It is restorative to read the examples of holistic, all-at-once knowing which is the healing balm for Western culture as our old dominant fades.  The book reminds us of the dimension and direction to which we are called.  How sensible to be oneself in the fullest as Leonardo was Leonardo and Dr. Shlain is Dr. Shlain. It is encouraging to see that this book is assigned in high schools and colleges where young minds will, no doubt, be quick to grasp its profound implication."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJEJMEY7SM7EC"
                },
                "Date": "on June 21, 2007",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RBA39LAJXOV4"
                },
                "Date": "on February 24, 2006",
                "Helpfulness": 0.8181818181818182,
                "StarRating": "2",
                "Text": "I was hoping this book would be at the level of Louis Menand's \"The Metaphysical Club.\" It's not. The core ideas grab the reader, but the writing is fuzzy and sometimes plain wrong. For example, on page 180-81 what begins as a fascinating insight into the \"primitive\" color words, black / white / red, quickly bogs down in error. Shlain claims that \"only in the most mature languages... does a separate word for the color blue make an appearance...\" Possibly technically correct, but conceptually wrong. \"Indigo\" has been around  since at least Herodotus (450 BC.) I suspect Dr. Shlain is a delightful generalist who has written a book far beyond his knowledge."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CEBKF9SKBPEI"
                },
                "Date": "on September 6, 2004",
                "Helpfulness": 0.7647058823529411,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A134DQADKTZ7Q2"
                },
                "Date": "on November 22, 2012",
                "Helpfulness": 0.8,
                "StarRating": "1",
                "Text": "This author poses a danger to those trying to learn about art or science.  Sadly many reviewers credit him with at least a \"shallow\" knowledge of the basic facts upon which he presents his thesis. It seems that reviewers educated in physics assume that the author understands art, while identifying his misunderstanding of even basic physics.  Similarly, those who recognize the author's ignorance of history and culture, strangely tend to assume that he has a grasp of physics.  The author himself acknowledges that he is a surgeon, which is a profession not known for erudition outside that field of specialization.  This may be an unnecessarily uncharitable comment, and I would be the first admit that I would listen to parrot if it were to say something interesting.  This author wrote nothing interesting before I stopped reading.  For example, the author missed an opportunity to put Leonardo Da Vinci in an accurate light.  Instead he credited Leonardo, as is still popular, with \"inventing\" such things as the helicopter.  Actually Leonardo's illustration is simply a hopelessly fanciful copy of a small toy recently imported from China.  Far worse than superficial, this author's facts are inaccurate stereotypes or garbled nonsense.  For educated readers this book may be mildly amusing at the author's expense, but there is potential in the thesis which was unrealized, and this caused me to be more annoyed than amused by the author's poor effort."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CQ1SKWF2G4QX"
                },
                "Date": "on May 2, 2001",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ELVZ6MUXSSBA"
                },
                "Date": "on May 1, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This literally exploded my understanding - not only of physics but of the interconnectedness of the brain, intuition, the universe.  It may not be possible, as yet to totally understand how the art precedes science but as Dr. Shlian so beautifully illustrates, it does, it does in the same way that myth precedes discovery and sci-fi is preparing us to go into space. This book should be in every classroom in the country if not the world.  it is required reading if you wish to be educated.  Stupendous.  Gift everyone you know with this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALJZL4SFH2E2J"
                },
                "Date": "on December 5, 2002",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22JBKKHCCLO86"
                },
                "Date": "on January 6, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANSGGIZXEMO4T"
                },
                "Date": "on December 10, 1997",
                "Helpfulness": 0.75,
                "StarRating": "3",
                "Text": "The author barely scratches the surface of what should be a fascinating topic.  His knowledge of physics and art, as displayed in the book, are not even at an educated layman's level.  Also, he simply does not make the connections between art and physics intuitive; at best they are coincidental and have no resonance.  This book is okay for people with little experience with art or physics, but should be skipped by people with previous knowledge and experience of the fields."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KOD0GE858IF9"
                },
                "Date": "on August 14, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I had no idea until reading this book that art has presaged and participated in so many important scientific advances. It's an amazing study, and should be required reading for any educator. In fact, for those educators struggling with colleagues who don't see the value in arts integration, this would be a terrific book to change their minds. Creativity is as vital to scientific innovation as it is to purely artistic endeavors and every child should have the opportunity to receive training in the arts, if for no other reason than to find their own voice, and amplify it in whatever field they ultimately choose. I found it life-transforming and think you will, too."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 9, 1999",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on August 4, 1999",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1K47UVWJ7T4Z8"
                },
                "Date": "on July 7, 1999",
                "Helpfulness": 0.7,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGSUAB3ZIHP8Z"
                },
                "Date": "on September 3, 2001",
                "Helpfulness": 0.7,
                "StarRating": "5",
                "Text": "In my field (coaching) you have to know a lot and I'm always trying to expand my sphere of knowledge. This book put me light years ahead and is near the top of my list of books which have influenced my way of looking at things. I'm a Strategic Thinker, so I see patterns where others see chaos. My knowledge of physics was minimal, my appreciation of art immense. I now have a greater appreciation for both physicists and artists.  This book brings it all together! It boggles my mind that a physician can write so well. I liked this book so much, I went through it page by page looking up all the paintings he mentions on the net and putting together my own \"study guide\" which I've shared with other people who then want to read the book. Fascinating insights, well written, a true mind-expander.  My only regret is that the publishers didn't put in more and more of the art he talks about."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27BNFD7926VFW"
                },
                "Date": "on June 30, 2004",
                "Helpfulness": 0.6842105263157895,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RAG0DOA8PHL5"
                },
                "Date": "on June 28, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Leonard Shlain not only understands the human phenomenon that we are, I love his gesticulations,  He takes the reader with method, clarity and brilliance of words, at least for some, to a place where once again one ponders."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APGUZK104HO8Q"
                },
                "Date": "on December 29, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Ah the most thought provoking book an artist with substance can study. Must get for any intellectual geek who believes more then what they see."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKK85KCX098TH"
                },
                "Date": "on October 5, 2007",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "This is a wonderful book, a fantastic read. Those upset with Shlain and think his work twaddle don't appreciate the vision behind his words. Sure, he might not get everything right. Loosen up, science folks. The work is visionary - not proven theory. One thing he talks about that is incredibly fascinating is how the left/right brains of humans evolved. This man has a lot of fascinating things to say. He doesn't need to be perfectly perfect with his facts to interest me."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VS32MQGDDIQ5"
                },
                "Date": "on January 16, 2000",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "Art & Physics is a brilliant survey,not just of the seminal relationship between art and physics, but a study of human consciousness in its dual right-left brain dichotomy, and  a study of how the combination  produces unity. This is an astonishing work---crystal clear physics and a  whole new concept of the place of art in our lives."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BDSK8FMHT8AB"
                },
                "Date": "on January 29, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I'll read anything this man writes. Although I enjoyed his later works more, this book is full of insights. He has a way of finding unity between seemingly divergent subjects."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I0QRF6Z7F214"
                },
                "Date": "on April 10, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book, along with \"The $12 million Stuffed Shark\" are the two best art books I have read thus far."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XE12PGTI9TBY"
                },
                "Date": "on August 18, 2001",
                "Helpfulness": 0.6,
                "StarRating": "5",
                "Text": "Shlain's willingness to tackle 2 huge issues provoked my thinking in many areas. In the end I'm not sure I agree with his conclusions but that is less important than that I now see conections between the two areas and  have a better idea of what happended throughout time. I'm writing this 2 years after reading the book but I remember it as keeping me engaged with new ideas from page to page."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UNRBX4SRTLSQ"
                },
                "Date": "on September 2, 2010",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "this book changed the way i work as an artist.  Shlain has wonderful insight and is exciting to read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3Q35P5E3KLV61"
                },
                "Date": "on March 11, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book took me a long time to get through but it is worth the time and will blow your mind."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on August 23, 1998",
                "Helpfulness": 0.6,
                "StarRating": "5",
                "Text": "So good, I bought it twice.  A delicate and careful tracing of our history  through the stories of two vital and disparate ideas:  This juxtaposition  of the fine arts and the hard sciences seems like a ludicrous idea at  first,  but Shlain builds a solid ladder of thoughts on each side's  contribution to the other.  His conclusions at times appear to be wound  more out of  opinion than fact, but that seems to be a subtle undercurrent  throughout the book; as if a challenge is made, not to think like he does,  but simply ->to think<-.  To write a book about something as wide as  art is monumental.  To write a book about something as deep as physics is  colossal.  To even attempt a bridge between these worlds shows a spirit  indomitable.  The science of this book would not impress Plank.  The art of  this book would not wow Matisse.  This marriage of the two fields would  provide inspiration to them both.  Art & Physics is my most prized  book."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 4, 2003",
                "Helpfulness": 0.6190476190476191,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KV51IEG9T6HC"
                },
                "Date": "on August 23, 1998",
                "Helpfulness": 0.5714285714285714,
                "StarRating": "5",
                "Text": "So good, I bought it twice. A delicate and careful tracing of our history  through the stories of two  vital and disparate ideas:  This juxtaposition of the fine arts and the hard sciences seems like a  ludicrous idea at first, but Shlain builds a solid ladder  of thoughts on each side's contribution to the  other.  His conclusions at times appear to be wound more out of opinion than fact,  but that seems to  be a subtle undercurrent throughout  the book; as if a challenge is made, not to think like he does, but  simply ->to think<-. To write a book about something as  wide as art is monumental. To write a  book about  something as deep as physics is colossal. To even attempt a bridge between  these  worlds shows a spirit indomitable. The science  of this book would not impress Plank. The art of this  book would not wow Matisse. This marriage of the two fields would provide  inspiration to them  both. Art & Physics is my most  prized book."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 17, 2001",
                "Helpfulness": 0.6,
                "StarRating": "5",
                "Text": "This is a wonderful and thought provoking book to read, however, if you hadn't had at least 3 years of college English, have a dictionary handy."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on January 7, 1998",
                "Helpfulness": 0.5833333333333334,
                "StarRating": "1",
                "Text": "It's a truly wonderful concept:  How do the Arts and the Sciences relate?  Unfortunately, Shlain gets it wrong.  His Physics is so often incorrect, especially concerning Relativity and Quantum Mechanics, that his entire line of reasoning falls apart.  And as for his claim that artists lead the vision of discovery (for example, it was artists who envisioned the concepts of Relativity such as in \"Nude Descending a Staircase\"), he neglects the fact that Science is more methodical than Art.  While a new style of painting is created and justified the first time an artist makes a piece, a new theory of physics is developed over a lifetime and must be rigorously justified.  The questions and thoughts that gave rise to Relativity were created long before (it goes back to Galileo) the Cubist style of painting was invented."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 5, 1999",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "In 30 years I've read something along the lines of 3000 books - everything from Shakespeare to pulp Star Trek novels. This one is the single best book I've ever read. I came to the book with a pretty good layman's  understanding of physics and was better informed when I finished it.  Meanwhile, my meager knowledge of art history was expanded dramatically.  This is a book with something for both the left and right sides of your  brain. What more could you ask for?"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQ9BT28BXU2MZ"
                },
                "Date": "on June 19, 2002",
                "Helpfulness": 0.5833333333333334,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A389NX5CL5CIPJ"
                },
                "Date": "on March 16, 2015",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "Fair"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3E4HCRUG3RWKP"
                },
                "Date": "on July 13, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Great quality and on time delivery.  Thank you!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on August 23, 1998",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "the arts and the physics of everything is to use it in unity to explore  the subconcious, our spiritual mind and our tangible 'life'. the point of  the whole story is that we are not demonstrating reconciliation when we  constantly put downt the other side because of egocentrics of both parties.  obviously physics is a stopable train, in the motion of the bride, so will  say Duchamp is that the abstract, however immeasurable, it is the train  that is an unstopable force. so in physics, to go beyond what is deserved  by what we find to be concrete evidence- it is the end. now where does the  search go from here? what happened to opposites attract? where is the love  of both working? the relativity of the Universe is what makes It work, and  so my mind shall work the same way? the whole point of a masterpeice is to  imagine where it came from, which part of the Universe, my thoughts, my  actions, my conscious words, my divine action to not separate. the point of  Shlain's story is that if we learn to recognize ourselves for who we are,  who we were, and from a linear perspective, who we will be? what can we  accomplish if we are \"Relative\"??? eternity. but of course, the  key is, will we be able allowed to attain it?"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 24, 1998",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "This is the best book I have ever read!  Leonard Shlain's weaving of two  strands, one containing the images of great artists and the other the insights of great physicists allows the reader to see one in terms of the other.  His style is very readable and at times his turns of phrase are poetical.  Abstract concepts in physics come alive when they are translated into the living, breathing, art of great artists.  I highly recommend this book."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on August 23, 1998",
                "Helpfulness": 0.25,
                "StarRating": "5",
                "Text": "the arts and the physics of everything is to use it in unity to explore  the subconcious, our spiritual mind and our tangible 'life'. the point of  the whole story is that we are not demonstrating reconciliation when we  constantly put downt the other side because of egocentrics of both parties.  obviously physics is a stopable train, in the motion of the bride, so will  say Duchamp is that the abstract, however immeasurable, it is the train  that is an unstopable force. so in physics, to go beyond what is deserved  by what we find to be concrete evidence- it is the end. now where does the  search go from here? what happened to opposites attract? where is the love  of both working? the relativity of the Universe is what makes It work, and  so my mind shall work the same way. the whole point of a masterpeice is to  imagine where it came from, which part of the Universe, my thoughts, my  actions, my conscious words, my divine action to not separate. the point of  Shlain's story is that if we learn to recognize ourselves for who we are,  who we were, and from a linear perspective, who we will be? what can we  accomplish if we are \"Relative\"??? eternity. but of course, the  key is, will we be able allowed to attain it?"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32EC18BPNO13J"
                },
                "Date": "on May 11, 2010",
                "Helpfulness": 0.25,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on August 29, 1999",
                "Helpfulness": 0.375,
                "StarRating": "3",
                "Text": "Having a good background in physics and not so in the arts I found the commentary on the artwork quite interesting without getting bogged down in nebulous descriptions of things.  The physics is sometimes flawed and I  found the whole attempt to connect art and science interesting but  ultimately like trying to fit a square peg in a round hole.  The book  really doesn't address why this connection exists.  Rather he focuses on  how his interpretation of what an artist was doing preceded what his  interpretation of what a scientific principle was illustrating.  My friends  and I saw just as many things that weren't similar.  Ignore that and just  enjoy the art history"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJMRABDGW04AT"
                },
                "Date": "on March 29, 1999",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "This book illuminates two diverse worlds and builds a bridge which encourages access from each where traditionally there have been nothing but roadblocks. Mr. Shlain's brilliant, literate and deliciously written volume  has been an inspiration to me, a high school teacher/artist.  I have now  read the book 4 times and with each reading I am further enlightened by the  text which leaps easily from the realms of science to art making clear  parallels and unclouding the pathway that truly exists from one to the  other.  It is a book I have shared with scholars, scientists, artists and  students and I have used it to frame the basis of an interdisciplinary  course at my school. I encourage the layman and the expert to read this  book."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on August 24, 1998",
                "Helpfulness": 0.2,
                "StarRating": "5",
                "Text": "the arts and the physics of everything is to use it in unity to explore  the subconcious, our spiritual mind and our tangible 'life'. the point of  the whole story is that we are not demonstrating reconciliation when we  constantly put downt the other side because of egocentrics of both parties.  obviously physics is a stopable train, in the motion of the bride, so will  say Duchamp is that the abstract, however immeasurable, it is the train  that is an unstopable force. so in physics, to go beyond what is deserved  by what we find to be concrete evidence- it is the end. now where does the  search go from here? what happened to opposites attract? where is the love  of both working? the relativity of the Universe is what makes It work, and  so my mind shall work the same way. the whole point of a masterpeice is to  imagine where it came from, which part of the Universe, my thoughts, my  actions, my conscious words, my divine action to not separate. the point of  Shlain's story is that if we learn to recognize ourselves for who we are,  who we were, and from a linear perspective, who we will be? what can we  accomplish if we are \"Relative\"??? eternity. but of course, the  key is, will we be able /allowed to attain it?"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2M5BSZ34B933W"
                },
                "Date": "on November 22, 2000",
                "Helpfulness": 0.16666666666666666,
                "StarRating": "4",
                "Text": "When I decieded to write an essay comparing physics and art for my physics class last year, I bought this book.  Although when I began reading it, I had no idea of what specific topics I wanted to discuss, after reading it, I had a clear idea.  In short, \"Art and Physics\" is a comprehensive book that will convince you of the parallels between the seemingly different disciplines of art and physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQ8X60RD5WXC2"
                },
                "Date": "on November 28, 2000",
                "Helpfulness": 0.09090909090909091,
                "StarRating": "4",
                "Text": "A good book to read before GEB (Goedel-Escher-Bach: An eternal golden braid)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37HPKD6GLXL2L"
                },
                "Date": "on August 29, 2005",
                "Helpfulness": 0.125,
                "StarRating": "1",
                "Text": null
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Art-Physics-Parallel-Visions-Space/product-reviews/0688123058/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "52"
    },
    "Salesrank": "#496,179",
    "Timestamp": "2015-05-24 13:07:07.428781",
    "itemurl": "http://www.amazon.com/Art-Physics-Parallel-Visions-Space/dp/0688123058"
}
