{
    "Category": "in Books (",
    "ListPrice": "$16.99",
    "Name": [
        "The Physics of Christianity"
    ],
    "OfferPrice": "$14.28",
    "Reviews": {
        "AverageStarRating": "2.9 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3565H6UEQLN37"
                },
                "Date": "on November 7, 2010",
                "Helpfulness": 0.8181818181818182,
                "StarRating": "2",
                "Text": "Many people on here have written fine reviews, covering more detail than I am willing.  But there's one thing I'd like to point out.  The bottom line is, I respect the guy for putting his controversial theories out there, probably fully aware that he was going to get crucified by scientists and non-scientist alike, but this book utterly fails in its goal.  In attempting to reconcile Christianity and physics, in a way that describes all the miraculous phenomenon of Christian doctrine, Tipler ends up satisifying neither christians nor phyisicists.  For example, in trying to explain the resurrection of Jesus, Tipler imagines some sort of de-materialization of Jesus' body into nuetrinos and then re-materialization back into His resurrection body.  I mean, come on.  Jesus' resurrection body was more than just physical.  There was a supernatural spiritual reality to it that cannot be explained by the laws of physics, for it is not subject to such laws.  And there's a whole lot more of this in the book.  And to be honest, I found myself glossing over some areas that were so out there I felt that they weren't even worth the time reading.  In the end, Tipler presents a far-fetched theory that neither christians nor physicists can accept."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12BL8PMLAG5HX"
                },
                "Date": "on May 14, 2007",
                "Helpfulness": 0.7654320987654321,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LACH6MLQWZ"
                },
                "Date": "on May 20, 2013",
                "Helpfulness": 1.0,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NS2RO75KABXF"
                },
                "Date": "on October 16, 2012",
                "Helpfulness": 0.8,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2L5ZXYRUTD4E4"
                },
                "Date": "on July 17, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "The Physics of Christianity is a challenging book that brings to light the age-old enigma \"how can the human mind understand the miracles, mysteries and other transcendental features of  the Christian religion through reliance on our  most advanced developments in physics. This concept may arouse underlying concerns that \"The Physics of Christianity\" is based on the rejection of the reality of Christian belief.  I think that a very careful reading of this book can demonstrate that it is not an attack on Christianity--it appears to be attempting to demonstrate what is presently still a challenge for the human mind to explain by present physical laws.  Perhaps the concept that \"change is always on the horizon\"  will enable one to see that wider scope of  the book. Miracles arise daily but we learn about them later."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3P603GVJIGKAN"
                },
                "Date": "on November 1, 2012",
                "Helpfulness": 1.0,
                "StarRating": "2",
                "Text": "This book jumped the shark for me in Chapter III.  That's the one in which Mr. Tipler says that our descendants will be able to download the personalities of all previous human generations into a \"quantum computer\", and that these downloads will then live happily ever after in a virtual Paradise.  This, he says, will satisfy the prediction of the resurrection of the dead.  Okay, okay, wait a minute.  Assuming for a moment that our descendants would WANT to do this--and I can think of a few of my ancestors I'd rather not resurrect--where are they going to get the information?  How are they going to download the personality of a person who left no record because she lived and died before the invention of writing?  How would they even know this person existed?  How does he imagine they are going to power this computer, and who is going to maintain it after the entire human race has been reduced to bits and bytes?  At the same time, he suggests that we should be zooming around the universe destroying baryons in order to bring about the collapse of the universe and the emergence of a singularity--which, he says, is the third Person of God.  Ummm--why?  Why would our descendants be in any hurry to see the collapse of the universe?  And this is just Chapter III.  I will read the rest of the book.  If the reasoning remains on the same level, it should be good for a laugh, if nothing else."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIOG0I516MAC2"
                },
                "Date": "on May 4, 2007",
                "Helpfulness": 0.6607142857142857,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARC0RAS242X1M"
                },
                "Date": "on January 10, 2008",
                "Helpfulness": 0.6551724137931034,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TBXDZH9XVU2Y"
                },
                "Date": "on August 1, 2007",
                "Helpfulness": 0.6545454545454545,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23XICHBMYAY0U"
                },
                "Date": "on March 11, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Should be read by believers and skeptics alike."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GBG12YNO8H6L"
                },
                "Date": "on September 13, 2013",
                "Helpfulness": 0.6,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BMKEJ61X57EU"
                },
                "Date": "on March 4, 2010",
                "Helpfulness": 0.6,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SSO4ZATMI9CQ"
                },
                "Date": "on March 21, 2013",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": "tippler's thesis seems not too impressive. The idea that God is the Singularity at the heart of the Big Bang seems necessary but not sufficient. A more pertinent question might be whether consciousness is a property or a byproduct of the universe."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10NSMQ0M2R6PF"
                },
                "Date": "on February 14, 2011",
                "Helpfulness": 0.625,
                "StarRating": "5",
                "Text": "Tipler reminds the scientific community that experiment and observation are to be recognized despite the philosophical implications. The universe had a beginning. No matter how much that repulses the secular crowd, this is the case. Tipler argues that it is observable physics and the implications of which that appear to favor a God, that have turned physics into a fantasy world where the best minds like hawking have abandoned experiment for theories (such as string theory) that lack a single shred of observation or prediction."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EB39WFIOG346"
                },
                "Date": "on April 2, 2013",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Z44N6RGLRMM3"
                },
                "Date": "on April 22, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The author did great explaining physics for the lay person. The ways in which he ties mathematics and physics to God is indeed phenomenal."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWTZXK24JZSZH"
                },
                "Date": "on February 22, 2009",
                "Helpfulness": 0.6153846153846154,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8H5XDI7ZE4K0"
                },
                "Date": "on May 30, 2007",
                "Helpfulness": 0.6333333333333333,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24HJBYNU0J3EH"
                },
                "Date": "on August 1, 2007",
                "Helpfulness": 0.6363636363636364,
                "StarRating": "1",
                "Text": "I was so upset that I purchased and wasted my time reading this book that I won't spend any more time than necessary telling you not to bother with it.  It's not clear at all what his point is, but it starts off with misstatements of truth: 1) That the standard model of quantum mechanics is complete and exact -- it's not at all, nor would any reputable scientist say it is.  It is the closest we have at this time; 2) He says that we know what quantum gravity is -- actually, we've been searching for the solution to quantum gravity for fifty years now .. and it's still eluding us; 3) He says the universe will collapse -- hogwash! An amazing yet quite proven finding from 1998 is the discovery of \"dark energy\" that is actually making the universe expand at a faster and faster rate; And his errors go on and on.  Given the amount of falsification throughout the book, there's just no point to wasting your time reading the book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31NKIGZ72RBN4"
                },
                "Date": "on February 6, 2014",
                "Helpfulness": 0.5,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GWX4HESBQJ3Q"
                },
                "Date": "on August 3, 2007",
                "Helpfulness": 0.6,
                "StarRating": "2",
                "Text": "Tipler's new book is certainly the best example of Christian Apologetics  I have ever seen.  He justifies Christian doctrine with a  convoluted model of modern science. His model of the world, although possible in theory, is highly improbable in practice. Tipler demonstrates that we can use science to justify almost anything."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AW1G0WOQRWOI1"
                },
                "Date": "on July 29, 2008",
                "Helpfulness": 0.6086956521739131,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEGLLY9CXWXX3"
                },
                "Date": "on January 14, 2015",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20J2SLG97V1ZF"
                },
                "Date": "on July 27, 2014",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KTOCX96YL9GN"
                },
                "Date": "on July 3, 2007",
                "Helpfulness": 0.5925925925925926,
                "StarRating": "5",
                "Text": "Setting aside the far-reaching implications and speculations about Christianity, this book is worth 5 stars just for the physics.  Tipler shows how Newton, Einstein, Standard Theory, and Quantum Theory actually fit together into a simple, elegant theory of everything. If you feel yourself cringing at the audacity of attempting a theory of everything, read it. You may be surprised to discover that Tipler doesn't invent a theory of everything, he rather makes a clear and compelling case that the history of physics shows that a theory of everything has already been discovered and rejected on philosophical grounds, not on scientific grounds."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21NB16K0B3QO3"
                },
                "Date": "on November 29, 2014",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "1",
                "Text": "For the most part, nutty as squirrel poop. We are advised by Tipler to forget \"the Copenhagen position\" (Niels Bohr, Werner Planck, and friends), because Einstein was right (\"God does not play dice.\").  Tipler doesn't tell us why, but the reason is that the sovereignty of God demands deistic determinism even at the quantum level. If God is responsible for everything, then what about evil?  No, God is not responsible for evil.  Why?  We live in a multiverse, and someplace out there is an identical universe to our own, but perfect, without evil.  We just happen to be in the wrong universe!  Jesus' resurrection is \"proved\" with help from the Shroud of Turin. Did anybody ever tell this guy about Bell's theorem, or about the Fourth Crusade (1204) that flooded the European market with fake \"relics\" like the Shroud of Turin."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A373ZCB1AYOZC"
                },
                "Date": "on May 22, 2007",
                "Helpfulness": 0.5,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29YC6QSXSPPKV"
                },
                "Date": "on May 27, 2011",
                "Helpfulness": 0.5384615384615384,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A67RR7EZCN0TN"
                },
                "Date": "on May 7, 2007",
                "Helpfulness": 0.5555555555555556,
                "StarRating": "5",
                "Text": "As is often unfortunately the case on Amazon, I have to advise you to ignore all of the 1-star reviews.  The mainstreaming of hostility to Christian belief continues unchecked.  Anonymous atheists explode with derision: \"A scientist?  I thought he was on our side.\"  It's supposed to be a book review: was the book boring? tedious? badly written? poorly expressed?  On all those tests, it is clearly 5 stars out of 5.  And the theory Tipler advances will one day be recognized as the Principia Mathematica of our day."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJJSSS4HH8JPO"
                },
                "Date": "on June 30, 2012",
                "Helpfulness": 0.42857142857142855,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A315F75TDDAI84"
                },
                "Date": "on September 11, 2007",
                "Helpfulness": 0.5844155844155844,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WFAOT7TI8DWV"
                },
                "Date": "on September 25, 2009",
                "Helpfulness": 0.42857142857142855,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VX2XXK2XZFW5"
                },
                "Date": "on January 3, 2014",
                "Helpfulness": 0.25,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFXCGK5813VOM"
                },
                "Date": "on December 11, 2013",
                "Helpfulness": 0.25,
                "StarRating": "1",
                "Text": "After reading only a few pages, I found the author was ignoring basic scientific principles in an attempt to prove his point.  Therefore, there was no reason to read any further.  However, if one has a limited knowledge of Physics, reading this could well further your understanding of the subject, and  while you may miss the errors and agree with Mr. Tipler, thus earning a \"D-\" or more likely an \"F,\" in a classroom setting, I would still consider it time well spent."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYTZMUTBGPHRN"
                },
                "Date": "on May 30, 2007",
                "Helpfulness": 0.5217391304347826,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9C8GEBNAWOUV"
                },
                "Date": "on June 19, 2009",
                "Helpfulness": 0.5185185185185185,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NV9GT2X15AOM"
                },
                "Date": "on October 2, 2007",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Among academic physicists, Tipler is probably the most creative in linking traditional Christianity with science.  While on first read much of what he says in this book may seem outrageous (to both Christians and physicists), subsequent readings somehow seem less so.  Surely his ideas are wildly speculative, but have their starting points in accepted physics.  A wonderfully entertaining and well-written book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1L1KRLXKKWLI7"
                },
                "Date": "on May 4, 2007",
                "Helpfulness": 0.5526315789473685,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALNY16VZ89ICV"
                },
                "Date": "on December 6, 2007",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XD98NXYKQR2Y"
                },
                "Date": "on September 4, 2009",
                "Helpfulness": 0.5172413793103449,
                "StarRating": "1",
                "Text": "...at random wondering if it was worth a read, only to find, on pgs 119+120 (HB ed.), Tipler make the claim that the Dominican inquisitors Institor and Sprenger, authors of the Malleus Maleficarum, were sons of Pope Innocent VIII, who commissioned them to investigate witchcraft in Germany. Now, this *would* take some fancy physics to explain, because Innocent VIII (nee Giovanni Battista Cibo) was born in 1432; Heinrick Institor (or Kramer) was born in 1430; and Sprenger was born in either 1436 or 1438. Sadly, Tipler didn't provide the physics that would've made this plausible. A complete rewrite is warranted here."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EQRWH4CH0TX"
                },
                "Date": "on January 11, 2013",
                "Helpfulness": 0.2,
                "StarRating": "5",
                "Text": "A little high level on the physics but fascinating. word 11 xxxx zzzz  qqqq  rrrr mmmm oooo tttt iiii rrrr"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Y6FQIVR8FL7V"
                },
                "Date": "on February 25, 2008",
                "Helpfulness": 0.38461538461538464,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CJY72RNY9A4R"
                },
                "Date": "on February 24, 2012",
                "Helpfulness": 0.4,
                "StarRating": "1",
                "Text": "He starts off by insulting every athiest scientist in the world. Basically saying they're all in denial about this singularity. Which is just untrue. They aren't. Then he redefines the word \"God\" to mean singularity. Then he tries to say that \"God\" is required, since the singularity is required. The singularity is not \"God\" as most individuals know the word. The singularity could be a mathematical formula. There's no evidence of it being a sentient being. THEN, he tries to say that there are only 3 singularities. When there are infinite numbers of singularities. He totally pulls the number 3 out of a hat. All of this within the first page or so. UNBELIEVABLE. How misleading and dishonest this book is."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23UAATRRQISB6"
                },
                "Date": "on August 14, 2007",
                "Helpfulness": 0.42105263157894735,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25WXYH7TCH3Q0"
                },
                "Date": "on January 4, 2008",
                "Helpfulness": 0.4117647058823529,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GK9LT41X73NC"
                },
                "Date": "on July 29, 2009",
                "Helpfulness": 0.3,
                "StarRating": "2",
                "Text": "Admittedly, my knowledge of Physics is very weak. And the formulas described here are beyond my fairly non-scientific education. But as for Religious Sci-Fiction, this book may be at the very top! Even if this theory of resurrection is somehow possible (very unlikely) why would such an incident occur only ONCE in the entire history of human or mammalian species?  And only in the religion in which the author was acculturated (Judaic/ Christianity)? Same goes for the virgin birth. Amazing how 40 years after the moon landing, so many still subscribe to superstitious myths with no proof, even obviously very intelligent academics.Books like this can only delude those of semi-literate background who cannot read it, but look at the cover for \"proof\" of their gullible \"convictions\"...But still the book is a worthy effort to explain the unexplainable and the \"mystery\" of a deity."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30BXO19IGOVIS"
                },
                "Date": "on December 19, 2007",
                "Helpfulness": 0.42857142857142855,
                "StarRating": "1",
                "Text": "Tipler is a physicist of some reputation, and his explanation of the principles of physics is OK, not as good as in his earlier Physics of Immortality.  The book really is weak in its understanding of Chrtistianity.  He does not seem to have even a rudimentary understanding of the teachings of the gospels, much less those who have commented on them from Paul to modern authors."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AA7RR5OIZKMCI"
                },
                "Date": "on August 3, 2007",
                "Helpfulness": 0.45454545454545453,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ICGH6YH43V9E"
                },
                "Date": "on July 18, 2007",
                "Helpfulness": 0.2222222222222222,
                "StarRating": "4",
                "Text": "Frank Tipler's Omega Point cosmology equates God with the transcendent \"singularity\" (i.e., the initial and final boundary condition) required by all logically-possible, spatially-closed universes.  An eschatology based on physics (specifically, the observationally-tested principles of general relativity, quantum mechanics, and the standard particle model) is an intriguing idea.  Tipler goes too far with his religious speculations, however.  I'd like to see him focus solely on the physics and perhaps find some synergism with Paul Davies' participatory multiverse concept."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D2PJC9CF87WP"
                },
                "Date": "on May 2, 2007",
                "Helpfulness": 0.4794520547945205,
                "StarRating": "1",
                "Text": "Curious as to how this book has got such top marks from others in the press. Without doubt the most confusing book I have ever attempted to read. I read many books on very deep topics and have an excellent grasp of the sciences and philosophy. Regardless, the way Tippler has tried to simplify things, has not worked, it's just made things impossible to understand. But a Christian arguing, no not arguing, making the absolute claim that we all exist in an infinite number of alternative universes? That's something I can not accept. It doesn't just damn common sense, it damns the Judeo Christian God. Sorry Tipler, you lost me right there."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1F3Y9Y9OD6SOV"
                },
                "Date": "on September 17, 2008",
                "Helpfulness": 0.375,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35EQVR9NA7YBN"
                },
                "Date": "on May 11, 2007",
                "Helpfulness": 0.3684210526315789,
                "StarRating": "5",
                "Text": "Kudos to Frank Tipler for proving the existence of God through pure scientific, unmitigated fact. Hawking brought it up, and Tipler confirmed it. A wonderful read. Highly recommended. Don't blow this one off, it just might surprise you."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10EW5N83RTO27"
                },
                "Date": "on August 29, 2007",
                "Helpfulness": 0.3695652173913043,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIXEGAK898N9V"
                },
                "Date": "on November 1, 2007",
                "Helpfulness": 0.2608695652173913,
                "StarRating": "5",
                "Text": "This book came highly recommended by our priest.  It was all the recommendation I needed.  I've bought it for my husband for Christmas."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ABWJNQ7OK9WV"
                },
                "Date": "on February 11, 2013",
                "Helpfulness": 0.13333333333333333,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GKJ1D4PZPGOI"
                },
                "Date": "on September 17, 2008",
                "Helpfulness": 0.2692307692307692,
                "StarRating": "1",
                "Text": "This confusion of science and religion is completely wacko.  If it were a joke, I could appreciate it, but Tipler, believe it or not, is serious."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1B6FAG6UJTLL3"
                },
                "Date": "on June 14, 2008",
                "Helpfulness": 0.2903225806451613,
                "StarRating": "1",
                "Text": "Without absolute proof of Christ's existence, Professor Tipler's efforts are no more significant than The Physics of Superman or The Physics of Harry Potter."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Physics-Christianity-Frank-J-Tipler/product-reviews/0385514255/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "57"
    },
    "Salesrank": "#489,933",
    "Timestamp": "2015-05-24 12:53:58.580554",
    "itemurl": "http://www.amazon.com/Physics-Christianity-Frank-J-Tipler/dp/0385514255"
}
