{
    "Category": "in Books (",
    "ListPrice": "$17.95",
    "Name": [
        "The Cosmic Code: Quantum Physics as the Language of Nature (Dover Books on Physics)"
    ],
    "OfferPrice": "$13.25",
    "Reviews": {
        "AverageStarRating": "4.7 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 5, 1999",
                "Helpfulness": 0.9736842105263158,
                "StarRating": "5",
                "Text": "It is a shame that this book is out of print. Pagels' lucid explanations of the quantum world are the best within lay science publishing. I also believe that Pagels' rational approach is far and away a better  introduction/exploration than the Eastern Mysticism-based books like  Zukav's \"The Dancing Wu Li Masters\" or Fritjof Capra's \"The  Tao of Physics.\" Of course, those books are useful as entertainment  (as exotic Parallelism) but it should be noted that the connections between  Eastern Mysticism and Quantum Mechanics in regards to questions of  conciousness and reality are not accepted as valid by any but a minuscule  minority of thinkers. Pagels' approach is much more true to the thinking in  new physics circles. In regards to a second edition that Mr. Beagle is  hoping for, it will not be forthcoming due to the untimely demise of Pagels  in a mountaineering accident in the late 80's. He is sorely missed! Also,  for the very best in Computer Culture-related lay science (even though it  is somewhat dated) I can't recommend his \"The Dreams of Reason\"  highly enough - especially to those familiar with his other works! I've  seen both books in used book shops many times."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VT804QG340FV"
                },
                "Date": "on July 15, 2002",
                "Helpfulness": 0.9722222222222222,
                "StarRating": "5",
                "Text": "I've been a fan of this book since it was published in hard back in 1982 and recent re-reading remind me that it is still one of the best, most accessible lay books on quantum physics that has ever been written.  It is a little hard to track down sometimes, but perhaps they will eventually reissue it.  Unfortunately, Heinz Pagels died in a mountain climbing accident years ago and won't be able to update this wonderful book.  It would be great if one of his many colleagues and admirers would undertake to do it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACRC8DJ7CMY3Q"
                },
                "Date": "on October 1, 2003",
                "Helpfulness": 0.92,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SLA0SXRQV8M0"
                },
                "Date": "on July 19, 2007",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "A very good overview, written for the popular audience, of quantum physics, originally written in 1982, by physicist Heinz Pagels. The first part of the book deals with the history of the subject. The second part, the (then) newer stuff, including complex subjects like Bell's Theorem. Unfortunately, since Pagels died in a mountaineering accident in 1988, there hasn't been an update of the book (because of the speed of the scientific discovery, even the best science books can get quickly outdated). That's why the newer stuff in physics, mainly string theory, is not covered here. Still, a very good book."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on November 17, 1998",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Pagels follows modern physics in an understandable way.  If you had trouble understanding p-chem, this is the book for you.  Not good for people who haven't had college physics or equivalent."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A284UORXIDYO4K"
                },
                "Date": "on July 18, 2001",
                "Helpfulness": 0.7857142857142857,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LZREXRYJAQNZ"
                },
                "Date": "on January 21, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on December 10, 1997",
                "Helpfulness": 0.875,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2X2U7PM79M8RC"
                },
                "Date": "on March 12, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book was mentioned in a previous book I have read (The Biology of Belief - Lipton).  This book easily explains a tough subject like quantum physics.  I found it strange that someone like myself (mostly read spiritual books) would enjoy a scientific discussion of the very small.  I could not put the book down.  If you enjoy reading spiritual books, you will enjoy this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1S8ZJTBOZ8H7"
                },
                "Date": "on March 21, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "This is an interesting explanation of quantum physics for the lay reader. I would not say that the information is easy to grasp even in this effort to make it comprehensible. However, it does provide the best interpretation for the non-scientist that I have found thus far."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1C6EIU81ZLX0T"
                },
                "Date": "on September 9, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1P266MD3WSCSJ"
                },
                "Date": "on March 10, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Physics and mathematics were not my strengths in school, so the very thought of understanding quantum physics would have been comical, had it not been for this book. The topics were arranged in a very coherent manner, starting from the fundamental discoveries and progressing to the more complex theories and discoveries. I couldn't put the book down, except when I had to. My only criticism of the author's perspective is that he rejects the notion that consciousness has no place in the quantum world, which I passionately believe is incorrect. In fact, theoretical and empirical investigations reveal that consciousness is at the base of the unified field. The book is instrumental in helping lay people, like me, to understand the structure of atomic and subatomic particles and energy fields. I enjoyed it tremendously!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QDSXDSPHJ68L"
                },
                "Date": "on November 5, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23RABSGRTBM31"
                },
                "Date": "on January 2, 2006",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": "Wonderfully and lucidly written. Lays out most of the basics of quantum theory in an accessible way."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UIPUCS28ZCIA"
                },
                "Date": "on September 12, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SFGXMMIUVWDS"
                },
                "Date": "on December 26, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "A concise but necessarily somewhat outdated overview of modern physics which I greatly enjoyed and still highly recommend. Although there is no math, it will undoubtedly conceptually challenge many readers, but that's because in the true tradition of a Feynman or Sagan, Pagels tries to really teach the reader something instead of blinding them with science. A classic in its category."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SGYGPGC0BX4L"
                },
                "Date": "on December 3, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Excellent laymans explanation of experimental and theoretical physics; excellent description of Bell's inequality.  I didn't agree with the consequences of his interpretation; but did understand the physical mechanics of the experiment.  Very worth the read.  Too bad Heinz isn't around to update us for super string theory.  Only wanted a little more math."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3R2TMP0E63M0J"
                },
                "Date": "on October 13, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3A3Z5TRBOR5CF"
                },
                "Date": "on February 11, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Still one of the best introductions to the history of modern physics, and the understanding of particle physics and the structure of the Universe - well worth reading."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AV3CZBGT4TG2I"
                },
                "Date": "on November 5, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GTIL5STHMNO3"
                },
                "Date": "on May 15, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKY9RPPIHNQGC"
                },
                "Date": "on August 9, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A180COCKIP44XU"
                },
                "Date": "on December 18, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QDSXDSPHJ68L"
                },
                "Date": "on November 5, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is still one of the best introductions to the ideas behind the \"math\" of quantum physics.  It is well written and enjoyable to read.  Although the subject, as best we now understand it, is for the most part beyond intuition and at times defies the logic of everyday experience, this book paints as clear a picture as possible.  Even those (like this reviewer) with some formal training in the subject, who never knew just what the calculations they performed actually related to, will likely come to a better \"real\" understanding of quantum mechanics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKZI7E6FAYWB5"
                },
                "Date": "on February 16, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The glue is old and the paper cheap so the glue cracks as I turn the pages and the pages become loose as I'm reading. There is a newer edition out there, but I chose this one because of a nostalgia for this old edition because I had had the book when it was first published in 1982 and it opened up a whole new world of ideas.  I would recommend buying the newer edition.  Heinz Pagels was a clear and wonderful writer."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2394CQXLVDF1I"
                },
                "Date": "on August 17, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "A Fine book for beginners interested in quantum physics. Not laden with heavy math. Some comments are a little dated, while others show amazing prescience for latest developments in modern physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1M5LICYJFJKGT"
                },
                "Date": "on May 4, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book goes into understand able depth of a complex study, and makes it relatively easy for anyone to follow. If you are interested in the 'new' physics this is the book for you."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38K32J2Y5STYF"
                },
                "Date": "on January 16, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "If you are into heavy reading and meta overviews of the strangeness of life then this book is for you.  I read it decades ago and was awed by it.  I purchased my copy to see if I could understand it better after decades of learning and experience.  Still awes me.  The pages are old and the glue is past hoding but for the price I'm not complaining."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EZO74UCGCWXB"
                },
                "Date": "on February 1, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is a fantastic book on physics! The clear and interesting writing is what sets it apart from most books of popular science. It is so unfortunate that Pagels was taken from us while still so young; no doubt he would have written many more wonderful books."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGP5C8WN0AVIH"
                },
                "Date": "on July 28, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book gave a very good general history of physics. It's was a easy read and made me feel like I was a part of the whole debating on the different views. I definitely recommend this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3O8USEWM2MQYM"
                },
                "Date": "on April 18, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellan!. Complex subject matter explained in easy to understand laymen's terms. Would like to see more books like it. Especially an update, since written back in 1980."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANIWBW9DG8W3S"
                },
                "Date": "on December 20, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This has been a really great book so far!!  I'm learning so many new things: quarks, leptons, etc.  Heinz really brings out the interesting details of quantum physics!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EJKGO169BZVS"
                },
                "Date": "on June 29, 2010",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Heinz Pagels, may he rest in peace, was one of the greatest writers of physics. I read Einstein and Feynman and the three of them are by far the best writers to explain quantum physics that I have found, and I have read many. The illustrations were lucid and enlightening, and fun. The way Pagels writes and his well-developed analogies and explanations leave the writer feeling as though quantum physics was understandable. The following book, Perfect Symmetry, is also fantastic. I was very sad when Pagels died, and since, when I have been looking for someone with his abilities to write about string theory - but alas, writers of string theory are just as confused as the theory is.  If you can find Pagels in a used bookstore, you will enjoy the read - and actually feel like you understand something about quantum physics!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VITFN9XE0UVL"
                },
                "Date": "on March 19, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "After reading this  I wonder if there are an infinite number of Universes other than the one we live in."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EIP8O3LY1WIN"
                },
                "Date": "on May 7, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book is probably the best basic book on modern science available,"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MFKFZE1T6ASW"
                },
                "Date": "on January 20, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Nice product.  I bought it for my son.  He loves it!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1T2212ZDYUNEC"
                },
                "Date": "on September 19, 2012",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "Although I did not care for the rambling in the first 60 pages or so, the later pages revealed interpretations and explanations of experiments that I have not seen done so thoroughly and uniquely in several other lay physics books I have read.  The problem, though, is that Pagels tends to be highly opinionated and denigrates the positions of others when later research, if what I have read in more recent publications has been properly presented, suggests that the positions of others are vindicated.  Nevertheless, Pagels unique way of looking at things and explaining them does add a lot of value and I recommend the book.  Another excellent recent publication that covers a huge amount of territory (and seems to disagree with several of Pagel's conclusions such as \"Spooky Action at a Distance\") is Brian Greene's \"Fabric of the Cosmos.\"  I also have to agree with another commentator that Pagels' interjection of his opinions on \"the God issue\" seems unecessary and distracting.  After reading numerous physics books, the one thing I have concluded is that no one seems to truly know how things really work despite how dogmatically they present their positions."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3Q61856TS4VPD"
                },
                "Date": "on June 11, 2008",
                "Helpfulness": 0.48148148148148145,
                "StarRating": "2",
                "Text": "This is a really good book on Quantum Physics. I really want to give it 5 stars, but the draw back is that the Author is constantly injecting his views about God into book, which at times is very distracting. The book is good because it guides you through both the history of Quantum Physics, as well as its core concepts. If the Author is still alive, I hope that he will choose to release a new edition of this book that speaks to the new developments, discoveries and theories that have occured since the original publication of the book in the 1980's."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AO78JFGRNERKF"
                },
                "Date": "on October 22, 2013",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "This is a reputed classic in the subject matter.  Have not yet read it, so can't critique its content with any authority"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PA90XNZ9PEUP"
                },
                "Date": "on July 5, 2005",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "Excellent transaction...would do business with again.  Book a little more worn than stated."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Cosmic-Code-Quantum-Physics-Language/product-reviews/0486485064/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "40"
    },
    "Salesrank": "#57,830",
    "Timestamp": "2015-05-24 12:32:51.884790",
    "itemurl": "http://www.amazon.com/Cosmic-Code-Quantum-Physics-Language/dp/0486485064"
}
