{
    "Category": "in Books (",
    "ListPrice": "$16.99",
    "Name": [
        "E-Z Physics (Barron's E-Z Series)"
    ],
    "OfferPrice": "$13.25",
    "Reviews": {
        "AverageStarRating": "4.5 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TYE73QHFM8ML"
                },
                "Date": "on January 9, 2012",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "4",
                "Text": "This book seems to get a bad rap(wrap?) on sites so I felt I should do a review of it.  I bought it as a companion to physics for scientists and engineers.  Physics for scientists and engineers is very technical and can get very boring fast; EZ physics progressed in the same order as my text so that was very helpful.  Sure, the example problems aren't anything test/quiz like, but they are good for refreshing. The text is also very simple to read and worded in a \"layman's\" form.  All in all this book helped me get a B in calc based physics with no prior physics courses or calc courses in my life, so I'd say its decent.  4 stars because it is not perfect, if I could give it something along the lines of 4 and 1/3 stars I would."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2V4FVEC3RM9NF"
                },
                "Date": "on March 19, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "It was a great help to me for my physics class before applying to med school. You can see the 120 You Tube videos I made to go with this book by punching in 'world's oldest premed student physics'."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AGT9INKSN63B"
                },
                "Date": "on December 3, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "It's what my husband wanted for Christmas. Came in great shape, and I know he will love it when he opens it up on Christmas morning."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1G2KXTETKGIF9"
                },
                "Date": "on September 9, 2013",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "I have received this book and I am delighted with it. There are so many exciting things to learn about Physics!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LSGHL92C7X7H"
                },
                "Date": "on March 31, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Loads of information to get my 7th grader started in physics. We will be supplementing most of the information in this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AU6TPACAH0FX"
                },
                "Date": "on May 31, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "I Began learning Physics just 3 weeks ago with this book and have gone though 4 chapters already. It is because This book is written well and is easy to understand, its so good that it is hard to put down. I originally got this book from the library but then bought it for around 10 bucks from Amazon. Its worth much more.  its good to have a prior knowledge of Algebra and triq before attempting to solve the many problems in this book. I am doing 2 summer physics classes and feel confident this book has given me the tools to pass the classes."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2I1K83U5KNZ7C"
                },
                "Date": "on February 19, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Really helpful in understanding the complicated topics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36G2PKDYQ7DZF"
                },
                "Date": "on October 23, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "It is helping me in physics class"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KXCL3FS8OF0E"
                },
                "Date": "on September 4, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Good!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TGB1FNT5P0JE"
                },
                "Date": "on December 8, 2010",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": "THIS BOOK IS GREAT, OH MY GOD!!! I BOUGHT IT ONLY DAYS AGO AND I'LL TELL YOU IS WONDERFUL,IT IS ALSO FULL WITH SO MUCH BASIC INFORMATION, IF YOU NEED IT DON'T THINK TWICE ABOUT IT YOU'LL LOVE IT."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VBNRUJ6KWM72"
                },
                "Date": "on April 5, 2011",
                "Helpfulness": 0.2857142857142857,
                "StarRating": "1",
                "Text": "I bought this book for a Physics class. I had high hopes for this book. Unfortunately, I was extremely disappointed. The book doesn't clearly explain a thing. Formulas are very confusing and it doesn't give enough examples for each problem. I've even found typos and incorrect answers in the back of the book. Overall, the book would be a decent supplement to a regular physics textbook. However, if you are using this book as your sole source for learning physics you will have to find other online sources (or books) to help clearly explain concepts."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/E-Z-Physics-Barrons-Robert-Lehrman/product-reviews/0764141260/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "11"
    },
    "Salesrank": "#88,699",
    "Timestamp": "2015-05-24 12:51:48.052502",
    "itemurl": "http://www.amazon.com/E-Z-Physics-Barrons-Robert-Lehrman/dp/0764141260"
}
