{
    "Category": "in Books (",
    "ListPrice": "$16.00",
    "Name": [
        "Quantum Reality: Beyond the New Physics"
    ],
    "OfferPrice": "$14.08",
    "Reviews": {
        "AverageStarRating": "4.5 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KJO5VP4K3CHU"
                },
                "Date": "on December 28, 2008",
                "Helpfulness": 0.989010989010989,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALD327BR0VOGQ"
                },
                "Date": "on May 17, 2000",
                "Helpfulness": 0.9391304347826087,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGBCZVYWRE8Q2"
                },
                "Date": "on January 31, 2000",
                "Helpfulness": 0.9574468085106383,
                "StarRating": "5",
                "Text": "This book is, without a doubt, one of the best nontechnical physics books I have read.  As a kid in high school, this book was my first introduction to the mysterious world of quantum physics. I was amazed that,  despite my technical illiteracy, Herbert gave me both insight into the  inner mathematical workings of  quantum mechanics, and into the deeply  troubling conceptual problems that this radical theory forces upon us. Even  today, as a graduate student in theoretical physics, I have a more profound  appreciation for quantum mysteries than any of my classmates, simply  because I read this book in highschool. I would recommend this book for the  layperson and the quantum feild theorist alike!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on August 29, 2001",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "If your aiming to simply understand as much as possible about quantum theory by reading one popular science book, then look no further. This book deals with all important theories and experiments in a clear way, without omitting the more difficult stuff. I have also read \"taking the quantum leap\" by Fred Alan Wolf but find it incredibly unclear because of its reluctance to show real physics. Talking about quantum physics without getting into too much detail for the coffee table reader makes it fragmented and obscure. Wolf favors vague talks of wonders over the step by step explanation of experiments that lead you to the heart of the problem. Herbert made me understand quantum reality as much as possible by using clear text with clear diagrams, explaining enough physical detail for me to appreciate the wonders of quantum reality. And yes... I'm still wondering. Enjoy!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A386QVFHNI08G1"
                },
                "Date": "on April 10, 2002",
                "Helpfulness": 0.890625,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8OJ5I0JM91SP"
                },
                "Date": "on March 7, 2004",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "There's something about this book that makes it an instant classic. Though it is not the newest and most \"user-friendly\" book on quantum physics out there, I recommend this title as a great way to kick-off your knowledge search into this and related subjects. Despite the \"mystifying\" subtitle, the book is not purely \"pseudo-science\" and is packed with a lot of detailed and concrete information. From classic experiments such as the \"photon slit experiment\" and the \"russian gravity wave detector,\" this book bravely plunges into the enticing riddles of the physics world. Struggling with the wave-and-particle-like duality of forces, and listing the different types of possible realities proposed by different theorists, this book serves a great window into the complicated beauty of a world unseen."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27Z51OEVOT733"
                },
                "Date": "on May 2, 2003",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Of all the books that I've read on quantum theory that do not use calculus, this is probably the best. He is clear and succinct and ties things together in ways that click (at least for me). Some others that I'm reading that I'm comparing to: Quantum Theory - A Very Short Introduction by John Polkinghorne (good, but very quick pace), The Story of Quantum Mechanics by Victor Guillemin (also very good, might come in second), Thirty Years That Shook Physics by George Gamov (alright, particularly good for anecdotal stories from one who knew these guys), and Physics and Philosophy by Heisenberg (good, but I'm not too far yet, clear, and a good writer)."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DCJ5Q657UK5K"
                },
                "Date": "on June 8, 2002",
                "Helpfulness": 0.9,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on December 25, 1996",
                "Helpfulness": 0.9444444444444444,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on September 24, 2003",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SGR7LE899LGG"
                },
                "Date": "on May 15, 2004",
                "Helpfulness": 0.8695652173913043,
                "StarRating": "4",
                "Text": "I found this reading on Quantum physics to be very good overall, but many explanations were carried over in a more complexed and technical manner than necessary. The wave definition chapter is very good and gives you a good understanding on the basic laws of waves (very important in quantum physics). The Dirac's view on the subject is very poorly explained, and the general tendency on relying on thecnical explanations (as mentioned before) makes this reading somewhat fatiguing at time. Overall a good book, but not the only one you might want to read on the subject for a full understanding."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on November 26, 1997",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "For those souls wearied of a cut and dried world, read this book!  Quantum Reality is appropriately titled, as Herbert explores the ideas of reality inspired by quantum physics.  And boy does it get weird.  He quotes Richard Feynman up front warning against asking \"How can it be so?\", and then devotes the book to exactly that attempt.  The subject is abstruse, but Herbert offsets some (not too much) technical talk with vivid images and quotes.  The reader can choose to \"bleep over\" the hard parts and still finish with a renewed sense of wonder at the universe we live in.  This is an important, edifying and deeply enjoyable book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1E37DNGUC3GCI"
                },
                "Date": "on February 27, 2006",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JYY1MNJH6C1I"
                },
                "Date": "on January 1, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book is very well written, and makes the paradoxical facts of atomic physics comprehensible to the layperson. It is rare to find such a book; either they are too oversimplified, or too stratospheric. In addition, the  logical progression of the book prevents confusion. If you don't know  higher order mathematics (I certainly don't), but still want to be  quantumly literate (is \"quantumly\" a word?), you want to read  this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYEY6KF6RP0KP"
                },
                "Date": "on July 15, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DI7KWXQZZ7OU"
                },
                "Date": "on September 17, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1N2LZPU91YZ7X"
                },
                "Date": "on March 1, 2006",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is a great book.  Instead of highlighting one or two strange quantum examples, this book really tries to explain what is going on.  Given that nobody really knows what is going on, this book does a very good job of explaining the prevailing theories.  Other books such as \"A brief history of time\" and \"the elegant universe\" talk a little about quantum mechanics, but they left me with an incomplete view of the field.  Although this book will not turn you into a quantum physicist, it will help you understand what quantum stuff is all about."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21ATVN2BJC01J"
                },
                "Date": "on February 25, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKVZXKGL91HE7"
                },
                "Date": "on July 23, 1999",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book just flew by.  It is loads of fun.  That is absolutely not to imply that it is simplistic however.  It is mainly concerned with the garnder implications of quantum theory, and every once in a while, one  needs to indulge those urges to ask the crazy questions about this crazy  theory."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KFCCRRXEB5KY"
                },
                "Date": "on September 17, 2006",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19OORKBG1VUGU"
                },
                "Date": "on September 19, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Richard Feynman noted that no-one understands Quantum Mechanics.  OK.  If you want a virtual understanding, this book is a great start.  It is easy to read, easier to read than other books mentioned by reviewers, and you come out of it feeling you at least understand something of Quantum Mechanics.  I enjoyed it so much I summarized my notes, so I could have my understanding of it on a few pages.  I do that only with the best books I read.  There is a very little bit of mathematics, but for those of us who didn't take 4 years of college level math, this is very understandable.  I've also seen this book cited in other books that present Quantum Mechanics in simple terms.  Since QM is replacing the Newtonian paradigm that our society is built on, this book is well worth reading.  I wish I'd run across it in high school, I'd have read it as carefully as I read Lord of the Rings."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29D43E3R6JGEJ"
                },
                "Date": "on August 22, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "As Nick Herbert points out early on in the book, the best kept secret of modern physicists is that they have \"lost their grip on reality.\" Although written in the 1980s this book remains, in my opinion, the best overview of quantum physics on the market. One has to wonder why the Newtonian model of existence is still pushed so remorselessly in our schools. Evidently we are only comfortable with the blatant external appearances of life and are terrified of looking beyond that. What you cannot see...you must ignore. Nick Herbert does an excellent job of exposing that paradigm as a ridiculous self-deception."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7UMC95YCRGTS"
                },
                "Date": "on January 29, 2001",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKF9MMZ0LRG5I"
                },
                "Date": "on March 24, 2004",
                "Helpfulness": 0.7777777777777778,
                "StarRating": "5",
                "Text": "This is a very clearly explained book by Dr. Herbert. The concepts of quantum mechanics are explained very nicely, and so are the 8 different interpretations of the quantum reality. Also if you want to know what Bell's inequality is, and quite a lot of things on how it is violated by the EPR entangled pairs, and what the EPR pairs are, then this book is really great for that. After a whole lot of tests are performed, such as the one above, Nick logically disects the 8 interpretations and sees how they are different now, and if they are still relevant."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RM1DEIDWOXYN"
                },
                "Date": "on June 7, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A323MND3MTFWEH"
                },
                "Date": "on March 5, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21JF8KCYLDI5W"
                },
                "Date": "on September 28, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book has been on my shelf for 15 years and never fails to excite me when I pick it up.  Theoretical physics is so fascinating and only because Nick Herbert makes it so easy to understand. The realm of quantum mechanics is so unreal and begs us to consider its philosophical and even religious ramifications.  Putting the many quantum principles in perspective, Quantum Reality takes the reader on a new journey of discovery.  If we really want to know what we cannot explain and see the world for what it \"really\" is, which is beyond our wildest dreams, this is a good place to start."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QURT94H95QB8"
                },
                "Date": "on June 22, 2007",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "This isn't easy reading for a first quantum physics book imo, because it quickly gets to the reality interpretations of quantum physics before it discusses the physics. This can make it confusing reading, especially the first time through. If you are already knowledgeable about the quantum facts, then jump right in and explore the possible underlying realities with this book. Any discourse on the reality underlying quantum actions should be somewhat confusing - no one understands it and there are many theories."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AP8OG94RK8ESV"
                },
                "Date": "on December 7, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "An excellent presentation of the issues of reality and the various interpretations. Clearly written. Enjoyable reading. Written at a level to be understood by the uninitiated but also interesting for those who have studied physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1N4QU3ZIZZKRY"
                },
                "Date": "on July 2, 2012",
                "Helpfulness": 0.75,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HYOSTX8I94DT"
                },
                "Date": "on July 23, 2000",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "This book was a real page-turner.  I learned a lot about quantum mechanics from this book.  I wish I'd read it back in grad school when I was actually doing this stuff!  And the conclusion is great - the universe really is  strange!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CD26VC79U9HE"
                },
                "Date": "on August 2, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "It gave me a full workup about Quantum Mechanics and encouraged  me to go further. He knows his stuff and knows how to teach ir."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38JKONR3APBGK"
                },
                "Date": "on January 7, 2011",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "I've attempted to read many books on this subject matter-I find it fascinating. For people who want a clear, organized survey of prominent theories in contemporary physics, this is your book. It lays it all out: the players, their ideas, the strangeness of it all....And even though the theories are often incomprehensible, they're fun and interesting to read about."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34ZV1MHRP71S2"
                },
                "Date": "on January 29, 2006",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "5",
                "Text": "Without veering off into New Agey territory too much (hello Mr. Talbot), this book explores the scientific side of quantum strangeness. It is a bit more involved and complicated, but it is still comprehendable with some concentration. Of course, it will help if you have some prior knowledge of quantum mechanics. This is an excellent book on a fascinating subject. Science and magic meet in the quantum world!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A252E790P52XNM"
                },
                "Date": "on December 7, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23Z4CH7R2TORD"
                },
                "Date": "on April 30, 2008",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "The key values of this book are 1) its holistic approach to explaining quantum mechanics and 2) its \"realist\" (philosophically materialist) perspective on quantum mechanics.  It's an extremely lucid account of quantum phenomena and quantum theory for the lay reader with excellent analogies and examples."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PYR4D7KXO8VZ"
                },
                "Date": "on December 5, 2006",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XH2YBQQECCRK"
                },
                "Date": "on November 6, 2012",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": "This book is very interesting; however after reviewing many books on this extremely World-Changing view of Science, I found it a little among the level of the average lay-person.  I would put it about mid-level, just slightly above the reader interested in this fascinating subject. I have been studying this profound view of science for over 10 years now, and still cannot get a very good grasp of what it is technically saying. Quantum Reality as a subject has definitely changed my Reality and the way I see the world. It is an environment that is so unique, as to be in another Dimension. That is about the best way I can explain it at present, even though I have a Doctorate in Psychology and a Stanford-Binet IQ rating of 163. Give it a try, but be warned, Quantum Physics, or Mechanics, or Science or Reality, it is still the Science of Possibility..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IENIQQPDMSIF"
                },
                "Date": "on November 26, 2000",
                "Helpfulness": 0.625,
                "StarRating": "5",
                "Text": "Easy to read description of different viewpoints of quantum mechanics. While there is somewhat of a sensationalization of the weirdness of the physics, indeed this weirdness is real (whatever real is, one supposes) and at the time of this review, still not well understood."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VHHI3VXHIQZV"
                },
                "Date": "on January 7, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "One of the best books on this topic. Understandable to wide audience without sacrifice of the rigorous logic."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACJSIRDWATLMF"
                },
                "Date": "on November 7, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Brilliant explanation of quantum realities"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1472Z54ECYT2P"
                },
                "Date": "on June 20, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "This is a different angle on Quantum Physics as this author has chosen to elaborate on the different quantum reality views help by different camps of thought.  Very interesting read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28THAZWNG5NZF"
                },
                "Date": "on August 20, 2014",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": "Sober and mandatory read for those lost souls, like Einstein, that have wasted their talents trying to re-interpret quantum mechanics. Overextending the theory with a myriad of fundamentally untestable claims leads to confusion and 'religious wars' within the scientific community. No more strange belief such as weird hidden variables and silly multi-world interpretations : Quantum mechanics just works. No more no less. Gratitude is owed to the author for extricating all of us from the mire of beliefs the community has been plagued with for the last century."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EPCDC2JJNG9"
                },
                "Date": "on October 1, 2014",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "2",
                "Text": "This book depends on too much jargon in explanations and needs more  analogy in explaining concepts. It does not draw enough comparisons and contrasts between the points of view.  I did not find it particularly well written.  I am a PHD biologist / microbiologist and this might explain my lack of enthusiasm for this book.  I hoped for greater insight for the non-physics major.  At the end of the book I had a somewhat better appreciation for the complexity of the subject but not a really better understanding."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RLPVO7BM6IAI"
                },
                "Date": "on December 12, 2013",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "3",
                "Text": "Pretty good but does get a little involved for those of us who are not totally interested in physics, gets a little difficult to stay with and therefore I've only read about half the book.  I don't think I'll finish it."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 23, 1997",
                "Helpfulness": 0.2727272727272727,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5IACXTUNAUT4"
                },
                "Date": "on December 30, 2013",
                "Helpfulness": 0.10526315789473684,
                "StarRating": "1",
                "Text": "These eggheads must be a few cards short of a full deck to agree with this \"stuff\".  Save your money, it's all BS."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14HFU0L07YVHY"
                },
                "Date": "on November 30, 2006",
                "Helpfulness": 0.07407407407407407,
                "StarRating": "1",
                "Text": "Herbert gives a comprehensible exposition on quantum theory, its history and development, and how it is relevant to ordinary human life.  This is a must read for anyone interested in the new science."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Quantum-Reality-Beyond-New-Physics/product-reviews/0385235690/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "48"
    },
    "Salesrank": "#115,285",
    "Timestamp": "2015-05-24 13:15:40.778371",
    "itemurl": "http://www.amazon.com/Quantum-Reality-Beyond-New-Physics/dp/0385235690"
}
