{
    "Category": "in Books (",
    "ListPrice": "$3.00",
    "Name": [
        "Flatland: A Romance of Many Dimensions (Dover Thrift Editions)"
    ],
    "OfferPrice": "$2.70",
    "Reviews": {
        "AverageStarRating": "4.2 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39GYZZRPSQX0U"
                },
                "Date": "on May 31, 2001",
                "Helpfulness": 0.9181818181818182,
                "StarRating": "4",
                "Text": "Although it isn't very long,  Flatland does take a long time to read.  This isn't because it is boring, or because it is hard to read, but because of the large amount of digestion one need's to fully comprehend (and to fully enjoy) this book.  Even this book contains only 82 pages, it is by no means light reading.  The book was originally released in 1884 under Abbott's pseudonym A Square.  In the story we follow the journey of a square who lives in a land of two dimensions--a flat land.  In it class, and ultimately intelligence, is determined by the amount of sides that a shape has.  As the amount of sides a shape has decreases, we find that it also is more emotional and apt to cause destruction through their pointed corners.  Women are depicted as straight lines, but one has to take into account the time that this book was published.  One can also disregard the story as having any relations to anything in our society and enjoy it for what it is, a mind bending social criticism.  In this tale we follow  the aforementioned square through his everyday life.  we learn what it is like to exist in only two dimensions. We learn of how rain falls form the north and disappears to the south and how gravity is a minute force that pulls to the south ever so slightly.  We follow him through the government and through social classes, and the discrimination that comes with them.  When his son talks of geometric impossibilities such as 23  (cubed) he has a dream of a lesser land than his, a land called line land.  IN it there is not two but only one dimension of being.  Through discussion with the kind of lineland, we are offered insight into why our hero the square cannot conceive of the third dimension. Later our hero is visited by a great being, a sphere that appears to him seemingly out of nowhere.  This confuses the square very much, and even more when the sphere tries to explain how he passed into his dimension from the third.  After heated debate, the sphere takes him and shows him the third dimension, turning our hero into an evolved form of him self, a cube.  Form his higher vantage point the square is able to see the innards of those who reside in flatland.  He receives tutoring from the sphere about this new dimension and all that it entails.  He learns of how limited the field of vision is for those living in flatland, both literally and figuratively.  With his previous limits of reality stripped and with his eye opened to the truth, the square quickly follows logic and asks to see the insides of the sphere, and wishes to ascend further into greater dimensions, fourth dimensions and fifth and onward and upward.  The sphere is appalled by this heresy and send our hero back to the limited realm of flatland.  Here he tries to convince others to be enlightened, but cannot find success.  He has a second dream involving the dimension of pointland, no dimensions.  The being inhabiting this land is of nothing and knows nothing but itself, which is nothing.  There fore this being cannot be disappointed by anything, because it cannot conceive of anything other than itself.  We can see the religious parallels to Hinduism and Buddhism here.  The completely content creature is of nothingness, much like the state that Buddhists try to achieve, and the outward ranking by dimension not sides can be seen in Hinduism in the spiral path towards God that the Hindu believe they travel along passing from one point on the spiral to another with each passing life.  In this land of math all of the lands are contained within each other, much like the rings of the spiral.  Finally after this dream the square realizes the futility of trying to convince others through speech, and he feels he must do it through demonstration.  Folks hear of his heresy and bring him to the court for the climax of the book.  Whether or not the plot of the novel itself is very entertaining, the ability to get your head around concepts that can only be experienced through the mind is challenged thoroughly by this novel.  It is a must read for anyone who thinks that they are well educated, as it will quickly tell you just where you stand, theologically, philosophically and mathematically."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2W1TK5CJXKH5U"
                },
                "Date": "on July 7, 2006",
                "Helpfulness": 0.9264705882352942,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TZ7VUNVDBKF"
                },
                "Date": "on September 3, 2010",
                "Helpfulness": 0.9024390243902439,
                "StarRating": "1",
                "Text": "This edition is essentially unreadable and not representative of traditional printings. It's printed directly from the digitized (and free) copy from Google Books and has clearly had NO editing work done. The book is filled with references to figures that were not included, mangled words, and seemingly random breaks and markings in some spots. This would be fine for a free digitized text online, but is entirely unacceptable for a paid-for product, especially a short book that would be similarly priced in a physical store."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on December 13, 1998",
                "Helpfulness": 0.92,
                "StarRating": "5",
                "Text": "Flatland is THE must-read for anyone interested in getting a feel for higher dimensions. The book is extraordinarily readable and succeeds even with people that are afraid of mathematics. Abbott's charm lies in his  ability to write simply and clearly about a topic that has its share of  very unreachable, esoteric books. You fall into the story (whose plot is by  no means secondary to the mathematical ideas), and before you know it you  find yourself in contemplation of things like the fourth and fifth  dimensions. The visual image that this book provides is a necessary step to  envisioning and then understanding the idea of higher dimensions, even for  those already versed in the mathematics of it. You never know, after you  read this, you might even be willing to try your hand at things like  Einstein's relativity. A little on the social aspects of the book: keep in  mind that it was written in the very late 1800's. Hidden within the  philosophical and mathematical ideas is a satire of the social climate of  the times: how women, the military, the upper echelons of society, and just  about everyone else were viewed. Flatland makes you think, and think  deeply, on many different and sometimes unexpected levels."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on May 19, 2000",
                "Helpfulness": 0.9583333333333334,
                "StarRating": "5",
                "Text": "From the square character's world of two dimensions in Flatland to the Sphere's three dimensional Spaceland, one comes to recognize the role of dimensions in geometry and in thinking in Abbott's Flatland. Both a  mathematical essay and a satire the book challenges readers to discover  dimensions for themselves in an unusual story.  Beyond the story of the  square lawyer protagonist and his adventure with the Sphere is the satire  on Abbott's English society. Women are depicted as lines with the power to  destroy men with there sharp, pointed ends. They are forced to remain in a  constant waving motion as a courtesy to men in order to remain visible. An  interesting predicament surfaces when coloring becomes a popular practice  in identification. Women from certain viewpoints appear the same color as  priests, much to the priests' chagrin. In sum, the women appear to have an  inferior role to the multi-sided men as women faced inequality in late 19th  century society.  Secondly, the shapes themselves present a hierarchy  of society. From the irregular figures to the noble Circles, each shape has  its own ranking and occupations. Moreover, each shape is subdivided into  figures that have a higher status in the Flatland world. For example, the  equilateral triangle is seen as superior to any of the other isosceles  triangle with top angles of less than sixty. These shapes have little hope  of progressing; hope lies in their offspring which may possess a more  respected number of equal sides. This can be seen as an analogy to the  lower classes struggle to achieve success in the society dominated by the  wealthy or aristocratic.  While the story of Flatland may be a mockery  of Victorian England, its heart is its mathematical meaning. It serves as  an interesting and understandable window into the subject of dimensions.  From Lineland, which knows no left or right directions, to the abstract  Fourth Dimension, where it is possible to look inside a solid object,  readers are introduced to new ways of thinking not usually encountered in  math class. Most importantly, the text of the book is not beyond the scope  of someone with a casual interest in the topic. Anyone can appreciate the  search for the meanings of dimension and truth in easy to comprehend  analogies presented by the author.  Another math topic addressed is the  discovery of new ideas themselves. Abbott shows that math is a field where  anyone with an interest has a chance to succeed just as the main character  stumbles upon the meaning of dimensions from thoughts from his grandson. He  pursues his hypothesis on the dimensions of Spaceland as well as develops  the ideas for the Fourth Dimension on his own. Although he is imprisoned  for his thoughts and attempts to teach others, the square keeps his  theories, not letting the views of society interfere with his work. It is  interesting that he faces this fate when trying to educate the public about  the truth of their world and beyond.  On the whole, Flatland is more  than just a short book with intriguing mathematical ideas. It is an opening  experience to the search from the truth behind the world through the  subject of dimensions. While mocking the English , the book also introduces  readers an odd world of shapes and figures. Lastly, math is encouraged even  though it may go against the grain of society. Any book that introduces  readers to a new way of thinking is worth reading."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TN0L7YA0VFHV"
                },
                "Date": "on June 21, 2001",
                "Helpfulness": 0.9130434782608695,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FWCSHKBKBU17"
                },
                "Date": "on August 8, 2010",
                "Helpfulness": 0.868421052631579,
                "StarRating": "1",
                "Text": "Warning: this is a terrible reproduction of the wonderful classic Flatland. I bought copies for college students and was very disappointed in the presentation. Very small print, poor contrast, and no decent formatting. Try to find an older printing, used if need be."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 18, 1999",
                "Helpfulness": 0.9047619047619048,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABBRA3KDUBFLZ"
                },
                "Date": "on November 22, 2010",
                "Helpfulness": 1.0,
                "StarRating": "1",
                "Text": "What a disappointment this edition is.  I have previously read Flatland, and part of the charm of the book is the hand drawn illustrations, which in this book are ASCII approximations!! Buy any one of the other editions - this one is cheap and nasty.  I will be asking for a refund."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NRJPY8LPHYJL"
                },
                "Date": "on August 19, 2001",
                "Helpfulness": 0.9333333333333333,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1S3C5OFU508P3"
                },
                "Date": "on April 22, 2001",
                "Helpfulness": 0.9333333333333333,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VP7JOT3K7PFM"
                },
                "Date": "on June 6, 2004",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2E1FDDZHJZA4K"
                },
                "Date": "on December 29, 2009",
                "Helpfulness": 0.875,
                "StarRating": "1",
                "Text": "Don't buy this version, there are plenty of others, including free downloads.  The formatting of this book is broken such that there's a forced line break every other line, making the text annoying to read.  Get one of the others that is properly formatted and don't waste your money on this one."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANW2FSHJ0ZPFD"
                },
                "Date": "on February 24, 2000",
                "Helpfulness": 0.9285714285714286,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MQXFVZ9DCE8M"
                },
                "Date": "on May 6, 1999",
                "Helpfulness": 0.9285714285714286,
                "StarRating": "4",
                "Text": "This classic short novel is centered about intelligent beings that live in only two dimensions. One of the inhabitants, Mr. Square, describes his world and visits a one-dimensional world. He later encounters beings from  the third dimension. Mr. Square finally considers even higher dimensions.  This tale by Edwin A. Abbott (1839-1926), an English clergyman and  academic, has become quite popular with those physicists and mathematicians  who study higher dimensions. It is also regarded as a classic in the  development of speculative fiction. I really enjoyed reading it. I've had a  copy on my shelf for over forty years and I have never met a Ph.D. in  physics (or math for that matter) who has not read it. Any student of the  development of science fiction should also have a copy."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SV7POGR6RBDP"
                },
                "Date": "on January 30, 2008",
                "Helpfulness": 0.9285714285714286,
                "StarRating": "5",
                "Text": "This has always been a favorite of mine, so I wanted to christen my kindle with it. I imagine most people who will buy it for the kindle have probably already read it.  If you like a mixture of Gulliver's Travels, Geometry and social commentary, it is worth the small amount of money.  Of course you can get it for free since it was written in the late 1800's, but the Gutenberg version doesn't have good diagrams - they are all ASCII.  I couldn't find diagrams in the versions available on AMAZON except the Oxford World's Classics edition, so that is the one I recommend.  The diagrams are important for the geometry aspect and are excellent in this version."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9998RE3AEA95"
                },
                "Date": "on February 19, 2000",
                "Helpfulness": 0.9230769230769231,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WB153XQLSW7"
                },
                "Date": "on August 7, 2010",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KUYEX5OS33MF"
                },
                "Date": "on May 2, 2010",
                "Helpfulness": 1.0,
                "StarRating": "1",
                "Text": "This edition of Flatland has all of the diagrams made with the keystrokes of a typewriter, not with continuous lines. So the squares, triangles , circles , etc, are illegible. Since the many diagrams are an indispensible part of the book, this edition is completely useless.  I bought four copies of this edition for gifts and had to trash them all. Flatland is a very well written, profound, thought provoking discourse of our inability to comprehend life in more dimentions than the three that we occupy, and it is a shame that this edition, well done in all other aspects, contains this fatal flaw, rendering it junk.  Do not buy this edition.  There are many other far better editions."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ODGAW5Z2EJ1M"
                },
                "Date": "on January 28, 2006",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LMBM1N4EXS5W"
                },
                "Date": "on June 1, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1P0ZB4YAA312R"
                },
                "Date": "on October 11, 2003",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QZCA4LTTVGAD"
                },
                "Date": "on January 12, 2003",
                "Helpfulness": 0.7906976744186046,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3L4ELX55Y202O"
                },
                "Date": "on January 1, 2005",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I started reading this book thinking it would not work well for analysis in a literature class but I was suprised.  While explaining geometric concepts, it has all the elements of any other story.  The book was easy and fast to read and comprehend.  After finishing this book as an assignment, I quickly bought Flatterland for independant reading.  I haven't found the time to start Flatterland but by the blurb on the jacket and other reviews, I am looking forward to it.  I recommend this book to any high school student or slightly younger students interested in math or science.  Of course, I recommend this to adults as well."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMX0PJKV4PPNJ"
                },
                "Date": "on September 9, 2004",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YC6AANV4GZ0F"
                },
                "Date": "on July 26, 2005",
                "Helpfulness": 0.9,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AP4JU2OIFUWMM"
                },
                "Date": "on November 30, 2011",
                "Helpfulness": 0.9090909090909091,
                "StarRating": "1",
                "Text": "I love the book and have had my copy since the 1970s.  I downloaded the Kindle version and discovered that there are references to diagrams but they are not included (that I could find).  This book is impossible to enjoy without them."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A48ULJD99IYZR"
                },
                "Date": "on November 19, 1997",
                "Helpfulness": 0.9,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACOBIT7H3G5KG"
                },
                "Date": "on November 14, 2010",
                "Helpfulness": 0.9,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on December 15, 1996",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MJMYLRTZ76ZX"
                },
                "Date": "on September 29, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CTSDJVTOA3X1"
                },
                "Date": "on February 19, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book is utterly amazing; by playing out \"mr. square\"'s life on a 2-dimensional surface, and soon his realization of the first and third dimensions, the reader is left pondering over the things beyond our world.  ....................To those who are ignorant torwards the enlightening  proposals of this book, and think you might rate it like the person before  me, save yourself some time and return to your \"alice in  wonderland\"... This is way past that Lewis Carol's writing (though I  loved it dearly) and has nothing to do with fairy-tales. It is presicely  the opposite, it takes to somewhere where few have dreampt of, and even  fewer have written on.  I highly reccomend this book to everyone  searching for what is \"past our dimension\"."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PK9PH3TZPWCQ"
                },
                "Date": "on November 6, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "The author makes a very good attempt to help us grasp what it means to live in a world bound by time, yet knowing there is another world with no such boundary.  He does it by presenting creatures that live in a two dimensional world and tries to capture their perspective.  The battle he faces is that the two dimensional world is in fact imaginary, while the world we live in is real.  Points and lines do not have width and the planes they occupy have no depth--yet the creatures he tries to create must have depth in order to exist in the way that we know existence.  The author doesn't quite resolve this, but the work is very entertainiing."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11ZCNWCZ3LR9Q"
                },
                "Date": "on January 15, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LRWPGZVEKQZR"
                },
                "Date": "on January 13, 2004",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ULF3LM8OBKI2"
                },
                "Date": "on July 5, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book at first is very dense. But once you get used to the writing style it becomes a great tool for thinking about perception. I especially like the section on shading and how that can determine what it is you are looking at. It is a short book but it does take a little a time to get through. Overall, it is a very good book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37XGUQ1VH0XM6"
                },
                "Date": "on July 13, 2006",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37XGUQ1VH0XM6"
                },
                "Date": "on June 16, 2002",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2C8RRGLZIIFTG"
                },
                "Date": "on June 7, 2002",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IFUWJX1SCLB0"
                },
                "Date": "on January 10, 2014",
                "Helpfulness": 1.0,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A274I6G6GGETCT"
                },
                "Date": "on August 19, 2001",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RUMJHU5PIV80"
                },
                "Date": "on February 8, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I am a freshman in High School and in my Geometry honors class we are reading this book. It helps me understand all of the terms and dimensions of Geometry, and is a good book satiring society!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QGUWN6AMVKKP"
                },
                "Date": "on October 20, 2008",
                "Helpfulness": 0.7692307692307693,
                "StarRating": "5",
                "Text": "If you are at all interested in the nature of multiple dimensions, in mathematics, physics, or plain old common sense curiosity, you should read this book. It is a story of an inhabitant of a two dimensional world and his discovery of a third dimension. He finds out that he is a cube, not a square."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11ED8O95W2103"
                },
                "Date": "on October 28, 2006",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3F2JAVBBNM6RV"
                },
                "Date": "on July 22, 2005",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Although the decidedly Victorian language may sound a bit strange to the 21st Century ear, Abbott's approach is classic: assume a set of social rules that is driven by an alien environment.  In this case, assume the constraints (and freedoms) offered by living in two dimensions.  Further, imagine encounters with life in one or three dimensions.  Do you mock those living in one dimension?  Do you gape in awe at the three dimension world?  You might read Flatland to appreciate the historical foundations of modern sci-fi.  You might contemplate the themes for personal reflection.  You might share it with others to sponsor interesting conversations.  No matter how you use it, it's worth the read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHXYMA8V6Y4BU"
                },
                "Date": "on May 9, 2009",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": "Reading reviews on this little gem of a novelette I have owned for over 33 years now, I see most have completely missed the point. Square states this clearly: \"inspired people are always considered by the majority to be mad\". Although Abbott's little book has been embraced by generations, used as a guide to kiddy schoolers in understanding geometry, its message runs much deeper. It is an illustration of mankind's effect on innovators who disclose knowledge at the cosmological level. It is the story that parallels all those who became a majority of one, all those who have seen further than others, to all who examine a pretty shell at the beach and realize there is a sea of knowledge before them, to all who have dared to step outside the box. Those are the innovators who have stepped out of flatland into spaceland and were subsequently denounced and ridiculed. Galileo, who expanded the universe a thousand fold, was put into house arrest by the inquisition...those priests refusing to \"look through his tube\" (a telescope). We pay the Edison company for a Nikola Tesla product (the inventor of alternating current). Tesla died almost forgotten and penniless. When demonstrating the first electro-magnetic device, Faraday was asked what good is it? His response, \"I don't know...what good is a newborn baby? Someday they will learn how to tax it\". The history and drama of the discoverer is the story of \"square\", his newly acquired cosmological knowledge through meeting \"sphere\", and what happened when he tried to disclose it to flatlanders. \"Square\" was a spacelander in a world of flatlanders."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16S84C9L5SC1Y"
                },
                "Date": "on February 11, 2011",
                "Helpfulness": 0.875,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1B5Z9TAIELK4X"
                },
                "Date": "on September 29, 2003",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Abbott's imagination is just fantastic.  And I say fantastic in the most realistic sense.  He has so many amazing ideas and makes everything so believable, but also makes you consider the possibility of something, some world completely beyond your conception; completely beyond your reality.  It's entertaining and interesting and left me turning page after page, not putting the book down.  Anyone who would like a good, interesting book should check this out.  It's great for everyone because not only is it a fabulously well-written imaginitave piece of literature, it's very short.  Short enough to finish in a day as I did."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHOPJ3HERWNDF"
                },
                "Date": "on April 13, 2000",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "I disagree w/last reviewer.  Flatland doesn't just lampoon the 1880's.  Victorian is Abbott's writing style.  But his social comment is as sharp today as Gulliver, and Screwtape's. If you can't spot the irony the entire  book is offensive.  If you do spot it, the parallels between say - its  women & the current suppression in Afganistan, or education &  Chinease purges, or angling up & US college sport programs - are  hilarious and bone chilling.  Abbot's  guesses on equator based navigation  are quite accurate.  North swimming bacteria actually have a lot in common  with the travelers in Flatland."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EZ3H06GLFW5D"
                },
                "Date": "on October 20, 2010",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LMBM1N4EXS5W"
                },
                "Date": "on June 1, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YQC925PTL267"
                },
                "Date": "on July 9, 2002",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZQVDGTRDC9IF"
                },
                "Date": "on December 27, 2011",
                "Helpfulness": 1.0,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1V8NBMG0PDVK1"
                },
                "Date": "on July 22, 2003",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IU7S4HCK1XK0"
                },
                "Date": "on April 26, 2001",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A153OH61MXIL2F"
                },
                "Date": "on October 19, 2005",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1P7XKMXKJZR5K"
                },
                "Date": "on December 20, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This ingenious approach to science and mathematics relates the higher forms of each to the graduate educated as well as the proverbial layman.  But disguised amidst the ideas of another dimension of reality for these complacent Flatlanders, lies a social and religious commentary on our own society.  The roots of ignorance, or rather self-perpetuated blindness, toward several social and religious truths are discussed, and each hold as true today as when Abbot first wrote.  This triumph of penmanship is of multiple dimensions; where the planes of scientific inquiry, dimensional mathematics, social forces, Christian ethics, women's rights and aristocratic roots all meet--to name a few.  Don't let its small size disguise you; there is more in these few pages than in many full length novels.  A must read!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3H0E8ZDJR3KA1"
                },
                "Date": "on May 10, 2009",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "2",
                "Text": "This edition is terrible on the Kindle.  There's all sorts of extra line breaks that make it difficult to read.  There's also no table of contents.  Buy the MobiPocket version for the same price.  It's a much better format"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJIKD8BWK7Z50"
                },
                "Date": "on December 31, 2004",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "4",
                "Text": "This book is a great reminder that what lies outside of our understanding does not necessarily lie outside the realm of possibility.  You don't have to enjoy mathematics to enjoy this book - I'd recommend it to anyone!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXPI82Y3YZCEZ"
                },
                "Date": "on October 2, 2001",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AACDX6CRFE7JF"
                },
                "Date": "on October 19, 2004",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on September 15, 2005",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "4",
                "Text": "This book \"flatland\" is one of my favorite books of all time. Even though it was written along time ago, it still introduces new theories that most people would not think about everyday. The details on geometry and polygons and the other dimension are well. Also the diagrams included also help a lot. The trips to Lineland, Pointland, and Spaceland portray the stubbornness of people to adapt to new customs that our introduced to them. The questions I have after reading this book is their other dimensions like 5th and 6th. My favorite character in the book is the square because; he is very curious and smart. A thing I liked in this book is that it was written in third person.  I would strongly recommend this book because it takes an idea that is rarely used, and makes it understandable to the general public."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AS0X0UPGDGN3M"
                },
                "Date": "on July 29, 2001",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14CC5FIPR5YVF"
                },
                "Date": "on April 29, 2005",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHXYMA8V6Y4BU"
                },
                "Date": "on May 9, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Reading reviews on this little gem of a novelette I have owned for over 33 years now, I see most have completely missed the point.  Square states this clearly: \"inspired people are always considered by the majority to be mad\".  Although Abbott's little book has been embraced by generations, used as a guide to kiddy schoolers in understanding geometry, its message runs much deeper.  It is an illustration of  mankind's effect on innovators who disclose knowledge at the cosmological level. It is the story that parallels all those who became a majority of one, all those who have seen further than others, to all who examine a pretty shell at the beach and realize there is a sea of knowledge before them, to all who have dared to step outside the box. Those are the innovators who have stepped out of flatland into spaceland and were subsequently denounced and ridiculed. Galileo, who expanded the universe a thousand fold, was put into house arrest by the inquisition...those priests refusing to \"look through his tube\" (a telescope).  We pay the Edison company for a Nikola Tesla product (the inventor of alternating current). Tesla died almost forgotten and penniless. When demonstrating the first electro-magnetic device, Faraday was asked what good is it?  His response, \"I don't know...what good is a newborn baby?  Someday they will learn how to tax it\". The history and drama of the discoverer is the story of \"square\", his newly acquired  cosmological knowledge through meeting \"sphere\", and what happened when he tried to disclose it to flatlanders.  \"Square\" was a spacelander in a world of flatlanders."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32UOXZQ5JC13V"
                },
                "Date": "on July 2, 2013",
                "Helpfulness": 0.7692307692307693,
                "StarRating": "1",
                "Text": "This atrocious book is nothing more than an apologia for the enslavement of the triangle. Has not the triangle suffered long enough?! It is time to put an end to hexagonal privilege. It is time to burn racist books like this."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZH8HU2O9MYJL"
                },
                "Date": "on July 16, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book is such a great tool.  I've used it for 10 years and it still gets my students excited about dimensions.  They can't believe it was written over one hundred years ago and still, as they say, \"blows their minds!\""
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZPWOCNMXU3CB"
                },
                "Date": "on March 29, 2005",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on January 22, 2002",
                "Helpfulness": 0.7777777777777778,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VSDNOJ3ZKZUA"
                },
                "Date": "on March 8, 2009",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "Like many readers and reviewers, I heard of Flatland long before I got around to reading it.  I expected it to be conversational in tone, but all about the geometry of one, two, three, and four dimensional space.  To my surprise, the book is as much about the foibles and prejudices of England's class-based society as it is about the explanation of contemplating more dimensions than one can directly perceive.  While it has valuable insights on both dimensional space and class politics and mobility, as well as a light, humorous, conversational tone, the mix is an odd one, and ultimately a combination that is bound to be a bit disappointing to those reading it solely for the math and those reading it solely for the social commentary.  A good, ground-breaking book, clearly ahead of its time, but neither a light, pleasant read nor especially deep on the substantive topic.  Still, a short, intriguing read for those who like to think about abstract concepts, both mathematical and political.  Recommended.  Donald J. Bingle, Author of Forced Conversion and GREENSWORD: A Tale of Extreme Global Warming."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MF338Q12XI3H"
                },
                "Date": "on April 11, 2001",
                "Helpfulness": 0.8,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CQQIGSCNGD51"
                },
                "Date": "on June 22, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38YF4N5F56VE9"
                },
                "Date": "on June 19, 2007",
                "Helpfulness": 0.8,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3Q04XXGGED746"
                },
                "Date": "on August 1, 2007",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AM836D28P0EEU"
                },
                "Date": "on January 31, 2002",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "The premise of this book is an exploration of a two dimenional world of people of various shapes - - more sides, and sides of equal length imply greater status - - but the shapes are not easily discerned (in a 2d world, you cant float to 'see' a square, because floating means travel in a 3rd dimension).  Consequently, the order of the status quo can be difficult to maintain.  By extrapolation, these limitations as we imagine them suggest limitations for us.  And it's in the suggestions that that I find this book has its particular value.  In Flatland, society finds a way to rank people.  It's not easy but they do.  And whether or not we think that ranking is valid is irrelevant - - it's THEIR ranking.  What about ours?  Gotta love it!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IDXIJO8ZDMFH"
                },
                "Date": "on January 19, 1999",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "You won't believe this book was written in the late 1800s----nor that the author was a mathematician. A copy of Flatland was in my mailbox awaiting my return to the \"real world\" (i.e. Flatland San Jose) after a  P.A.C.E. Seminar I attended in Carmel in 1972.  It caused me to do a lot of  thinking, visualizing and reading over the following years.  However, one  of the unanticipated benefits for some readers is the fact that Flatland  can help one easily visual some aspects of math. [BUT, I do think you have  to be in the right mood, space and timeframe when you read it.  It would be  easy to put this book down for some of the reasons already discussed in  other reviews.]"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38OAT311260VM"
                },
                "Date": "on June 12, 1998",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on August 14, 1997",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2G7R556ZQ6ONE"
                },
                "Date": "on December 1, 2010",
                "Helpfulness": 0.8,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BWQA63BFH6GI"
                },
                "Date": "on January 6, 2011",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "1",
                "Text": "Word to the wise: spring for the deluxe edition for only 99 cents! Illustrations from this edition did not show up on my kindle 3."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on May 7, 1998",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I wanted to read this book because I'm a math major; I found myself loving this book because of my minor in Women's studies.  E.A. Abbott was an 18th century idealist and feminist, and FLATLAND is an incredibly idea-packed, well-written little book.  It takes on class conflict, women's roles and narrowminded bureaucrats with a very subtle sense of wit and satire.  If you read it, pay special attention to the parts about color and women's language versus men's language.  His observations are still relevant, even in the postmodern world."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on November 21, 1996",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Witness profundity stunningly aproportionate with length!  This treatise boggles the mind with its premise, the plausbility of conceptualizing higher dimensions.  With fanatical brilliance, this book elucidates on the transdimensionalism underlying spacetime, superstrings, and other theories central to modern physics.  But even more, even more, it's an appealing story.  If you read and loved _The Phantom Toolbooth_, or have an even passing interest in mathematics, herein will you find the sublime"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2I32NDE5W31GA"
                },
                "Date": "on March 1, 2004",
                "Helpfulness": 0.75,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 18, 1999",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1N0MCEPMT2VR4"
                },
                "Date": "on March 21, 2002",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": "I've read Ken Wilber refer to Flatland enough times to make me curious enough to read this book. This book is written from the perspective of a 2 dimensional being. His world consists of length and width only. The first half of this book is the main character describing every aspect of this two dimensional world. The second half is where it gets interesting. Our 2 dimensional main character interacts with a 3 dimensional being and a 1 dimensional being and describes how these interactions might take place. All this sets the stage for the 3 dimensional reader to ponder the experience of the 4th dimension and what 4 dimensional beings might be like."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1699EAPMLMAJY"
                },
                "Date": "on March 20, 2000",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10T2H6N4BDQ7I"
                },
                "Date": "on May 18, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I had to read this book for geometry class when I was in ninth grade, and I am so glad. Rarely do I read a book that is so fascinating on both a philosophical and an imaginative level. The author's descriptions of the different dimensions were so vivid. I think the impact of the novel is at the end when it leaves the possibility of other dimensions and what the implications of that are."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ULQOGN59LDNK"
                },
                "Date": "on December 9, 2002",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Flatland is one of the most interesting books I have ever read.  The characters of the book are lines and geometric shapes.  The main character lives in a two dimensional world, then is exposed to the third dimension.  Returning to the second dimension, his heightened knowledge is marginalized.  Overall, the book reminds me of Plato's allegory of the cave."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GXFEJNVKUQAV"
                },
                "Date": "on July 16, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I downloaded a copy of Flatland that Amazon was giving away for free, but I ended up deleting that from my Kindle and buying this version instead. It was well worth it -- the illustrations are included in this version, and they are important to the plot. The text makes references to the various figures when explaining the properties of Flatland / Lineland / Spaceland, and without them it might be difficult to visualize what the author's talking about. For a difference in price of only $1.00, this edition is a huge improvement."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZQVDGTRDC9IF"
                },
                "Date": "on January 5, 2012",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AM1E36GH57DB4"
                },
                "Date": "on September 6, 2011",
                "Helpfulness": 1.0,
                "StarRating": "2",
                "Text": "this is one of my favorite books of all time; i like reading it every couple years, so i figured it'd be worth a buck to download it to my kindle. of COURSE i paid for the illustrations instead of opting for the free, text-only edition! the copy is pretty good for this edition, but the illustrations seem to be completely random! after the author's original drawing on the first page, this edition features a necronomicon-looking geometric figure with brambles in the middle; a photograph of a bas relief stone head; some stone tablets or faded headstone laying in the grass; a grainy, hi-contrast black-and-white of some gears and such.. NONE of these images are from the print editions of the book.. or have remotely anything to do with the text! more perplexing than vexing, the book is still really fun to read.. i would just recommend that you opt for one of the OTHER illustrated editions! (if you find them, the drawings are totally worth the ninety-nine cents..)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LMBM1N4EXS5W"
                },
                "Date": "on June 1, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LMBM1N4EXS5W"
                },
                "Date": "on June 1, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29CDBCGBL2GI2"
                },
                "Date": "on January 15, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LMBM1N4EXS5W"
                },
                "Date": "on June 1, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LMBM1N4EXS5W"
                },
                "Date": "on June 1, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AI9EIHVBHFPC"
                },
                "Date": "on September 10, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKJ6O69BT7KLA"
                },
                "Date": "on December 15, 2008",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3P45K6YTTLGI1"
                },
                "Date": "on August 20, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2U7B86V49XAU3"
                },
                "Date": "on June 19, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JFLR4GBBZ0TB"
                },
                "Date": "on May 14, 2002",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3G8AMJ33GBBFZ"
                },
                "Date": "on October 23, 2008",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": "If you are looking for a book that makes you think this is the one. Written in 1867, its amazing that we are still having the problems that are embellished in this lovely book. This book helped me remember I need to be more empathic to others when they are limited in thier perception. And for me to never stop dreaming."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2U1HMVZJ0B2G5"
                },
                "Date": "on September 8, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A364720X0CBBGJ"
                },
                "Date": "on August 28, 2001",
                "Helpfulness": 0.75,
                "StarRating": "4",
                "Text": "Flatland is Edwin A. Abbott's depiction of A. Square's (the story's narrator) odyssey though the spaces of many dimensions. It was written in Victorian England and is a very stylized piece. The book is divided into two parts. In Part I of the book Abbott describes Flatland and particularly its social structure in a satirical nature (akin to Animal Farm). Part II of the book is where the more mathematical and geometrical concepts are expounded upon. This section of the book is also written in the spirit of Lewis Carroll's Alice in Wonderland. A. Square (analogous to Alice) ventures back and forth through Pointland (no dimensions), Lineland (one dimension), Flatland (two dimensions), and Spaceland (three dimensions). A. Square even eventually speculates the appearance of the inhabitants of a land composed of four dimensions! Flatland will appeal to both mathematicians and lay people alike. If you are curious about dimensionality and the world in which we live, and would like to see it presented in a playful and charismatic manner, then Flatland is the book for you. Although initially taken at face value, Flatland is very deep and fully of many hidden mathematical and satirical jokes waiting to be discovered by its readers (again similar to Alice in Wonderland). Furthermore, Abbott's style tends to be very wordy. To that end, his sentences are jammed packed with ideas. These final two aspects of the book may deem a reread useful. Nonetheless, Abbott blesses us with phrases such as \"dimensionable Dimensionality,\" \"Thoughtland,\" \"Spacious Space,\" and perfect perfection.\" Brilliant! I hope you enjoy it as much as I did."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14C303OEAPED4"
                },
                "Date": "on March 5, 2014",
                "Helpfulness": 1.0,
                "StarRating": "1",
                "Text": "This publication is virtually unreadable. It doesn't do this classic justice. Multiple typos, no illustrations, and the most wonky footnotes conceivable. Spend a dollar more and get a decent edition."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on May 6, 2004",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This may be the greatest science fiction story of all time.  I have read this story at least ten times and I never tire of it.  An all time classic that makes a wonderful conversation topic."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUZQ10DELYOD8"
                },
                "Date": "on June 16, 2005",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": "This is one of my favorite books of all time. Even though it was written so long ago, it still comes across as timely, innovative, creative, and pertinent. A real mind-opener. Abbott is a genius!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FLON9A2F6E5"
                },
                "Date": "on September 28, 2002",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGO5I0VDVY9ZM"
                },
                "Date": "on January 11, 2009",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31ODPJ3EZ1Y99"
                },
                "Date": "on December 14, 2007",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATTPT4D14A8Y3"
                },
                "Date": "on April 30, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Keep in mind that this book was written over a hundred years ago, and consider the incredible ground it covers with this little tale: geometry (obviously), physics, government, politics, the clash between the sexes, class structures, manners, human nature, psychology, philosophy and even neuroscience (consciousness)!  At first reading, it's deceptively simple, but explain it out loud to someone else and you'll find yourself noticing new things. If something doesn't seem to make sense, ask yourself \"why?\"  This story is an allegory, a metaphor for so many things that fall into disjunct categories.  There's a reason for the weird; the \"bump\" is there to make you take notice.  Read it, think about it, give it some time and you'll be on your way to understanding the incredible range of this tiny work."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2625TYJ451L76"
                },
                "Date": "on May 19, 2010",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on August 13, 2002",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "to the person who said \"there ARE three dimmensions and we are NOT shapes\"....the book is an allegory, and nowhere does it state that there isn't a third dimension. The book uses an IMAGINARY, multi-dimensional universe inhabited by shapes to convey the idea of higher and lower dimensions to us, who live in a three-dimensional world. the shapes aren't the point. the point is, (in my opinion) that we can use the same argument presented by A Square to A Sphere concerning higher dimensions, and apply it to our universe, and our dimension. I had to read this book over the summer as well, for freshman math, and i think it is great. It teaches you to think in entirely different ways, and i realize that a lot of people my age simply aren't up to that."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20OD13594FCT"
                },
                "Date": "on November 27, 2004",
                "Helpfulness": 0.75,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25FJJSWH2PD6P"
                },
                "Date": "on October 6, 2000",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "I'm still not sure to this day if Abbott's geometry students grappled how fantastic a book it was that their teacher had written for them.  First off, my geometry skills improved two-fold after reading this.  Second of all, the book was a masterful satire of the times society.  Women being regarded as witless beings, and soldiers portrayed as violent louts.  Finally, it practically started the entire religion of modern illuminism.  First, Abbott shows that even he who is regarded as the wisest in the land can be ignorant, and some \"priests\", or government officials, may not tell all of the facts.  Lower planes may be ignorant, but with the help of a being in the higher dimension anyone can be guided.  Further more, it suggests that there are limitless multitudes of higher dimensions."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SNR60JA7R0OH"
                },
                "Date": "on January 5, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on August 19, 1996",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BNC0LLNEIHZR"
                },
                "Date": "on April 24, 2005",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "This is an absolutely fascinating book. It's also a classic, written in 1880, that has definitely stood the test of time. I am mildly interested in math and fascinated by science, and the concept of multiple dimensions (or fewer dimensions) is one of great interest to me. The notion of Pointland, Lineland, Flatland, and above and beyond into 4-D, 5-D, 6-D, and more is, to allow my geek side to show, exciting. The book also has some interesting social statements to make. I can't recommend this book enough to anyone at least mildly interested in math or science."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YLTPYGTCUI00"
                },
                "Date": "on July 24, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "A must-read for all who appreciate geometry. Expect an older style of writing. Realize that it is not purely a mathematical book, but has a Victorian theme, too. Appreciate the geometry concepts in their historic context. Look at the original publication date of Flatland (not this edition), and imagine the author contemplating the fourth dimension back then. Put yourself in this frame of mind, most suitable for truly enjoying the concepts and details of this classic work. A must-read if you enjoy geometry. This thrift edition is a bargain, too."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3N6L2NG4K435Y"
                },
                "Date": "on February 20, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 29, 1997",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OVF0KSZZRTEV"
                },
                "Date": "on December 17, 2002",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book is a great piece of very clear, very convicting prose, using well-explained mathematical analogies for classism, sexism, and close-mindedness. I think it's a great analogy for people's willingness to accept paradoxes and the possibility of a spiritual realm. It was written by a minister, so that's not so much of a surprise. I highly recommend this book! The mathematics are simple and not intimidating. Mind-opening."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MZ3XBKAO2EP5"
                },
                "Date": "on July 6, 2014",
                "Helpfulness": 1.0,
                "StarRating": "1",
                "Text": "a friend of mine owns a copy of this book with the same cover. it is a well bound paper copy and when we found this on amazon i immediately ordered it. but now that it has arrived i am very disappointed with the quality of the book.it is cheaply bound with a surprisingly low resolution cover, a thin and flimsy frame ,and an all around cheap feel. here are pictures of what you will get http://imgur.com/a/Dotvw"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 3, 1996",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is a fascinating book -- although it is about a hundred years old, it remains an engrossing and mind-enriching tale. A character living in a 2-dimensional world explains his universe to the reader, as well as his ventures into 1D (LineLand), 0D (PointLand), and 3D (SpaceLand). He also invites the reader to ponder the fourth dimension and beyond. Excellently written, and a real mind-bender. Read it"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2P6JDD13PPMTG"
                },
                "Date": "on October 20, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "What a cool book, what an incredible imagination Abbott had.  I expected it to be corny or cheesy but it wasn't, it was really deep.  I couldn't put it down, I read it in just a few long sittings.  This book rolls around in my mind now and will affect me in a permanent way, for sure.  I think everybody should read this who has the slightest intellectual bent and curiosity about reality."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFTBCHBWLYKEF"
                },
                "Date": "on May 25, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "It' s a book about many dimension - and many dimensions it has. You can read this book from the viewpoint of a mathematican  or from the viewpoint of a philosopher or from the viewpoint of civilisation or form the viewpoint of a historian ... or just for fun.The book is not only very very interesting from many points of view, it is also charmingly written. So: Have fun!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUVVLB9XPYU50"
                },
                "Date": "on February 28, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Flatland is quite an interested and at times, mindblowing piece of writing. The novella length story can be seen as an expansive, yet fictitious look a a unique and possible world or can be perceived as an interesting look at our world from a vantage unlike any other and in this, there are many strong implications. This is a must read for any math lover or sci-fi fan."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VONQL7YW8UPM"
                },
                "Date": "on November 3, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AOOO1WLT6UU9"
                },
                "Date": "on July 7, 2013",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37P8F5G48F9P9"
                },
                "Date": "on April 5, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This classic text helps students think \"outside the box.\" It opens up new possibilities, and flexes the thinking of those who think rigidly...my way is the only way..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24KQXD9BOZA59"
                },
                "Date": "on April 5, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2W9J8466WX1O6"
                },
                "Date": "on March 28, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "This is a great book. The old-style language is bearable and it is a fascinating book. It is especially good in that their drawings are included to clear things up."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQ0PDP8OQCEIB"
                },
                "Date": "on December 27, 2012",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "A great story. One you will be wanting to read over again. Thank you Edwin Abbot for the expansion of consciousness."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AD492HFI8LHV"
                },
                "Date": "on December 18, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This brilliant and cleverly written book/essay opens the mind to the consideration of other dimensions. Not just dimensions like time, but in fact other physical dimensions of which we cannot comprehend. For the low price, this is a fantastic and eye-opening read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JKK6LIR7X579"
                },
                "Date": "on October 5, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is Social commentary in the guise of mathematics, written by a contemporary of Dickens.  It is somewhat heavy-handed, primarily because that was needed at the time to convince people that they were reading allegory and satire.  Gender and class bias were so ingrained in society that violent methods were required to get the reader's attention.  Still relevant today, but less likely to win converts - polarized positions cause people to reject different ideas out of hand."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23O6TKRGCTUMP"
                },
                "Date": "on October 15, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PRZGF2SNTS93"
                },
                "Date": "on July 1, 2001",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "A brilliant book even for today's science although it was written over 100 years ago.  I suggest everyone to read it.  A wonderful blend of math, SCI-FI and fiction.  The book marvelously touches on the subject of how ignorant we humans are and yet consider ourselves the highest beings on the universe.  I only wish it had more pages."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10NYSAQCUJCWY"
                },
                "Date": "on September 9, 2010",
                "Helpfulness": 1.0,
                "StarRating": "2",
                "Text": "I was very excited to see this come out on Kindle; definitely one of many books I wanted to keep on me at all times. However, this version does not have any illustrations in at all, which makes the true experience and understanding of this book useless, as it uses many references that can only be fully understood through images."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IE7YPWUYZAXS"
                },
                "Date": "on June 11, 2001",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "4",
                "Text": "First of all, the book does appear sexist by today's standards.  However, if you're big enough to get by that you will find an absolutely fascinating science fiction story that is elegant in both its creativity and its simplicity.  But be warned: this book is thought provoking and not for people that simply want to be entertained."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on September 7, 1998",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "At first it seems difficult to follow Abbots thinking as he described  lines, triangle, squares, and other shapes as people.  The writing style is  English and some words have different meanings today. Finally, at the end  you discover a deeper spiritual influence.  It is thought provoking,  indeed."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30TK52G9XBS3F"
                },
                "Date": "on February 13, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "As a math teacher, I believe Flatland should be required reading.  It is a geometric view in 2-dimensions that is challenging and funny.  Can you imagine a world of 2-dimensions?  The way of identifying characters, class and intelligence is intriguing.  I believe this book is a classic."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13N76LHHAZJIA"
                },
                "Date": "on April 22, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book should be read by anyone who thinks that this world and this life is all that there is!  Today, it's common to reject the traditional understandings of the existence of a spiritual world with angels, demons, Satan, and God the Creator himself--that's a Flatlander viewpoint!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 22, 1997",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Y1QAA9SA6Z4Z"
                },
                "Date": "on June 27, 2001",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "I was required to read Flatland for a geometry class in high school. It's a great book; it's very detailed and in-depth. However, it uses turn-of-the-century language, which to a Freshman in high school, is confusing. That kept me from giving it 5 stars."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AA0ZABCFX7AXN"
                },
                "Date": "on March 31, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1B14BZLNEQW67"
                },
                "Date": "on May 1, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3E3Y9R7W5NAI8"
                },
                "Date": "on September 16, 2010",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Y47HN5IP85J"
                },
                "Date": "on April 6, 2010",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LMBM1N4EXS5W"
                },
                "Date": "on June 1, 2011",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1S0T7F4CNF4A4"
                },
                "Date": "on December 31, 2009",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NH890WJ2LDFC"
                },
                "Date": "on March 14, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A54VWW3R7VGCL"
                },
                "Date": "on December 24, 2006",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "1",
                "Text": "Why anyone would publish an unillustrated version of this marvelous book is beyond my understanding. Do not take my granting of a whole star as any sort of endorsement; one star is the lowest rating available."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJN24TVEGZEI4"
                },
                "Date": "on July 18, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WC63IB2EUVEO"
                },
                "Date": "on January 24, 2010",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CISZ4JLKQRJA"
                },
                "Date": "on January 9, 2010",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LWA6C6A6FY4P"
                },
                "Date": "on March 14, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PYMYL11MW8N5"
                },
                "Date": "on February 5, 2011",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TDY2B1DDMUXH"
                },
                "Date": "on March 1, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DSVKMTJCRCM0"
                },
                "Date": "on January 31, 2010",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "Outstanding book enjoyable to young and old alike! It has become a favorite resource for perspective in my son's homeschool studies.  Highly recommended!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOV3ZCETYEHE9"
                },
                "Date": "on August 19, 2012",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HZ1OT542M5FO"
                },
                "Date": "on February 12, 2010",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "This book changed the way I think about dimensions. Illuminating Intullectially and a great read otherwise. Free AND illustrated? Hell yes."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KMDMHN9HSY1Z"
                },
                "Date": "on December 30, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CQQIGSCNGD51"
                },
                "Date": "on June 17, 2009",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UN7OY78AE38X"
                },
                "Date": "on February 20, 2007",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "I read Flatland (which, I believe, in the US was published without post colon, as it was in the UK) when I was a teenager in the 1970s studying geometry and many other things (girls, art, girls, movies, girls...) without understanding much of any of it.  The book fascinated me, and I went on (probably not because of it, but certainly in appreciation of it) to study Mathematics at University.  I even sometimes bring it up in my consulting engagements as a way to explain how different types think of their world and learn.  While there are different dimensions represented in the book, there are different learning styles, different socioeconomic exposures, different interests, different *people* we all have to deal with.  I'd recommend Flatland to anyone who wants to take a different slant on why we are all different."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VABOK088RU06"
                },
                "Date": "on December 9, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXBO2RY22DZNI"
                },
                "Date": "on February 24, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I love it! If you are into mind bending ideas then this is just right for you. As a lover of science and things that blow my mind this book was perfect. The book is about a 2 dimensional shape that travels to 3 dimensional realm and has to either convince his people that a 3D world exists and face the consequences or keep it to himself. This book will take you on a journey in understanding mathematical principles (dimensions) in a fun way. Though, it will be rather odd trying to picture a 2D world and how 2D objects see their world. It will allow you to understand what it would be like to live in 1D, 2D, or 3D world through various perspectives. (Perspectives of 3D objects, 2D objects and even 1D objects.) The book is short but it packs a punch. If you are trying to picture what a 2D object would see if a 3D object entered their world then buy this book! You will not be disappointed!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APPZQWRWSS3MC"
                },
                "Date": "on December 20, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "this is a great book to help you put your mind around other dimensions. It was cleverly written and an enjoyable read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MGZ5JV9HOLR3"
                },
                "Date": "on August 7, 2010",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Story a bit confusing at times but once understud the position of each shape,duty and dimension they represent; things starts to shape up opening a fresh way of thinking and interact. Meaning that just one view is not enough to understand and love one another but the open view and the category that each of us represents in the shape we relate to it will bring a different opinion in how we judge each-other.some people walks all their lives with only one view of their surrounding(flatland)without thinking and lot of judgemental opinion towards others.  the spaceland shape look and study creations(people) and surrounding, understanding that love is needed and guidance for the less fortunate bringing them out from the flat way of living. Put God first in all you do because the creations He gave  us is to enjoy, to honor,and to love."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TZP8YG6BI3UV"
                },
                "Date": "on September 4, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LUU5FS11V8J8"
                },
                "Date": "on July 11, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I love this strange little book.  It has a lot of injustice based on gender and appearance, which was the author trying to point out problems in society at the time.  We still deal with those issues.  My teen has read it and gave a copy of this book to her high school English teacher and to her Algebra 2 teacher as end of year gifts.  Neither had ever read the book and she was surprised.  The characters in the book are all shapes and how many lines they have affects their social status.  It's a thin book but not for everyone.  If you don't normally read in your spare time, then this isn't for you.  If your idea of reading is a paperback romance novel, then you probably won't get the ideas in this book at all.  Intellectuals typically enjoy discussing this book though."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26XAIS9A8UNXX"
                },
                "Date": "on November 20, 2010",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24X47KX6F9RI8"
                },
                "Date": "on May 4, 2007",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "I have read this book at least a dozen times.  It's a must read for anyone, a satire of many dimensions.  While the aspects of dimensionality apply to the math geeks, the pun on straight-laced Victorian society actually mirrors many of the things we face in our society today, but with a different twist.  This is a great way for a lay person to understand the concept of dimensionality.  If you like this book, I also highly recommend reading Rudy Rucker's Spaceland and Ian Stewart's Flatterland.  Both are great sequels to this original classic and absolutely hilarious!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JZVPE2TFD56Q"
                },
                "Date": "on March 18, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20BH1PVEWZBH0"
                },
                "Date": "on June 18, 2014",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AKG73AM4OKSI"
                },
                "Date": "on March 8, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1X1Z9PPA9LDO7"
                },
                "Date": "on September 4, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEW0IMWCFSQ0Z"
                },
                "Date": "on April 23, 2010",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "While Flatland is a great book, the Kindle edition is missing all of the pictures/diagrams."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UKYHLIT0P5A9"
                },
                "Date": "on July 22, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Very good service and a high quality product, I would definitely buy from them again."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A277B71D8B4PU6"
                },
                "Date": "on May 7, 2007",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "I have just finished reading this little book for probably the third time.  As I tend to read in bed at night just before turning out the light to go to sleep, I would lie in bed after putting the book down trying to imagine the fourth dimension.  The spiritual implications throughout the book are undeniable.  Once one has been touched by a higher dimension, life will never be the same.  However, trying to communicate to others what one has experienced proves near impossible, as our square friend in Flatland so aptly relates."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AEJJHI6792U"
                },
                "Date": "on April 1, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2I3D2NX4XKZYJ"
                },
                "Date": "on September 26, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A75C7OH10SLKY"
                },
                "Date": "on May 8, 2014",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": "I suppose if you just love geometry and math, then you might enjoy this novel. But it's really nothing special. The entire premise is: what if the world was 2-dimensional, or 1, or 3? And it just explores what that would look like, how people would interact, see things, know things. And how a person in the 2 dimensional world would be able to comprehend our world. It's not terribly profound, but you kind of get the impression reading it that the author thought it was. So, if you're a math or geometry nerd, this is the book for you. Otherwise, you'll be bored to tears."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A120MZ5H389RQR"
                },
                "Date": "on October 8, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I, being the personified crave for knowledge that I am, had my eyes adhered to this masterpiece. Within this book await worlds you never thought you would expose any granule of consolation, and worlds you lack the cognitive capacity to conjure in your mind. Though methinks this prose may be extravagant at times of necessary elaboration, it inspires ideas of the first, second, third, and indeed the forth dimension, whose explanations will astound you. Permit me to assure you that you will not be dissapaionted, and you will be in deep pensive for many hours."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHHU34NT0HTR1"
                },
                "Date": "on October 7, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A988UK5MI6U85"
                },
                "Date": "on January 31, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I was required to read this book for a class, and went in not sure about the subject matter. Upon reading it, I found myself laughing a lot of the time. It's a smart, witty book that bends the way you see your world. It also has an amount of mathematical theory in it,  but it's easily explained within the book. I found it to be entertaining and educational. For anyone looking for an easy, smart laugh this the book for you. It's short, too, so it won't take very long to read--the chapters are small for reading in quick spurts."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31TL0DN1CNG8B"
                },
                "Date": "on May 16, 2007",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1X8V2H9ILQNW5"
                },
                "Date": "on April 24, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This is a simple little story written well before its time (1884)  that will take you on a journey of thought about why we don't/can't/won't perceive dimensions beyond our three dimensional known world.  It is also a social commentary giving us a glimpse at past - and, for some people, present - prejudices that inhibit us from looking beyond our own conditioning in order to discover possible worlds greater than our own.  Some of the language is antiquated but, for me, that simply added to its charm."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DOMM7SM5L0YR"
                },
                "Date": "on December 26, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I really enjoyed this book. I would absolutely recommend it to anyone who enjoys math or geometry. I loved all of the abstract imagery.The entire time I was reading it I thought it was some new book somebody had written when they were on drugs or something because of how out-of-the-box it was. But when I finished reading it I found that it was written in the 1800s and I was completely shocked. It made me think about the book in a completely different way which I thoroughly enjoyed."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HS1J3IDG2YS2"
                },
                "Date": "on April 25, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I bought it for my eight-year-old, who likes math.  He enjoyed the story when I read it to him, but couldn't get much out of it when he read it himself.  Abbott's Square uses a large vocabulary, florid language with extravagant sentence structure.  This time through I noticed the delicious social satire; the first time I read it I was impatiently waiting for the four-dimensional part.  We saw an image of a a vintage cover somewhere; it would have been nice if this book had it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1D6THAJG4XGSP"
                },
                "Date": "on December 19, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Upfront admission: I haven't read this book. I bought it for my 12-year-old math geek son after reading a review of the much newer \"Flatterland.\" And lo and behold, he likes it! He's been reading it for about a week and is almost done with it and is enjoying it very much. He was SHOCKED a few days ago when I mentioned how old it was - a very good sign, in my opinion! I'll probably get to it myself one of these days, but for now, I am completely satisfied."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BR18ZWYGVN71"
                },
                "Date": "on September 12, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "I have known about this book for years because it has been mentioned in other books or articles that I read.  However, I am just getting around to reading it in full (the Kindle version).  The book is highly imaginative but somewhat tedious to read.  I did find surprises in the book based on my previous, very fragmentary knowledge of it.  I think the book is worth reading once, and some aspects of it are memorable.  However, I will not read it twice."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XGLO9XNXRJ7M"
                },
                "Date": "on December 27, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I have loved this book since I first read it (early teens). I've given it to several people, and that's the reason I bought this one. The first one I bought was a used hard cover at a used book stand outside Old South in Boston (in the 1950's). Lost it to someone I loaned it to. It really is a wonderful story, lots of insights into human behavior and geometry. Highly recommended. This edition has good line drawings and clear printing. Price is ok."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1K74OR4SM5LOM"
                },
                "Date": "on April 15, 2009",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14XP3JPD0SQR6"
                },
                "Date": "on December 19, 2013",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "The book is a good read. The journey through the 1D and 2D lands is creative. I think I enjoyed mostly how the text was written... since it was written originally in 1880, the author obviously has a different look on society than we do today. Besides that, without spoiling anything, as I am very vague in what I have said so far, a simple but obvious lesson is learned at the end of the book. As I said, it was a good read, but not great."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16TKTL0Q6FU1I"
                },
                "Date": "on November 26, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A very interesting book.  It is about a society living in a two dimensional universe.  Most people can imagine such a world.  When a bright two dimensional creature interacts with a three dimensional creature, the two dimensional creature can almost imagine what a three dimensional world might be like.  If we understand this book, we might have a chance to understand that a world with four (or more) dimensions might actually exist."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22YEJMN7E6KW7"
                },
                "Date": "on August 30, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "As a math teacher, it's always a struggle to find ways to explain things that you just seem to automatically know or understand. In Flatland, Abbott somehow manages to explain the ways of 1, 2, and 3 dimensions and it's amazing. Beyond the geometric aspects of the book, the social commentary is fascinating. This book is in a league of it's own and I have bought copies as gifts because I basically think everyone should read it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DTMOP2ZIZE62"
                },
                "Date": "on December 23, 2012",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LMBM1N4EXS5W"
                },
                "Date": "on June 1, 2011",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30LYZ1TZ8MJOG"
                },
                "Date": "on May 14, 2011",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AA9ZC0I8HR4QU"
                },
                "Date": "on May 11, 2011",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "I downloaded one version of Flatland for the Kindle which said it was illustrated, but all I saw where each illustration was supposed to be was what looked like placeholders.  This version is beautifully formatted, with illustrations and table of contents.  More than worth the $0.99."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QFDGSV640AG"
                },
                "Date": "on November 15, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "FlatLand is a book for everyone who likes to think outside of the box, or in this case, outside of the square.  This book, originally written in the late 1800's puts a unique perspective on dimensions.  Imagine what it would be like to actually live in the first or second dimension.  Imagine what it would be like if you met someone in the fourth dimension.  What do they look like?  I think I have an idea."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33YJKA2GFJ9DC"
                },
                "Date": "on January 25, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I appreciated this as a concept book...in other words, I didn't really \"enjoy\" reading Flatland except as a stimulus to looking at the world differently. Since I like doing that, it made the book worthwhile. It's the kind of book you remember long afterward because it's so different...and it raises new ways of looking at issues you've probably considered at some point."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VADEUO4VFXRP"
                },
                "Date": "on January 7, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYLLWUIB4T5GM"
                },
                "Date": "on February 11, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28K6G5GYUOLDI"
                },
                "Date": "on August 10, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I've read this book three times.  It is a classic.  It is ingenious.  You will not be able to stop reading it.  I have not read this particular edition, but this is the edition that I chose to give 5 stars because this edition (as far as I can tell) contains the original, wonderfully quaint, illustrations.  Enjoy!  (And while you are at it, go read Sphereland too.)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PO0HTXQPQXHA"
                },
                "Date": "on July 14, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CP22RP3X59WC"
                },
                "Date": "on June 29, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21IS7F392BN4E"
                },
                "Date": "on June 18, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Years ago an excellent mathematics teacher tried to motivate me and suggested that I read Flatlands.  Unfortunately i was not ready to be motivated, but now fifty years later bought the Kindle version.  Edwin A Abbott's satire is stil fairly accurate 100 years after it was first published.  It is a quick read, and an enjoyable ride."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DXUFZOVNC7WP"
                },
                "Date": "on May 19, 2014",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": "I enjoyed the book, however, the illustrations failed to render on my Kindle PaperWhite. As this is the primary reason I chose the download, I am not satisfied."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VWYPS9SCOFK3"
                },
                "Date": "on May 2, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OR1Z9YIR2JR3"
                },
                "Date": "on April 17, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "It's fun, like nothing I read before! A lesson about prejudice and narrow mindness, and geometry, in the most creative way."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIC4UL49A2IEI"
                },
                "Date": "on April 11, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This story makes you adjust your mind to try to think in only two dimensions. This alone makes it a good mental exercise, but it is also a good read. A well-done work, but probably not for everyone. I enjoyed it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFU9O984I7Z6E"
                },
                "Date": "on February 14, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is a most to any mathematician enthusiast. I really loved, and now I want more answers since this book version feels that ends a bit abruptly, but maybe that's the way to finish, to let the reader to go for more by themselves."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7UGRPAXUXXVA"
                },
                "Date": "on December 28, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "An excellent piece on how 2 dimensional characters might perceive space. It makes me wonder how a 4 dimensional being might look to us..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20Z7A32S4L0LK"
                },
                "Date": "on October 21, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Very thought provoking, makes u think outside of the your world to consider there are other worlds u are not consciousness of and just because u are not aware does not mean they do not exist u have to force yourself to see anothers prospective it is not something that comes naturally."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CTHVD2NG6KL6"
                },
                "Date": "on October 7, 2013",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "This is an excellent description of how sentient beings might react to extra dimensional appearances.  Classic al inference is used with a novel twist."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24T501SYM8ETT"
                },
                "Date": "on September 4, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Read this book a long time ago when I was first teaching Geometry. Led to great discussions (beyond Geometry) with students!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4AD9YAPWI4PN"
                },
                "Date": "on September 3, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is a charming little book that makes you think about our perception of the everyday world. It wouldn't impress a genius, but an amateur wannabe thinker like me found it fun to read with much more value than most fiction."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1A548RZU66ZHH"
                },
                "Date": "on August 22, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "If life can exist in only 2 dimensions just because they cant understand more, could there really be more than 3 or 4."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4XVNR4BRD0KG"
                },
                "Date": "on August 20, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DEACS6TQH589"
                },
                "Date": "on August 12, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SIKHOF1DUQJS"
                },
                "Date": "on August 5, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book makes you think,  good book  I originally read this in High School,  Loved it then, love it now."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15OOJAZFASYL9"
                },
                "Date": "on August 3, 2013",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UATHBQ21AGDI"
                },
                "Date": "on June 25, 2013",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "The concept of flatland isn't at all astounding. It's eh. Not a bad read though. People on Reddit need to relax. Go ahead and read it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RRT0NF070H2Q"
                },
                "Date": "on June 12, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "The subtext wasn't very interesting but the general idea of a world with less dimensions was really cool and make me think."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EFQWQV8D9PEP"
                },
                "Date": "on June 10, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "After starting this book, keep reading until you begin to understand what the author is trying to explain to you.  That is not really done until after about thirty pages."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADRP1OAW0ZI2Q"
                },
                "Date": "on June 3, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SUXT16WFMGWF"
                },
                "Date": "on May 27, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent! This will require several re-readings.  The basis for all thought is challenged in this timeless work. Although Religionists may no doubt claim this as evidence for their ways of thinking they should be quaking in their boots."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9OXIU3BGP4VR"
                },
                "Date": "on May 22, 2013",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28BG2CRN89O1K"
                },
                "Date": "on April 2, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "It's a bit sexist (product of the late 19th century) But the concept is fun.  Abbott takes you on an adventure through pointland, lineland, flatland and spaceland.  What's next?"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JDS8YUM4A9ZI"
                },
                "Date": "on March 27, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Y86S1BJ4TAY8"
                },
                "Date": "on March 16, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Nothing wrong, or exceptionally great about this product, a simple Ebook, i would buy from them again. You should too"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PYKV8SKZ4HYP"
                },
                "Date": "on March 9, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Flatland is a book that every thinking person should read - and that will make every person think.  It's a true classic in the sense that it speaks to everyone and it delivers lasting and universal insights.  That said, some will avoid it because it is (in principle) a book about mathematics.  When my high school math teacher recommended it, I read it and was at first astonished that the pentagon who is the books protagonist could not understand the mysterious third dimension.  It clicked in only a little later that perhaps I was just as ignorant about higher dimensions than our poor pentagon.  That started a train of thought that has persisted to this day; in my consulting practice, I regularly use the mathematics of several hundred dimensions.  I really don't understand (except in a mathematical way) what they are, exactly, but Flatland gave me the mental background to use them happily.  However, you don't have to be a scientist or mathematician to enjoy Flatland - my wife the English major also enjoyed it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27P63KTWIPZ4D"
                },
                "Date": "on February 25, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Flatland is a classic that should be read by every person remotely interested in math. This however does not mean that you need a mathematical background to enjoy the reading."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2I6W1271EUF9F"
                },
                "Date": "on February 22, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APNG6RUTFHQ4Z"
                },
                "Date": "on February 21, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book was slow at times, but I still enjoyed it. Edwin Abbott clearly put a lot of thought into how a two dimensional society would work, and thus Flatland felt like a real place and (ironically) hardly felt flat at all. My favorite part of the book, however, had to be when Mr. Square and Mr. Sphere visit Pointland, a plane of existence consisting of zero dimensions. The self proclaimed God of Pointland talks to himself in an endless soliloquy of purple prose, and believes itself the end all and be all of everything despite not even understanding the concept of the number 2. Overall, while the book is dense and is not a light read, it was still quite enjoyable, and will leave your head buzzing with thoughts of four dimensional cubes for days."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19MAIIJ5DVS2K"
                },
                "Date": "on February 8, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "If you like the idea about how other dimensions work, you should start reading this and then perhaps move on to spaceland. (rudy rucker). really gives another perspective on how things can be looked at."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVDIBV09WX9Z4"
                },
                "Date": "on February 3, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Although it's a heavy critic to the Victorian society, it's a cool book about physics, and teaches you about some basic concepts about it"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2770KJ6KSH1XQ"
                },
                "Date": "on January 30, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FWRB0D9VBD1Z"
                },
                "Date": "on January 27, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Edwin Abbott look leads the reader into thinking of the possibility of more than four dimensions as created by God."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20GDEC750K2EX"
                },
                "Date": "on January 25, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Wow the book pull me in and made me feel in he's place can't wait to re-read to see if I learn more"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RJO0257L6OHH"
                },
                "Date": "on January 15, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I enjoyed it very  much so I'm going to have a closer look at non-Euclidean geometry in the very near future."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6D2NLW9C70MI"
                },
                "Date": "on December 31, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "That was so much fun! An entertaining story that I wish I could have read as a kid. Recommended to anyone."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIPR2NMC2334B"
                },
                "Date": "on December 24, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Heaven for geometry freaks! This is filled with things to simply sit and ponder about for a while. Super funny, and smartly written."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4XB148ESOT1B"
                },
                "Date": "on November 2, 2012",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "It was an interesting study in perspectives, but not so interesting a read. I enjoyed seeing how the hero would view each new environment, but there was no plot as such. It may have been good for me to read it because it reinforces my desire to see things as others see them. It just wasn't a whole lot of fun."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LP7ELEAHTZ05"
                },
                "Date": "on October 23, 2012",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "Good book, but just that, Flatland was only disappointing because of the number one rating in a recent survey for the best sci-fi novel of the last few centuries. Plebians. Excellent satire produced from a restrained era, the story told exposes a civilization very difficult to imagine in two dimensions.  During this election year, it becomes more relatable than I was comfortable with. I do recommend the read to classicists of science fiction, but don't expect the thrill ride that books like Shut Up can give.  Thoughtful reservation, yes- thrills - no."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12LNI1GNKAO5W"
                },
                "Date": "on October 9, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Anyone with even the most basic grasp of geometry will find this book enjoyable.  Abbot's ability to convey such an abstract concept AND make it fun is impressive.  A surprisingly fresh read for a book that is over 70 years old."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MDEFS474MFDK"
                },
                "Date": "on October 8, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I first read this book in High School many, many years ago.  It was a treat to read it again as an adult.  The humor, irony, social comment, wonderfully stilted Dickensian language and logic were mostly lost on that drifty teenager but really enjoyed this time around."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WO4N75MN0I60"
                },
                "Date": "on October 8, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1M8IVOLVQI9IR"
                },
                "Date": "on September 14, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5JEC9NWDU0UJ"
                },
                "Date": "on September 6, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TZZXMP3FXAEB"
                },
                "Date": "on August 6, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I love this book! It's a wonderful satire of human hubris--required reading for the bratty teenager who thinks he knows everything. Highly recommended...and it's a very quick read!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2F4PBAHBIG1B5"
                },
                "Date": "on July 17, 2012",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "A whole new world opens up when you think about the differences between the 2nd and 3rd dimensions. Really interesting and provides avenues for much creative thinking. The archaic ideas about the nature of women is annoying throughout, but the era in which this was written is more to blame than the author, I suspect."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RLK6TP2PFDQ5"
                },
                "Date": "on July 12, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great book for any geeky/math person. It gives you a great sense of the silliness of math sometimes encountered, but there are also undertones of sexism and social status."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KQZT4H57XAXE"
                },
                "Date": "on July 7, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28UDAP816PSH7"
                },
                "Date": "on May 24, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Reading this book lead to several days of higher-dimension dreams :) . It is so easy to be complacent about what we see and experience, never questioning other possibilities. This was an eye opener. What if we're like the square or the poor dot? Worse yet, what if we're like the smug sphere who preaches to lower dimensions but can't see beyond his own?"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22T7N5IUPS8LZ"
                },
                "Date": "on April 29, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Is \"Flatland\" an imaginative geometry textbook/primer or a perceptive social satire of Victorian England?  Either way, it is an entertaining and ingenious read, even if I have encountered it far too late in life for it to make me see things (either geometrical or social) from a completely different perspective!  At least a vague interest in geometry is probably required to really enjoy \"Flatland\", and if you are the sort of reader who will get really upset that the female shapes aren't considered equal to the males you probably won't appreciate the subtle social commentary, either.  With those caveats in mind, recommended as a diverting read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XEI1YXN2BXR5"
                },
                "Date": "on April 16, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VKROSQK55S18"
                },
                "Date": "on March 6, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HQQB5TYWXFH1"
                },
                "Date": "on January 7, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANRE1BJ0Q4PLS"
                },
                "Date": "on November 24, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MGYLAI619YUS"
                },
                "Date": "on March 13, 2014",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": "Let me begin by saying that this book is designed to look like a book published by Penguin, but it's not. The abstract cover image is blurry and pixelated. There are supposed to be images within this story and there are none. For example, page 2 reads: \"... figures 2 and 3 represent the Tradesman...\" yet there are no accompanying figures."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A145LW77U7GIGN"
                },
                "Date": "on December 3, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This classic, insightful story is a stark reminder of how courage and reasoning evolves world views.  Over the years I'd read many references to Flatland.  Finally, I downloaded it onto my Kindle. Afterwards, I  realized that this provoking story written in the 1800s has left me far more wiser. I  highly recommend this to readers of all ages."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KOE4AABUO2MG"
                },
                "Date": "on December 27, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22VWH8XS3YJ9D"
                },
                "Date": "on April 3, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Timeless, current and easy to understand. Flatland describes how our perception of the world is defined by our bias. The Sphere drags the square out of two dimensions to the third where it becomes obvious that our world views are flat. Written in 1884 this story reflects today's and tomorrow's world view and why it is so hard to see truth."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACFRVTK9CNE55"
                },
                "Date": "on October 17, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I've been looking for this classic for a long time, and finally found it on Amazon. Hooray! A short afternoon's guilty indulgence. A hot cup of cocoa (half and half instead of whole milk, serving temperature of 183 degrees, seven mini- marshmallows [no more, no less], and Sheldon Cooper to enjou the insuing  book discussion  with!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JBQW7F3WFYCQ"
                },
                "Date": "on August 22, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "The central analogy the story is about is great tool for understanding higher dimensions. The point where the story falls flat is that it goes into great depth about the world of flatland, lineland, and pointland, while not unappreciated, some aspects of society shown are not what anyone today would consider \"politically correct.\""
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3B5F2XXL8K7PC"
                },
                "Date": "on March 4, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Weird, but totally unique and enjoyable. There are many editions of this floating around, and unfortunately this isn't the best I've seen. But it's certainly better than some others. It's an awesome glimpse into one of the earlier fantasy novels. Contains a hilarious and interesting bit of math and science as well. Recommend!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1F50CUXGKWG43"
                },
                "Date": "on September 11, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Imagine beings living out their existences in a two-dimensional world, unable to conceive of a third dimension. Now ask yourself whether the ground that our three-dimensional mindset stands on is any more solid. Thus Abbott's quirky tale is seen to be not a mere curiosity, but a probing inquiry into the nature of reality."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJGTXO96B00KI"
                },
                "Date": "on October 21, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "If you haven't already read this book, you've probably already read some part of it without knowing it. There are excerpts of this classic story floating around the internet, especially on math forums and such. It is nice to finally get to read the story in its entirety. If you like math, you'd probably like this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKAMPNA389X6O"
                },
                "Date": "on January 10, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ND16WPX7TS4K"
                },
                "Date": "on January 22, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Very good read if you are interested in the philosophy behind the story. It does a good job of painting universes of less than three dimensions. I also enjoyed the social commentary of Victorian England. I warn others potential readers of this, most of this book is not story but thought experiments."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFCIVNO3Q5Q75"
                },
                "Date": "on November 30, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent. Highly recommend it. The point of view of A. Square is delicious. Altho this is over one hundred years old, it's still timely today. If you saw the recent movie \"Interstellar\" and were somewhat confused by the multidimensional treatment, this book will help your perspective."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LMBM1N4EXS5W"
                },
                "Date": "on June 1, 2011",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PW9JQO58SK3S"
                },
                "Date": "on October 30, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Was introduced to Flatland by our 10th grade Math teacher - and can't wait to read it again. An extremely novel perspective.  Purchased a copy for a friend who had the same teacher and had not heard about it.  Want to share opinions of it. Finding it on Amazon was easy and quite inexpensive."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FG3GR72E4K7R"
                },
                "Date": "on April 28, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I read this book in 9th grade. It was interesting and captivating. It perked my interest in math and physics. After reading this book, I went on a time travel kick and never went off. An interesting approach to math and science set in a fictional world. Advanced concepts, but worth the read!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3W0Z1OH9K8V3T"
                },
                "Date": "on February 12, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "this is a very nice book to introduce a child to the mathatical notion of dimension and what would brings in different dimensions be like and how they would live and interact with brings that can access a higher dimension.  it is a great fun to read for a mathematican as well."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31W68NQ4DHHX4"
                },
                "Date": "on May 9, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Pretty complex given the protagonist is A Square. No really, that's his name. And that name is a variation on the author's Edwin Abbott Abbott, a^2=A Square... get it. This book is a classic of literature and explores several points of interest in higher dimensional thinking."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6ZZZQNKKII6X"
                },
                "Date": "on October 25, 2005",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Flatland is an account of the adventures of A Square in Lineland and Spaceland. In it Abbott tries to popularize the notion of multidimensional geometry but the book is also a clever satire on the social, moral, and religious values of the period. A romping good read!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LUVZN5S1AUVA"
                },
                "Date": "on July 4, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "I bought  for a friend, to replace a copy that I borrowed from her and lost. Still can't find it to finish it! This is a Victorian-era satire based on the some of the  ideas on dimensions that Carl Sagan talked about on his TV show \"Cosmos\" in the '80s."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20Y9IVBJ8QRG"
                },
                "Date": "on June 4, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A nice read on several levels--It was written as an argument about dimension theory.  It has subtle religion references, some would see sexist references, a great story line.  Only the last thirty pages or so are hard to read--the author is pleading his case!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASKZ7HRJOYNS3"
                },
                "Date": "on April 1, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6GKXUU9AOV65"
                },
                "Date": "on June 16, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I just finished reading this masterpiece of thought, which all 3-dimensional beings should read at some point in their lives. It's a short and quick read which manages to explain incredibly difficult and obtuse thoughts in easily digestible terms."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZTEUW378YQ59"
                },
                "Date": "on January 2, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2H6Q6AK8S90F3"
                },
                "Date": "on December 8, 2010",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALGX012NY5HHV"
                },
                "Date": "on October 19, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "30 years ago a project manager that I worked with recommended this book to improve my ability to abstract about the world. It was worth reading... Thanks Tony D."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APGAZS0809TN7"
                },
                "Date": "on March 19, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is a great philosophical experiment that both stretches our mathematical understanding of the world (or flattens it) and provides interesting satire on the structures and dogmas we set up in society that limit our imaginations."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PF39G8QHUH69"
                },
                "Date": "on December 24, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I assigned this book to my accelerated 7th and 8th grade students. Most all said they hated it, but when we seminared on it I was convinced that nearly all of them had learned something from the book book that would stick with them."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1R4YHXH7A9HHZ"
                },
                "Date": "on January 16, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "One of the better books I have read. If you notice the underlying social criticism, you will find it absolutely hilarious. I would suggest this to anyone who likes math. It definitely helped me quite a bit in multivariable calculus."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKB2PYODH0TKS"
                },
                "Date": "on September 22, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "considering that the book was written in 1889, it does hold up.  it's fun because of the bizarre descriptions of living in one or two dimensions, but it never makes a good case for what a world with four dimensions would be like."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AB5GCVO7VQFX0"
                },
                "Date": "on July 6, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I satisfied my expectations.  I gave it to some above average 10th grade high school students, and they enjoyed seeing mathematical ideas used in a fun read.  For them it was interesting to see mathematics not in a math textbook."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NYDDEU4P2K1C"
                },
                "Date": "on February 13, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Even if you aren't crazy about math, this book makes the concepts accessible and entertaining.  This tale really re-emphasizes how complicated describing different dimensions are to someone who can't step outside of their own."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17WMNJ7VA8IIH"
                },
                "Date": "on July 11, 2010",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IVJZ38YFFVNS"
                },
                "Date": "on October 24, 2012",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "It's a good book, and had to reread it two or three times to fully appreciate it, but it just wasn't what I expected. Maybe because I'm so use to modern day novels, I expected it to be written like Enders Game."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IX78SEP2XHA"
                },
                "Date": "on November 9, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Such an original work that pulls the reader in many different directions but brings you back to the main idea, that everything we know is only based on the knowledge of the world around us as we perceive it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AX4CL75JYDEYT"
                },
                "Date": "on April 22, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "found this to be an interesting read, not real math heavy, just a few connections related to men and women mostly, sort of an odd take on the relationships between men and women and on the social classes."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16Q3XSCJ68E83"
                },
                "Date": "on July 28, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "A classic book. Very interesting take on dimensions. However, it was hard to get past the overt sexism and classism. However, that was the original point of the book - a satire on Victorian society."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A159CB2GA4LHU"
                },
                "Date": "on June 18, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This guy is like the Hunter S Thompson of physics, the Aliester Crowley of Geometry.  Maybe like the Confederacy of Dunces but in \"flatland\".  It is very, very short, but quite entertaining."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OGAFF7XCBHPH"
                },
                "Date": "on June 29, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This very short read was facinating.  It was an exercise at looking at things very differently.  It is the kind of book that you want to discuss with a friend.  Nothing riveting, but interesting."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TZT5FNBH27ID"
                },
                "Date": "on September 26, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is one of the great books of mathematics.  In a highly entertaining way, the author introduces the mysteries of other dimensions.  This is a must read for anyone with scientific curiosity."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ACUHYUW6UANH"
                },
                "Date": "on May 29, 2010",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book by analogy helps to explain the existence of other dimensions and can therefor can be used to explain many theological principles that seem contradictory in three dimensions."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4A60AIOL698S"
                },
                "Date": "on May 14, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book is amazing. Such good information and such a good simple story of the simple beautification of each dimension.  Specially the first, where most of the story takes place."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SC67Z2ZT7TFP"
                },
                "Date": "on September 7, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VTQ9BX6XW783"
                },
                "Date": "on April 24, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Loved this book, a beautifully narrated and funny story of the land of 2 dimensions, educational as well. I guarantee your geometry will be better off for having read this :D"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BLT7DUCT6JUR"
                },
                "Date": "on October 9, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Needless to say .. the book is a masterpiece. I prefer actual books to free online editions. Unlike other reviews i didnt mind the print at all and im happy with the book"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17B8OJL4M308J"
                },
                "Date": "on March 13, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WA8AYOPNODRS"
                },
                "Date": "on September 9, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The book itself is excellent, but the introduction is what really makes this copy special. I would have missed some of the book's nuances and satire without Jann's intro."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25BMFPGV7SMXP"
                },
                "Date": "on August 25, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "After some recent glowing reviews from friends and acquaintances, I was a bit disappointed by the ending to this story, No spoilers but I found it a bit underwhelming."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FF8DAOB62EKY"
                },
                "Date": "on January 11, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "It was a quaint narrative about the importance of having an open mind, of honest inquiry and how those of influence and power will do what they can to to hold onto it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SECN0T4O81KI"
                },
                "Date": "on December 5, 2009",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "Everyone should read this book at some time in their life.  It makes you realize the limitation of our physical senses."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29APHE3VT9CBJ"
                },
                "Date": "on April 3, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I loved it when I first read it decades ago.  Now my daughter wants to be a writer, and what a great example of a specific writing style to add to her collection!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11XZHBS4MF0FA"
                },
                "Date": "on January 8, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Relic of its time. The description of the different dimensions was awesome- but that's about ten of seventy pages of fluff that's kind of a relic of it's time."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANDNTPFILIZ5"
                },
                "Date": "on November 28, 2010",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "It's awesome and it's cheap.  The other were right!  Easy to read and has the illustrations in it like the book!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1X134UQEYA7FM"
                },
                "Date": "on February 16, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A story that can blow your mind. Even if you know what is it about, reading it forces your mind to think what living in a n-dimension universe would be like."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TXWK15IC09HD"
                },
                "Date": "on June 5, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LK4M7JEMCL4U"
                },
                "Date": "on January 11, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Published in 1884, it reads like it was written yesterday. I loved the part where the 2-dimensional being realizes there's a third dimension. A worthy read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MIJZGQYCHTE9"
                },
                "Date": "on November 23, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXZ77GURVOILV"
                },
                "Date": "on May 21, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Bought this tomb as a gift. It was the EXACT edition I had read in elementary school. Good job. Fast shipping. Thank you for preserving a piece of my youth."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6RGEZMSEW7PW"
                },
                "Date": "on January 21, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The cover is not the cover shown, but a good book without any torn pages. Some pages were dog-eared but any literary enthusiast knows how to fix that."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MDCZMVO66FOL"
                },
                "Date": "on December 9, 2014",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1G2J98G9L72HD"
                },
                "Date": "on June 13, 2010",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Very nice and cost effective edition. As for the text itself it's... inspiring. I'll would recommend it to all that like to think deeper sometimes."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVKB1VCEQJEA3"
                },
                "Date": "on August 27, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Really cool book with a very unique perspective.  It's meaning goes beyond geometry and touches into metaphysics and our concept of perception."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VRZ6J81Z7J8B"
                },
                "Date": "on March 24, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "He creates a total universe to help us better see our own. Really a quick read....it seemed to make more sense if I did not set the book down."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UE2CCKGC5EH2"
                },
                "Date": "on August 15, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "It shipped a day after it said it would, but when I got it it was in good condition. The whole book for under 3 dollars is too great to beat."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3532CJFE1UKNT"
                },
                "Date": "on May 2, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Charming little book, it takes you into a world of shapes and dimensions. Some of the book can be a bit dry, but it's interesting overall."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGU1K7B8XNUQU"
                },
                "Date": "on October 6, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great price, great read. Great book for people interested in places with more dimensions and less dimensions and how they could interact."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3L9W17V010MZF"
                },
                "Date": "on January 22, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Amazing!  Takes no time to read, and really has a fun thoughtful message.  This is a book you will want to share with every one you know."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIXD4SZY4CDO2"
                },
                "Date": "on February 25, 2013",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "This would be good for an intellectual but was beyond me. I grasped some of it, but got bored with it after awhile and didnt finish it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TK5410ZBCJ6V"
                },
                "Date": "on June 18, 2013",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "It was actually not that bad, for a math book. Part II was much more interesting, since part I was mostly used to explain the setting."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5AA7FMLN44IR"
                },
                "Date": "on April 2, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This book warps my mind with its different dimensions and the roles of priests and women are too strange a reality to comprehend."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJLWVR4ZOYL3S"
                },
                "Date": "on August 2, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "this book here is wonderful, i am not done reading it yet but i love it. I love the math behind it. Perfect if you like numbers."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QIDYHSM64L8R"
                },
                "Date": "on April 28, 2010",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I hate this book & had to get it for my math class. But its short so whatever. It seemed like it took forever to arrive though."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A353WFRBBPU0UR"
                },
                "Date": "on March 14, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A Geometric/existence beautiful novel that any who treats withe any edification of reality has to read. Truly a must read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HLABSNBCIW2B"
                },
                "Date": "on February 20, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "It is amazing to find a good read in such a short book. The dimensional concepts portrayed here are still relevant today."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NH26EJTRASXR"
                },
                "Date": "on January 9, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This product is exactly as advertised.  This product showed up on time and as advertised. I would recommend this product."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2W1E6RP4CFOF0"
                },
                "Date": "on December 3, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Delightful book! And I happened serendipitously to read it just before Interstellar came out. This is required reading."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOTHA28XUF6XC"
                },
                "Date": "on March 22, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "I was impressed how the book can relate to today's society even though it was written almost a hundred years ago."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RFBTMLQX8OAP"
                },
                "Date": "on July 30, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great read for just about everyone. I suggest reading this book first to set the context for Flatland: The Movie."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3A6968RCSYJG6"
                },
                "Date": "on May 31, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I read this for class. The book was in great condition and was an easy read. Got to my door really fast also."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CYNYS6KQ7S7I"
                },
                "Date": "on April 27, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great to read the thoughts and social ideas of over 100 years ago. Provides a good view of social commentary for the times but needs to be taken in the proper historical perspective.  Such views and comments today would be outrageous."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VQMT748N8ZU7"
                },
                "Date": "on March 22, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is a classic that will go down in time. It will shape your thinking in relativity and life in general."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1R3CRQHSJJMGT"
                },
                "Date": "on November 24, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "The book is good but one corner of the cover was folded over upon arrival.  I was a bit disappointed."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TE25L2J58WRM"
                },
                "Date": "on March 5, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "had heard of this story years ago, but never got around to reading it. glad i finally found the time"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3J9X2A6M2T9BC"
                },
                "Date": "on November 26, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book is so entertaining! I saw the humor of it immediately. Very much like our society today."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HLL52JX0RFW2"
                },
                "Date": "on July 20, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "delightful story that uses geometry - great if you love math or science fiction or fantasy books"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHOKS28MM3FGY"
                },
                "Date": "on November 4, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book will help you to expand your mind. It is amazing that was written so long ago. I like."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RYCUN4Y3EHY"
                },
                "Date": "on March 17, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQ32JOOWB7HHO"
                },
                "Date": "on May 3, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "great story- I read it in high school and it affected my decision to become a math teacher."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3S7NGGAYF6RTW"
                },
                "Date": "on June 23, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "It was a gift for my stepson and I didn't read it myself so I can't commemt on its quality."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GI3LU4GV8D8Y"
                },
                "Date": "on March 6, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Flatland is a fun classic that is a good weekend read, but be warned it may be a bit dry."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TNZH03RF7QIE"
                },
                "Date": "on March 27, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "very, very interesting read-the fact that it was written in 1895 even more interesting."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Y1AF1N8FOSQ"
                },
                "Date": "on March 10, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Very clever classic book - you have to be a little nerdy to read and appreciate it -"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKWINCX1KZO8G"
                },
                "Date": "on April 27, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "For those interested in Math, Geometry, and a world with more than 3 dimensions."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BGHKD3996GGF"
                },
                "Date": "on August 11, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent edition with good modern introduction. Worthy of Oxford Univ. Press."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WS4ALT1Z5YSB"
                },
                "Date": "on September 21, 2010",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FPBM5VOHHWP3"
                },
                "Date": "on September 23, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent book used in a college geography class. Still very relevant today."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16S84C9L5SC1Y"
                },
                "Date": "on February 11, 2011",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZ7611CVHTINL"
                },
                "Date": "on February 20, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Interesting from both a sociological and mathematical perspective."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2C4R5NNCSWNZU"
                },
                "Date": "on July 22, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Interesting. Sometimes hard to sit with for any length of time."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 23, 1999",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "This story is a great primer for people who are interested in Theoretical Physics/Relativity.  the story is superficial, the language is thick and inefficent (by today's standards), but it's a charming book.  It's easy and  quick and a nice title to have under one's belt.  If nothing else, it's  entertaining."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2I1I013BYF5S1"
                },
                "Date": "on December 15, 2008",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31UEHS8L8Z3SJ"
                },
                "Date": "on February 19, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "You'll never look at the world the same way again."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEDR28X7F3WWX"
                },
                "Date": "on July 12, 2010",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Such a simply delightful discourse on on two-dimensional beings/theory.  A fine introduction for thinking about the modern theories involving n-dimensions.  A must read for every collage math or physics major."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22JBKKHCCLO86"
                },
                "Date": "on December 24, 2013",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABBR5NBV7ERHK"
                },
                "Date": "on November 27, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Oh yeah, this one is exactly as described."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XWDZG9SDS1M"
                },
                "Date": "on April 19, 2009",
                "Helpfulness": 0.5,
                "StarRating": "1",
                "Text": "This is not properly formatted for Kindle. It would have been easy to do a better job. This is just a raw text upload with no functioning TOC or proper formatting. The ASCII \"illustrations\" don't work."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWR5UGTHRBTTL"
                },
                "Date": "on December 23, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Had to read it twice but a great book!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHXAPVSHPJ6OJ"
                },
                "Date": "on December 24, 2002",
                "Helpfulness": 0.6,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SQMYZWF09TWU"
                },
                "Date": "on April 16, 2015",
                "Helpfulness": "",
                "StarRating": "1",
                "Text": "Would give less stars if possible"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LS0H7Y9QSSIA"
                },
                "Date": "on July 19, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent! Exactly what I wanted!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3E9VLE7O63VC2"
                },
                "Date": "on November 26, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Probably my new favorite book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1P2CKDK563QW2"
                },
                "Date": "on October 28, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent product and service."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZRBWJ5UFRJKV"
                },
                "Date": "on October 13, 2008",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EDZH51XHFA9B"
                },
                "Date": "on April 28, 2000",
                "Helpfulness": 0.6071428571428571,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on November 7, 1999",
                "Helpfulness": 0.5714285714285714,
                "StarRating": "5",
                "Text": "Ok, great book.  Also, this book was not centered on spirituality or Christianity as some of you morons thought it to be.  It's just a book that opens your mind up to the possible and what is beyond our grasp.  To always  search for the truth, no matter where it leads us, or whatever  preconceptions it shatters.  G'day to you all!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2I22Y2G5F6UPV"
                },
                "Date": "on August 29, 2014",
                "Helpfulness": 0.5,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LQILM8Z44CM6"
                },
                "Date": "on October 7, 1998",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": "Don't waste your money on any edition but the Dover... this tiny (80 p.)  allegory makes some good points. A fun sci-fi classic."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MGEZRKBFWVFV"
                },
                "Date": "on February 20, 2015",
                "Helpfulness": "",
                "StarRating": "1",
                "Text": "Meh.  I don't get the hype."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33BDEL0IFPYUP"
                },
                "Date": "on October 25, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Have loved it for 60 years."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2W1379NIAATM2"
                },
                "Date": "on January 23, 2011",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CQQIGSCNGD51"
                },
                "Date": "on June 17, 2009",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AS6EL4R6PPUE6"
                },
                "Date": "on December 3, 1998",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "When I read this book in geometry class, i never knew that someone would wast so much time to write a book like this.  Is this guy nuts?  This man just rammbled on.  He wrote about thirty pages of story, and about fifty  pages of pure junk.  When the author is trying to make a point he starts to  trail off and starts to talk about things that have nothing to do with what  the book's about.  I thought I was going to go crazy, until i got to part  two of the book.  Part two is the actual story of the book.  It was  interesting about how other worlds in the book were.  I like the way he  described them.  I also like how he took the way these people acted in the  different lands and showed how close-minded some people are to new ideas.  I also liked how he put in the color revolt.  It was my favorite part of  the book.  In conclusion, I honestly wish i had never read this book.  I'm  glad it was only 82 pages long."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AO3C1XHG6TAB3"
                },
                "Date": "on March 20, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "read the whole thing!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHMPBG7609J66"
                },
                "Date": "on January 18, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "One of my fav books"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UB1ZIYDN278D"
                },
                "Date": "on October 15, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Thank you so much!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20I58BR0IX3KG"
                },
                "Date": "on October 10, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great, thank you!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGZUT5BE7RG9Y"
                },
                "Date": "on December 5, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "makes you think"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALRMLDRF60PKD"
                },
                "Date": "on February 4, 2011",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "This is speculative fiction at its finest: the premise of an unreal world (two-dimensional) allows the exploration of both mathematical and political issues from a new, exciting, perspective. The horrible Victorian social atmosphere of Flatland is reflected perfectly in its mathematical rigidity, and the subtle criticism of a society with rigid social classes is amazing -- even as spoken from the mouth of a square who truly and honestly believes that this is how society should be."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16S84C9L5SC1Y"
                },
                "Date": "on February 11, 2011",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CS741N2BFYCR"
                },
                "Date": "on December 20, 2011",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "When I read this book, I was struck by how harsh the government was. In fact, most of the book was dedicated to describing the government. The main character is sentenced to life long inprisonment, just because he's explaing his views. It was interesting, tho, when he discovered the three dimensional world and asked his pal, the sphere, to open his guts. I assume that the sphere was a human."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOBCRM6X050DW"
                },
                "Date": "on December 23, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Quite nice"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2O1UCVQIDWJCB"
                },
                "Date": "on September 29, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Good read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADGEK87YMQEMS"
                },
                "Date": "on July 10, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "Slow read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LHMWMCGBKUP2"
                },
                "Date": "on January 20, 2015",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": "I made it about 40 pages and gave up. At first I enjoyed the description of the flatland but it didn't move fast enough. If you understand the concepts by page 10 then I can attest that the next 30 pages are just like rereading the first 10, 3 more times. Maybe there is something later in the book that is a mind bender but I can say the first third of the book is pretty elementary."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A265Z31TQCREN1"
                },
                "Date": "on March 15, 2014",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": "My dad recommended this book to me & he is really well-read, so I figured it must be good.  I guess I missed something though because I found it really boring.  I think maybe I'm spoiled by all the very colorful & full fantasy & sci-fi worlds out there because in contrast, this was...well, FLAT.  The only reason I read the whole thing was because I was in a foreign country with no internet connection to buy more Kindle books & no English-language paperbacks to be found!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3P3Q1WODHBGSW"
                },
                "Date": "on February 24, 2013",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": "The thesis of this piece was very appealing to me, but it just did not deliver. I know those who thoroughly enjoyed it, but I can't imagine why."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3V4YRXU94RINY"
                },
                "Date": "on January 4, 2013",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": "This book could have been reduced to ten pages.  Great for for someone with a third grade education.  May be that was the point."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15L2CAB5814O5"
                },
                "Date": "on December 17, 2012",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": "A bit heavy for someone who is not that refflective.  I thought I would give it to my grandkids after I read it but I gave up on that idea."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJPCXRRQ2SE7X"
                },
                "Date": "on January 8, 2013",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AF0NZN3Y6F67L"
                },
                "Date": "on May 15, 2012",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": "Unless you are a math teacher or enthusiast this book can put you to sleep.  I have a lot of respect for mathmeticians, but I don't have the same taste in literature as they do.  So for your average teenager who doesn't exactly take delight in going to geometry class everyday, I must say this book isn't for you."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IFXP2DJE0TF8"
                },
                "Date": "on November 4, 2007",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on December 3, 1998",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Anyone who's ever wondered what it might be like to live in four diminions, or two, or what zero diminsions means should read this book.  By giving detailed descriptions of life in two diminsions, Abott opens your  imagination to what life in four or five diminsions might be.  It's cool  stuff <grin>!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2K6L8C0IJGQY4"
                },
                "Date": "on September 8, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Wowzers!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39XFQ0R1N7CBT"
                },
                "Date": "on March 12, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Love It"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1W1M1XA0FHUQ4"
                },
                "Date": "on May 12, 1998",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "A fantastic tale that takes you to other dimensions.  A novel truly ahead of its time considering the original date of publishing.  Highly recommended to anyone interested in interdimensional cosmology.  It really breaks it down for the average person."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 8, 1998",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "This book has helped me explain dimensions to my middle school math students.  Using the worlds of \"Flatland\" and \"Lineland\" from Abbott's story, it is easier to conceive of a fourth dimension existing.  Wow!  What an eye opener!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3A8V5PC2QVH4S"
                },
                "Date": "on March 26, 2011",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Every young math student should read this book.  And every budding philosopher.  It speaks to life as few others, perhaps Animal Farm.  A must read again if it has been a while.  It is a short but worthwhile read.  It can be read aloud easily."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUZEWRP9EZJ45"
                },
                "Date": "on July 2, 2013",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": "Heard about the book on NPR and Big Bang, sounded like it might be a good read, wrong. If you read the first 3 pages you pretty much have read the whole book. It rambles on and on  repeating itself without saying anything."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PY99MBDWVHFG"
                },
                "Date": "on August 30, 1998",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on September 4, 1998",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I just have to add to the previous comments with this similar opinion:  it  was fun and very interesting.  A short novel about shapes that have some  very human qualities, such as our hierarchy.  Worthwhile."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on November 3, 1998",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "As a geometry teacher, I really enjoyed Flatland... and my students have, too!  It's very easy to understand and really gets you thinking about what life would be like in a 1 and 2 dimensional world."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DO91H50H1J3Y"
                },
                "Date": "on November 8, 2011",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "2",
                "Text": "Flatland is a story of A Square living in a two dimensional land called Flatland. One day he discovers that another dimension exists and it changes his life. This 19th century classic is not only an explanation of dimensions, but it is also a social commentary on Victorian England. I was disappointed in this story. I was looking forward to an interesting look at geometry and dimensions, but mostly I was bored, especially with the first half of the book. I had to repeatedly remind myself that it was social commentary and that the horrible description of women may have been commentary and not the author's real feelings. If you are interested in a way of viewing dimensions, the second half of the book might interest you, but as a whole I wish I skipped this one."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SHKO70AK1DC3"
                },
                "Date": "on July 28, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "thanx"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7XUM8VT5N9J0"
                },
                "Date": "on February 6, 2013",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": "I heard the audio book of Flatland and I found it very basic in terms of Geometry. I did like the author's creativity in creating the 1- and 2-dimensional world."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1X7NEDTAYXZ09"
                },
                "Date": "on July 27, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "Good"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQ9GAAHR00VLN"
                },
                "Date": "on August 8, 2013",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": "This version does not contain the drawings which are crucial to the overall story. I recommend you find another edition to purchase."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UDYLDHSNK1XE"
                },
                "Date": "on November 26, 2014",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": "This version of the book is without the graphics, and the plaintext does not do justice to the contents of the book at all."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JGOKYJPPARHO"
                },
                "Date": "on August 8, 2008",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "One-click transaction.  Couldn't ask for a more wonderful buying experience. Thank you very much!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LB8XZLK0V041"
                },
                "Date": "on November 7, 2006",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on May 12, 1998",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Abbott makes you wonder, with the analogies that he uses, about the higher dimensions."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27ZH163OHF6ZQ"
                },
                "Date": "on June 13, 2009",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "1",
                "Text": "the book itself is a marvel, you can read it again and again, like slowly sipping good wine. but the pages came apart within a few minutes. i think that offering a cheap edition should warn us that something is wrong. had i known the book is of such poor quality, i would have chosen a hardcover."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DUVEKBWJPBNF"
                },
                "Date": "on December 30, 2005",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": "A fascinating geometric tale. An easy and short (<100 pages) read. It is an interesting read for anyone (not just mathematicians). It's amazing to think this was written over 100 years ago - Abbott was way ahead of his time."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EC1IG3LOB0NF"
                },
                "Date": "on May 11, 2001",
                "Helpfulness": 0.4,
                "StarRating": "4",
                "Text": "Well by the time you read this book you probably know all about it. Almost all books about multiple dimensional spaces refer to this book and when you find it less than a dollar you want to read it. It is interesting that somebody wrote a popular science book hundered years ago regarding how life concepts would show itself in one two or more dimensional spaces and author creates his own concepts and solutions to problems. Well you do not learn anything new that you did not know but it is a classic book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37M7W1JKJ303E"
                },
                "Date": "on October 24, 2009",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QX3NLR2SZ420"
                },
                "Date": "on December 15, 2002",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABUN5OOLTV3YG"
                },
                "Date": "on February 17, 2007",
                "Helpfulness": 0.4,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JULKQLVLWZV"
                },
                "Date": "on August 7, 2000",
                "Helpfulness": 0.4,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29TNOA10JLWN8"
                },
                "Date": "on August 4, 2001",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "Abbot has a commanding style as he weaves a tale using geometry to challenge the way people view the world.  Through a cunning use of analogy, though admittedly more suited to a younger, school-age audience, he challenges the way people view the world, urging them to be more open-minded and less narrow-minded, or \"flat,\" in their view of events around them.  He also obliquely deals with the antagonism between the sexes, somewhat outmoded in today's culture, as well as the resistance of society in accepting new ideas and the power of government to corral the thoughts and images available to the public."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 11, 2000",
                "Helpfulness": 0.4,
                "StarRating": "5",
                "Text": "This book rocks. I can't say anything else because it has been said above. BUY IT BUY IT BUY IT!  This book is truly a work of art."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30BTO2KJDHZTU"
                },
                "Date": "on August 20, 2002",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I read this book when I was 13 because my math teacher recommended it.  This book is great.  It was first published in 1952 and is still used and taught by schools, mathematicians, physicists, and others.  I have always had an interest in math and since reading this book I have been reading other math/science related books nonstop.  Anyone who likes math should read this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FAX66GJNM5MH"
                },
                "Date": "on January 5, 2001",
                "Helpfulness": 0.25,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 28, 1998",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Behind the 19th century english text is mind-boggling exploration through life on various dimensional planes from the perspective of a square that ultimately is liberated from his two- dimensional realm."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIFWJDBTGP6UQ"
                },
                "Date": "on August 9, 2007",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Smooth transaction, careful and fast shipping, very nice product, couldn't ask for a more wonderful buying experience. Thank you very much! A+++"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YLXRC8Y79SCE"
                },
                "Date": "on October 29, 2001",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Even if you hated geometry class, you will love this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24YHUNDZ5E33K"
                },
                "Date": "on April 9, 2008",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "In Flatland, we are reminded that it is hard to convince people of something, when they have no terms of reference with which to make sense of what we're saying. It is a great reminder to us that, when we are talking to people from other religions or belief systems, it will be very hard for them to understand us. We have to really bend over backwards to translate our message into something that they can latch onto and understand. Fine. But here is the problem: Today, people are using this film to convey a very different message. They try to leave the impression that anyone who disagrees with their agenda (political, environmental, gender, whatever) is (1) wrong, (2) too poorly armed to ever understand them, and (3) therefore not worth trying to reason with. The result of this line of \"thought\" is that they will simply have to impose their wisdom on the Others. This leads to having government health care, whether you want it or not; using politically correct language, whether your want to or not; for your own good! So, the only problem with the Flatland story is that it fails to remind us that most people who go against the crowd are simply wrong. Sure, everyone laughed at Einstein and he turned out to be right. But everyone also laughed at millions of clowns who were simply nuts. The idea that anyone who is different is therefore right, is wrong. The idea that there is no point in reasoning with your adversaries, is also wrong. Please read or watch this story and enjoy it, but when your boss says, \"I want us all to see this film so that we have a common language ...\"  RUN!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on May 9, 1998",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "Not bad, but not good either.  As short as the book was (~100 pp.) it was tedious and dull.  Abbott wastes lots of time explaining the most simple ideas (e.g., the appearance of a square in 2-dimensional space (ch. 1)).  Furthermore, there were several impossiblities encountered.  For example, A. square is always in 3-space, but is only able to sense 2-dimensions.  He therefore will never be able to \"see\" 3-D, even when he is \"pulled out of the plane\" by the sphere.  I also am curious as to how he is able to understand 3-D, if he is a 2-dimensional creature.  Among humans, only the most brillian can begin to understand higher dimensions, but among 2-D creatures, a lowly square can understand 3-D??"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1X8VZWTOG8IS6"
                },
                "Date": "on September 3, 2007",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "Flat is an exercise in science fiction geometry, if you like.  It shows a denizen of a 2 dimensional world seeing what it would be like to exist in higher dimensions.  An interesting mathematical and philosophical exercise.  Some will definitely find this very odd, and rather quirky.  If you don't know what a dimension means in this sense, give it a miss."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19MKI0BDG8KC9"
                },
                "Date": "on January 10, 2013",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": "I had heard of this book as one that takes it's characters through different numbers of dimensions, but I did not realize how long ago it had been written.  As a result, I really didn't like the book.  Not only is it pretty sexist, but a lot of the \"story\" is just descriptions of life in the 2D world way back when.  I thought their would be more plot instead of descriptions of old timey high society and class divisions.  I guess if you want a Pride and Prejudice type story with a geometry flare, you might like it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3COFV276PO2N1"
                },
                "Date": "on September 22, 2013",
                "Helpfulness": 0.2857142857142857,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3F62RXE2KIA3E"
                },
                "Date": "on June 20, 2010",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": "I downloaded this on my Kindle App after hearing about it on \"Big Bang Theory\" and tried to like it.  I really did.  But now it has been several months, and I'm less than 1/4 of the way through it.  The first few chapters were interesting, but after a bit, I got completely lost.  Sorry Flatland, maybe I'll try again in a few years."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VLWU4270TFZE"
                },
                "Date": "on May 13, 2005",
                "Helpfulness": 0.4166666666666667,
                "StarRating": "5",
                "Text": "I read this book over 20 years ago for extra credit in 10th grade geometry.  It has the effect of compressing your mind like a spring, (into 2D) then releasing it.  What I got was a different meaning than most.  And that is...this could explain \"where\" Heaven and Hell are.  If our 3D existance is a subset of 4D or higher as the book suggests, then it \"fits\" for an answer to a rather basic question of faith in God."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 29, 1999",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Flatland is a very enjoyable book.  It is quite a challange to try to realize all of the different worlds described."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LSNX2NOYDL7L"
                },
                "Date": "on July 31, 2014",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": "I just couldn't take all the misogyny in this book. I know it's dated but even so it was too much for me."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Y7WGAKUKMJKF"
                },
                "Date": "on February 27, 2001",
                "Helpfulness": 0.36363636363636365,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JBD9VTO4B2XD"
                },
                "Date": "on January 11, 2007",
                "Helpfulness": 0.25,
                "StarRating": "5",
                "Text": "This book in its semplicity is very smart. It's like a comic fairytale but in the end the author's message is very deep. Everybody should read it.."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWNBZSEZ9P8BE"
                },
                "Date": "on February 19, 2004",
                "Helpfulness": 0.2222222222222222,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYMJQP055M642"
                },
                "Date": "on January 6, 2003",
                "Helpfulness": 0.2727272727272727,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A291NNST1ASDCJ"
                },
                "Date": "on July 2, 2011",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "The book is great.  I have purchased dozens of copies in the past for my students.  This E-tailer has poor communications practices:  no notification that the product was shipped, no tracking method, no notice as to which carrier the product was shipped with, no notice that the recipient received the shipment (the purchase was a gift sent to another address.)"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on August 26, 1999",
                "Helpfulness": 0.14285714285714285,
                "StarRating": "4",
                "Text": "hi im marlene i wanna know a phone number that gime me more information to how i buy this book because is the first time that i try ti buy a book on the internet and i wanna know more about this ok"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 26, 1999",
                "Helpfulness": 0.2857142857142857,
                "StarRating": "2",
                "Text": "The book was very intresting, and refered to lots of geometric synopsises, but i personally did not enjoy it. It wasn't exciting or suspenseful. It  was boring and dull. \"A\" square was not at all life like, he was  weird. I think this book was geometrically incorrect. Alfred Snyzeltrice  would frown!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2B1UR6SQT9RVM"
                },
                "Date": "on February 24, 2006",
                "Helpfulness": 0.25,
                "StarRating": "4",
                "Text": "this book was written a century ago - yet is embodies the principles, the mind skills which are currently developing our outstanding dot com industries.  Read it - you will be fascinated!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34KIS35PH4HKO"
                },
                "Date": "on October 25, 1999",
                "Helpfulness": 0.3181818181818182,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3W01WZTQV1K82"
                },
                "Date": "on January 8, 2010",
                "Helpfulness": 0.18181818181818182,
                "StarRating": "5",
                "Text": "I ordered this as a gift.  It came on time and in new condition.  I was happy to give it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAW5W11WNRO5"
                },
                "Date": "on July 18, 2001",
                "Helpfulness": 0.15,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A115U76RTTQPA8"
                },
                "Date": "on January 7, 2010",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "Although the item was shipped properly and received on time, it does not hold my interest."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1M5WFZ5M3O47"
                },
                "Date": "on September 10, 2004",
                "Helpfulness": 0.05555555555555555,
                "StarRating": "2",
                "Text": "I was assigned to read this book as part of my online geometry course, and it was ok, except there is absolutly no story line to the book."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 23, 2006",
                "Helpfulness": 0.07317073170731707,
                "StarRating": "2",
                "Text": "This book is a cure for insomnia.  If I ever have trouble falling to sleep, I'll just dig out my old \"Flatland\" book, and I'll probably be fast asleep a few minutes later!  Listening to the A. Square character telling us about his flat, two dimensional world is not thought provoking, its just confusing!  Trying to imagine life in two dimensions is truely mind numbing.  I mean I understand what Flatland would be like, but only after I carefully think out what Mr. Square is saying.  I spent more time trying to comprehend the two dimensional reality of Flatland than I do enjoying the story.  Not very interesting at all, even two stars is being generous!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 18, 2000",
                "Helpfulness": 0.09090909090909091,
                "StarRating": "1",
                "Text": "I have to read this book for my English 4 AP class, and am so far highly disappointed and confused!  What is the purpose of this book.  It's another Alice in the Wonderland yet much more confusing!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Y5KWAC2HJ9F6"
                },
                "Date": "on August 11, 2000",
                "Helpfulness": 0.0975609756097561,
                "StarRating": "1",
                "Text": "As a future sophomore high school student that was forced to read this book over summer vacation, I would like to voice my opinion. Flatland, by  Edwin Abbott was absolutely horrible. This man should have been locked up  when the book was written in 1895 or '96 (whenever it was written). I had  to read Flatland for my Geometry class and let me tell you, just by reading  the description online sent me into a fury. I had no interest in reading  about a two-dimensional world with shapes that move about in a society  based on how many sides they have. But I did try to keep an open mind - but  that (as you can see) didn't work. You have to be truly TRULY interested in  that sci fi dimension hogwash to completely understand and fully enjoy this  book. Maybe I disliked it so because I had to read it over my 90 days of  summer vacation as well as 4 other non intersting and unentertaining  \"books of literature\" (I think summer reading really makes  students dislike reading even more). I personally enjoy reading the  newspapaer, National Geographic magazines, and some books that may grab my  attention at BARNES AND NOBLE (just for those who believe me to be some hot  headed teenager who dislikes a good book). Please! Save your $4.45 and put  it toward saving hungry and dehydrated children in Ethiopia instead of  buying this ridiculous \"satire\"."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 17, 2002",
                "Helpfulness": 0.08974358974358974,
                "StarRating": "1",
                "Text": "okay, i was forced to read this book for summer reading. it was awful. i only have one thing to say about this book-there ARE three dimmensions and we are NOT shapes.  stop forcing children to read this book!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 22, 1997",
                "Helpfulness": 0.0196078431372549,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOZMMXSU9DESE"
                },
                "Date": "on March 14, 2006",
                "Helpfulness": 0.10619469026548672,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on May 13, 1999",
                "Helpfulness": 0.04285714285714286,
                "StarRating": "1",
                "Text": "Worst book ever written. Not worth 80 cents"
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Flatland-Romance-Dimensions-Thrift-Editions/product-reviews/048627263X/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "463"
    },
    "Salesrank": "#4,222",
    "Timestamp": "2015-05-24 12:38:08.193977",
    "itemurl": "http://www.amazon.com/Flatland-Romance-Dimensions-Thrift-Editions/dp/048627263X"
}
