{
    "Category": "in Books (",
    "ListPrice": "$16.99",
    "Name": [
        "A Different Universe: Reinventing Physics from the Bottom Down"
    ],
    "OfferPrice": "$14.81",
    "Reviews": {
        "AverageStarRating": "3.7 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XJ0UU2BI78HZ"
                },
                "Date": "on July 5, 2005",
                "Helpfulness": 0.881578947368421,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PR6NXG0PA3KY"
                },
                "Date": "on January 14, 2008",
                "Helpfulness": 0.9111111111111111,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AO8L3QR0C0LBZ"
                },
                "Date": "on May 9, 2005",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3T6V2W5M7QK2I"
                },
                "Date": "on August 14, 2010",
                "Helpfulness": 0.8235294117647058,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Y1AU2VTU0EAG"
                },
                "Date": "on June 8, 2005",
                "Helpfulness": 0.8235294117647058,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29KOUMEOY9CBT"
                },
                "Date": "on August 16, 2008",
                "Helpfulness": 0.8888888888888888,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GXRS61C8LN77"
                },
                "Date": "on July 5, 2008",
                "Helpfulness": 0.7727272727272727,
                "StarRating": "1",
                "Text": "I am compelled to read and study science and mathematics and usually have several books on quantum theory, cosmology, relativity, and the nature of consciousnesses going at any moment in time. I select my reads carefully and am rarely disappointed, but I really blew it in choosing Robert Laughlin's \"A Different Universe.\" I grudgingly finished the book hoping that there would be some insight near the end that would make getting through the rest of it worthwhile, but alas no cigar. My specific criticisms are as follows. The book is extremely light in physics and heavy in personal anecdotes and attempts at sarcastic humor, some of which is funny, but then I didn't look under humor when I choose this book. The physics, chemistry and biology that Laughlin does include are dealt with in a cursory manner as if they were inside jokes not requiring thorough explanation. If I had not previously read extensively on the main topic of the book, \"emergence\", I would have ended \"A different Universe\" still confused about the concept. If you are interested in a clear book on the subject I would recommend, \"The Emergence of Everything-how the world became complex\" by Harold Morowitz. The reason I read these books is to get an ever increasing understanding of the natural world and I hope that the scientist writing them will offer up a new metaphor, analogy or image that will enlighten my understanding.  I assume that Laughlin has that ability, but at least for me, failed to display it in \"A different Universe.\""
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7CEZDM1IK52K"
                },
                "Date": "on February 7, 2006",
                "Helpfulness": 0.75,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3R7QQO8FAQU1O"
                },
                "Date": "on March 16, 2005",
                "Helpfulness": 0.71875,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYFF49N9DN9O6"
                },
                "Date": "on November 11, 2008",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZDPQA6FLY8XM"
                },
                "Date": "on October 16, 2005",
                "Helpfulness": 0.6944444444444444,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LPGL6LP1NFHH"
                },
                "Date": "on October 23, 2007",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "3",
                "Text": "I read loads of science books and generally take away something of value from each of them, however oddly written they may be, but this book was really a huge disappointment.  It is supposedly about the concept of \"emergence,\" as used by physicists, but it barely pauses between its random sophomoric stories and pontifications to even define -- let alone explain -- that term before we're off on a long series of almost completely unrelated topics, as for example, when he spends a paragraph, for no apparent reason I can find, snidely dismissing the possibility of building a quantum computer, and that even though several primitive versions of that device are now in operation.  Maybe if you know this field inside and out this book will make sense to you.  If you are looking for an introduction to the disputes around \"emergence,\" however, this is no place to start. P.S.: After writing all the above I had occasion recently to reread several parts of this book.  There is one glaring exception to what I wrote before, namely chapter four, which explains the mysteries of standard phase transistions in materials, especially water.  It is the best introduction to that topic I've read anywhere and deals only with the phsyics, eschewing the many silly stories about physics conventions etc. that ruin the other chapters.  I recommend chapter four highly.  But you don't need to buy the book to read it as it is included in the online version of the book, which an internet search will turn up quickly."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4HJ8AUH5U6D1"
                },
                "Date": "on March 26, 2015",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11CNB9UQ0VVP"
                },
                "Date": "on January 21, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Just finished this book.  His sense of humor, his humorous attacks on EVERY branch of science, especially his own are worth it alone.  He gives you a different way to view the Universe - why some questions, while not impossible to answer, will not be easy, how easy it is as a scientist to ask the wrong questions -- and really, you get a feeling for an 'insiders view' of being a scientist, a lot of the flaws, the language used to cover uncertainties of mistakes or just bad math - yet at the same time, puts forth his theories of emergence and self-organization together so well, tying together so many things, that I found myself looking concepts and ideas I had never HEARD of before up on the web to understand MORE before I could consider.  About every 3rd page was something that made me go \"Woah, never thought about it that way\" or \"never knew that before\".  Well done.  Some of his camping stories were a bit long but I like camping tales, so it didn't bother me - and a bunch of scientists hiking up a mountain would make for interesting reading all by itself.  A lovable smart___ but heck, he won the Nobel prize - worth listening to for sure."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35OPO6QCBG6ZS"
                },
                "Date": "on September 4, 2005",
                "Helpfulness": 0.6875,
                "StarRating": "5",
                "Text": "This book is not a page turner, its better than that. You may find yourself putting the book down just to prolong the pleasure of reading it. The author's thesis is that fundamental laws are based on generally complex collective phenonomena. Maybe, I find it gratifying because I have long suspected that this is the case. The book may off-putting for a couple superficial reasons. One is that readers who've studied elementary physics or learned from books like those of Brian Greene and Roger Penrose that accept the primacy of  fundamental univeral laws of nature may not be so familiar with the kind of fields like low-temperature physics, solid state physics, and phase transitions, from which Laughlin draws his examples. Such fields as these are traditionally regarded as applications of supposedly deeper ideas and so do not get that much attention from educators and populizers. The other reason is that Mr. Laughlin does not conform to the serene wiseman stereotype of a theoretical physicist. He's more like a crotchety but idealistic engineer who is forever tilting against the received wisdom. (At his most annoying, he harps on supposed gender differences and differences between people from different parts of the US. He seems to think that New Yorkers can't appreciate the photography of Ansel Adams!)It would be a pity if these things deter readers because the author has a lot to teach. I only wish that he had elaborated further on some of his fascinating ideas such as the emergence of things like fundamental constants and empty space out of collective phenomena."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1B25JL8W6YN9U"
                },
                "Date": "on April 18, 2005",
                "Helpfulness": 0.6862745098039216,
                "StarRating": "1",
                "Text": "This was a disappointing book in several ways. Most significantly, the main concept - emergence instead of reductionism - was poorly explained. The anecdotes, ostensibly to illustrate scientific points for the sake of the unscientific reader, usually obscured what they were intended to clarify. Often they seemed little more than self-indulgent stories seeking a place to park themselves.  The rapid accounts of various physical and biological items were of no use to a reader who already knew them, and were simply sleight-of-hand to one who didn't. The disresepect for the reader was truly insulting."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HC2JZWHT480S"
                },
                "Date": "on May 12, 2010",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "When I picked up this book, I intended to be entertained along the lines of other physics popularizations, but what gradually dawned on me after a few chapters was that Laughlin was actually covering radical new ground. I couldn't stop reading. Emergence is, of course, not a new idea anymore, but this book goes far beyond what I had been aware of (such as the article \"More is Different\"). Laughlin makes such a compelling case for emergence and organizational principles as constituting the core of our physical reality, often drawing from his deep insights into condensed-matter physics to illustrate this larger point. A good example is his elevation of the fractional quantum hall effect (for which he won the Nobel prize) as the quintessential emergent phenomenon, where a reductionist approach must fail. Here the parts (electrons) give rise to a collective state whose excitations have fractional charge. Laughlin weaves these examples into a larger whole, and argues that physical laws themselves (not only individual phenomena) are emergent by nature. Endlessly fascinating and profound ..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DECZ2YDZVNFW"
                },
                "Date": "on July 3, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "The author does an exemplary job of stating the case that not enough time is spent on using experimental physics to glean a better understand of the more complex unsolved problems we are trying to solve. He does this with insight from his experience but also relates other recent work to make his case. He provides a human touch to this, referring to the contributions of several key experimental physicists. Throughout the book he adds anecdotes about himself and others that add a good backdrop to how these people think and live. Finally many of his observations and anecdotes are funny. This book makes you think about experimental physics in a new light."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WPNH9C1K7PWL"
                },
                "Date": "on December 20, 2006",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VX6A9UZBLEPI"
                },
                "Date": "on April 20, 2005",
                "Helpfulness": 0.6842105263157895,
                "StarRating": "4",
                "Text": "Very often, books written by Nobel laureates in physics tend to overindulge in arcane philosophical arguments. Some topics discussed are so far removed from the average scientist's day-to-day reality to the point of being comparable to someone's unrealistic abstract nightmare. However, this book is quite different. The author remains grounded and presents his science as something much more tangible. Although some philosophizing is unavoidable, there are also various anecdotes that add a nice personal touch. The writing style is engaging and the topics are varied - within the realm of physics and physicists. I would recommend this book mainly to scientists and science buffs."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WCYFUYT4HADS"
                },
                "Date": "on May 16, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1A1I7SRTN771"
                },
                "Date": "on April 1, 2012",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XE2JOZZKMEG6"
                },
                "Date": "on February 28, 2011",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QNO9W8ZS4JUK"
                },
                "Date": "on November 26, 2007",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "Laughlin provides a broad sweep of reductionist physics, takes that reductionist model to it's logical limit and then gives us a a worthy suprise- the birth of \"emergence\" theories in physics at the other end of the spectrum in size.  He eventually shares that what we think of as classical or Newtonian physics is actually emergent from quantum physics, once the scale of atoms or molecules become great enough.  Further,  emergence theories explain new patterns found in nature not at the atomic, but rather at the system and organizational level. What I loved about the book was his crystal clear and approachable writing, sense of humor, excitement of discovery, and personal stories from time spent with some of the greatest thinkers of our time.  The new theories of emergence also help explain why open systems or starfish style networks often self organize and produce such tremendous power and beauty in their output.  As a co-author of \"The Starfish and The Spider: The Unstoppable Power of Leaderless Organizations,\" I find that \"A Different Universe\" helps explain the mysterious power of decentralized organization that sometimes \"just happens\" in a free and open system.  The \"organizational\" models and theories from physics often have parallels in human groups. This book is a masterpiece in both physics and organizational thinking."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QITNVEUOUS3V"
                },
                "Date": "on March 16, 2006",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1O3FL4UBQXCVX"
                },
                "Date": "on November 26, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Great balance of intellect, creativity and analysis."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QBJFAUAL174I"
                },
                "Date": "on January 11, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "This is an interesting book written by Nobel laureate Robert Laughlin (Physics 1998, fractional quantum Hall effect). The main subject of the book is the concept of EMERGENCE, which has different meanings to different people but within the realm of science means that patterns and physical laws do emerge from complex systems made by large numbers of interacting \"particles\", e.g. atoms, molecules, electrons, ants, and so on. Laughlin argues that the end of reductionism is near and therefore we should embrace new concepts and views of the physical world. The book is peppered with lot of anecdotes, funny stories, and jokes most of which were experienced personally by the author. In many places he is honest about the scientific approach: we do not understand the majority of these complex, emergent phenomena therefore science did not reach an end yet. You cannot expect to learn the mathematical or physical details of emergence (because this is still an open field of research) but you will gain an interesting perspective of this important subject."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ERB9U9PFUQEU"
                },
                "Date": "on April 27, 2010",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": "I read this book with fruition. The author develope his ideas in such a way that one can connect different fields of knowledge or the evolution of different systems (natural or artificial ones) by a unique phenomenon: emergence. I would say that the ideas are given only in a phenomenological way which is a first step in the understanding of a given phenomenon. I would expect one or two chapters with more explicit formal (litle more) relationship between aleatory different systems that were mentioned in the book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AH0Y86J739J6Q"
                },
                "Date": "on July 31, 2006",
                "Helpfulness": 0.631578947368421,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ISM2WJVIXP1L"
                },
                "Date": "on May 28, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9AMXY6TRC2O4"
                },
                "Date": "on December 4, 2005",
                "Helpfulness": 0.6190476190476191,
                "StarRating": "1",
                "Text": "I think the author is a brilliant physicist with some incredible ideas, but he sure didn't express them in this book.  As stated by others, there a various anecdotes (many which are funny and enlightening), but most without real relevance.  I bought the book to learn about his ideas, but alas this book seems to be written for someone with a significant background in the subject matter already. My rating is really based on the readability (which is poor) since the book did such a poor job of relating his ideas I can't judge those."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1756UX359OCIJ"
                },
                "Date": "on November 19, 2006",
                "Helpfulness": 0.5714285714285714,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKY9RPPIHNQGC"
                },
                "Date": "on March 25, 2015",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37XU5QV2WF38P"
                },
                "Date": "on May 15, 2013",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2X3GVZT68K9XK"
                },
                "Date": "on July 28, 2005",
                "Helpfulness": 0.5882352941176471,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1D3DN36E8MMU6"
                },
                "Date": "on April 12, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Great book. I will read it again. I also plan to seek out other books written by this author.  I recommend."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GK6ADT70NLHB"
                },
                "Date": "on December 18, 2014",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "I just finished reading it and did learn some interesting things about condensed matter physics – but only got 1.5 pages of typed notes (not good). Amazon gave it 3.5 stars.  I would say that although it has cute stories, it is poorly edited, verbose yet cursory, often off the point, and lacking in definitions of terms and any kind of technical depth which might clarify his concepts (“Where’s the Beef!”).  The book was based on a overly-condensed but basic article, “The Theory of Everything,” by Pines and Laughlin, http://www.pnas.org/content/97/1/28.full  If he had elaborated on this in a more careful and more technical way, he would have had something."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ESKPQLUE3T5M"
                },
                "Date": "on July 26, 2005",
                "Helpfulness": 0.5833333333333334,
                "StarRating": "2",
                "Text": "I bought this book with a lot of expectations, but was deeply deceived! It is a pompous book, confused, and not too well written. Just because one won a Nobel Prize doesn't oblige one to have the final true. Too many stories without too much interest in my opinion, too many quotations. I didn't had even the patiente to finish it. Best luck to all its readers..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ON01SQSBE1XE"
                },
                "Date": "on June 20, 2005",
                "Helpfulness": 0.56,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A116M7O6RO6RGD"
                },
                "Date": "on May 10, 2005",
                "Helpfulness": 0.58,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18M5AUP4JCSH6"
                },
                "Date": "on March 11, 2009",
                "Helpfulness": 0.4444444444444444,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7UMC95YCRGTS"
                },
                "Date": "on August 29, 2005",
                "Helpfulness": 0.5238095238095238,
                "StarRating": "5",
                "Text": "One of the paradoxes of current science is the way it gets more and more brilliant about one aspect of reality, but leaves mostly everything out. Then that part is used to bludgeon everyone else into submission to a limited perspective that makes no sense of other fields. This limited vision is especially evident in biology as the enigma of life stands out as somehow an anomaly (?!), and yet it is the main event. The author's effort to give a lift to current suspicions/speculations about emergent phenomena hopefully is a bellwether for a turning point in science beyond the legacy of reductionism. He also takes a potshot at the current reign of Darwin's 'antitheory' that might be helpful in the current frenzy of the Darwin debate."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3M6DCC9KXKDEH"
                },
                "Date": "on October 5, 2013",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "A different look at physics than cosmology or particle physics. Entertaining and eye opening. I can suggest it for light reading for a physicist."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APL9LTCDIAJP0"
                },
                "Date": "on July 16, 2011",
                "Helpfulness": 0.25,
                "StarRating": "3",
                "Text": "Certainly not physics or cosmology, a cross between memoir and philosophy. An interesting life, but Laughlin chose to not teach science in this volume. Just OK."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EYJ7WJMPH1Y8"
                },
                "Date": "on January 4, 2007",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RNNHT8T1I5ZR"
                },
                "Date": "on April 13, 2005",
                "Helpfulness": 0.4864864864864865,
                "StarRating": "5",
                "Text": "Chris W. says \"Overall, I am left with the impression that Laughlin & Pines are giving a war to which no one should come, because the case for their revolutionary intellectual movement is founded on misperception and false choices.\" Well, maybe, but come on over to the philosophical side of the house and you'll find that Laughlin's  correctives are urgently needed. His principled emergentism is exactly what is needed to counter (1) those who cite the failure of good-old-fashioned-reductionism as an argument for a nouveau dualism, and (2) those who think that they can simply build a theory of mind by gluing together enough neurons."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NF735JALJURE"
                },
                "Date": "on March 19, 2005",
                "Helpfulness": 0.4186046511627907,
                "StarRating": "5",
                "Text": "I think there is a Mohs Hardness Scale that applies to people, and Mr. Laughlin is definitely a '10'.  I don't recall ever reading a book by a physicist that was so 'earthy'.  Some thinkers are forever constructing 'skyhooks' with their thoughts; for Laughlin, ideas are like 'cranes' that move rock-like earth.  I found it very refreshing.  Instead of a heart fluttering in the sight of the beloved, I sensed scorching sun on a burned back and teeth made whiter by the ruddiness of weathered cheeks.  I didn't realize Jack London types could be physicists, too.  I felt a kinship and a respect I haven't felt in a while.  While this review is probably way too esoteric to mean anything to anyone else, I just wanted the author to know that I enjoyed reading his book.  And yes, that steak would be the best thing I've ever tasted."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HV1ZRHBQYUJL"
                },
                "Date": "on March 3, 2006",
                "Helpfulness": 0.29411764705882354,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IAECQHS9E2CW"
                },
                "Date": "on August 13, 2005",
                "Helpfulness": 0.37142857142857144,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2A83W584C0N0L"
                },
                "Date": "on September 6, 2005",
                "Helpfulness": 0.07692307692307693,
                "StarRating": "3",
                "Text": null
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Different-Universe-Reinventing-Physics-Bottom/product-reviews/0465038298/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "50"
    },
    "Salesrank": "#345,860",
    "Timestamp": "2015-05-24 13:25:00.047874",
    "itemurl": "http://www.amazon.com/Different-Universe-Reinventing-Physics-Bottom/dp/0465038298"
}
