{
    "Category": "in Books (",
    "ListPrice": "$14.99",
    "Name": [
        "APlusPhysics: Your Guide to Regents Physics Essentials"
    ],
    "OfferPrice": "$13.83",
    "Reviews": {
        "AverageStarRating": "4.9 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XJH0VVYWXOQ2"
                },
                "Date": "on May 5, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2T0CFTT19I1AI"
                },
                "Date": "on March 29, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I am a college student struggling with my first year physics course.  The required text for my school is very difficult to follow and written to a higher level of understanding than you would expect to find in a survey course. There is only one student in my class that can easily follow our textbook.  While studying for a test, I went online to look for videos to help me.  I came across Dan Fullerton's videos and book.  His book covers the exact same material that I am studying, yet it is easier to follow and understand.  There are plenty of exercises to help reinforce the material.  I highly recommend this book to anyone who is having a hard time with entry level college physics. Quite frankly, I wish my school would adopt his book as our official text.  More students would be successful using his material.  If you are struggling with a physics course, I strongly encourage you to buy this book.  It is not expensive (especially compared to college textbook prices) and is worth its weight in gold!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AK4955PZOY9RV"
                },
                "Date": "on May 6, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book is a fun and exciting way to help students review and prepare for the essentials of physics.  The illustrations and information is captivating and motivating.  I found myself learning more about physics than I had known before and to be able to see that I was on target was outstanding. I have a large family and it is something I would encourage my children to use as a resource and educational guide."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XKKS18AOA7MW"
                },
                "Date": "on May 4, 2011",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7IHF4RPFUZLK"
                },
                "Date": "on May 4, 2011",
                "Helpfulness": 0.7777777777777778,
                "StarRating": "5",
                "Text": "This book offers a unique approach to studying and preparing for the New York State Regents Physics Exam. Online supplements, including animations, Podcasts, quizzes, and discussion forums are useful review tools that offer students immediate information and feedback. Questions are integrated into the text of the book that offer step-by-step instruction that allow students to practice concepts immediately following reading about them. Content is clear and concise and specific to the curriculum. Overall an excellent resource for any Regents physics class."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BVTYDNWFLNXD"
                },
                "Date": "on March 29, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "The combination of Dan's Regents Physics Essentials and APlusPhysics.com videos have work as a great resource for students who were struggling to translate their understanding of physics concepts into success on Regent's style test questions. This book has worked as a guide to help my students understand what they really need to know to be successful on the Regents exam and on tests.  I have given this book to a few students and watched their test scores improve. Great Resource!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3H4VA22WQEOIF"
                },
                "Date": "on November 13, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "There's no reason to think the study of physics is \"over your head\". We love to just browse through this book and tell each other \"fun facts\" as a family. It's also a very useful guide for students...of all ages."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AITXZ1QOILJ5Z"
                },
                "Date": "on January 23, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "A good guide book for review.  Has lots of questions and well thought out answers.  It tells you what you need to do and how you need to answer to get all the points for each question."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGPNQAWKKCPRC"
                },
                "Date": "on December 7, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "One of the most difficult things in the world is to make the complex simple and understandable. Dan Fullerton has done this extremely well. If I can understand physics, anybody can."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1237SQAAVK3A0"
                },
                "Date": "on November 13, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Good supplement to classroom lectures and (mostly) clearer than textbook. Includes practice questions with answers to help you understand. Definitely worth getting."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21NESRBY8O4UQ"
                },
                "Date": "on March 13, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Love it, makes everthing about physics clearer than the actual book I had to buy for the class.  I suggest buying it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACUMD6C5I5C7H"
                },
                "Date": "on May 4, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "A complete and concise review book for the NYS Regents Physics exam! This book outlines exactly what students need to know to do well on the exam, and includes many sample regents questions for students to practice with. I would recommend this book to any student who needs extra practice or would like a complete overview of all the topics likely to show up on the regents exam. Mr. Fullerton has done a great job explaining the basics of physics in a way that students can easily understand and he uses many helpful scenarios to illustrate his points. This book was well worth the money I spent on it!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARZGII5VV0KWF"
                },
                "Date": "on December 22, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Great product"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A131648W3BGI11"
                },
                "Date": "on June 28, 2011",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A131648W3BGI11"
                },
                "Date": "on June 28, 2011",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": null
            }
        ],
        "ReviewUrl": "http://www.amazon.com/APlusPhysics-Guide-Regents-Physics-Essentials/product-reviews/0983563306/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "15"
    },
    "Salesrank": "#622,715",
    "Timestamp": "2015-05-24 12:34:01.766771",
    "itemurl": "http://www.amazon.com/APlusPhysics-Guide-Regents-Physics-Essentials/dp/0983563306"
}
