{
    "Category": "in Books (",
    "ListPrice": "$24.95",
    "Name": [
        "Teaching Physics With Toys: Hands-on Investigations for Grades 3-9, Easyguide"
    ],
    "OfferPrice": "$23.74",
    "Reviews": {
        "AverageStarRating": "4.0 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3K85BEIH94L2B"
                },
                "Date": "on November 7, 2013",
                "Helpfulness": 1.0,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOUCJRIGWJZFG"
                },
                "Date": "on May 17, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Great for any science teacher! The author has done all the work for you. The enclosed cd rom has all the student work pages for you to reproduce."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABB0I2OX8TPK4"
                },
                "Date": "on March 13, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I have been enjoying this book greatly and look forward to making sure it stays available to my homeschool group.  I think it could easily be used at home by parents who want to increase their knowledge right along side their children.  If you're at a loss on how to keep your kids busy during the summer, this is a great way to spend quality time with the family maybe include the neighborhood kids, without spending big bucks.  There are also resources on line to help.  I love that it gives the expected time and because of past experience doing these kinds of things it seems pretty close.  The only thing that might influence the time might be the ability and needs of the students which is always a factor in any class.  I am looking forward to checking out the other series in this collection of science fun!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14OJS0VWMOSWO"
                },
                "Date": "on June 10, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Children are learning to understand physics from the day that they are born - from the first time they see something fall to the ground. \"Teaching Physics with Toys: Hands-On Investigations for Grades 3-9\" is a guide for parents to find just which toys can give their children an edge in understanding this science and the universe around them. With over twenty investigations for many toys, and enhanced with an accompanying CD-ROM for helping teaching your children lessons about their toys, \"Teaching Physics with Toys: Hands-On Investigations for Grades 3-9\" is highly recommended for school and community library collections catering to physics, and ideal for any home schooling parent who wants to give their kid an edge in understanding."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2N4GMNDTT03JO"
                },
                "Date": "on October 21, 2011",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "The book has very good ideas for experiments and good background information for teachers.  I did not received a CD-ROM with my order.  I was able to download the student pages from the terrific science website but I cannot find the K'NEX Parts Inventory or assembly info which is a real drawback.  Be sure to try the experiments yourself before you do them with the class... not all of them have worked very well."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FMAK8UREG0H5"
                },
                "Date": "on January 22, 2012",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "Described as being accompanied by a CD-rom of the lessons, this edition was not.  I wrote to amazon.com to ask about it, but did not receive a reply.  Aside from that, it looks good for the intended purpose.  I'll base an elective course for 7th and 8th graders on this set of lessons.  They are low challenge for this age group, but the lessons can easily be extended."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Teaching-Physics-Toys-Hands--Investigations/product-reviews/1883822408/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "6"
    },
    "Salesrank": "#1,005,023",
    "Timestamp": "2015-05-24 12:44:25.478409",
    "itemurl": "http://www.amazon.com/Teaching-Physics-Toys-Hands--Investigations/dp/1883822408"
}
