{
    "Category": "in Books (",
    "ListPrice": "",
    "Name": [
        "Special Relativity (The M.I.T. Introductory Physics Series)"
    ],
    "OfferPrice": "$34.38",
    "Reviews": {
        "AverageStarRating": "4.6 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D4Z9QQ6F06QI"
                },
                "Date": "on August 22, 2003",
                "Helpfulness": 0.9736842105263158,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3A5G15FQO0F8H"
                },
                "Date": "on April 30, 2006",
                "Helpfulness": 0.9705882352941176,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZKTRGIRSED0A"
                },
                "Date": "on July 16, 2002",
                "Helpfulness": 0.9696969696969697,
                "StarRating": "5",
                "Text": "This book was extremely helpful when I was taking a class on special relativity.  The author introduces new concepts and rules in a very logical order, and the examples clearly illustrate the material.  The book is written very clearly, especially for such a complicated subject.  The problems in the back of every chapter allow you to test yourself and make sure you have grasped the material, since some of them have answers in the back of the book.  Overall, a great book to either teach special relativity to yourself, or as a companion for a special relativity class."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39D3MOCFPEG7W"
                },
                "Date": "on January 25, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16GAIJJE39T1S"
                },
                "Date": "on June 11, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A233X04MSJ8K38"
                },
                "Date": "on June 3, 2006",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "5",
                "Text": "I purchased this classic work at MIT, circa 1972, and have referenced it too times to remember.  When I bought it, the book was part of the M.I.T. INTRODUCTORY PHYSICS SERIES.  It contains about everything one could wish for on the subject matter.  The derived transformations for acceleration and force (i.e. of d(mv)/dt) have been especially useful, and are not often included in other books.  It is truly a gem, created by a world class physics instructor at the top of his game.  G.R.Dixon."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFP6UTFWK0P85"
                },
                "Date": "on July 25, 2012",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1T73IOFNJ67WF"
                },
                "Date": "on April 4, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is a wonderful book, I really enjoyed it and I recommend all of A.P French's books. Very clear writing, no confusion, it's a joy to read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30COZEQST0K0K"
                },
                "Date": "on August 20, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I have read several treatments on Special Relativity and like this one as it goes well beyond both the simplistic explanations of time dilation/Lorentz contraction (which can be misleading), and the dry derivation of Lorentz transformations, energy-mass equivalence, etc.  There is a good deal of time spent in describing experiments and empirical results both in support of the predictions of the theory and as a backdrop to the history leading up to and succeeding its publication.  The book covers numerous adjacent topics such as relativistic Doppler effect and particle dynamics and looks back and forth between the various implications of the theory together with the standard analytical framework to build a more complete understanding than I've seen in other books.  It is not the fastest exposure to the concepts or primer of the relevant mathematics, but should build a more complete understanding for those willing to take the time."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AY6RTYRSDLOTV"
                },
                "Date": "on October 30, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I think this is an excellent book to introduce special relativity. For a lot of books, if I could finish reading half of the book, I consider the book excellent. This is one of the books I actually finished reading the entire book. As a matter of fact, the last chapter is the most interesting. It really brings electrical field and magnetic field together, and this is the very purpose of me looking into special relativity. If the book could extend a bit more in four-vectors, that would be great. Nonetheless, this is still an excellent book. This makes me wonder if I should buy other books by French."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A118GOQ15P7XT0"
                },
                "Date": "on May 14, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "great book for SR"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JQ8SGP2F5EAH"
                },
                "Date": "on September 30, 2010",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "This book is exactly what you think.  It's a textbook about special relativity written in 1968 - fortunately exactly nothing of value has changed in the field since then (inb4 angsty relativity specialists disagreeing with me - the math is the math is the math).  I highly doubt anyone is buying this for any reason other than for a physics class, but on the off chance that someone is, here's some actual thoughts:  it seems to be relatively well written and straightforward (if you can ever say relativity is straightforward).  A bit dry, but it is a textbook.  My copy is more than a bit faded since, well, it's from 1968, but it's still in good enough shape.  I guess I would recommend it if you want to read a special relativity textbook for fun?"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1C3RTV39RIHND"
                },
                "Date": "on November 20, 1998",
                "Helpfulness": 0.5416666666666666,
                "StarRating": "5",
                "Text": "The beauty of this book is the simplicity of the math used and the excellent use of language to communicate the ideas. One of the clearest written science books I've ever read. The book is out of print, but I  inherited a copy from my Dad who was a Physics teacher."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37ISC7Y56VPWG"
                },
                "Date": "on December 12, 2008",
                "Helpfulness": 0.25,
                "StarRating": "3",
                "Text": "not for self study. a very good book for those who already have a grasp of relativity and wish to further their abilities. luckily, it has most of the answers in the back so you can use it to learn relativity for the first time if you so choose."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FPPGSVR8JBM3"
                },
                "Date": "on July 25, 2006",
                "Helpfulness": 0.25,
                "StarRating": "5",
                "Text": "This book was in good condition, and is very easy to follow.  Recommended for anyone wanting to learn university level modern physics but not wanting to go cross-eyed or get lost!"
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Special-Relativity-M-I-T-Introductory-Physics/product-reviews/0393097935/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "15"
    },
    "Salesrank": "#148,258",
    "Timestamp": "2015-05-24 13:07:00.466942",
    "itemurl": "http://www.amazon.com/Special-Relativity-M-I-T-Introductory-Physics/dp/0393097935"
}
