{
    "Category": "in Books (",
    "ListPrice": "$15.95",
    "Name": [
        "Beyond Einstein: The Cosmic Quest for the Theory of the Universe"
    ],
    "OfferPrice": "$13.59",
    "Reviews": {
        "AverageStarRating": "3.8 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10NCCBBZZ1S85"
                },
                "Date": "on November 5, 1999",
                "Helpfulness": 0.9565217391304348,
                "StarRating": "5",
                "Text": "If you have even the slightest interest in theoretical physics, astronomy, or cosmology, READ THIS BOOK.  Michio Kaku continues with \"Beyond Einstein\" in the proud tradition of its predecessor,  \"Hyperspace;\" I read it as a sophomore in high school and  couldn't put it down, and \"Beyond Einstein\" was no different.  No  prior knowledge of physics or mathematics is assumed; all you need is  curiosity about how the world around you works.  It is well-written and  easy to understand, with just enough history to set the reader up for the  science.  This book will absolutely DAZZLE YOU!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AO6OFEFDBZG3R"
                },
                "Date": "on February 7, 2006",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "This isn't Kaku's best book-its one of his earlier efforts and his writing skills have gotten quite a bit better since then. However I still recommend this book. At the time I read it, I was studying electrical engineering in college and one day I ran into a friend in the student union. He started talking about all this physics stuff he was reading and how it was blowing his mind. It was like he had been through a religious conversion. He promised to let me borrow the book and it was Kaku's Beyond Einstein. A very easy read, Kaku got me hooked on physics right away, exposing me to ideas like extra dimensions and grand unified theories of particle physics I had never heard of in my engineering studies. He follows the standard historical treatment, talking about Maxwell, Einstein and the development of quantum mechanics. While it is a bit \"breezy\", its thoroughly enjoyable reading filled with historical antecdotes and nice descriptions of Einsteins spacetime warps. Then after the big bang he heads into his favorite topic, talking about extra dimensions and string theory. I was so hooked by this I began buying up every pop physics book I could find and soon changed my major from electrical engineering to math/physics. After reading Kaku engineering actually seemed mundane. Anyway, like I said this isn't Kaku's best book because his writing style has matured and he writes a lot better now. But the book is a gem that I recommend to those interested in science."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24GD1AWG77IDJ"
                },
                "Date": "on December 29, 2000",
                "Helpfulness": 0.8108108108108109,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4JFU5SW7BY9Z"
                },
                "Date": "on March 9, 1999",
                "Helpfulness": 0.9090909090909091,
                "StarRating": "5",
                "Text": "Although not as well written as, 'Hyperspace,' Michio Kaku has put complicated aspects and terms of cosmology and quests for unified field theories into a simple, easy to follow book by using many similies and  metaphores.  The book totally avoided explaining the concept of superstring  theory, but instead it gave a lot of information that lead up to it.  Nevertheless,  I thoroughly enjoyed reading Dr. Kaku's new book because it  gave lots of information about different theories that lead to superstring  theory, such as: special relativity, general relativity, Maxwells theories,  Newtons theories etc.  The book also grasped the concept of understanding  the beginning of the universe before and after the big bang, although not  going into it in much scientifical detail.  However, the big bang is  totally theoretical and hard, infact impossible to explain omnisciently.  The book has some diagrams; resultingly, making the comprehension of some  ideas much easier.  Dr. Kaku is indeed capable of better work, (not that  this isn't good) he is by far one of the best autors of the understanding  of space, in my opinion the only better autor is Steven Hawking himself.  Dr. Kaku is an inspirational role model to me and I hope others agree. His  books can be read by anyone from elementary school students to top  physicicists, due to the simplification of the terms of thought.  The only  people that I don't recomend this book to are the people totally interested  in the science and detailed decriptions of superstring theory.  Otherwise a  Must to read!!!!!!!!!!!!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2988B52PKKNHL"
                },
                "Date": "on July 28, 2006",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SM20OB2USA2B"
                },
                "Date": "on October 13, 1999",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "As an engineer I like to keep up with things, plus I've always enjoyed Physics.  This book easliy brings you up to date with modern Physics, and has many interesting stories about many of the great men and women in  Science.  It doesn't grind you through lengthy equations and it doesn't  cost $50.  Highly recommended."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3V40B7OW7V5NU"
                },
                "Date": "on August 30, 1998",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A267XR412O2336"
                },
                "Date": "on April 16, 2000",
                "Helpfulness": 0.875,
                "StarRating": "5",
                "Text": "Beyond Einstein is Michio Kaku's second best book compared to Hyperspace. In this book he mainly writes a hypothesis on: The Superstring, Hyperspace, kaluza-Klein,and GUT. He gives parables to help you comprehend his ideas  and better understand this book. Beyond Einstein is an excellent book that  will leave you thinking about the physical attributes of modern Theoretical  Physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QP2FNF1JA5QS"
                },
                "Date": "on December 17, 2002",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KJO5VP4K3CHU"
                },
                "Date": "on December 11, 2007",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AP2RYT0L9ZZM"
                },
                "Date": "on April 18, 2006",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "This fascinating book will take you through the realm of cosmology, physics, and the world of mathematics.  However, the book at times can be hard to understand because it uses very hard language and refers to several theories and scientist.  It is necessary to have small background knowledge in physics and in many of the scientists and theories the book mentions.  It mentions scientist such as Einstein, Heisenberg, Bohr, Hawkins, Newton, Maxwell, Feynman, Glashow, Nambu, and many more.  The book mainly talks about the Theory of Relativity and Quantum Mechanics; however, it does mention several other theories too.  It talks about Quantum Mechanics and Einstein's theories in detail; therefore, those theories are easy to follow.  Nevertheless, once the book starts talking about all the theories that came in response to Quantum Mechanics and the Grand Unifying Theory the book becomes hard to follow.  This book tells the history of how several theories have evolved and are being developed to create one theory that unites the four fundamental forces of the world.  The four fundamental forces are electromagnetism, gravity, weak nuclear force, and strong nuclear force.  All these forces are very different, however, with the Superstring Theory; all these forces will be unified.  I recommend this book because it will change you perception of the universe all everything that is around us.  It will baffle your mind with new ideas that seem to be science fiction, yet are somewhat true.  This book is also a great book to learn the basis of the theory of Relativity, Quantum Mechanics and many more astonishing theories that have shaped the way we view space, time, and the world."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXSH6O4OP5L4M"
                },
                "Date": "on December 27, 2000",
                "Helpfulness": 0.7692307692307693,
                "StarRating": "4",
                "Text": "While I take a profound, almost religious, satisfaction in physics, especially the more exotic concepts of relativity and quantum theory, I have not the math-physics type of mind that my friend Steve Smith has--lucky fellow.  I found this book readable enough, though, because it doesn't belabor the math side of physics, nor is it one long list of arcane physics formulae. It is still a little more advanced in places than I was fully able to appreciate, but I do enjoy the mental exercise that this kind of a challenge provides.  I had heard of the Superstring theory when it first arose, but I did not take the time then to find out much about it.  It took Steve's intervention to bring it again to my attention, and this book seemed a good place to start.  As a person with an interest in history, especially the history of science, I found the background data on the individual physicists responsible for the various components of the Big Bang Theory and of the Superstring theory of especial interest.  It certainly made the acheivements of these people more human to me and therefore more wonderful.  It also helped me put together, at least at my rudimentary level of understanding, the thought processes that went into making each advance, much as the works of Australian physicist Paul Davis' books do.  Both have a facility for taking the average person through the processes in constructing and testing a theory of the universe.  With each step forward presented by the author, the theory made a little more sense.  I thoroughly enjoyed the learning expereince and plan on reading some of the other books by the same author."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12A08OL0TZY0W"
                },
                "Date": "on September 6, 2002",
                "Helpfulness": 0.8,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1S8P2BTDZDMB8"
                },
                "Date": "on October 11, 2001",
                "Helpfulness": 0.75,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 27, 2002",
                "Helpfulness": 0.75,
                "StarRating": "2",
                "Text": "I have read a number of books at this point on grand unification and theory of everything.  This book in particular deals with superstrings as a means by which to unify the physical forces.  From a personal standpoint I do not like superstring theory as the answer to grand cosmological problems.  The readability is also poor and the writing is disjointed.  Last, I prefer the works of Martin Rees and Kip Thorne to Kaku.  Again this book is very disjointed and does not even present superstrings all that well.  Spend your money elsewhere, on the afformentioned authors, or check out some Feynman books if it is unified force type of stuff."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11ZVOICEMNK7V"
                },
                "Date": "on May 8, 2009",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "As a previous reader of Michio Kaku's work, I admit to coming in with quite high expectations. Mr. Kaku and his co-author, in this work, do not settle on a thesis or an overarching theme to the book and it suffers from a lack of direction. Often the book is fascinating in it's discussion, but the descriptions of physics processes is often weak and hard to connect and the use of much too many acronyms slows the reading by forcing the reader to check back much too often. My joy in reading this book was certainly dampened by the fact that I read it in too many sittings. Mr. Kaku's work, when read at it's optimum, is read in as few sittings as possible. If you have an afternoon to devote to this book you will wean a great deal of knowledge - and I certainly recommend it as an introduction to a study of the history of the search for deeper knowledge in particle physics. If you are, as I am, an avid reader and fan of all types of work on theoretical and particle physics, you may find this book too bogged down and somewhat lifeless."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AN4GLK1AFGZD3"
                },
                "Date": "on October 25, 2014",
                "Helpfulness": 1.0,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALI7JVPJJ5RYG"
                },
                "Date": "on December 14, 2009",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "Beyond Einstein comes short of delivering you to the realm beyond. It only gestures at the surface of the underpinning mathematics and physics, which isn't nearly enough to get your feet wet and leaves you wanting for more. While analogies are important for a lay reader to form appreciations, many of the analogies are vague and confusing to the untrained minds. I love reading popular science books, but I don't love this one as much as I could have."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AI9EIHVBHFPC"
                },
                "Date": "on February 17, 2010",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADTRPBYXKK8BE"
                },
                "Date": "on July 16, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A199V9Y5ER1L5P"
                },
                "Date": "on November 30, 2007",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2X2X32A6H5ESQ"
                },
                "Date": "on March 19, 2000",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "5",
                "Text": "I bought this book looking for an introduction to the superstring theory and got a heck of a lot more than that!  I was surprised to learn more about the rest of physics than I did about superstrings!  The book does not  throw a bunch of meaningless equations at us that the layperson has no  chance of understanding.  Instead, we are given a breif, concise history of  atomic physics and shown how string theory fits into that as a logical next  step.  While I was a little dissappointed that there wasn't more  information on superstrings, I found this to be an excellent read and a  very quotable book.  The chapter about the higher six dimensions will blow  your mind!  Try it sometime!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9VX4O2Q0P4D6"
                },
                "Date": "on May 4, 2009",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "If you are bored, this will be a fun read. I had no problem reading this book from the first half toward the middle, then it got extremely technical. I had to skip one chapter in the middle and proceed ahead to the rest of the book. Compared to other books on this topic, the content of this book is about average. The authors aimed more toward entertaining you rather than teaching you, which is fine. My favorite quote from this book: \"You don't understand mathematics, you just get used to them\", as said by John von Neumann."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15BK82FNEPT98"
                },
                "Date": "on July 16, 2012",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "While I think Kaku is an excellent author, this was not one of his best works. It was a little dry, and he jumped from topic to topic too quickly. Some sections were very interesting and theories well described, but at other times he briefly mentions a theory and then moves on to discuss it further without giving the non-scientist reader a quick explanation of what he's even talking about. It's rather hit-or-miss."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVZ3F1DP7GIVL"
                },
                "Date": "on July 15, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Mr. Kaku is as interesting in his books as he is on film.  Very well written,  Incredible that a professor as gifted as Kaku is so erudite in print and appearance.  10 stars for all his writings!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 24, 1999",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "This book was extrememly well written, I am 15 years old and understood everything clearly. A must for anyone interested in physics and to what regions physics is heading into the future."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KC4SZ9D43N1H"
                },
                "Date": "on February 16, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "In this time of profound darkness when the pseudo science sets back in the health of this nation with the measles epidemies pounding once a country leader in one more than one thing and also when  the darkest ideas order people to kill their brethren,  this book is a serious alternative for all the challenges of our modern world (MODERN!!!???? we are back into the 6 th century!!) gets us relaxed, makes us think that it was not religion but science and the industrial revolution who allows us all to destroy slavery....and promotes better conditions of life all over the planet for even people who would have not raised ever up to the industrail revolution,  if only for their stuck mentalities unable to think out of the square box, but not for lack of intelligence, but yes for excessive obedience to ignorance  Yes, I have a big hope and this comes through this type of Scientists with a good based moral in old principles as well."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NUW85WUAPF6J"
                },
                "Date": "on February 5, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "My husband loves science, and has loved all of the Michio Kaku books I have given to him as gifts."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PHPLLLZBDNK8"
                },
                "Date": "on August 6, 2001",
                "Helpfulness": 0.6470588235294118,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6U9U61OEQG75"
                },
                "Date": "on December 19, 2010",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Machio Kaku's shows on the science channel are must see for anyone interested in our universe. 'Beyond Einstein' continues his (pretty) easy to understand presentation of superstring theory, and related topics. It takes a while to read the couple hundred pages, but the book is one you read two or three times to get the most out of it. Some simple explanations, such as why nights are dark, add to the layman's knowledge of 'ordinary' events. A great book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3V33BZ3PRUJA"
                },
                "Date": "on September 10, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This author is great.  I love his books. It's science for dummies but he has really educated me in a pleasing and interesting way.  I look forward to his being on Coast to Coast Am with George Nory.  I learn so much.  People take my books so I have to rebuy them.  I  like to review them from time to time and I underline words and phrases I want to remember."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A246YJPJAXV3RB"
                },
                "Date": "on April 25, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3C3P1H56NROV0"
                },
                "Date": "on August 31, 2000",
                "Helpfulness": 0.625,
                "StarRating": "5",
                "Text": "I absolutely loved this book.  I had read a short article on string theory that a friend recommended to me and I was hooked.  I bought this book on  Amazon.com and read it as soon as it arrived.  It starts out with a lengthy  history of how the evolution of string theory starting from way back with  Newtonian physics, through Einsteinian physics, quantum physics and  finally, arriving at String theory.  The majority of the book is taken up  by this history, but it's an important part of understanding string theory  and how these theories evolve.  Very enlightening and educational and  presented in a manner that anyone can understand."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QKX0VV7QWSRZ"
                },
                "Date": "on December 23, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Another brilliant book by Michio Kaku!  I love his works. He's one of the best educators in his field as he has the ability to easily explain his concepts."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GA8YZS91M0QM"
                },
                "Date": "on April 28, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book is for everyone who has interest in physics  you don't have t a physicist to enjoy this book, it really captivates you."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1F7T7I94P3R6Q"
                },
                "Date": "on January 2, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is a typical Kaku read, ergo fascinating, well explained and easily digestible. Makes the future an exciting prospect ."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KRFDY1RCR7JL"
                },
                "Date": "on December 29, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Superb review and explanation of complex subject(s) accessible to non-scientists."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1171UHSW2GJYA"
                },
                "Date": "on September 21, 2010",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "This book is great. its full of mind numbing theories and ideas that will confuse you for a while. if your interested in Physics, or have watched \"The Universe\" tv show, this is the book for you."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 28, 1997",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": "One of the better layman's books on the subject, but did not explain string theory, as it seemed to lead up to.  (I know, \"Beyond Einstein II\"...) This seems the common approach in this tight genre.  Some explanations were dead-on, while others missed the mark.  All these books seem to lack the will to judge the merits of the Copenhagen Canon, which today seems as \"untenable\" as Einstein's \"localism\".  I could not help challenging several key assumptions leading to the \"inevitable\" conclusions in mainstream theory, assumptions which were stated almost as facts in my own college quantum courses.  It is true; those working on the theories are so caught up in the math, they are not equipped to think visually, as did Einstein.  Now that we've gone beyond dear Albert, isn't it time we go back and pay him a visit?"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CVSSG9MR80RO"
                },
                "Date": "on February 4, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great item, thanks A+++ \":)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A254TGDBB6Y81I"
                },
                "Date": "on November 18, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great reading by Dr. Kaku."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on September 13, 1997",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": "after hearing how strong a book 'hyperspace'was,i decided to take a look at Kaku's new book...to my dissapointment,the book was more like a schoolboy's essay on the subject,lacking any depth or analysis (which i didnt find strange..knowing that the co-author has written about 4 COOK books!!) so if you just wanna know the history of superstrings and previous theories..then buy that book,if you are serious about getting to the grips with the subject,Avoid it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17LB0HBCXIWJI"
                },
                "Date": "on February 2, 2009",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VKF0E152GX65"
                },
                "Date": "on May 31, 2000",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": "Lots of review for the educated, but well put together and very readable. Recommended for all levels."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LSPCE7SMFUT6"
                },
                "Date": "on January 13, 2011",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "in better condition than expected, took a while to get to me but when I querried the vendor, we firured out the delay was at the USPostal Service"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on May 7, 2001",
                "Helpfulness": 0.4,
                "StarRating": "5",
                "Text": "This was my first venture into quantum theory and superstring theory, and I would reccomend the same course for anyone else who wishes to learn more about this subject but is intimidated by the advanced mathematical knowledge required to comprehend most other texts on the subject.  Kaku has broken the complexities of the theories down into simple, easily grasped concepts so that most anyone could understand them, but one does not get the feeling that the text has been \"dumbed down for the illiterate masses\".  Many concepts are explored both through diagrams and words which aids all types of learners in getting the full benefit of the piece.  All in all this book struck me as an excellent introduction and/or refresher for those interested in the subject matter and even for those who are unsure about it all.  It is by no means a light read due to the intriguing examples and theories presented to the reader, but it is most definitely an enjoyable experience."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A250XU4W3L5QYM"
                },
                "Date": "on December 25, 2014",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": "My order was not as pictured."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11ALL8YWS8BBR"
                },
                "Date": "on August 23, 1998",
                "Helpfulness": 0.4,
                "StarRating": "3",
                "Text": "Beyond Einstein had some of the greatest explanations for particle physics  and string theory, sadly, it also had some pretty bad explanations as well.  It does however have some great history and quotes from different  physicists, sadly, the history went on and on and on."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 21, 2000",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": "I read this book before having any knowledge on high-energy physics.  I don't remember too much about this book, but Kaku has a habit not not really giving the right explanation, and making bad analogies."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SGR7LE899LGG"
                },
                "Date": "on January 14, 2004",
                "Helpfulness": 0.25,
                "StarRating": "4",
                "Text": "This book reads well and it is easy to grasp, however there is little focusing on the various subjects especially string theory in general. Overall for the beginner and casual reader this is a good book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2R511F66OX4Z"
                },
                "Date": "on November 3, 2011",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": "when I ordered the book, the condition shows \"NEW\", but when I received the book, it's an old book - pages are yellowed by age and there are marks on some pages. Disappointed when receiving it although the book itself is a really good book (meaning book contents)."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 11, 2000",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "I did not like the opinion expressed by the Author on Einstein's disbelief in Quantum Mechanics. I think this is false. Nevertheless this book is highly recommended for those who would like a macro understanding of  Superstring Theory."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33GR5KLN0ZR5E"
                },
                "Date": "on January 2, 2002",
                "Helpfulness": 0.3870967741935484,
                "StarRating": "1",
                "Text": "Numerous occasions of poor writing and some wrong statements of fact combine to disappoint me. Some of the more egregious examples are these. On page 37 we read \"astronomically small\", which is an oxymoron. On page 68 we read \"billions of chemical compounds that were known to exist.\" There are only about 20 million known at this time. On page 82 we read \"...literally picking one's self up by one's bootstraps...\" The bootstrap business is a figure of speech, not a literal statement of fact. (It is also a cliché). On page 136 we read \"The vice-like grip of the black hole's gravitational field is so great that nuclei are ripped apart...\" I believe it is the high temperature, not the pressure, that dissociates the nucleons. On page 185 the aliens are said to reply \"We understand what cobalt-60 is. We know which element has sixty protons in its nucleus.\" Cobalt still has only 27 protons. It's hard to trust a book that has such obvious mistakes."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Beyond-Einstein-Cosmic-Theory-Universe/product-reviews/0385477813/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "53"
    },
    "Salesrank": "#103,775",
    "Timestamp": "2015-05-24 13:19:56.730334",
    "itemurl": "http://www.amazon.com/Beyond-Einstein-Cosmic-Theory-Universe/dp/0385477813"
}
