{
    "Category": "in Books (",
    "ListPrice": "$14.95",
    "Name": [
        "Introduction to Crystallography (Dover Books on Chemistry)"
    ],
    "OfferPrice": "$13.73",
    "Reviews": {
        "AverageStarRating": "4.5 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FKYMZZC4GRK7"
                },
                "Date": "on March 19, 1999",
                "Helpfulness": 0.9761904761904762,
                "StarRating": "4",
                "Text": "This book is definitely a good starting point to learn Crystallography. As a matter of fact the title is in my opinion a little misleading since the book really introduces the reader to X-ray Crystallography... The book  starts with a concise yet elementary discussion of crystal lattices, point  groups and space groups. The chapters are nicely woven together so that the  reader easily develops a sense of continuity as the the concepts are  introduced. Principles of diffraction phenomena and determination of atomic  positions are very densely discussed. However the treatment is  \"crystal\" clear and no vital details  are ignored for the sake of  \"simplicity\". The overall treatment is very elementary and  requires an extremely modest amount of mathematical background. Fourier  series a briefly introduced in the discussion of electron density and  structure factors in an effective manner. The effect of glide planes and  screw axes on the structure factor (systematic absences) are elegantly  described in the examples. I wish D. Sands would have written an longer  book and have included more material in structure determination as well as  powder diffractometry itself (that's why the books is rated 4 stars only).  He certainly has the ability to effectively get the points across  throughout his book in a elegant fashion making the book easily readable.  The book is ideally suited for those who would like to make their first  steps into X-ray crystallography. In addition, the price is so right (as is  the case with all Dover Series) you can not go wrong. I highly recommend  it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38552L451XKFX"
                },
                "Date": "on October 17, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35G8CZBCA0LJ5"
                },
                "Date": "on March 14, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book is a must for beginners in the study of crystallography. It covers with worked out examples many of the themes, techniques, and approaches of structure determination, from a historical perspective and almost as a \"Cliff Notes\" version of the foundations, techniques and approaches within current crystallography. Easy to follow terms and descriptions. Lattice geometries, symmetries, fourier terms, intensities, structure factors and electron densities; it's all there. This works as my \"bible\" in addition to my actual Holy Bible. I can't say enough good things about this book. Lastly, it's supremely affordable. Buy it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AI9EIHVBHFPC"
                },
                "Date": "on January 26, 2011",
                "Helpfulness": 0.6,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39EVIB6TQ4A3Z"
                },
                "Date": "on April 2, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Want to know what space group are and what those mysterious symbols \"Pmm2\" are? This is the book you should start from."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25L8K15FRC36N"
                },
                "Date": "on April 2, 2012",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "I love Dover books because they are cheap and easy to read. It is a good place to start and will allow one to get a good general idea of the topic, follow this by reading a more current text or literature."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1953EDJ2ZA2KC"
                },
                "Date": "on May 8, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Written well"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FOBJ44JPM254"
                },
                "Date": "on October 14, 2011",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "4",
                "Text": "A very helpful book for studying the course of X-ray diffraction or solid state chemistry, whose content is clearly and easy to understand."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2X674TN3P7AVU"
                },
                "Date": "on November 8, 2010",
                "Helpfulness": 0.25,
                "StarRating": "5",
                "Text": "This is a classic and a must have for any Materials Science and Engineering student. For the price you can't get a text in the subject as good as this one. I strongly recommend supplementing this text with a undergrad structures class."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DYXX019985JG"
                },
                "Date": "on February 19, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "That's Good and new enough and it's deliverd ahead schedule.That's Good and new enough and it's deliverd ahead schedule. Good"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A126KX6FVI4T66"
                },
                "Date": "on August 27, 2007",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": null
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Introduction-Crystallography-Dover-Books-Chemistry/product-reviews/0486678393/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "11"
    },
    "Salesrank": "#140,191",
    "Timestamp": "2015-05-24 13:07:45.080950",
    "itemurl": "http://www.amazon.com/Introduction-Crystallography-Dover-Books-Chemistry/dp/0486678393"
}
