{
    "Category": "in Books (",
    "ListPrice": "$16.00",
    "Name": [
        "Hyperspace: A Scientific Odyssey Through Parallel Universes, Time Warps, and the 10th Dimension"
    ],
    "OfferPrice": "$14.40",
    "Reviews": {
        "AverageStarRating": "4.4 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OVSKQCT56NTT"
                },
                "Date": "on October 13, 2000",
                "Helpfulness": 0.9722222222222222,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A180Q8A4K4KVER"
                },
                "Date": "on January 1, 2001",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Though it is impossible to visualize higher dimensions and difficult for most of us to understand the equations involved in this technical field, Michio Kaku, who has become the \"Carl Sagan\" of our time, does an excellent job of helping lay readers comprehend hyperspace.  The concept of higher dimensions, which was formerly introduced in 1854 by Geog Riemann, was not taken seriously because it was an untestable theory and lost credibility upon the introduction of quantum theory in the early twentieth century.  Reinman believed that the forces of nature such as electricity, magnetism, and gravity were just effects caused by the crumpling or warping of hyperspace, an idea that Albert Eisntein revived in his theory of general relativity.  In this comprehensive and often humouous work, Kaku takes the reader from the fictional characters of Charles Hinton to Relativity and String theories; both of which have revived interest in higher dimensional reality.  If you thought, like me, that you could never come close to understanding the concepts of hyperspace, this book will surely bring you within reach of this understanding, while providing a sound background in the history and development of higher dimensions."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIYO6FQ94RZLJ"
                },
                "Date": "on August 7, 2000",
                "Helpfulness": 0.9090909090909091,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TG5TYEP2T9P2"
                },
                "Date": "on December 4, 2002",
                "Helpfulness": 0.9090909090909091,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZZ4HG7DJKECG"
                },
                "Date": "on February 18, 2001",
                "Helpfulness": 0.8863636363636364,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2STLT852H9K75"
                },
                "Date": "on May 22, 2001",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1H7Y5XKPGT0OS"
                },
                "Date": "on December 22, 2003",
                "Helpfulness": 0.8611111111111112,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PWWYGO14M3CL"
                },
                "Date": "on March 8, 2001",
                "Helpfulness": 0.8536585365853658,
                "StarRating": "5",
                "Text": "Though it is impossible to visualize higher dimensions and difficult for most of us to understand the equations involved in this technical field, Michio Kaku, who has become the \"Carl Sagan\" of our time, does an excellent job of helping lay readers comprehend hyperspace. The concept of higher dimensions, which was formerly introduced in 1854 by Geog Riemann, was not taken seriously because it was an untestable theory and lost credibility upon the introduction of quantum theory in the early twentieth century. Reinman believed that the forces of nature such as electricity, magnetism, and gravity were just effects caused by the crumpling or warping of hyperspace, an idea that Albert Eisntein revived in his theory of general relativity. In this comprehensive and often humouous work, Kaku takes the reader from the fictional characters of Charles Hinton to Relativity and String theories; both of which have revived interest in higher dimensional reality. If you thought, like me, that you could never come close to understanding the concepts of hyperspace, this book will surely bring you within reach of this understanding, while providing a sound background in the history and development of higher dimensions."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8ITIARDLHR9D"
                },
                "Date": "on June 23, 2001",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VP7JOT3K7PFM"
                },
                "Date": "on February 22, 2004",
                "Helpfulness": 0.9375,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QC2BOU3AL7L8"
                },
                "Date": "on January 16, 2003",
                "Helpfulness": 0.9375,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXSH6O4OP5L4M"
                },
                "Date": "on August 28, 2002",
                "Helpfulness": 0.9333333333333333,
                "StarRating": "4",
                "Text": "Hyperspace by Michio Kaku is a very lucidly written account of the multidimensional approach to a unified field theory, of the possibility of parallel universes, of superstring theory of particle physics, and of the future of intelligent life and the fate of the universe.  That's quite a feat in 334 pages, but he does a superb job of putting these complex concepts across for the non-math/physics types like myself.  I had some difficulty getting through his discussion of superstring theory, of which he is one of the primary architects, but the other aspects of the text were more comprehensible.  His style is very conversational, and he often calls upon his own experiences as a student, as a human being, and as a peer with others in the field to illustrate some aspects of his topics.  The illustrations, though few, are clear and helpful.  The bibliographical entries are a little old for a book written in 1994, many from the late 70s and early 80s.  I've read some of the entries in the past and enjoyed most of them. They will definitely give one a thorough background in the recent  history of physics and cosmology.  I've put several of them on my wish list for later purchase.  Notes to the chapters are full of additional historical and explanatory data of interest and are worth taking the time to read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WYLOSPS6L8TI"
                },
                "Date": "on January 7, 2006",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I'm not a science brain, just an average T.V. viewer who greatly enjoyed this book. I had no problem understanding the physics explained in this book.  After seeing the television series \"The Elegant Universe,\" I wanted to read more about it.  Kaku's book \"Hyperspace\" explains the theories of Einstein, 10 dimentional space, superstrings, etc.  I found the book very insightful and interesting.  I enjoyed every page. I would rate it with more stars if I could."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1U9DGWBPA0EES"
                },
                "Date": "on April 13, 2000",
                "Helpfulness": 0.8888888888888888,
                "StarRating": "4",
                "Text": "I first read this book when I was 11, and was fortunate enough to meet Dr. Kaku at a lecture shortly after finishing it. After recently rereading it as a college student, I feel I have a much deeper understanding of the  subject in general, and feel qualified to give a short review of this book.  Much of the critical acclaim received by this book is, indeed warranted,  for two main reasons: First, it provides an accessible route for the casual  scientist to explore theoretical physics, an area in which I believe many  books fall far short. Second, it reintroduces theories such as wormholes,  higher dimensions, and superstrings to the public, and in doing so, creates  more interest in the sciences. (e.g., more funding, etc..). This book will  be a disappointment, however, for the person already well aquatinted with  Hyperspace's subject matter. Bottom Line: A great primer for theoretical  physics, suitable for anyone interested in exploring this area, but the  seasoned reader/professional physicist will likely find this a very  elementary, albeit entertaining read. I really wish I could give it another  half star. Have fun! ;-}"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on December 14, 1999",
                "Helpfulness": 0.9285714285714286,
                "StarRating": "5",
                "Text": "This was a very well written book that keeps the reader interested even while covering very complex theories. What it lacked in technical depth, it more than made up for in broadness and ease of reading. You do not need a  Ph.D. in astrophysics to enjoy the book. It is easy to understand and  follow the concepts and theories."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZLUMSWANRYXL"
                },
                "Date": "on January 5, 2006",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8F2AZWB20X1H"
                },
                "Date": "on April 18, 2002",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4NSL2SHVJLKW"
                },
                "Date": "on November 20, 2006",
                "Helpfulness": 0.9230769230769231,
                "StarRating": "5",
                "Text": "I say great airplane book because I fly internationally a lot and this book is ALWAYS in my carry-on.  Even though I've read it probably 30 times through, I never skip chapters, it still is a great read each time.  I'm trying to do the \"physics by osmosis\" method of learning."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25PVRYJWY5270"
                },
                "Date": "on September 23, 2004",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20EZ74LZZP6X7"
                },
                "Date": "on January 27, 2000",
                "Helpfulness": 0.9166666666666666,
                "StarRating": "5",
                "Text": "I saw this guy at first on an MSNBC panel show call \"the futurists\" at about 5 am Jan 1, 2000. Although the show was short, my attention was engulfed in what he was saying, as he explained these things--type-n civilizations, hypercubes, and so on--with amazing carisma.  I absolutely love theoretical and hypothetical arguments with friends  (*cough* nerd :-) ) and always talked about these things. Needless to say i  grabbed the book and have started reading it straight through the nights!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SRZQU1SZG4RR"
                },
                "Date": "on February 4, 2005",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKXCAAM43BEXR"
                },
                "Date": "on May 15, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Michio Kaku has come up with one of the greatest semi-laymen's books about higher dimensional physics and cosmology since \"A Brief History of Time\". Taking up to an extent where Stephen Hawking left off, Kaku  builds on the idea first introduced in \"A Brief History of Time\"  and takes your understanding of Hyperspace and wormholes, etc . . . to a  whole other level. This is definately not a beginners book, unless you're  really intuitive about this kind of thing. It's better than some of Kip  Thorne's bulkier works. The best thing of all, is that Kaku makes you  understand everything he's talking about without using one single  fancy-schmancy mathmatical equation that you'd have no idea of ever  understanding. There are a few in the back for furthur referencing . . . I  think it's a metric tensor, but I'm not sure. Easily, one of the greatest  and most inspiring book s I've ever read. A must by for any library which  already has \"A Brief History of Time\" in it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WXOZF76Z7ULE"
                },
                "Date": "on June 2, 2000",
                "Helpfulness": 0.8260869565217391,
                "StarRating": "5",
                "Text": "This book was one of the most AMAZING books I have ever read. It expanded my consciousness to an explosion that created and/or activated a new way of thinking, dreaming, and changed my entire being. (bowing to Mr.Michio  Kaku), to have this effect on people.  With the super intense subject  manor, it's amazing how he put it in simple terms that the lay people can  comprehend. The examples, stories, and excerpts from other books were put  together very cleverly. I can not say enough about this book and it's  author. This book puts a new classification in the words \"theoretical  physics\". I had no idea that I and others would be effected in this  way. A total life change from just one book.  \"Hyperspace : A  Scientific Odyssey Through Parallel Universes, Time Warps, and the Tenth  Dimension\" is a must! Way more \"out there\" than most made up  si-fi. Who needs fiction with factual books like this.  VERY IMPRESSIVE!  I give this book 5 x 1000000000  hyper stars."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on November 9, 1999",
                "Helpfulness": 0.8666666666666667,
                "StarRating": "3",
                "Text": "Kaku is doing a service by writing in the format he did: I have recommended this book to many friends of mine who know nothing of physics.  But I would not recommend this to anyone who actually studies string theory  and higher dimensional subjects; this book exaggerated quite a few things  that shouldn't have been focused on, and it read more like a story-book  than a physics text.  In other words, it's great if you don't plan on  delving into the field very far, but if you're an aspiring student, I'd  much rather have you read Feynman's lectures."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TL9FGSMTSQXP"
                },
                "Date": "on January 4, 2004",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "When I bought this book, I expected to read a book that focused on cosmology, quantum theory, relativity, and the like.  What I found was a treasure trove of scientific history, facts, and knowledge.  Michio Kaku is a venerable walking encyclopedia of science!  I was thrilled with the immense diversity and breadth of scientific discussions and information presented in this book.  Kaku covers cosmology, quantum theory, superstring theory, relativity, mathematics, the extinction of the dinosaurs, wormholes and blackholes, time travel, numerous scientific and mathematical achievements and achievers, and a plethora of related (and, sometimes, seemingly unrelated) topics!  This book is written in terms even readers with a very basic, fundamental knowledge of math and science can understand.  It is not a difficult read; it is entertaining, informative, interesting, and lively.  I highly recommend this book for anyone who has even the remotest interest in any branch of mathematics or physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20L3QQCMG2ANH"
                },
                "Date": "on August 25, 2010",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OY4UAV1KAMR4"
                },
                "Date": "on December 21, 2004",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DCJ5Q657UK5K"
                },
                "Date": "on April 22, 2002",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NS51BT9SXF7R"
                },
                "Date": "on January 15, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I had been looking for such a book all my life, At times i found myself smiling because of the beauty of the information and how the author made it crystal clear,its a really wonderful book, enjoy the physics science with  this book. i even recommended my mother to buy it , but unfortunately she  said ,\"i cant read in english.\"."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NC5BMF6QWC5B"
                },
                "Date": "on April 2, 2006",
                "Helpfulness": 0.8181818181818182,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AD16LUH1FYEYK"
                },
                "Date": "on May 8, 2003",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25JXRK3OO2B0K"
                },
                "Date": "on July 27, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "By the time that I read this book, it was already five years in print. Nevertheless, I did not find it to be outdated or repetitive of more recent books that I have read. In fact, the book laid a better foundation for many  concepts that are handled only summarily in other books. The author traces  the progression of thought that led to superstring theory, covering many  difficult subjects, such as field theory, the standard model and  supergravity, in an understandable way. But mostly I appreciated his  attempts, through visual aids and analogies, to convey an understanding of  dimensions that are beyond our immediate physical experience. The author is  obviously an accomplished physicist and mathematician, but is able to  communicate in an interesting and simple style. This ability to convey the  essence of difficult subjects is what I consider to be genuine brilliance."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A88KEDKPCLGMD"
                },
                "Date": "on March 28, 2005",
                "Helpfulness": 0.875,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 12, 2003",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I picked up a copy of \"Hyperspace\" by Michio Kaku after seeing a show on techtv where Dr. Kaku describes String Theory. I read the book twice in 3 days! He uses language that is easy to understand and you really don't need to know anything about physics to love this book. I am now on a quest to read all I can about theoretical physics! Dr. Kaku did an excellent job!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A359U0JFFZ0Q04"
                },
                "Date": "on June 10, 2002",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3E0OGXUBADKFK"
                },
                "Date": "on October 21, 2001",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NI7I0IB29CL6"
                },
                "Date": "on July 24, 1998",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Z82XNTD381ZR"
                },
                "Date": "on October 15, 2001",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "5",
                "Text": "HYPERSPACE is an amazingly comprehensive account of modern theoretical physics for the non-scientist.  His description of higher dimensions recapitulates all of the mind games played in Rucker's book, \"The Fourth Dimension.\"  He goes over the structure of scientific revolutions and explores Einstein's hagiography.  Einstein's famous equations are explained.  Not only are they explained in their natural elegant context but it is explained how they are \"marble.\"  It was Einstein's dream to grasp the universe by the pure thought of mathematics, to turn the entire cosmos into \"marble\" with seemless equations.  Thus, 'God does not play dice.'  The world of the quantum is far from \"marble\" however with its \"wood\" of uncertainty and nonrenormalizable models.  The puzzle confronting scientists is how to mesh the wood in to the marble.  He explains how the wood and marble are very explanatory paradigms against the four forces governing the cosmos.  Gravity is beautifully accounted for by Einstein's relativity--which does nothing for the story of subatomic particles.  However, quantum theory's Standard Model takes over here and describes the nuclear forces and electromagnetism.  It is here that hyperspace, or supergravity, is revealed in its subsuming aspects.  With the ten dimensional universe, all of our familiar forces are unified.  I think one of the most awesome things I read was the \"Parable of the Gemstone.\"  He does not leave it off here, but moves on to other cosmology like wave functions, many worlds, and baby universes--then civilization and technology.  Highly recommended to keep you up with recent thinking."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30E1NNKCPPZPQ"
                },
                "Date": "on June 19, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AN9TLUKFAJHP8"
                },
                "Date": "on December 1, 1999",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BRIJNK0VVHU4"
                },
                "Date": "on May 13, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Wow, this book was just plain fun to read.  Better yet, it was not dumbed down in any way, yet it was completely understandable.  This world of cutting-edge physics is not just interesting, but also important.  It really makes one wonder what is possible if we can ever solve these last mysteries of physics.  I particularly thought he explained higher dimensions well.  It's a very difficult idea for us 3 dimensional beings to wrap our heads around, but he manages to give a thorough and convincing explaination.  You won't regret buying this book, you'll blow right through it and be telling all your friends about the crazy things you learned about hyperspace."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LVPPJELT3FCP"
                },
                "Date": "on October 24, 2001",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "When I read this Book I was amazed! I could not believe all the things that were mentioned in it. Literally the whole of the universe is discuused! Many aspects that you only hear about are discussed in great detail. This book is what got me started on the self-educating experience on our home the Universe. I will greatly advise any one who wants to jump onto the modern phisics band wagon to read this book in the first place, its a great modern physics 101 type of a book. I loved it! You'll love it too I can (almost) guarantee that!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IQIP1VD44B5L"
                },
                "Date": "on February 10, 2005",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I have conversed with Dr. Kaku a few times over the years.  He is like meeting the director of the Einstein's symphony.  I am no deep mathematician.  I am a physicist.  If you want to learn the real beauty of the concepts behind hyperspace, time warps, and quantum reality, then you need to read this book.  If you would like to see the other more transitory relationships from ancient civilizations and observers of the universe, you need to read The Ark of Millions of Years.  These two books will solve the riddle of all time for you."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PK0TG5C3KFQO"
                },
                "Date": "on May 6, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Hyperspace is incredible; no other book I have ever read has touched on so many interesting things. From how to visualize higher dimensional objects in our world to god and time travel and multiple universes, Hyperspace is  for anyone interested in modern science, physics, and philosophy. It does  leave you with questions, but they are good questions; they are either ones  that keep you thinking, or ones that leading research physicist are also  asking."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on November 15, 1999",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "By use of creative analogies, in-depth discriptions, and the occasional diagram, Michio Kaku has managed to make the world of hyperspace easy to understand and very interesting!  The book takes you on a journey through  time, explaining the evolution of modern hyperspace, and leading up to the  most recent discoveries.  I loved it and highly recomend it to anyone who  dares to question the unknown.  A+ material!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JTH9WIXC82QA"
                },
                "Date": "on March 2, 2005",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TYNI5HWQXZ7H"
                },
                "Date": "on June 5, 2003",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32ZD5YEY5W2FS"
                },
                "Date": "on May 4, 1999",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "This book was more like popular fiction, then true science. It had lots of fluff but not much substance. I would recommend this book only for those who are starting out in Physics. It read like a slow Science Fiction book.  The writing style was not bad, just overly redundant with no real lessons."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CSQA6TT0DFIR"
                },
                "Date": "on July 9, 2008",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "good book. explains details in a way that laymen can comprehend. i never took any physics- but i was capable of understaning dr. kakus book. he is well spoken and well versed in the modern beliefs of theoretical science."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TYNI5HWQXZ7H"
                },
                "Date": "on June 5, 2003",
                "Helpfulness": 0.8,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 19, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This a very interesting book.  But I think that the only people that could agree with that statement would be those that haven't read much about modern physics.  This is definetly a perfect book for a person just getting  into modern science and would be a great introduction to the material.  You  won't really learn as much as you would from a text book, but you will get  a good idea of what is happening in the theoretical physics community.  This is the trade-off you get for having an easy-to-read format.  There  have been some bad reviews about this book, mainly because it really  doesn't teach the reader much about the subject matter.  If you are really  wanting to learn in depth the ideas presented in this book, then I wouldn't  suggest reading it. If you are interested in the subject matter, but are  not interested in knowing exactly the principles behind the ideas  (mathematics), then this would be a great book.  It would also be a great  introduction book for anyone that is interested in learning the princinples  of modern theoretical physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AS6EPVW1IRRP5"
                },
                "Date": "on October 14, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Hyperspace is a lively, fascinating, and highly readable account of state-of-the-art theoretical physics as of 1995.  Arguably, the theories under discussion in this volume are outside the realm of science since they are at present, as they are likely to be into the far distant future, empirically unverifiable.  Even so, as Kaku argues, science may yet uncover indirect evidence of wormholes, dimensions 5-10, and strings.  Whether or not this proves true, one cannot help but be awed and delighted by the mere possibility that the universe -- fascinating already in its meager 4 dimensions -- is structured and functions in the ways MK describes.  To see the mathematics of higher dimensions so neatly subsuming the laws of physics as we know them (electromagnetism, relativity, etc.), one cannot help but imagine that a beautiful and simple unified theory might indeed lie just round the bend.  Hyperspace thrills with the excitement of that possibility.  It is a terrific read."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on August 14, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I have always been a fan of theoretical physics and this book brought  together all the reasons why I am such a fan.  The work that these  physicists are doing is so amazing everyone in the world should be told  about it.  There are moments while reading this book that are forever  etched in my mind because the revelations were so shattering to my  existence.  I can't stress enough the importance of the work deftly  explained within the pages of this book.  An absolute MUST read for anyone  who is interested in learning about the cutting edge of theoretical  physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWNYO50OFKPYB"
                },
                "Date": "on December 27, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GKIQT92QXRHY"
                },
                "Date": "on June 27, 2001",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book is absolutely fascinating. Michio Kaku writes about science in a way that a non-scientist can understand and stay awake while reading. Basically it explains the theories that may become the Unified theory that Einstien died trying to solve. Let's just say that if this theory is proven, reality turns out to be a lot more like a sci-fi movie than I ever expected. Michio Kaku also has a website with his articles that you can read for free, so look it up."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NNSSFYY8WCPJ"
                },
                "Date": "on August 2, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A199V9Y5ER1L5P"
                },
                "Date": "on November 21, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A394HBRX911M8X"
                },
                "Date": "on July 27, 2001",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": "Reading this after 'Visions', I'm most pleased. Hyperspace is a non-stop intellectual adventure through the fantastic ideas of Wormholes, Time Travel, Parallel universes, and Higher Dimensions, with lots of educational sidetracks along the way. Not just your everyday physics book though, Kaku doesn't simply preach ideas and formulas but adds interesting side notes, analogies to movies and literature, and how these ideas could affect the future in the most amazing ways, if you like science, science fiction, or thinking what the future may be like, I'd recommend this book for you."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A227CKIO54N9QW"
                },
                "Date": "on October 29, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This one book did change my life in a way perhaps no other scientific book did. The examples were very illuminating. I liked and shared the author's childhood experiences. The Flatlander/Spacelander example was great. This example has to go to your heart before you can understand the non-understandable!! The young ones should know this before they become fixed to some scientific dogma. A must-read book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASMND63SJRMZP"
                },
                "Date": "on June 4, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALF3APB3TGNZW"
                },
                "Date": "on December 17, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I'm a fan of science but never took \"real\" physics in college.  This book covers a lot of ground with regard to the history of physics over the past 200 years.  Along the way he does a great job of explaining the underlying concepts in a way that is understandable without being ponderous.  Readable quantum physics for the average person."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DQN99S51ND8D"
                },
                "Date": "on March 18, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "What a great piece of writing! Through the authors literary prose you are taken into the mind of a theoritical physist. The author explains what are clearly advanced topics so clearly that any lay person should be able to  understand. A great example of pure genius of our time. Hopefully this book  will inspire the next Einstein or Napier."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9YJ94OP2VOAK"
                },
                "Date": "on January 4, 2008",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": "The book is nicely organized and explains most of the popular theories till date in very basic layman terms which most anybody can understand and keeps you engrossed as you go along. There are also lots of quotes and reactions by all the great minds... Definitely a must read for anyone interested in  all the work over 2 centuries by great physicists to understand and search for the unified theory to explain everything in the universe."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on January 9, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I have found that highschool is more interesting now that I have read this book. I did not know about all the possibilities of  existence.  needless to say I am stoked about  physics and have just enrolled in ap physics. this book is a inspiration.  I hope I can help us become a type one  civilization."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7SHHWDKM8BYS"
                },
                "Date": "on February 11, 2001",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "I wish that he had gone more into depth explaining strings, but that is not the kind of book it is. it is an overview on higher dimentions. but it is definitally fun to read. once you hear the story about him and his parents, a football feild, and 30 miles of wire... you will be on the floor."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21ESPAF4RUNEC"
                },
                "Date": "on March 23, 2005",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": "Excellent book. I just enjoy reading about the universe, its possibilities, and this was a great book to read. I read it years ago and actually picked it up again last year and read it all over again. I am writing this review as I just ordered Michio Kaku's latest book and thought I would look this one up to see how it did in the reviews. I found it delightful and intriguing."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16CRUH5B3SZ44"
                },
                "Date": "on November 27, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22IV6NFWC8A5C"
                },
                "Date": "on September 26, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VONCVB0ANIEH"
                },
                "Date": "on November 21, 2005",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SCD2NYTIAQTY"
                },
                "Date": "on December 6, 2005",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AF7RNA41LJOSQ"
                },
                "Date": "on March 6, 2002",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "In his book, Hyperspace, he duscusses time travel, parrellel universes, extra dimensions, and the list just keeps going. His writing is easy to visualize and colorfull in ones mind. A one sit reading that leaves you spellbound in amazement"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARN3N3GJQYE8V"
                },
                "Date": "on November 20, 2003",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "2",
                "Text": "Although \"Hyperspace\" is fairly easy to read, and does have some interesting ideas in it, it's a little light on the science compared to other books I've read. That might be due to the fact that the subject matter is still in the theoretical stage. But, still, much of the book is anecdotal and many of the analogies used to explain the main theories are repetitive and off-subject. Plus, the book (and the information inside) is pretty out of date. Kaku often refers to things that might happen by the year 2000. This book is more useful for light reading than for really learning about unification theories and multi-dimensional universe models."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QP26XNESJQEQ"
                },
                "Date": "on March 2, 2006",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WB7712KRT758"
                },
                "Date": "on July 30, 2000",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "With the previous title, Georg Bernhard Riemann gave one of the most important lectures of the history of physics on June 10, 1854. That day, the long-cherished Euclidean geometry tumbled down. As everyone knows, the  Euclidean geometry is based on flat space, namely, a space with no  curvature at all. Riemann, introduced with his lecture a new kind of  geometry that could easy manipulates, in a pure mathematical way, any type  of curved space and with more than just three dimensions. All this geometry  was based on the use of the famous \"Riemann Metric Tensor\" which describes  the bending of any region of the space by the means of a limited number of  components that depend on the number of dimensions considered. Riemann was  guided by the principle that the laws of nature simplify in higher  dimensions, acquiring an elegant form that has never seen before. This was  the birth of the theory of hyperspace. The book featured by the author,  explores profoundly the development of this theory since its very  beginning. Splitting the text into four parts, Dr. Kaku covers all the  stages of the theory including \"Kaluza-Klein Theory\", \"Supergravity Theory\"  and the latest version: \"Superstring Theory\", which states that the world  we live in has ten dimensions, but only four of them (space-time) are  perceptible to us. In the first and second part of the book, the authors  explain us, very carefully, the way in which the theory was conceived in  its earlier stages and the problems that it has had to overcome in order to  survive the generalized skepticism through decades of researching. Many  theoretical physics, even today, refuse to embrace the theory because it  probably will never be proved to be correct due to the astronomical amounts  of energy needed to restore the broken symmetries of the forces found at  the Big Bang instant. In the final parts, third and fourth, Dr. Kaku take  us in a exciting journey through black holes, parallel universes, wormholes  and, finally, a scientific and very realistic study about the possibilities  of mastering the hyperspace within a reasonable period of time. I recommend  this book to every laypeople interested in learning a great deal of  relativistic and quantum physic because the text was written in a clear,  funny, informative and straightforward fashion that anybody with meager  knowledge of mathematics and physics can read and delight. I personally  think that this text is one of the best popular books ever written in the  theme of Superstring Theory, and of course, about its role as an unifying  theory of the four forces of nature: electromagnetism, gravity and the  strong and weak nuclear interactions, into a Superforce responsible of the  creation itself."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A133ENN4JUKZHA"
                },
                "Date": "on August 4, 2001",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": "Mr.Michio Kaku does an excellent job of explaining the string theory, quantum mechanics, and all sorts of nerdy sounding consepts, making it exciting and readable for those beginning to explore physics, as well as for those who know it well."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZTK5XSICX4VM"
                },
                "Date": "on July 21, 1998",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "The concepts that underline this book are very interesting, and quite a lot has been written on them in the popular and not-so-popular press. Michio Kaku aims his book squarely at the 'popular science' market.  There is no maths in the book, and not an awful lot of physics either. It is a book written to fascinate, and as such it does well, but in my opinion it does not delve deeply enough for the discerning reader. For instance, we don't even get a glance of the maths behind Kaku's ideas.  What is really needed in this area is a book called something like 'Elementary String Theory', or 'Strings for the Mediocre Physicist'.  This would allow students and other interested parties to have a look at the maths (which I am assured is not too bad) and the deeper concepts (derived from classical mechanics) that lie behind this fascinating area of Physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Q8E89P3DF5UM"
                },
                "Date": "on September 20, 2001",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A228Y86AL6HUUQ"
                },
                "Date": "on January 15, 2007",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "A good book for understand higher dimensions with examples, dates and works of famous mathematicians and physicists."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A138588VA4EAQW"
                },
                "Date": "on July 18, 2001",
                "Helpfulness": 0.7,
                "StarRating": "3",
                "Text": "Despite the fact that I am a grad student in biology, not physics, I bought this book because I am interested in all the sciences and hoped that this would be, as promised, accessible to the lay reader.  It was not.  Like most incredibly gifted scientists, Kaku seems to have forgotten what it is like to approach a subject with no prior experience, hoping for an introduction to it: he will often use terminology and only introduce it several pages later; he uses analogies that are ugly and bear no resemblance to their subjects; and, worst of all, writes in a disjointed style that allows the reader glimpses into strange and beautiful theories but quickly snatches them away from that vantage and pulls them back into confusion and jargon.  The lay reader may come away from this book thinking they are too stupid to comprehend the subject when in fact it is just the explanation that is unclear.  A truly ingenious writer (like a Sagan) would be able to explain these ideas with lucidity.  Dr. Kaku is an obvious genius in his field.  Unfortunately, most of us will need another introduction besides this one to appreciate it as he does."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2J1JFMGRO6W6J"
                },
                "Date": "on September 30, 2005",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Very interesting book for those who seek to learn more about \"trancedental physics\". You don't need to be graduated in physics to understand its contents because the book is written for lay readers on the subject. Hyperspace describe the ultimate world of physics, a highly advanced subject that we commonly see only in science fiction movies such as Star Wars and Star Trek. Indees, most of the technology that is about to exist or to be invented, depends on advances in this field of physics such as interstellar travel, mastering and manipulation of the gravitational force, etc. In my opnion this is one of the best book about the great theory of unification for lay readers."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AW07SB2RZ7GNK"
                },
                "Date": "on April 21, 2000",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "I bought this book because I wanted to learn about thesuperstrings theory. The first part of this book deals withsuperstrings in a 11 dimensional space and multiple universes; and the second part of the book is about star formation, black holes, whormholes, time travel...etc. The first part was really well covered even though this subject is very complex. This book gave me an insight into another field in astrophysics, Theoretical Astrophysics.  If you are more interested in the second part of the book, I recommend other books such as 'Black holes and Time warps' by Kip Thorne. It is more complete and well presented."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NW0P6ELCVD26"
                },
                "Date": "on March 1, 2004",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Michio Kaku does an excellent job of mixing a touch of history and introductory ideas with detailed and concrete physics information. Packed with a sort of \"timeline\" approach to the changing world of physics, from the \"mainstream\" ideas of Einstein, Newton and Maxwell to newer ideas such as string theory and the multiverse. An excellent addition to any physics library, this book will broaden your physics vocabulary and knowledge of physics history ; including its influences on society and the art world alike. Sure to open up new dimensions of thought in an easy-to-understand format."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A336NZCTZZZ2EK"
                },
                "Date": "on January 4, 2001",
                "Helpfulness": 0.75,
                "StarRating": "3",
                "Text": "Good overview of space in the solutions of science.  Though the book suggests upper dimensions as simplifications to lower dimensional enigmas, it generally provides little to grasp in the ascent of these upper realms.  Good introductory book, with a first half summarizing relativity and early 20th century physics, and a second half dominated by speculation.  Sorry, I was unfortunate to have read other more recent books on the current scientific scenary, and found this one to be far too lacking on substance.  Would be a good book to begin a venture into current trends, but if you've kept up your reading, this might add little to your game plan but vocabulary."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10NCCBBZZ1S85"
                },
                "Date": "on November 5, 1999",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I first read this book as a sophomore in high school with no more physics and/or math background sophomore chemistry and algebra, and I COULD NOT PUT IT DOWN!  In \"Hyperspace\" Michio Kaku explains in terms anyone  can understand the concepts and ideas that are drive theoretical physics in  our time.  He includes just enough history to fill the reader in, and uses  entertaining pictures, stories, and analogies to captivate his readers.  If  you have even the slightest interest in ten-dimensional space, black holes,  or the origins of the universe, READ THIS BOOK!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DPR0MR4OA1KT"
                },
                "Date": "on April 28, 2001",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Michio Kaku expains modern theoritical science, and how scientist have come to discover multiple dimensions (everything from Einstiens theory of relativity to Quantum Mechanics) in an extremely interesting and yet very clear and understandable way.  I now impress people at parties to no end with my borrowed clever tidbits, explanations and quotes.  \"You're so smart, did you study at Harvard?\" they say.  \"Just undergraduate work\", I reply laughing, and no ones the wiser.  Thanks Michio!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 26, 1997",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Excellent to get a amateur view of current mindset on Quantum theory.  Some of the math context was being my ability to fully appreciate, perhaps someone better schooled than I wouldn't have a problem.  One negative comment is the traditional \"we better change or else\" ending to the book.  I've been shamed, guilted, and warned enough about man destroying the world.  I was disappointed to get a lecture in liberal political world views in this book.  Would have been better to stick to the topic."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16QBNFP84CI0Y"
                },
                "Date": "on January 17, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "An amazing book I read a few years back (need to read it again); but Dr. Kaku takes us in the fascinating and crazy world of physics. Dr. Kaku's life is amazing from the very start as a young child. This book will truly blow your mind away and is a highly recommended read. Through Dr. Kaku's life, he exemplifies to us from a very early age that it was \"how he thought\" not necessarily \"what he thought\" that helped bring out the genius we know of today by this great scientist of our era."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 2, 1999",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I'm only 14, but this book is so well written that not only am I able to figure out the harder concepts, but I'm actually able to understand what Mr. Kaku is talking about.  For the past few years I have thoroughly  enjoyed learning everything I can about the evolution of physics, and this  book sums many of the important issues into one.  I can't wait to buy  another one of Michio's books, and I greatly encourage anyone interested in  this field to atleast check this book out."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GCKJPXMXMO2P"
                },
                "Date": "on July 23, 2009",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "A littler out of date with newer theoretical developments in string theory, but still an interesting and fascinating read.  I found it to be a fairly simple and smooth read for the average reader, however, I felt like some statements/facts he presented could've used more background and explanation.  It's much harder to understand and remember concepts when you're expected to accept them as is without an explanation of why they hold true."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A392ESYMS3D02K"
                },
                "Date": "on January 29, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "What a fantastic book. Though I have to read it slowly and in segments because it almost literally blows my mind every time I open it and start reading. Never has theoretical physics been easy enough to understand that I didn't, as a layperson,  just shrug my shoulders and move on with my life. Thank you Dr. Kaku for making it digestible for the general populations understanding of sciences and physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6NWM51IB4C9J"
                },
                "Date": "on November 18, 2002",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "This book was a good introduction to a topic I was curious about and many other general topics as well.  Higher dimensions, matter-energy and space-time, relativity, black holes, wormholes, and time travel are all covered.  This book was written to be understood by the layman but some of the explanations could have been more technical.  This is still a great start for someone interested in these topics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13MJU2QH19K50"
                },
                "Date": "on December 19, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Well written book, and the author is VERY articulate.  Kaku did not go into as much detail, or as much math as I would have liked though.  Great for a basic understanding of concepts, but lacked in that I was expecting a lot more depth to the subjects, and more math than just brief side-notes.  Kaku has a wonderful ability to explain complex ideas to the populous, and this should not be over looked."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17LB0HBCXIWJI"
                },
                "Date": "on February 2, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TVUW5YYKK1XB"
                },
                "Date": "on July 16, 2003",
                "Helpfulness": 0.75,
                "StarRating": "4",
                "Text": "It has a great start and a great end. The middle is taken up by much complicated physics that is difficult to follow. However, once Kaku begins to describe ways in which we might begin to probe the 10th dimension and civilizations that may have done so alredy, it becomes engrossing. It is certainly too much for the casual reader, but for lovers of science fiction or science in general, it is a fascinating book."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 26, 1999",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Mr. Kaku express in an easy way concepts that everybody should be aware. This book should be translated in all languages and should be recomended  his reading in School. Once you understand how super minds have made their  discoveries, more than one will jump in this facinating world of misteries."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFZQQH4OUI52Y"
                },
                "Date": "on January 24, 2013",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "I rarely quit reading a book until I'm finished, and this one was close, but I stuck with it and I'm glad I did.  I admit, I skimmed a few pages dealing with the formulas and math, but the chapters that I did understand gave me a greater appreciation for the universe that I live in...currently:)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGV6K9M8X8UDX"
                },
                "Date": "on June 10, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "I'm no physicist, but this book was still understandable for me.  Parts of it got a bit heady and difficult for me (hence the 4 stars... If I had loved ALL of it, I would give it 5)  However, in general, this was a very readable assessment of the state of physics at the time it was written."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 25, 1998",
                "Helpfulness": 0.6724137931034483,
                "StarRating": "1",
                "Text": "I've noticed the rave reviews (some very recent) below don't take note of  how the book was written in 1995 and is now discredited. (No discredit to  Kaku personally, of course.) The various 10-Dimensional superstring  theories have now been shown to be a minor part of a greater theory,  11-dimensional M-theory. No doubt Kaku will explain this too in due course,  but until then remember the theory in this book's no longer valid."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VH6QWC6JZRAC"
                },
                "Date": "on January 15, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1V74MGUYUUFAK"
                },
                "Date": "on February 7, 2008",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DTHLEGPQED44"
                },
                "Date": "on January 22, 2001",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Kaku demonstrate in this book he's great talent of presenting an extremelly difficult and fascinating scientific topic in very simple words that takes you fluidly throughout the book and leave you at the end thinking that you got it !!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BCIAH2TIYVQ9"
                },
                "Date": "on January 2, 2007",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This book is an attempt to put some really complicated physics into layman's terms. The book covers the history of scientific thought and discovery as it relates to the four dimensions we live in (three spatial, one temporal) as well as the other six that some physicists believe complete our universe. What was amazing to me was that although the title sounds like the stuff of sci-fi, the topic actually encapsulates all physical sciences, from chemistry to astronomy. This is because the theory of ten dimensions is a result of the quest to find one theory that explains all forces in the known universe (other theories, such as Einstein's theory of relativity, explain certain forces but break down for others). Although I felt in over my head at a couple points, the author does a good job of simplifying everything and explaining the math without using much math. The book is full of helpful and entertaining diagrams (my favorite is the one of Einstein staring wide-eyed through a wormhole at a Tyrannosaurus Rex). And although the book wanders off topic from time to time (like the tangent on how the universe will end and how the human race might carry on after our sun burns out), even these digressions are fascinating, if not completely relevant. I'd recommend this book to anyone whose imagination has ever been captured by the thought of time travel or parallel universes, or just anyone who wonders what the heck E=mc2 means."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1L869XL8TKG9T"
                },
                "Date": "on December 9, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A393EJD130USD6"
                },
                "Date": "on January 21, 2001",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Fabulous book. It plainly explains theoretical physics of the higher dimensional type. Another good book if you like this one is the Elegant Universe by Brian Greene"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3F9MA9JKBCDDY"
                },
                "Date": "on July 12, 2002",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "This book was thoroughly enjoyable--I love Kaku's style of writing--he has a way of presenting complex ideas so that the non-scientist can comprehend and appreciate them without feeling \"talked down to\". I've been into Quantum Mechanics and Cosomology for a while now, and this book is a welcome addition to my library. Kaku manages to cover a wide variety of related material --I had to write down a list of all the items that piqued my interest, so that I could research them later: Reimann's Metric Tensor, symmetry breaking, CP violation, Edward Witten, Ramanujan theorems, Veneziano-Suzuki theory, the Yang-Mills field--so many subjects that it took hours of searching through the WWW--but it was ALL fascinating, and I have Michio Kaku to thank for it! I am no math whiz, so my research into these subjects has a limit (at least for the moment), but he presents the math gently and his style is not intimidating at all-- you can tell he very much wants to share this wondrous knowledge so everyone can taste the pleasure of understanding--HIGHLY recommended!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 20, 1996",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I am an astrophysicist in a university (which shall remain unnamed). I have long wondered what there is out there in space. Many of my esteemed collegues believe that the universe has an \"edge,\" if you will. That, at some point, the universe stops, and there is nothing. It's more or less hard to comprehend, really, because many people think that at the egde of the universe, when molecules and time stop, there must be black. Well, there isn't. There isn't anything. What is out at those far reaches  will never be known, because it isn't there. As far as travel through parelell universes go, you would have to figure out some way to move through this nothingness. Personally, I think it's impossible in more ways than one (since matter in nothingness is in efect nothing). If some sort of equation were to be made, that would help us pass interdemensionally through use of technology, well, then who knows what can happen. You need a man with a large brain for this one, for we are only beggining to understand and comprehend"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 19, 1999",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I read a lot of the reviews for this book and the one's that rate it low seem to know college levels of physics already. This book was written to explain to the general public in a comprehensible way superstring theory,  and higher dimensions. And it does an AMAZING job. I had long been  interested in science and higher dimensional theories and topography, but  had never really been able to conceptualize these concepts until I read  this book. It allowed me to both learn to \"see\" these concepts  and understand where they are coming from, and it also showed me how this  stuff might be more than just intellectually stimulating. The author does  refer to himself in the book, but that only gives you a greater respect for  his base of knowledge on the subject. Of course, if you have a graduate  level understanding of these concepts, the book could be very trite. But if  you don't, I reccomend you read it, even if the concepts aren't up to 1999  date. And it doesn't hurt to read other books like it either."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on August 3, 2000",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Although I have had an interest in physics, and science in general, I highly reccommend that everyone should read this book. This book has  allowed me to think in different perspectives in life. I cannot say enough  great things about this book without doing it an unjustice. After reading  certain parts of the book, I would get frustrated because I am unable to  think in higher spatial dimensions, simply because of the fact that I do  not exist in them. I get so excited reading about this stuff that I find  myself reading chapters over and over again just to enjoy the concepts that  physicists, mathmeticians, cosmologists, astronomers, etc., have been able  to come up with. This book truly boggles the mind, and to give the best  description using a quote in the book to describe the concepts in the book,  \"Nature is not queerer than we suppose, it is queerer than we CAN  suppose.\""
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUSRVXQ69UGWH"
                },
                "Date": "on November 12, 2004",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "4",
                "Text": "There are lots and lots of books out there about science, but very few that actually inspire with science, and even fewer that truly teach it tothe general audience. Kaku is usually pretty good, but I think he sometimes turn into tinsel. My two favorite books on modern science right now are Brian Greene's Elegant Universe, and a new one by Leon Lederman and Christopher Hill called \"Symmetry and the Beautiful Universe.\" I'd say either start with Greene to wet the appetite, then do Lederman and Hill, or start with Lederman and Hill so you are ready for Greene. I'll be teaching poets with these books. These books set the standard that you will see most other books fall far short of.  With these books as my \"5 stars grade\" I rank this one accordingly."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APLQSL08RZ3AD"
                },
                "Date": "on July 31, 2006",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "4",
                "Text": "Kaku attacks some very difficult subjects in Hyperspace. Subjects usually reserved for theoretical physicist and mathematicians.  Kaku not only adeptly conveys these supremely difficult subjects in a way that the average reader can understand, but also takes the reader on a well organized and engaging journey through the theory of everything.  If you have ever wondered if time travel will ever be possible, if other dimensions exist, or if humans will ever live on other planets in other galaxies then this book is for you.  It will give you the theoretical physicist's point of view on these mysterious subjects.  This book is supremely informative and wonderfully entertaining.  I gave it 4 1/2 stars instead of five, because of the last Chapter which was contrived and superfluous."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVZLUD2WRZFW5"
                },
                "Date": "on June 29, 2000",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DY14ACZTXV47"
                },
                "Date": "on March 24, 2012",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XAY4ZXXSAMNZ"
                },
                "Date": "on November 23, 1998",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Kaku's \"Hyperspace\" is elegantly written and informative. I had never really considered the wilder ramifications of Einstein's theories, believing the whle topic to be waaaay over my head. However, after being  assigned this book in a class on Physics and Quantum Philosophy, I was  pleasantly surprised to find that Michio Kaku has clearly explained not  only the basics of higher-dimensional physics, but also the ramifications  of this information in an engaging and thought-provoking manner. Using  realistic situations and very visual examples, this book is definitely a  worthwhile read for those of us who are interested in the material but less  than fully competent in the fundamantals, it takes you where you want to go  and then some, but skips the dull stuff you may not care to know. I highly  recommend it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20YNS4RNUI1KF"
                },
                "Date": "on May 15, 2010",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on April 14, 2000",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Hyperspace is an excellent book. It's a book that has condensed so much knowledge into so little space that you can read it again and again and still get something new out of it. I read this book first in 8th grade, but read it again in several years with more science knowledge behind me. The  first time was lovely, but I appreciated the book alot more the second time  I read it.  Michio Kaku, in addition, is a wonderful writer. His  procession of thoughts is very logical, and the wording is precise. Many  other physics/math books I've read have been dissociated and difficult to  read because the authors lack writing skill. As a proficient reader, I find  that it is just as easy to appreciate this book for its ideas as it is to  appreciate it for the writing skill displayed."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11VWUNAPEZZU7"
                },
                "Date": "on November 29, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "A must have primer in the physics world. His writing is easy to follow even through some heavy duty stuff."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OJPC8MOBI3X4"
                },
                "Date": "on May 12, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1M42RZYKG1X06"
                },
                "Date": "on January 7, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I first read this when I was a teenager, somewhere around 1998.  My perspective on the universe and our place in it has been forced open to view a much bigger picture of existence.  I never even heard of cosmology when I was that young, but after reading this book, I began devouring work by Thorne, Hawking, and other cosmologists and physicists.  The concepts are solid and explained clearly with examples and that can be related.  I don't think that this book is over anyone's head.  If you are looking for answers to questions about the universe, this book should be your starting point from which you can launch yourself into a sea of other related books, journals, or articles.  Happy trails."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YMBHOE618X9B"
                },
                "Date": "on March 14, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 26, 1998",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I loved this book and could not put it down from beginning to end.  Anyone can enjoy its clear and easy metaphors which make complex ideas such as how we appear from higher dimensions, time travel paradoxes, and superstring theory seem as simple as addition and subtraction.  For the \"recreational physicist,\" this book is perfect.  As a high school student, it is easy for me to become lost in such complex ideas.  But never once in this book was I wondering what I was reading or trying to figure out what was going on.  Completing this book left me with a hunger for more knowledge in the field of astro and theoretical physics."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on December 8, 1996",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Have you ever heard about a book that sounded so good, you couldn't get it out of your mind? Well, a year after hearing an interview with Dr. Kaku on National Public Radios \"Fresh Air\", Hyperspace was still on my mind. The good doctor combines science and his own personality to deliver a book that most persons of average or above intelligence can understand. I've read several books that deal with \"String Theory\", etc that you have to force yourselve through sections. This is anything but true for Hyperspace. My favorite part? He describes the states matter pass thru, using a pressure cooker in your kitchen"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 8, 1997",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "If you're a thinker like me, then Hyperspace is your brain food. Mr. Kaku literally takes you into another dimension with his clear and vivid explanations of some of the most amazing ideas in theoretical physics. The detailed descriptions of objects that we cannot perceive are actually created in your mind's eye,leaving you looking at everything as if it were possibly a ten dimensional object, while at the same time having you think over such ideas as wormholes, space travel, parallel universes, and probably the Loch Ness Monster and Bermuda Triangle! This book is a must for any deep thinker and lover of the unknown."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 4, 1999",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on April 17, 1999",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "All I have to say is the man is a genius in his own field.  He explains scientific jargon to the layman.  He uses excellent analogies to explain a concept or equation.  It opened my eyes to the vastness of the universe  that has been created, and the possibilities that man has yet to understand  about the world in which he lives.  It absolutely captivated my attention!  Great thought and passion went into his book, and it is evident by his  tone, language, and outline.  I loved it before the first chapter was  completed.  Anyone who likes to learn and augment their imagination, should  read this book."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 26, 1998",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Kaku does a good job of explaining the basics of the different mechanics of modern day thoughts about quantum theroy...  While this book does contain a great deal of speculation, its more like Kaku invites us all into a group of scientists and fills us in on all the \"gossip\", the speculations that are out there being proven or disproved right now.  If you want a book to introduce you to quantum theroy, hyperspace, and space-time, Kaku's may just be the best one out there.  And from this book it is much easier to move on to Hawking and the other big brains of therotical physics..."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 23, 1997",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Scientists are currently seeking proof of that which mystics have always known: the \"unified\" theory, multidimensionality, parallel universes. For those approaching the subject from the metaphysical perspective, Hyperspace presents a lucid outline of current scientific theory about how our perception of reality is constructed. Mr. Kaku's literary journey leads us through ever more complex theories which ultimately simplify the relationships among matter, time, space, energy, vibration, and observation. It's a fun ride in the philosophical amusement park"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on December 1, 1997",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Finally there is a scientist who is willing to talk about things that usually scientists arent willling to talk about.  While Im a little bit wary of his argument that our universe coincides with another 6-dimensional universe which is many orders of magnitude smaller than the nucleus of an atom (I disagree with the size part), this book definitely makes you ask some interesting questions. The conclusion of the book also gets a little bit to philosophical and political for my taste.  But other than that, definitely worth reading."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13RRZ6SL5QL1K"
                },
                "Date": "on December 23, 2001",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Michio Kaku is a new author for me.  I'm glad to have had a chance to preview 30 pages of this book.  From what I've read, I'm definitely hooked and can't wait to get the book.  Kaku's  taken a complex subject matter like parallel universes,  dimensionality and the forces of nature and has woven it into a context that is easily understood, exquisitely expressed and mind bending.  His work helps to provide a foundation for those of us interested in taking that journey beyond 3-D but don't have a background in theoretical physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OPRWG194AWML"
                },
                "Date": "on June 27, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "For years, i was addicted to video games and I did not care about school. Starting earlier this year, my attitude reversed and I wanted to learn more about science. I decided to start with this book, and I am more than extremely satisfied with my choice! Michio Kaku is a marvelous genius who makes the most abstract the most interesting. Because of his book, I am now reading about the wonderful world of physics everyday!  If you or you know someone who likes, wants to get in to, or has not tried physics, This book is a must."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 25, 1999",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "No, this book was not written for the theoretical physicist who wants to understand the intricate details of string theory!  It was written for those who want a broad concept of what is going on in this section of physics and for the intellectual who enjoys thinking about things such as  visualizing extra dimensions.  Kaku has done a magnificent job at what he  intended to do with this book.  For those who want more than a popular  account, stop bashing Hyperspace and go read the more involved books Kaku  has written."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEDLJZMLDDGWA"
                },
                "Date": "on September 4, 2002",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Michio Kako has a gift when it comes to explaining the unexplainable in layman's terms. He sort of beats you over the head with it sometimes, but I think it's necessary to understand the deep concepts here. It's fun to explain to someone who has not read the book that light is a \"ripple in the 5th dimension.\" That's some really deep stuff! His book called \"Visions\" is also good, although it is a little bit out of date already. It's about the evolution of technology over the next fifty years."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on January 3, 1997",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I read this book a couple of years ago, and it blew my mind. Unfortunately, I lent it to a friend who never returned it (she probably was too engrossed in it). It was always in my mind, and when I came across it last week, I bought one for myself and one as a present for my girlfriend's mom. Since then, I have been thoroughly absorbing every page eagerly. It truly is amazing when words can fuel the mind to imagine the unimaginable. It is a must read for anyone who likes explore new ideas"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 8, 2003",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is a most enjoyable and elucidating science book. The publication affords a painless understanding in its chosen area of theoretical physics. If you wish to have a good general grasp of the spatial dimensions beyond our paltrily perceived three physical dimensions, and want to understand the significance of superstrings, cosmic wormholes, and also gain a decent historical background of such wonders, then you should purchase this engagingly-written book. A definite \"must read\"!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 10, 1999",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A very good book with a history of physics along with personal experiences that make it more understandable.  It makes you want to learn more about physics.  Although this book is not like a textbook-- you won't find  physics formulas or anything of the sort.  So if your studying physics in  college or maybe highschool, don't buy this book for reference.  It is a  very good book, anyway, somewere in between pleasure reading and a quick  reference guide.  RECOMMENDED HIGHLY!!!!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 3, 1999",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQUZQHSAT9SME"
                },
                "Date": "on December 27, 2001",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book is incredible. Not only does Michio Kaku bring the most puzzling aspects of modern physics down to the laymans erms, he describes them in a revolutionary way that anyone can understand and grasp thoroughly. I recommend this book for anyone interested in basic or advanced cosmology, physics, or any science. This book will change your outlook on life and give you perscective on your place in the universe. Warning: This book willl blow your mind."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33WM3FAC1RTQ3"
                },
                "Date": "on May 28, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1INNXJZG8T7Q7"
                },
                "Date": "on July 6, 1998",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Kaku has struck just the right balance between solid theory, analogy, and narrative. The book is written in a way that allows the reader to become completely absorbed in this mind blowing area without becoming too stumped on theoretical complications. It doesn't pretend to provide a full explanation for everything it describes, and it is here that the book excels. It provides an excellent spring board for further exploration of the various topics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15KDT35A3DKR6"
                },
                "Date": "on June 23, 2010",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "\"Hyperspace\" is a genuinely easy read for a budding cosmologist. I must say, there were parts which seemed repetitive and unnecessarily wordy. At times, I wish there was an illustration to help me understand it better (Brian Greene style), but I still enjoyed it. To think of the universe in so many dimensions is truly mind blowing. Hopefully, one day, we'll be able to harness some of the fantastic ideas presented in this book in the near future."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on December 6, 1996",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 12, 1997",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The major problem that those who have opinions or theories on physics but no doctorates degree is that no one will listen to them.  We need to stop making physics follow the equations and start making it follow the evidence. The equations can wait if you can prove that something works.  This book opens the minds of all of us non-proffessors and allows us to start to think that maybe our ideas aren't so strange after all"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EYRC90P14WE2"
                },
                "Date": "on October 16, 1998",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 1, 1999",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "After I bought this book, I started to read it and could not put it down. I read the entire thing in two days! Michiu Kaku has become one of my favorite authors because of this book and I currently have almost all of  his books. All I can say is that he is a genius plain and simple. I have to  reread pages of information before I can grasp the details of these  concepts, it is excellent writing. Excellent!!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 12, 1999",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "For those with basic knowledge in physic, this is really what you need to start.Trust me, I've read tons of books from Paul Davies, John Gribben, Martin Rees, others ... but it's too difficult to comprehend. It covers most if not all the basic stuffs that you need to know. Not only that it  was very well written, it was also structured just like any other good  novel. A must have for physic lover !"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 22, 1997",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Hyperspace blew my mind with pages upon pages of discussion on time travel, wormholes, black holes,  the end/beginning of the universe, parallel universes, and so on.  This book explains some of the most complicated and highly theoretical ideas of physics in Laymans terms, making it a truly wonderful, well written book great for both information and entertainment.  Hats off to Mr. Kaku on this one."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OFK4HAGDRE7E"
                },
                "Date": "on September 12, 1998",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Not only was this book a fun and informative read, but it helped explain  some of the more complex theories understood by science today -- in plain  English!  I found out that many of the questions that have confused me in  my attempt to understand the science of the universe also confound the  greatest minds of our century.  It made me feel smarter and dumber all at  the same time.  A great read."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on April 20, 1997",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book is very good it puts evrything in in Layman's tems, while going into the deepest parts of theoretical physics. Dr. Kaku uses simple English to explain the hardest part os quantum physics to interdimensional worm hole theory. His synopsis of Kaluza-Klein is great, and his knowledge of superstring theory is outstanding! It is a must read, for any Star Trek, Star Wars, or 2001 Buff"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A171XUDWWXE8O2"
                },
                "Date": "on April 15, 2000",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is my first book in physics and it rocked! Michio Kaku give easy to understand examples that helps understand complex ideas. No math background needed. I am 13 years old. If I can understand it, anyone can. This is a  must buy if you are interested in physics and theories about space-time. I  plan on reading more from Michio Kaku. BEYOND EINSTEIN is my next target =)"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 26, 1998",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I  starting at the middle of the book.  I just opened a section to scan some pages, and the next thing I know, three hours have passed and I've finished quite a few chapters. I finished the last half  and then went back to read the first half. The book captures your mind and starts you thinking....Kaku has done a fine job and I have been recommending this book since."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28YNHK56S78YB"
                },
                "Date": "on June 30, 1998",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "After hearing Michio Kaku on a national radio show, I opted to pick up this book and see what he had to say. This books contains a great deal of theory and is written in such a way that it is easily understood.  Although parts of the book can be a challenge to fully comprehend, I can at least say that my ignorance and boundry of understanding was rearranged."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4IGGPAA7QAXR"
                },
                "Date": "on July 5, 2000",
                "Helpfulness": 0.6,
                "StarRating": "4",
                "Text": "Over the last 150 years Physics has evolved from Newton's Deterministic universe, through Einstein's Probalistic universe to john Wheeler's participatory universe. What the sages of yore proclaimed is just what  scientists of today theorize: The physical universe is not what it appears  to us through our five senses confined to the known dimensions of  space-time continuum. At the microscopic and macroscopic level one  encounters a state of incomprehensibility that later evokes a sense of awe  and wonder, which as Einstein put it is the prime motivation behind all  scientific discoveries.  Both the devout scientist  and the curious layman tread a very narrow path as they venture into the  unknown where one need not always find the explicable counterpart of what  is known. This is the juncture when the layman seeks a plausible  explanation from the scientist who to a great extent is baffled by the  immensity and diversity of creation fractionally revealed by science. From  this perspective Dr.Michio Kakuo  appears triumphant as he tries to  explain in lucid terms the scientific reality, without much technical  jargons, which is but a reflection of unified cosmic reality. But still,  one should keep in mind that often the nature of physical reality with its  increasing incomprehensibility points to the metaphysical realms of reality  as well.  Prof.Kakuo in his book surveys the major  discoveries and developments in physics spread across the past 150 years  right from Newton's theory of gravitation to the latest theories of  Superstrings and Hyperspace. Kakuo's exposition of a multidimensional  universe, which he limits to ten, makes even the lay reader think of  imaginative possibilities one comes across in Richard Bach's novel \"One\",  which in fact is inspired by the book \"Many World Interpretations of  Quantum Mechanics\". He pays his homage to Srinavasa Ramanajum when he says  the mathematics contained in the lost notebooks in essential to develop a  mathematical framework to supplement the emerging new theories in physics.  Riding on Einstein's equations he takes us on a sojourn through hyperspace  and explores the startling possibilities of building a time machine.  Any discussion on such topics will be incomplete without mentioning  the mathematician Kurt Godel who school the foundations of mathematical  logic with his monumental incompleteness theorm. In Hyperspace there is a  detailed discussion on Godel that points to the limitations of logical  thinking, much like the way a Zen koan eventually makes the aspirant  realize the in effable nature of reality, when one tries to explain in  scientific terms the mysteries of consciousness and insight. The inner  universe is also as complex as the outer world, but it encompasses all.  Hyperspace is one more step towards the understanding that the very nature  of physical reality is metaphysical in essence and one understands the  universe deeper in all its splendor at the experiential level than at the  rational level...the borderline between Physics and Metaphysics is but a  virtual division of the united whole..and the sum is more than the parts  put together!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XP5MV9QBYXEN"
                },
                "Date": "on February 26, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QJULCSTDW1D1"
                },
                "Date": "on February 7, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I love his books. He writes in a manner that makes the subject understandable for an average reader like myself who is just curious about these issues. I never fail to be totally absorbed. Highly recommend"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUKRQ2JNMDJSN"
                },
                "Date": "on February 5, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7CTN8OK3HI4X"
                },
                "Date": "on January 10, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I love Michio Kaku! He makes physics easier to understand for the lay man or woman. I really liked and appreciated this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASRLC7TCJOKYH"
                },
                "Date": "on July 15, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "WOW!! This is really a cool and good book! It's easy to understand given that it is physics and space and time, a very hard topic to understand. I really enjoyed this book and I recommend this book to all people interested in science and how the universe works!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1R0O48VQIB9TC"
                },
                "Date": "on June 7, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I have bought it as a gift to my hubby, and he loves this book when he brings to travel with him!! Thank you."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NSILYG20DEQI"
                },
                "Date": "on May 30, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Very well written, text flows & makes the academia of the book easy to understand with great examples.  Michio kaku is one of the best authors of modern science & physics!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWV7SMFPLAZ3A"
                },
                "Date": "on May 22, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This book has a very detailed explanation about Hyperspace, Quantum Physics, String Theory, etc. yet it is not written in a language that only PhDs can understand."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NOCE6E2NB6A3"
                },
                "Date": "on April 4, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "The book is very educational, easy to follow, & in some sections very witty. ( i don't have any more words."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DQOVHBNALKE7"
                },
                "Date": "on February 5, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2V45K1X8UEDG9"
                },
                "Date": "on May 20, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This was a very easy to read explanation of the Physics in a way the layman can understand. I believe this is as close as one can get without being able to do the math oneself."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3K6S1K0OMQMDA"
                },
                "Date": "on February 13, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I just started reading this book on my Kindle, and am enjoying it completely. He takes complex thoughts and explains them in such a way that most people can understand them for the most part. Awesome book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GHXU070U8QYF"
                },
                "Date": "on August 22, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The author, Professor Kaku,is an exceptionally good writer.  He provides an entertaining historical background for a complicated subject.  This is a physics book that reads like a novel -- a page turner."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 21, 1998",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I picked this book up from the library by mistake. But it wasn't a mistake I would regret. This book was excellent. I'd recomend it to anyone with an intrest in science (physics). I have since bought the book and barrowed it to 4 of my friends (the ones that are interested in thaht type of thing). They have all loved it too...What more can I say?"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on November 13, 1998",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "There is a nice metaphor at the beginning of the book about a fish in a pond  and its limited perspective. Later on, the book becomes somewhat technical.  It liked it though. Two other books I like are \"The  Inflationary Universe\" and  \"The Bible According to  Einstein\". It is interesting the Kaku has endorsed  the latter."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 3, 1996",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on December 1, 1998",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JU4F29FU92TO"
                },
                "Date": "on October 17, 2002",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Great \"pop\" physics. Easy to understand mathematical models and imagery help explain to the layman some of the more interesting theories of grand unification. Maybe just a bit dated now, but still very relevant, simply because it uses such casual language that even the most disinterested person might find the material intriguing."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AMJBRZGCWWV7"
                },
                "Date": "on October 29, 2003",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "I loved this book and continue to go back and read a section or two.  It was very thought provoking, yet easy enough to pick up and read.  I have to say worth checking out if you are at all interested in this subject matter.  One of the best I have ever read."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on September 4, 2002",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I loved how this book brought out multiple aspects of the atomic world and explained them in terms of our physical world.  The book is somewhat technical, yet still not difficult for an amateur to understand. It gets into some uncertain terrain, much like STILL PITYING THE FOOL, which can be a lot fun if you're up for it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A364RRYVVUG8AA"
                },
                "Date": "on November 10, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Rather difficult for non-scientists. I struggled a little with some of the concepts, but it was so well written that i at least understood the basics of each idea. Kaku has a wonderful style, which makes the read so enjoyable and interesting. It truly was fascinating. I do, however, warn against the difficulty level."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on August 25, 1999",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A wonderful introduction to the mysterious nature of space.  I especially liked the sections on dimension in art, from the middle ages to present. Those of you who enjoyed this book would also enjoy the new book  \"Surfing Through Hyperspace: Understanding Higher Universes in Six  Easy Lessons,\" by Pickover."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HKFTT3MDBY2J"
                },
                "Date": "on July 17, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Really good book. This was my first book that I bought by Michio. After seeing him on many news programs I decided to go ahead and pick it up. I found his literary style very easy to get in to and understand the concepts he was discribing, along with his analogies that helped me visualize what he was talking about"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on September 27, 1998",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ED6PZXMW4L2L"
                },
                "Date": "on December 18, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The book itself is one of my favorites & worth reading. However the copy I received is underlined & highlighted throughout. Regardless of condition specifications, look for hidden flaws if buying 'used like new' as I did. Seller refunded my money, but it was a b-day present I was forced to not give."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WKJG7PAF1C53"
                },
                "Date": "on May 27, 2010",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is a great book that has remarkable withstood the test of time since it was written about the cutting edge research in the 90's and it is now 2010.  Great metaphors that help you visualize but don't dumb down the physics.  Rather it shows a great deal of respect for the reader.  Love this book!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on August 1, 1996",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 9, 2003",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on November 10, 1996",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I maybe 14 years old, but I understood everthing. From super strings to (my favorite) hypercubes. This book further my intrests in theoretical physics and led to my own theory about the hypercube. The detail was not what I expected and the book was also pretty easy to read. I enjoyed it"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A341EGY6NRQWIV"
                },
                "Date": "on May 7, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is big. This is awesome. For those like me you didn't go very far into physics in high school, this is wonderful. Michio Kaku explains the laws of quantum physics and the string theory in a way that even someone like me can understand a bit of it. I definitely recommend this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24PIJ1PLTDU36"
                },
                "Date": "on April 26, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 30, 1998",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is a book that I read and enjoyed the whole way through. I think that anyone that likes the subject would love this book. It makes everything so easy to understand and fun to learn about. I think that this is a good addition to anyones physics book collection."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on August 25, 1999",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Kaku has made all the hardest, most recent scientific ideas easy to understand via great analogies, and everday language. Anyone who is interested in physics should read this book and it is an excellent resource  tool. I am 17 and understood everything."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUQ7A9LH3F3AQ"
                },
                "Date": "on September 18, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Fascinating!  I read it and understood Some of the concepts although I am not versed in physics and higher math. I have read Kaku most recent book in the brain and am planning in time to read his other books. This has opened up a whole new world for me"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on August 31, 1999",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "In this book, Kaku takes something unimagineable- 10 dimensions, 7 more than we are aware of- and makes it so simple that I, a 15 year old, can understand it.  Not only that, I can explain it without parroting it.  This  book is pure and simple genius."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3V6GE3Z7K65UQ"
                },
                "Date": "on January 30, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on September 16, 1996",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1W8VFZCX4CFBD"
                },
                "Date": "on April 19, 2000",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book was a great read, it really opened my eyes and made me think.  Michio Kaku is a wonderful author, able to make difficult concepts easily  understood by anyone. Hyperspace is a must read for anyone and everyone."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7M6QCWC7ZD9"
                },
                "Date": "on December 7, 1999",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "Though I never knew thigs like this were real, I found this book to be a revalation. Those interested should be most pleased by this writing as well as this topic!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IUD9RHPK4R9F"
                },
                "Date": "on January 5, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Michio Kaku takes the reader through a series of fascinating possibilities that most of us thought were only real on Star Trek. But he shows how theoretically, time warps and parallel universes are actually possible."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQJEQJ5IVA802"
                },
                "Date": "on May 19, 1998",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This author is fabulous at explaining the history of physics and where is now.  He also explains technical issues of physics in a simplified manner.  Enjoyable to read.  This is one physicist with a sense of humor!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on September 7, 1999",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I found it hard to put down this book, I have read it multiple times. It is well written with great analogies that make it good for both scientific minded people, and people who have trouble understanding science."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 21, 1996",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Shortly after reading this book, I found myself floating somewhere in the 10th dimension, aligned with the substratum of a high-energy degenerative particle consciousness that was rivaled only by my alarm clock"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 23, 1999",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I wish I could of read this book in Jr. High or in High School. Dr. Kaku has writen a book to capture the young (and old), minds of anyone interested in physics.  It is a great book, thats all there is to it!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CSHPFM92BJJ4"
                },
                "Date": "on May 21, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I always enjoy Dr Kaku's books. This was easy to understand although I already knew something about the subject. I think now there are 11 proposed dimensions instead of 10 as mentioned in the book."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 9, 1999",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book does a great job of summarizing the complexities of superstring theory and its history in a way that is easy to read and understand.  Anyone interested in the subject should read it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A126KX6FVI4T66"
                },
                "Date": "on January 18, 2007",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3I4HPAR9L0MYU"
                },
                "Date": "on July 8, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I loved this book and devoured it.  I found it to be a great conversation starter with my fiance when he and I were in the mood to have creative and inventive conversation."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 23, 1998",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Absolutely fabulous! Finally an explanation for the average idiot. Dr. Kaku's narrative explains just how shocking and critical this type of theory is to all of humankind."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38T5ZL2EZ7ZJH"
                },
                "Date": "on December 8, 2012",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "Not a bad book at all, interesting and different perspectives on the same topics that I have found in other sources. the only issue I have is that it is a bit old.  1993"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XP5MV9QBYXEN"
                },
                "Date": "on May 24, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great reading for those who follow Michio Kaku and the science of the future. Good reaing for those looking for a more anthropic view of what the universe may hold."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AF6PZPL30OVQO"
                },
                "Date": "on November 28, 1998",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Could not put it down. Got me interested to learn more physics. Designed for folks who don't know much about physics (like me). Michio makes it interesting and fun!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 11, 1998",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is a good book. It is clear and well written. The reader should realize however that the existence of more than three spatial dimensions  is still speculative."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28X2QWXXWFE81"
                },
                "Date": "on October 2, 2000",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "This is excellent. I came to this book with very little background on the subject...a glancing knowledge of relativity and of quantum mechanics. Michio Kaku presents the material in a very accessible manner, leading the reader the history and evolution of the theories that lead up to Superstring theory. This has the advantage of giving the reader a framework and a context within which to place each additional bit of knowledge and the advantage of humanizing the story.  I strongly recommend this book for anyone with even a slight interest in the topic, whatever your background may be. For those who have no knowledge of the subject, Michio Kaku is an excellent and amusing teacher. For those who understand Hyperspace and Superstring theory, this may give you an historical context for your knowledge and present you with ways to explain this complicated subject to others. Kudos to Kaku and O'Keefe"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BM531UWB2P31"
                },
                "Date": "on February 23, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I am a musician . . . .  My son is a student of science. I wanted to read this to be able to understand some of what he studies. It is very very readable!!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19DPT74H0JU72"
                },
                "Date": "on August 21, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Kaku one of the best science writers of our time. Its like being escorted through time with one of the best scientific host. I welcome more from Mr. Kaku"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 4, 1999",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book takes the laws of the universe to another level.  It journeys through all ten dimensions, giving the reader a lot to think about.  It's great"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZPT8CE2BY50X"
                },
                "Date": "on June 14, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Great book, thought-provoking. We are carried away in a different dimension. However, some basic knowledge is necessary to understand certain concepts"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2X0LL9TH3EO76"
                },
                "Date": "on December 30, 1998",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Very interesting. Kaku is entertaining and very readable. Not too much math :( but it is a good book book for an intro to multi-dimensional physics."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 24, 1996",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Clearly written, but I found two things irritating: (1.) author brags about himself (2.) author discusses how we can escape not so much the end of the world, but, mind you, the end of the UNIVERSE in billions of years' time! Excuse me? Sounds to me like the ultimate in greed for life and the hubris of modern man. Like liberal scientific people, he may think of himself as more enlightened than the low-class masses who may believe in God. However, apparently, he is not enlightened enough not to have this bottomless pit of a greed for human life, which is in the end true foolishness. Among some people in the modern world, there is little humility, little thought that afterall, we are just another animal, so why should we have the capacity to understand everything"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CYTJLW53DC4X"
                },
                "Date": "on August 9, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Love the way he writes for the layman.  There are plenty of relatable stories about others.  Very easy read on a difficult subject."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on September 2, 1999",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book takes you beyond the immediate realm of science, and into a deeper level, a deeper way of thinking.  5 stars all the way."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on September 21, 1999",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Yes, the material is pretty complex, but this does a pretty good job of explaining his side (now, what about the other side?)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3Q07YH6T4153Z"
                },
                "Date": "on March 10, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is a complex and fascinating book.  It will take me awhile to read and digest its content.  What a journey it will be!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GT09QXJT2XNJ"
                },
                "Date": "on May 9, 2000",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BVQI8IWI4NHE"
                },
                "Date": "on April 2, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "It's a great scientific theorem, good thinking and fascinating to read. I like it. Will probably read it again. cheers"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AUYV4X8OA0UJ"
                },
                "Date": "on January 28, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "the spine is not creased at all, nothing is written in it. and it looks brand new from the store. love it :)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EFY3XXO335MZ"
                },
                "Date": "on January 14, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I get more than I expected. It's very good for me. I recommend the products in 100% for all that can get it."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on May 31, 1999",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I great fun book on dimesions it explains everything even for someone in 4th grade it is a very good book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DS8I4CW735Q9"
                },
                "Date": "on December 25, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": ".....hyperspace  is a difficult subject to read about,  but  explained excellently  by Kaku....."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AS5JILVJQ957"
                },
                "Date": "on May 16, 2012",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LOQGJU018626"
                },
                "Date": "on January 25, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "As always, Michio Kaku holds the imagination while opening the mind!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AS6DAKFBL309N"
                },
                "Date": "on August 24, 2011",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Z4SPB8ABM64U"
                },
                "Date": "on August 4, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "So much fun to read and follow Kaku as he enlightens the reader."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on August 15, 2000",
                "Helpfulness": 0.6,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SGR7LE899LGG"
                },
                "Date": "on December 7, 2002",
                "Helpfulness": 0.6,
                "StarRating": "5",
                "Text": "Great book. It is very detailed but without getting too hard to follow. This book does satisfy the curiosity of the average reader and it is very well put togheter and captivating. Overall:EXCELLENT"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A109TM75UJYV2"
                },
                "Date": "on July 2, 2006",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CK48ERTLB90J"
                },
                "Date": "on November 28, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I bought it for my 18 year old son and he really likes it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12V4JZYYC8OTL"
                },
                "Date": "on May 8, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Clear and concise, mainly for non-physics experts."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3W4GJR5CCADBX"
                },
                "Date": "on October 17, 2002",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ST9PG26FSN2H"
                },
                "Date": "on March 23, 2004",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "This book was written ten years ago but it still holds up well.  Michio Kaku examines the theories of multi-dimensional space in an entertaining and educational book.  His explanations are so clear that 10-dimensional space actually made sense.  The book is somewhat a rambling adventure.  Kaku takes us on a tour, introducing us to an interesting cast of characters  including the sad story of Georg Bernhard Riemann who developed key equations for analyzing multi-dimensional space in the 1800's.  The tour differs from a typical physics book in that instead of giving us the basic lecture of the advance of physics, Kaku approaches everything from a slightly different angle.  In trying to help us understand multi-dimensional space, he looks not just at science but in art and literature.  To emphasize a point he might explain it using something from his own career or from a science fiction story. The main problem with the book is that the author does tend to get off topic and ramble at certain points in the book.  Stories about what an intelligent culture might do as the Universe ends doesn't really fit into the flow of the book and since we really have no idea how the Universe will end, it all seemed a bit pointless.  I started to get the idea that Kaku had a number of pages in mind and was trying to fill the book with a lot of different ideas he has had floating around to reach that number.  But don't let me scare you away.  At least two-thirds of this book is brilliant writing that will make you think, help you understand modern theories of physics, and entertain you.  I can forgive the author's ramblings when he provides that much in a few hundred pages."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24QL28TI2E9TV"
                },
                "Date": "on February 26, 2002",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "I may seem a litle young for this type of book, but even though it contained some equasions (which in \"A Brief History of Time\" Hawking stayed away from) it was well put and should be easy to understand by anyone who has some general knowledge of the general and special theories of relativity and some quantum physics too. I am not a braniac kid or anything, I get by and like to desighn things. Theoretical Physics Isn't exactly the hardest thing to comprehend (I think understanding our own mind probably is) and this is a good book to get. There are good descriptions and graphic illustrations (no this is not a kid's book) make this easy to understand by the layman. It tells of Superstrings (now known as the M-theory) and Worm holes. It also describes how we must evolve in the tree types of civilizationary stages, and includes many stoies and anecdotes all in all this was a good book"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on November 5, 1999",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "D.r kaku unwraps the mysteries of the most modern theoretical theories. he takes trough black holes and trough time. showing us the potential for humanity in the stars."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 13, 1997",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "Despite its critical acclaim, \"Hyperspace\" is mostly a rehash of ideas developed a century ago but ignored because of their \"impossible\" nature.  Kaku writes with enthusiasm but stops short of proposing a testable model of hyperdimensional physics, claiming instead that such higher \"state spaces,\" while interesting, will not be confirmed scientifically for centuries.  What good is a theory if it cannot be tested for hundreds of years?  We'll just have to wait, Kaku says, leaving the intrigue of time travel, free energy, and alternate worlds in the same never-never land orthodoxy has always relegated them to.  But several other researchers have already provided convincing evidence of higher dimensions, complete with testable models.  Interested readers may refer to the work of MIT's Eugene Mallove, former NASA astronaut Brian O'Leary, Richard Hoagland and Thomas Bearden for starters.  This said, Kaku deserves commendation for bringing hyperspace and all its implications back into the public arena, where it has been absent (except in Star Trek episodes) for far too long"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2G0E1DVA3NQMD"
                },
                "Date": "on February 12, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Easy reading, fun to read!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25BNNDMDH45F3"
                },
                "Date": "on April 19, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "good buy will use again"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on May 8, 1998",
                "Helpfulness": 0.5,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on December 3, 1998",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "I am only in the 8th grade, and I read this book!  I knew almost absolutely nothing about hyperspace when I first picked it up, but when I finished it, I had a clear introduction.  Some parts were definitely  difficult to comprehend, but it all came together, eventually.  I didn't  quite understand the math, it was way above me.  I really appreciated the  way Mr. Kaku was able to help the reader to visualize what he was  describing, by use of metaphors and similies.  I know I get frustrated not  being able to see those other dimensions and things, so it really helped  that he was able to do that for us.  I hope he comes out with more books as  good as this one - he really got me interested in this subject!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WSVXL31LY8XY"
                },
                "Date": "on May 26, 1999",
                "Helpfulness": 0.5555555555555556,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AF8DM6NWL9API"
                },
                "Date": "on September 23, 2007",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I'm not a scientist (I'm a classicist) and didn't even enjoy science in school at all. In fact until writers like Michael Behe, Heinz Pagels and Michio Kaku came along science was totally unapproachable for me. For a writer to take such incredibly complex information and present it, not only clearly and understandibly, but also enjoyably, one has to be uniquely gifted. Kaku and Behe can do this and remain my favorites. It's been years since I read this and to this day I can't forget it. So, here's my point. If you, like me, long to understand fascinating ideas that have always seemed incomprehensible, let Michio Kaku help you out. Get this one."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VMENM5CPGF1W"
                },
                "Date": "on November 20, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Amazing read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GPOOPTQS3MXQ"
                },
                "Date": "on September 5, 2001",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I have to say personally to Michio Kaku that this was the greatest book he's ever written on hyperspace! He makes it sooo easy for anyone to understand the concepts of dimensions and how we view our universe! I highly reccomend this book to anyone who's interested in physics, higher dimenions, the beginning and end of the universe, and how physicists through time figured out and invented theories that no one believed until now!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14PVA1OJVHGHD"
                },
                "Date": "on February 7, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great Book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3B4XP3LEZ2DI7"
                },
                "Date": "on April 4, 2001",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "This book has played a key part in my gaining an interest in theoretical physics. I have even made a site about parallel universes. This book explains many different theories in an extremely lucid manner. It's a must for one who's interested in theoretical physics. It's also a must if you're interested in the show \"Sliders\". Check it out!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A250XU4W3L5QYM"
                },
                "Date": "on January 3, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Good book"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2T3869ZK0AQJ2"
                },
                "Date": "on March 27, 2003",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "This book may be a tad difficult for many readers but If you keep working with it, it will change the way you see your world, it will open new views on the universe and how things work. If your at all interested in science or space travel even this is a great book to get. Michio Kaku is a wonderful writer and he shows this well in Hyperspace."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36PIUPYBFNLD2"
                },
                "Date": "on July 1, 2003",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "If you are ok with reading a fairly heavy book. If you  want you're peception of the way the world works on an atomic level changed forever. The theory of 10 dimensions is dicussed at a lot. Also talks about string theory. Again there are times this reads like a text book. So if you are not willing to do some heavy reading don't get this. Also from this author \"Visions\" Mr. Kaku's vision of what the future will bring. Writen in '97 \"Visions\" is broken down into what will happen within 50 years,100 years,and beyond 100 years. If you have read one of the two then get the other. They are not about the same thing but are equally as mindblowing."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UCUXQPDLMK1A"
                },
                "Date": "on May 21, 2001",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "I found this book to be a great mind-opener even for someone like myself who is not a physicist. It was an interesting conceptual look at theoretical physics and the evolution of man, and society. I took you from basic concepts of Einstein's theories to Kaluza Klein theory and Riemann. Moreso it didn't present itself in a confusing manner."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BMRJAEXGU0OU"
                },
                "Date": "on October 7, 2002",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "This was the first book I'd ever bought on Hyperspace, and it was great.  The author is fun to read and explains things very clearly. Once you pick up this book you won't be able to put it down, I know I couldn't."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVO11V65MZQCA"
                },
                "Date": "on February 21, 2012",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": "This book is more of a story than it is actual science.  The foundation and basis of the theory is assumed rather than explained."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VHEJIR78OH7V"
                },
                "Date": "on December 28, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "my husband enjoyed getting this for Christmas!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IACRUW2CJ5U6"
                },
                "Date": "on September 30, 2005",
                "Helpfulness": 0.42857142857142855,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35H0XIWPU4Y39"
                },
                "Date": "on July 9, 2000",
                "Helpfulness": 0.42857142857142855,
                "StarRating": "3",
                "Text": "This book covers a wide area of modern physics as it title suggests, and  does so in an acceptably thorough manner, but the author often repeats  himself and often ends up beating a dead horse (or two-dimensial worm in  this case) with his tiring examples and writings. Overall, a good book to  read if a friend has it and you have no other access to any better books,  but not one to buy. There are better, more thorough,a nd more interesting  books."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KNHFFJWDSNZU"
                },
                "Date": "on May 28, 2004",
                "Helpfulness": 0.4,
                "StarRating": "5",
                "Text": "VERY GOOD book written by the extremely smart and well-rounded scientist. Very easy to follow."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XRJ0IYZ093KN"
                },
                "Date": "on August 22, 2006",
                "Helpfulness": 0.42857142857142855,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 29, 1999",
                "Helpfulness": 0.25,
                "StarRating": "4",
                "Text": "It almost looks open-minded. Michio Kaku has pulled off a superb piece of multidimensional propaganda for a ``state-of-the-art`` academic ``science``  in urgent dead need for inflationary public expansion. It is such a clever  and underhanded way of acknowledging, but dismissing, the original fidings  of the pioneers of radio and TV who more than proved survival after death  and tried (unsuccessfully), to formalize their  findings in a  multidimensional theoretical context. Kaku is (honestly!), a very good and  kind guy (he replied very enthusiastically to one of my e-mails!), but in  my view he is being grossly used by the shadowy high priests of an academic  dogmatism that still refuses to die.  .-Conrado Salas"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RHXQTYF30CM9"
                },
                "Date": "on July 17, 2006",
                "Helpfulness": 0.4444444444444444,
                "StarRating": "3",
                "Text": "The book is a bit outdated, as to be expected, and does not include M theory, the theoretical, incomplete theory unifying the many string theories.  The book used too many technical terms without explaining them in depth.  As the pages went on these terms built up until I was pretty lost.  I just figured it was due to the complexity of the subject but then I research it online and find a very short webpage that described things wonderfully."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SFAUH5IHPERT"
                },
                "Date": "on August 8, 2002",
                "Helpfulness": 0.47058823529411764,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on November 23, 2001",
                "Helpfulness": 0.47368421052631576,
                "StarRating": "2",
                "Text": "I praise Kaku's lucid literary writing style, but condemn everything else about this popular physics book. Kaku mystifies physics and makes it look like some sort of cult which deals with surreal objects such as \"hyper-dimensions\" and \"warped space\" - whatever those things mean to the average person who hasn't completed his PhD in supersymmetry. Reading Kaku's book is similar to reading a science fiction novel or watching an episode of star trek - things that have nothing to do in practice with physics. What ever happened to wondering about why the sky is blue, or how a radio works? Geez ... if you're into mysticism, try this book. If you're into physics, try another."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFK5GK0XYXY1C"
                },
                "Date": "on May 2, 2005",
                "Helpfulness": 0.35714285714285715,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 4, 1999",
                "Helpfulness": 0.4918032786885246,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4QBJJ9YC59WE"
                },
                "Date": "on September 12, 2009",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I appreciate the speedy transaction and the fine quality of the book I received. I'll purchase from this seller again in the future!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 28, 1998",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "1",
                "Text": "Yet another physics popularization, this one with a dose of politics.  The discussion of dimensions was done better by Rudy Rucker's book _The Fourth Dimension_, and the physics is explained more clearly in Kip Thorne's book  _Black Holes and Time Warps: Einstein's Outrageous Legacy_."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on September 12, 2002",
                "Helpfulness": 0.2727272727272727,
                "StarRating": "5",
                "Text": "I just got it today but its great, lots of great ilistrations. If your thinking about geting it, get it."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 12, 1999",
                "Helpfulness": 0.4444444444444444,
                "StarRating": "1",
                "Text": "If you want to be able to chat about neat physics ideas at a cocktail party and feel like you are really having an intelligent conversation about cosmology and Physics, read this book. If you want to really understand  something, pick up a college physics textbook- I would recommend Feynman's  Lectures. I strongly agree with a previous reviewer that this is one of  those books that while you read it, you think you have learned something  when you really have not- thats the problem with analogy- it always gets  bogged down in philosophy rather than real science. String Theory now more  than ever seems incapable of being proven, so it is a useless theory... it  seems like many string theorists have realized this fact, so they have  turned to writing books and coming up with lots of analogies to explain the  inexplicable... Without the experimental proof, this theory continues to be  elegant science fiction.  P.S. I am an Applied Physics grad. student in  case your curious about my background"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OA0QSBGST2CG"
                },
                "Date": "on May 10, 2002",
                "Helpfulness": 0.425531914893617,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on January 28, 2002",
                "Helpfulness": 0.125,
                "StarRating": "3",
                "Text": "The author presents the subject matter in an interesting way.  He should stay away from the topic of evolution and religion, though."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MXA8PBST8SYC"
                },
                "Date": "on December 19, 2011",
                "Helpfulness": 0.18181818181818182,
                "StarRating": "1",
                "Text": "I have read two of his books and am convinced he has no writing skills and his popular science books are just science fiction. There is no attempt to explain hard science principles in layman terms. The books are just chatter and after two chapters I am putting all his books in the \"white elephant christmas party\" gift wraps of our department!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AABVQ6A9BD5V"
                },
                "Date": "on November 22, 2000",
                "Helpfulness": 0.3225806451612903,
                "StarRating": "1",
                "Text": "I usually like books about weird science, but I have to say that this one didn't grab me-- maybe because I got to it right after reading Kip Thorne's book on Black Holes and Time Warps.  It's ok, but didn't seem special."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALUUKSTOOI9FA"
                },
                "Date": "on June 29, 2003",
                "Helpfulness": 0.11764705882352941,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 12, 2000",
                "Helpfulness": 0.3150684931506849,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 14, 1999",
                "Helpfulness": 0.23684210526315788,
                "StarRating": "1",
                "Text": "Poorly constructed sentences, fuzzy descriptions, inappropriate tone, self-serving references, opinion mixed with \"fact\" - this book has it all. The book is an embarassment."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EG4SXUN31AZT"
                },
                "Date": "on May 27, 2002",
                "Helpfulness": 0.24,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YO2ED0UWZXI3"
                },
                "Date": "on May 10, 2002",
                "Helpfulness": 0.05,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36A8HVVVBOA1W"
                },
                "Date": "on May 27, 2002",
                "Helpfulness": 0.12903225806451613,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZWSIL96PFDBJ"
                },
                "Date": "on November 12, 2010",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": "never received book, never received refund as promised. Getting unhappy with amazon. Can't even find customer service number to call."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Hyperspace-Scientific-Parallel-Universes-Dimension/product-reviews/0385477058/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "277"
    },
    "Salesrank": "#28,136",
    "Timestamp": "2015-05-24 13:20:55.319537",
    "itemurl": "http://www.amazon.com/Hyperspace-Scientific-Parallel-Universes-Dimension/dp/0385477058"
}
