{
    "Category": "in Books (",
    "ListPrice": "$15.99",
    "Name": [
        "The Body Electric: Electromagnetism And The Foundation Of Life"
    ],
    "OfferPrice": "$11.14",
    "Reviews": {
        "AverageStarRating": "4.6 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37KIH2KMAXDFW"
                },
                "Date": "on November 28, 2003",
                "Helpfulness": 0.9550561797752809,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A356ZF6U1I9R1F"
                },
                "Date": "on January 20, 2004",
                "Helpfulness": 0.9633507853403142,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQDMG28ILLNW4"
                },
                "Date": "on June 15, 2004",
                "Helpfulness": 0.9461077844311377,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VPRWEPH6C823"
                },
                "Date": "on March 25, 2003",
                "Helpfulness": 0.9375,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2E5VNFZVVB2HD"
                },
                "Date": "on June 9, 2004",
                "Helpfulness": 0.9516129032258065,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3T5NSG7LMRY0A"
                },
                "Date": "on August 18, 2007",
                "Helpfulness": 0.975609756097561,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5WMBIOGE8Q6N"
                },
                "Date": "on January 2, 2006",
                "Helpfulness": 0.9555555555555556,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1X4W52SIAOR2A"
                },
                "Date": "on March 12, 2001",
                "Helpfulness": 0.9512195121951219,
                "StarRating": "5",
                "Text": "\"The Body Electric\" is a ground-breaking dissertation on human health as it relates to small electrical fields.  Being a scientist, I was suspicious of the book's initial hypothesis, but I was later convinced by the overwhelming clinical data provided in the book.  Very well written, easy to read, and extremely valuable.  I highly recommend this book."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 11, 1999",
                "Helpfulness": 0.9696969696969697,
                "StarRating": "4",
                "Text": "This is a book that will enlighten a lay person that has limited knowledge in the sciences and interest the educated. It focuses on: Regeneration, Politics in Medicine, and Electromagnetic pollution. It slows down a bit  when the author chooses to voice his opinions on politics in the medical  field, but quickly picks up in the end when he explores the effects of  electro-magnetic fields on the human body. I recommend this book because,  in short, I found it very interesting."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3M3OR35XTFPN4"
                },
                "Date": "on April 7, 2001",
                "Helpfulness": 0.967741935483871,
                "StarRating": "5",
                "Text": "I first read this book nearly 10 years ago and it started me down a path of exploration that hasn't ended yet. Read it, and then look at its bibliography, and read a few of those books. I first picked it up because it was quoted in another book I love. I have no technical training in this area but I understood it and loved it. Very mind expanding!!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYXTL2TLT88TM"
                },
                "Date": "on November 3, 1998",
                "Helpfulness": 0.9642857142857143,
                "StarRating": "5",
                "Text": "Robert O. Becker, the 20th century pioneer of research in bioelectric phenomena, does a masterful job of leading the reader into the invisible yet profound world of electromagnetism and its effect on all living  organisms.  At times awe-inspiring, at others frightening, Becker ends his  book with more questions posed than answered, both in the realm of medical  implications of tissue regeneration and in the realm of electropollution  and its possible ramifications for our industrialized society.  An  excellent book for the intellectually curious."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OD54F3CBG2C"
                },
                "Date": "on April 3, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4N0S51DFI3LS"
                },
                "Date": "on August 12, 2006",
                "Helpfulness": 0.9259259259259259,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYT0T7D3LWHK3"
                },
                "Date": "on May 5, 1998",
                "Helpfulness": 0.95,
                "StarRating": "5",
                "Text": "Utterly profound.  This book begins with a eye opening look into the life work of two doctors unafraid of going against the medical/polital grain.  Their work discuses how many of earths creatures can regenerate many of their organs inclding their heart, eyes, and brain and their semi-succesful attempts in human subjects.  But the tail end of this work takes a gloomy and discouraging turn as it discloses the side effects of electromagentism, which we live in every day, and the governments attempts to shelve all evidence."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FA802MJ6SPSU"
                },
                "Date": "on April 15, 2001",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2C5GGOSNFSQPZ"
                },
                "Date": "on October 6, 2008",
                "Helpfulness": 0.95,
                "StarRating": "5",
                "Text": "This is an amazing book.  It's required reading.  After watching a friends severed fingertip grow back (No it wasn't sewn on, it literally grew back with nail and all), this book goes right along with what I've seen with my own eyes."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3T3V9PQ67CMVK"
                },
                "Date": "on October 29, 2008",
                "Helpfulness": 0.9411764705882353,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OJEMIA900QX"
                },
                "Date": "on September 26, 2002",
                "Helpfulness": 0.8846153846153846,
                "StarRating": "5",
                "Text": "This book is just brilliant. Lots to think about especially relating to cancer. I'd love to know the current research along his lines. I have seen there are a couple of researchers following in his footsteps, but not nearly enough. There was just an interesting article about limb regeneration in the New York Tuesday September 24 2002 in case the above link doesn't work anymore). But no mention of his work on the electric effect Becker worked on. What a shame they seem to be missing this part of the puzzle."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on September 24, 1998",
                "Helpfulness": 0.9375,
                "StarRating": "5",
                "Text": "Written so that the lay reader experiences the sense of adventure, the  frustrations, and the triumphs as some of life's most fundamental secrets  are revealed and lucidly explained. A classic with far reaching  implications into our daily life, written by a man with impeccable and  possibly unique credentials in this field."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27AXE0KQAGO2K"
                },
                "Date": "on March 11, 2000",
                "Helpfulness": 0.8620689655172413,
                "StarRating": "5",
                "Text": "I have read many books on similar topics and none even come close to this one.  Well documented, exciting, easy to read, exciting, logical, exciting, good pictures, did I mention exciting? Really gets you into the book, hard to put down."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NYYFSXTU7OHL"
                },
                "Date": "on August 8, 2006",
                "Helpfulness": 0.8070175438596491,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17X4L5GKQXLV"
                },
                "Date": "on August 23, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2C7VMN9UAYYDW"
                },
                "Date": "on November 22, 2012",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANDR87NHHVP9"
                },
                "Date": "on August 23, 2010",
                "Helpfulness": 0.9090909090909091,
                "StarRating": "5",
                "Text": "Body Electric is chucked full of interesting history of laboratory experimentation and telling results, which uncovered our electrical interconnection with the earth's magnetic makeup, all living things, and the solar system's effects on all life. I had trouble putting the book down to take care of daily business. What a great read!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JO7CGBSO67KS"
                },
                "Date": "on January 9, 2007",
                "Helpfulness": 0.8666666666666667,
                "StarRating": "5",
                "Text": "If you are pretty well versed in physiology and basic biology, you will probably love this book! As an engineer and experimental scientist Dr. Becker opened my eyes to a whole new area of study which, politics aside, has the potential to change almost every person's life."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1A1W3GP06WND9"
                },
                "Date": "on February 5, 2007",
                "Helpfulness": 0.8095238095238095,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27Q5WRSF11KX0"
                },
                "Date": "on July 29, 2010",
                "Helpfulness": 0.8235294117647058,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AN96O3E0W2UP1"
                },
                "Date": "on October 5, 2010",
                "Helpfulness": 0.9,
                "StarRating": "5",
                "Text": "Becker did it right.  He started with his own research and how he discovered that the work of Royal Rife and Dr. Tennant is correct, that electromedicine is a way to heal bones, kill microbes and even effect cancers.  I recommend it for anyone interested in alternative medical practices that work."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4RM4FMSKL9YS"
                },
                "Date": "on February 17, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFM9DJYPNM7VT"
                },
                "Date": "on March 27, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALJV92MSX4D9W"
                },
                "Date": "on July 13, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I first read this as a library book after seeing it cited in many a bibliography, and quickly realized that I must own a copy for my own collection.  The Body Electric is considered a classic in the field of bio-field research, and for good reason: Becker was one of the first to realize that our bodies are semiconductors of electricity.  He was ridiculed at the time, but now the world of medical science takes this fact as a given.  As Director Orthopedic Surgery at the VA hospital in Syracuse, he successfully used electrified silver ions to regenerate bone growth in otherwise hopeless medical case.  Did you know that young children can regrow severed fingertips?  Or that DC currents can be used to anesthetize patients as well as chemical gasses?  I sure didn't. Most fascinating of all to me is Becker's theory that humans evolved from crystalline mineral structures in the sea, rather than from plant-like algae.  His postulation that magnetic crystals would probably be found to exist in the human brain has since proven to be true and embraced as fact.  Becker was a true pioneer."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8OY7QEVDSZ49"
                },
                "Date": "on March 10, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Robert Becker MD spent decades studying electricity, healing and regeneration in humans, but mostly in animals. He recounted his researches, gleanings, and travails in this book. The book could have been half as long and still gotten the important stuff across. The narrative was too heavy on technicalities for my blood and I am a trained physician. Engineers would get more out of the book than physicians. Which Becker might have admitted. Physicians generally shy away from Electromagnetism and the like. Becker spoke to that situation often in his Body Electric. The book is not for the dilettante."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JKA9MUFZ6N88"
                },
                "Date": "on April 13, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I read this book a number of years ago. The information contained in this book is top notch and  not readily accessible elsewhere. I constantly find myself going back to this book again and again as a reference for my own work. What more can I say? Five stars all the way."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NDV2PE0V9VDM"
                },
                "Date": "on April 11, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Dr. Becker's voice comes through clearly in this book.  You will be amazed at the life forces he brings forward in the first part of the book.  It will make you envision an entirely different reality for our world.  We could all be living and thriving in a much healthier world if his experiments had been sufficiently funded and supported by the establishment.  The fact that this book was written almost 30 years ago should not deter you from reading it - it will show you that biological effects of EMR & EMFs have been evident since the 60's, and that Becker was one of the people that tried to protect the safety of the public from the proliferation of these fields.  This book is totally relevant today with the concerns of bombardment of man-made electromagnetic radio frequencies effecting human health.  His coverage of the military use of the spectrum brings out the dark side of humanity."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LU72XFNBTXIS"
                },
                "Date": "on June 4, 2010",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": "This is a fascinating book that explains the relationship between the human body and the body's electrical system. I highly recommend this book for those in the healing arts and for those who are simply interested in understanding the correlations between good health and the body's electrical system."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IO12ZBF9YT86"
                },
                "Date": "on March 17, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXHXW3QOBEV2T"
                },
                "Date": "on January 28, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12BXRYHHYP4DK"
                },
                "Date": "on February 8, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I received a toxic brain exposure in 2009 from a high powered utility solar photovoltaic system that I was commissioning that left me with significant memory issues.  This was one of the many books that I purchased to try and understand what had happened to me.  The book does a good job of explaining the research that the authors were performing in the area of electrical cellular regeneration and the techniques that they were using.  Today, we know that irradiating water with certain radio frequencies can alter the growth rates of mammals that drink it!  The book is a good overview about what was known in 1985 and it is surprising to see how much was known back then and the extensive denials of this information that corporations and governments are routinely engaging in today.  As Devra Davis states \"Most people have no idea that OSHA is a ghost and has been so for years\".  Since that time cell phones, cell phone towers and radio frequency (RF) transmitting meters have come along and our knowledge has progressed.  I found that I had to develop my own knowledge in this area to deal with the more recent environmental exposures that this book does not cover.  This book is an excellent foundation in the electrical dynamics of the human body that you would want to supplement with the more recent health books regarding alternate energy systems, cellular communications and transmitting RF utility meters."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TY4Y65VH81HK"
                },
                "Date": "on August 24, 2009",
                "Helpfulness": 0.7777777777777778,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AD5BVSSJKJS9B"
                },
                "Date": "on September 30, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Wow! What a book! Its amazing that we hear almost nothing about how its possible to regenerate parts of the body with electricity. Becker does a great job going over the basics of electircs and the body as well as explaining his research projects. This book really opens up a worm hole. Highly suggested even though its now slightly out of date (but the research surprisingly isn't!) Buy it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1G0GSKBW2P07S"
                },
                "Date": "on January 17, 2015",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "First sections of book are just interesting but book really starts to hum in later chapters as human effects of electricity and EMR are discussed.  Good introductory reading (later chapters) for anyone wanting to study current US government geo-engineering programs and related effects on human beings."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2F4CFDTQK28I4"
                },
                "Date": "on June 4, 2009",
                "Helpfulness": 0.7272727272727273,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOB20HD4O8UUL"
                },
                "Date": "on August 6, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This changed how I view the world. I could always feel energy, but this book took it out of the world of mysticism and gave some science to it. very interesting read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BELYA5XPUF7O"
                },
                "Date": "on January 10, 2011",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": "This book doesn't disappoint.  It is an facinating read even if your not a science buff.  The content is insightful and sheds light on the state of our medical industry."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9U7Z6075DF78"
                },
                "Date": "on March 1, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Fascinating, fascinating read.  I'm quite late on writing the review, but I enjoyed this book so much I'll read it multiple times."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13TW696LER085"
                },
                "Date": "on November 13, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23WMNH6Q4B714"
                },
                "Date": "on November 30, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10PBSVEYJEA6I"
                },
                "Date": "on September 27, 2014",
                "Helpfulness": 0.75,
                "StarRating": "3",
                "Text": "The scope of the book is quite wide, and they are no doubt brilliant authors and they've put a lot of effort into this, but unless you are very close to getting your MD, you'll have a tough time reading through this.  It is a much more technical book than one would expect.  So, while the subject matter is very engaging and important, like most \"very smart\" people, they've somehow made the decision to write this for a select few, rather than for the public at large, who ironically, could benefit greatly from the subject matter.  Oh, well...What else is new!?"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4RYJCI441DTX"
                },
                "Date": "on December 11, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "In depth book that gives much insight into the Body's Electrical system and explains the numerous studies and experiments that were done.  This book will also link you with a better understanding about the connection of Esoteric studies concerning the Energy Meridians...  I just happen to draw the parallel myself, since this is what I'm currently studying.  This book doesn't get into that but it all ties in.."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OH995FWTVK3Q"
                },
                "Date": "on March 21, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25RCXGBV6FD6W"
                },
                "Date": "on May 31, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AE44PVZ3F55D"
                },
                "Date": "on July 13, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Many books are not worth reading cover to cover, this book was one of the exceptions. I'm not going to rehash what has been said by other 4 and 5 star reviewers, rather I'm going to say, Dido! Dr. Becker, thank you!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GCWYW6AXXQAO"
                },
                "Date": "on April 28, 2013",
                "Helpfulness": 0.75,
                "StarRating": "4",
                "Text": "Still reading it. Condition of book was good. I'm enjoying it but the content is hard to understand. Perhaps a physics major could zip through it but for me it's a hard read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AP3UDM5VJTY"
                },
                "Date": "on December 14, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book requires the reader to think and ponder the ideas presented, but as a Biomedical Engineer I found it to be excellent and very inciteful.  Robert Becker did a great job!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KZLD88V0RC2Y"
                },
                "Date": "on February 13, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Read it.  Astonishing.  I ordered it in Salt Lake City from Texas at the library and just never forgot it.  To this day I use these methods in my natural healing work."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2R4F6GF0W6SRX"
                },
                "Date": "on January 17, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Dr. Robert O. Becker is an honest man with a lot of integrity. He is telling several stories here. One is about the truth of the relationship between organic matter and electricity/electromagnetism. A second is the story of infighting, backstabbing and fraud in the research community. A third story is about the political structure and hierarchy that controls research and progress by blocking, subverting and other corrupt practices, while supporting cronies and those with political power. These are all elements in a genuine biographic thriller that is must reading. You will understand why there is so much corrupt data and why much science is really just politics. Well written with many good, simple diagrams. The science is clearly explained for the layman and kept simple as possible. I am amazed this book is still available and has not \"disappeared\". Buy two. I promise you will want to keep it and also give one to the right friend."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34BJ6TIJCOIPF"
                },
                "Date": "on April 14, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "It gives you insight about how living organism work..It tells you that living things are made of more than just chemistry."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VWWK21FPIZU"
                },
                "Date": "on June 9, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": ". it explores so many aspects of health that are new and exciting.  I am determined to learn all it has to offer!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35NW5XCQ13568"
                },
                "Date": "on October 26, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SCHZRMZMHLTR"
                },
                "Date": "on February 2, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Great read if you are interested in other outlooks of medicine."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZB9ABR34X2TI"
                },
                "Date": "on February 27, 2006",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "This provides the missing link with respect to the transfer of energy as it activates the healing process at a cellular level."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7FSJ38T6ZJZM"
                },
                "Date": "on December 26, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Becker's \"Body Electric\" is the story of the author's research experiences with electromagnetism and its effects on living tissue.  It is detailed, interesting, and profound.  For me it connects to the electro-plasma theory espoused by the guys at Thunderbolts.org.  That is, electricity is the foundation of existence.  The universe is connected by it (and not by gravity), we communicate with it (esp), and life develops using it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4CZDMHVHAZEJ"
                },
                "Date": "on January 15, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I'm reading this as i travel so haven't finished yet. its very interesting research written in a easy to read way...sadly seems the author got the short end of the stick a lot. i think it would be a stronger read if some of this were left out some of his obstacles and  just talked about the awesomeness of his research findings but it isn't stopping me from reading. The topic is too interesting..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3V2QDIZWXQQUN"
                },
                "Date": "on December 3, 2011",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BVBI0WC4PQF1"
                },
                "Date": "on September 13, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AU7LL3DRX26W"
                },
                "Date": "on May 2, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Really good if you want to be well versed on cutting edge thinking. This book is referred to by many authors who I respect and is mentioned in Joel Wallachs books. Fills in a lot of information, bringing together my practices"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BIU9ESOZ73PS"
                },
                "Date": "on March 27, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I enjoyed this book very much.  It was written for everyone to understand with plenty of pictures and diagrams where needed.  Covering a wide range of areas where electricity can effect the body positively and negatively."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FMZD5C276D4J"
                },
                "Date": "on June 13, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Over the years I have purchased many copies of this book to give to friends and relatives who have an interest in the medical, scientific or health fields. They all have told me that they really enjoyed the book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AK4GUS0Z4J0ZY"
                },
                "Date": "on October 19, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is a wonderful book for someone learning more about subtle vibrations and energies of all things on this earth, and beyond.  I am glad that I have it , to read and then keep, as a reference."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BSVN9TBKKOUQ"
                },
                "Date": "on December 31, 2010",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "This is an amazing book well ahead of its time, and extremely important to anyone who is interested in healing, both the planet and ourselves."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JT6Y26IHXJQ8"
                },
                "Date": "on March 23, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This and, Cross Currents, by the same author, are very interesting and I appreciate having the information. The author has accomplished opening the minds of some of the medical profession."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31QUTLNSSL79Q"
                },
                "Date": "on May 10, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is a great book by a true scientist. His research is real and legitimate. I found the historical information especially on Burr enlightening. I highly recommend this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KACGK617JDGH"
                },
                "Date": "on January 11, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great shape it was a gift for my husband he likes books from that author and our son is going through treatment from cancer and an electrical shock andchemo treatment."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWCREO78MJMVU"
                },
                "Date": "on May 6, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A fascinating and courageous examination of the intriguinging connection between electricity and humans.their physiology and behavior.There is more to learn"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CCXXEZQHNZ3D"
                },
                "Date": "on December 8, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Amazing insights into the nature of the body, largely ignored by our medical \"establishment\" and \"science,\" so called."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MTIX4Z3VH0V2"
                },
                "Date": "on July 20, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "THIS IS AN EXCELLENT BOOK. IT EXPLAINS THE BASICS OF THE HUMAN BODY'S ELECRICAL SYSTEM. IT'S VERY INTERESTING AND INFORMATIVE."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ELD00TN7EP1T"
                },
                "Date": "on December 29, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Very good information on what electricity does in the body.  I have shared information about the book with several friends."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3G48VSNC3QJAQ"
                },
                "Date": "on March 27, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I haven't finished it yet bit it has been bedtime and breakfast reading for a few days now! Well worth the investment!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CEMSHQHPP157"
                },
                "Date": "on May 15, 2015",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": "The base information is good but this area is evolving to much to rely on a book published in 98."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2R48WN1HTG5IF"
                },
                "Date": "on October 13, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excelente libro que toda persona que trabaje a nivel de terapias energeticas deberia leer."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAS5A39A59JIC"
                },
                "Date": "on June 30, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent book. Been wanting to read this for the last ten years. Worth the wait!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A237YJF4IE1TGR"
                },
                "Date": "on October 24, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Never thought I would find this book. Let alone in excellent condition."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A677BFCUURR3A"
                },
                "Date": "on February 12, 2012",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "This contains the secret of life - exactly how your body works so you can look after your trillion little cells. Suitable for anyone with even the most rudimentary grasp of highschool science. After you read it also watch the HHMI Christmas lectures on stemcells and check out the TED talks lecture by Dr. Steven Badylack"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APJATPT1L8L1B"
                },
                "Date": "on December 9, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A must for all the medical community. Dr. Frankestein..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHXG6I71QMR3E"
                },
                "Date": "on October 12, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great book, a real eye opener."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANYTCA2UQ1CFQ"
                },
                "Date": "on October 15, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "very interesting"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11VAJ8HOQ2AOV"
                },
                "Date": "on July 24, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "thank you"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATJ7JZNBNQCLR"
                },
                "Date": "on February 2, 2014",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": "Well supported with scientific studies in an intelligible form about this obscure field as well as practical information about how to protect oneself."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AUAYR2NSPC49"
                },
                "Date": "on November 21, 2011",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I really believe theis book is on target.  If you want to know about the politics of medicine anr research this boook will explain it well.  If you want to gain better insight of evolution, acupuncture and othe psychic phenomena and healing start with this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2O4RD41R56VFA"
                },
                "Date": "on June 14, 2011",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": "Not a book to love, it is a book to like.  Very interesting and one that I will definitely add to my medical library.  I appreciate this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Z0B87YDDLL22"
                },
                "Date": "on February 3, 2015",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Very interesting read.  Loved it!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A327PUENBFGT6Y"
                },
                "Date": "on January 20, 2015",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "full of important esoteric info"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VI5PYJXS67VW"
                },
                "Date": "on January 12, 2013",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "4",
                "Text": "It is a very interesting book. I have not finished yet but so far it really seems to hold my interest."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8CF7WQRNTCR"
                },
                "Date": "on December 25, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "A must read for philosophers."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MJ8RDG362DLU"
                },
                "Date": "on April 11, 2015",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "will buy from seller again."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VGK1I8JLVFSJ"
                },
                "Date": "on March 26, 2013",
                "Helpfulness": 0.5333333333333333,
                "StarRating": "3",
                "Text": "While this is interesting research into the nature of energy through scientific investigation of creatures and plants, it did not give me the more practical information I was seeking."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MER4V6I6CWWX"
                },
                "Date": "on February 1, 2015",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "eye opening."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2V2MC35I7I511"
                },
                "Date": "on January 23, 2015",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Excellent !"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A361RKL1CWE6P2"
                },
                "Date": "on March 17, 2015",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "gift"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9YMY1TAUNBY7"
                },
                "Date": "on October 3, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "fine"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A357TV9WOLDABG"
                },
                "Date": "on April 29, 2015",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "meh"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGZBJSF6M5JSL"
                },
                "Date": "on January 6, 2013",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PQ615U3VHQ10"
                },
                "Date": "on February 26, 2015",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "Difficult read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30ZWICNQMG0T7"
                },
                "Date": "on October 28, 2014",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": "Not what I expected."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Z9IJ9O57654K"
                },
                "Date": "on September 12, 2007",
                "Helpfulness": 0.3302752293577982,
                "StarRating": "2",
                "Text": "The information was not what I expected in regard to a misleading title. Anyone in the acupuncture field, as I am, should not be persuaded to buy this book. It basically deals with reptilian experiments done 50 or more years ago. It is a biology book, in a sense. I wish I had not purchased it!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALDYWG0CPSYUF"
                },
                "Date": "on February 27, 2012",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": ". . . .But, interesting.  The seller delivered quickly and the book was in the condition described.  The fact that the book was not what I expected was my fault for not researching it enough."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BE5NAF33ZYZR"
                },
                "Date": "on February 9, 2013",
                "Helpfulness": 0.265625,
                "StarRating": "1",
                "Text": "With the exception of a few, the overwhelming majority of reviews of this book seem to just echo the book itself.  There is a tone of confirmation bias in all of these reviews.  It would appear that the majority of people who read this book were ready to believe in some far-reaching, institutional conspiracy and this book just feeds that need."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WWWRZIWMDY3Z"
                },
                "Date": "on May 8, 2009",
                "Helpfulness": 0.05263157894736842,
                "StarRating": "5",
                "Text": "The ordering process went well and I received my book as promised.  Thank you."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Body-Electric-Electromagnetism-Foundation-Life/product-reviews/0688069711/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "108"
    },
    "Salesrank": "#10,987",
    "Timestamp": "2015-05-24 13:43:03.765309",
    "itemurl": "http://www.amazon.com/Body-Electric-Electromagnetism-Foundation-Life/dp/0688069711"
}
