{
    "Category": "in Books (",
    "ListPrice": "$16.00",
    "Name": [
        "5 Steps to a 5 500 AP Physics Questions to Know by Test Day (5 Steps to a 5 on the Advanced Placement Examinations Series)"
    ],
    "OfferPrice": "$9.70",
    "Reviews": {
        "AverageStarRating": "1.6 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PFLD0R9VFSR0"
                },
                "Date": "on March 23, 2012",
                "Helpfulness": 1.0,
                "StarRating": "1",
                "Text": "This book is a list of 500 physics problems with answers provided in the back. Some of the problems are very good, and it is a good review for someone already experienced and is just looking for a review. It will be frustrating as a study guide for the AP exam, unless you are up for the challenge of finding their errors. It is well organized into the logical sections for the AP exam, but unfortunately, it contains numerous serious errors. About 10% of the problems exhibit fundamental errors in physics knowledge or some other error resulting in the correct answer not being shown in the multiple choice list. Other problems suffer because they are not well posed - that is, it is not possible to determine the problem statement. Here is a partial list of the problems that I have identified so far as having significant errors: 7, 9, 23, 25, 46, 58, 61, 72, 80, 95, 101, 103, 119c, 146, 165, 178, 180, 183, 191, 210, 214, 232, 235, 236, 241, 266, 268, 269, 270, 286. These are just in the first 300 problems. All of the cross product problems are incorrect (9, 23, 25). Some of the kinetic energy problems are worked incorrectly because the \"change-in-V\" was squared rather than using the difference in V-squared (165, 180). There are numerous math errors, some with a result off by more than a factor of a million (183). In many problems, a different value was used in the answer than stated in the problem statement (61, 72, 146, 286). In some problems the answer is wrong because a critical parameter was treated as constant when it actualy changed (119, 269). In other problems, there are additional minor errors such as incorrect units (111, 132, 137, 270). I have concern for students trying to learn from this book. Note that this book is not endorsed by the College Entrance Examination Board. Overall, I would declare this book as \"unacceptable\" as a study guide for its intended purpose."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWYB5MAQSYNBI"
                },
                "Date": "on May 12, 2013",
                "Helpfulness": 1.0,
                "StarRating": "1",
                "Text": "It's incredibly frustrating to constantly have to figure out whether I'm wrong or the book is wrong. And in many cases the book was wrong! I began to question fundamentals that i know are true because the book was incorrect. I like the concept of this style of review book, but it's terrible that it's so flawed!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5NY9XD9LBPXB"
                },
                "Date": "on February 26, 2013",
                "Helpfulness": 1.0,
                "StarRating": "1",
                "Text": "I'm not sure if the book had more questions with mistakes than questions without mistakes but it definitely came close. I don't recommend this book to anyone who wants above a 1 on their AP exam. But if you want to do better than all your friends on the exam tell them to buy this book (or if you're desperate, buy it for them) and they won't stand a chance against you (but you might not have any more friends afterwards)."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AHCFQETFKFZ1"
                },
                "Date": "on May 14, 2012",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "1",
                "Text": "The fifth step? Burn this volume in effigy and get the College Board's official \"released exams\" instead. No hard feelings to McGraw Hill, but this book is a joke."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HJ2JJMN9DGVH"
                },
                "Date": "on April 10, 2015",
                "Helpfulness": "",
                "StarRating": "1",
                "Text": "Bad book. If there is a zero star, I will give one."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LX62I2T1B2NX"
                },
                "Date": "on April 10, 2015",
                "Helpfulness": "",
                "StarRating": "1",
                "Text": "Totally BULLS***."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A361GL21R180RJ"
                },
                "Date": "on August 17, 2012",
                "Helpfulness": 0.25,
                "StarRating": "5",
                "Text": "If you are looking for something to TEACH the physics needed for the AP Test, then you are in the wrong place.  If you already KNOW the physics, and want to practice, then you are in the right place! This is the workbook to get you used to reading and interpreting word problems like you will see on the test.  Use it that way, and you will find it very useful. Like to old saying goes, \"How do you get to Carnegie Hall?\"  \"Practice, Practice, Practice!\""
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Physics-Questions-Advanced-Placement-Examinations/product-reviews/0071780726/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "7"
    },
    "Salesrank": "#647,584",
    "Timestamp": "2015-05-24 13:32:35.298074",
    "itemurl": "http://www.amazon.com/Physics-Questions-Advanced-Placement-Examinations/dp/0071780726"
}
