{
    "Category": "in Books (",
    "ListPrice": "$15.95",
    "Name": [
        "Collider: The Search for the World's Smallest Particles"
    ],
    "OfferPrice": "$12.82",
    "Reviews": {
        "AverageStarRating": "4.0 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MLXGN1VE5PR1"
                },
                "Date": "on August 2, 2009",
                "Helpfulness": 0.9,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADGFHAEZYURLV"
                },
                "Date": "on August 28, 2009",
                "Helpfulness": 0.8888888888888888,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAWREHJSE4LDL"
                },
                "Date": "on October 22, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31RRSFY19FLBI"
                },
                "Date": "on August 27, 2009",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2J0LCXN3HUCO5"
                },
                "Date": "on August 27, 2009",
                "Helpfulness": 0.72,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WU2GH2HFC7D2"
                },
                "Date": "on August 12, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XSND15WEU143"
                },
                "Date": "on October 1, 2009",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": "Once again Dr. Halpern has managed to take a highly complex subject and help us non-physicists not just understand but appreciate the joy, frustration, and human drama of discovery.  Writing on a technically dense subject such as particle physics with a light touch is not easy, but he pulls it off.  His highly accessible analogies elucidate the most complex of theories, showing us that human imagination is critical to the advancement of science.  Haplern's whimsical, lighthearted moments on the page are the match of Stephen Hawking and then some.  His miniature biographies of scientists, such as Fermi, could be a worthwhile book in themselves.  As an engineer I can appreciate the challenges of research and experimentation, and as a human being in the twentieth century I can only feel lucky to be alive in a time where astonishment is the order of the day when it comes to achievements in particle physics.  Thanks to Halpern for keeping it real!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIZ25HDI0ZJWZ"
                },
                "Date": "on November 16, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JZ4B9005Q1KU"
                },
                "Date": "on September 3, 2011",
                "Helpfulness": 0.75,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXW444VIV75UF"
                },
                "Date": "on June 13, 2010",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AG212WE6M4O5D"
                },
                "Date": "on November 15, 2009",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35T1GYDK0PRPO"
                },
                "Date": "on September 1, 2009",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AX2TAYC1S068W"
                },
                "Date": "on September 1, 2009",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "Just finished reading Collider. Made the physics come alive, with humor and helpful fun analogies. Besides explaining the inner workings, I thought the writers background information and humorous insight made the book enjoyable reading."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30M3DBW5MFC3R"
                },
                "Date": "on July 28, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANO063NE8GC1N"
                },
                "Date": "on July 10, 2010",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AI9YK9QJG7ZM"
                },
                "Date": "on October 9, 2009",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1D1P9JQKWW8N"
                },
                "Date": "on October 31, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent all the way around. I would buy from them again. Very satisfied overall."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11HHF5NYWT4HG"
                },
                "Date": "on October 30, 2009",
                "Helpfulness": 0.5714285714285714,
                "StarRating": "3",
                "Text": "This is a good historical review of the search, but it is all words; a few grainy B&W; pics, but I was expecting lots of great pics of the new collider, diagrams, etc.  Not recommended for the general public; you will get tired soon."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACE8JFORXQZMM"
                },
                "Date": "on October 12, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "great! thank you"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AO945ETOO2BHZ"
                },
                "Date": "on September 1, 2009",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "This book is great for the novice!  Halpern makes physics both interesting and accessible."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACOAH4EE4OEK6"
                },
                "Date": "on August 31, 2009",
                "Helpfulness": 0.5714285714285714,
                "StarRating": "1",
                "Text": "As a particle physicist I have to comment on the serious misconceptions in this book that purports to explain the purpose and functioning of the Large Hadron Collider at CERN, Switzerland.  \"Collider: The Search for the World's Smallest Particles\" is simply wrong.  I am appalled that a person who calls himself a \"physicist\" can say such false things.  The smallest particle is a photon, a particle of light, which has no mass.  The next smallest particle, which has a tiny mass, is the neutrino (and there are three kinds of them); then come the up and down quarks, electrons, and then larger particles.  The Large Hadron Collider's purpose is NOT to search for ANY of these \"smallest particles\" mentioned above.  The title of this pretentious and unenlightening book is therefore completely false.  What, then, is the purpose of the Large Hadron Collider?  Almost everyone who reads newspapers or watches television, or even gets news through the Internet, knows by now that one of the main aims of the LHC is to search for the so-called \"Higgs Boson\"--the \"God particle\" as some have called it (that name comes from Nobel Laureate Leon Lederman)--named after the Scottish physicist Peter Higgs.  Another main purpose is to look for \"Superpartners\"--particles that derive from the mathematical theory of Supersymmetry.  These are, like the Higgs, particles that are hypothesized to exist but have never been seen before.  NONE of these particles, the Higgs and the Superpartners, are among \"the World's Smallest Particles\" as the title of this confused book claims.  The Higgs may have different levels of mass, we are not yet sure exactly where it lies (we haven't found it yet!), but from recent experiments at Fermilab near Chicago (which has less power than the LHC, about 2 TeV, while the LHC will get to 7 TeV and later to a max of 14 TeV), we already know that the Higgs boson cannot be any lighter than about 119 GeV.  Now, the GeV is a unit of energy, and also MASS, because by Einstein's formula E=mc-square, mass and energy are equivalent.  Without getting into technical details, the electron--far from the \"smallest\" particle--has mass-energy of 0.5 GeV, thus hundreds of times smaller.  So this should give you a rough idea about how \"large\"--in terms of mass--the missing Higgs really is.  The neutrino, by the way, is many orders of magnitude LIGHTER than the electron.  So the Higgs boson is very, very far from being a \"smallest\" particle.  The same is true of the Superpartner particles that are searched for in the LHC.  These, too, have masses that are large, and like the Higgs boson, their masses could be hundreds of times larger than that of the electron (and many thousands of times larger than that of a neutrino).  The LHC is not looking for small particles, although the uninitiated may like the analogy of looking smaller and smaller things.  The LHC is looking for rather massive particles that are \"hiding\" in space, in what physicists call the vacuum.  But if they are nor small, why can't we see them?  Good question.  To understand what's going on you need to grasp two main concepts.  One is the Einstein equation mentioned above.  This equation allows us--through the immense power of the LHC--to convert particles into energy (the LHC crashes protons, which by the way are also very far from \"smallest\" particles).  Then, using the same formula, the energy is converted into mass (if E=mc-square, then m=E/c-square, see?).  This mass appears as particles.  They are heavy particles that we don't see every day.  Why not?  Here comes the second relationship you need to understand, called the Heisenberg Uncertainty Principle.  It says (in this context) that if you want to \"see\" a large (meaning massive) particle, you must observe it during a very, very short interval of time (technically, the larger the uncertinty in mass, the smaller the uncertainty in time--hence large mass goes with a \"precise\" time interval, that is, an extremely short one).  The LHC's energy from the crashed protons allows this large energy-mass to reappear--for a very short instant of time, something like 10 to the minus 12 seconds or less--in the form of an unstable, unseen particle.  Such a massive particle can be a Higgs or a large superpartner.  In fact, the predecessor of the LHC, called LEP, helped physicists discover the last massive hidden particles, called the W and Z bosons, which are also many times heavier than the electron.  So why don't we see these massive particles in everyday life?  Well, according to the modern theory in physics, based on fields (called quantum field theory), the unstable heavy particles such as the W, the Z, the Higgs, etc., are really excitations of fields.  Normally, the field is not excited (it doesn't have much energy); but the LHC collisions excite the field (the Higgs field, or the fields of the other particles) by providing it with energy.  The roiled field (think of someone jumping up and down on a springy mattress--this analogy comes from a great book I recommend, \"Quantum Field Theory in a Nutshell,\" by A. Zee) creates waves, and (roughly speaking) another quantum principle says that a wave is also a particle.  So this is how we see the heavy hidden particle through the LHC!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32IYHDV0ATWIK"
                },
                "Date": "on August 27, 2009",
                "Helpfulness": 0.29411764705882354,
                "StarRating": "1",
                "Text": "I disagree with the previous writer comparing the author to Carl Sagan.  This is a bit of an exaggeration.  This book didn't do it for me at all.  The descriptions and explanations of the LHC are not done well, nor completely, and the physics is either lacking or incomprehensible.  Try Leonard Susskind's \"Black Hole War,\" or Lisa Randall's \"Warped Passages,\" or any of Michio Kaku's books, or Paul Davis's books."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Collider-Search-Worlds-Smallest-Particles/product-reviews/0470643919/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "22"
    },
    "Salesrank": "#382,109",
    "Timestamp": "2015-05-24 13:09:43.858882",
    "itemurl": "http://www.amazon.com/Collider-Search-Worlds-Smallest-Particles/dp/0470643919"
}
