{
    "Category": "in Books (",
    "ListPrice": "$16.99",
    "Name": [
        "The Physics of Star Trek"
    ],
    "OfferPrice": "$13.36",
    "Reviews": {
        "AverageStarRating": "4.4 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1K1JW1C5CUSUZ"
                },
                "Date": "on August 3, 2001",
                "Helpfulness": 0.9393939393939394,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJODIMJX61856"
                },
                "Date": "on November 15, 1998",
                "Helpfulness": 0.9210526315789473,
                "StarRating": "4",
                "Text": "As both a Star Trek (old series) fan and popular science reader, I was greatly intrigued to see Lawrence Krauss' The Physics of Star Trek at my local bookstore.  Often disappointed by past efforts to connect to the  bandwagon of popular culture, I was delighted at how learned, clear, yet  sprightly Krauss' short book was.  In the first part, Krauss attempts  nothing less than an explanation of Newtonian physics, general and special  relativity, and other physics concepts to explain warp drives, tractor  beams, wormholes, and other Star Trek staples that -- under the laws of  physics as we now understand them -- are probably impossible.  Subsequent  chapters address and deconstruct the transporter beam, warp drive, etc. The  clarity and humor of Krauss' writing is just wonderful. Perhaps the most  amusing chapter is the last, in which Krauss lists his \"top ten\"  Star Trek scientific bloopers -- events, plot devices, and the like that  just could not occur.  Because he is a trekker, Krauss does not treat these  foibles with contempt or ridicule; as a scientist and writer, he ably  outlines those errors."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IX44U32F4E7F"
                },
                "Date": "on January 21, 2001",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "As I looked through my local bookstore for an interesting read, I could not help but notice this interesting title in the Physics science section.  Being a sporatic viewer of Star Trek myself, I picked it up for a closer look.  As I read the first section of the book, I realized that it was more than blatant critique on scientific errors.  Rather, it was an interesting view of future possibilities and also impossibilities in the field of science.  In this book, Krauss explores the existence of things such as wormholes, black holes, and existence of other intelligent life in space.  Krauss is also relentless in his discussion of Einstein and other renowned Physicists.  He often writes about highly esoteric subject matter, but on the whole this book is well rounded and a relatively interesting read.  However, keep in mind that one must have an interest in science, specifically fields such as quantum mechanics and relativity."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1V51M8M216Y69"
                },
                "Date": "on December 14, 2005",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GT3ZY6XN6F04"
                },
                "Date": "on February 25, 2000",
                "Helpfulness": 0.9375,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NJO6YE954DBH"
                },
                "Date": "on October 21, 2000",
                "Helpfulness": 0.9333333333333333,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JFDCLA9PZGQ0"
                },
                "Date": "on February 20, 2006",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "...for anyone who likes both \"Trek\" and science. Laurence Krauss shows that it is possible to enjoy \"Trek\" while using it as a tool to teach some physics fundamentals (usually to the effect that \"Trek\" physics/technology is impossible or wildly improbable). The foreword is by Stephen Hawking, also a fan, who endorses the imagination-expanding possibilities of science fiction. Remember how many engineers were inspired by the example of the late \"Scotty\" (he was even given an honorary engineering doctorate for it). Read, and enjoy - and learn more about the awesome universe in which we live."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FOZ0B9R1O6OK"
                },
                "Date": "on July 19, 2002",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "I'm sure some 'true blue' Star Trek fans will be disappointed that this book doesn't agree with all the 'science' used in Star Trek.  Actually 'Star Trek' is only used as a jumping off point to talk about physics and possible advances of physics in the future.  It also presents the other side, and will give the scientific reasons that some form of Star Trek technology (such as transporters) will probably never be possible.  I thought the explanation of various scientific principles (usually related to something in Star Trek) were done well without being either condenscending or obtuse.  I was actually surprised that the author (apparently a Start Trek fan) found that, for the most part, the scientific concepts used in Start Trek were generally more accurate than the usual SF TV show or movie.  Usually the science in these shows is pretty bad.  It appears that the Star Trek technical advisors have been doing their homework.  I recommend this book to those interested in science and physics and are also familiar with Star Trek.  The connection between the two makes the science more palatable and enjoyable."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BPYPUTSS0OAI"
                },
                "Date": "on March 12, 1999",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I loved this book.  It explained things in two hundred pages that twelve years worth of science teachers have failed at, and I'm no Trekkie.  I assume it is physics in relatively simple terms, given that I could  understand most of it, but I feel like a scientist now (did you know that  quarks come in three colors?).  Its the same idea as A Brief History of  Time but easier to understand.  Recommended for any curious resident of our  universe."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on May 26, 1999",
                "Helpfulness": 0.9166666666666666,
                "StarRating": "5",
                "Text": "This books really surprised me.. I reread some parts several times to really grasp what he was saying because he delves into some pretty deep thinking and math based ideas.  I highly recommend this to anyone who ever  wondered how a transporter or warp drive could work and wanted a really  good answer"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HUKUAS8F9LGA"
                },
                "Date": "on November 28, 2001",
                "Helpfulness": 0.8,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VHENWK5MI0PD"
                },
                "Date": "on October 14, 2000",
                "Helpfulness": 0.7714285714285715,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TZPRIVAK2C1P"
                },
                "Date": "on October 14, 2003",
                "Helpfulness": 0.8125,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A379OQ6THHJKBJ"
                },
                "Date": "on July 5, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Let's not kid ourselves, physics is a tough subject to learn, and equally tough to teach.  But there are few books that do as good a job as this one.  This book is written for laypersons.  And Krauss has found an excellent  way to make the subject fascinating.  If in your entire life you only want  to read one book on physics, then this should be it.  I suspect, that  Krauss will interest you enough that you'll want to read more.  But even if  you don't, you'll enjoy learning the wonderful info contained here."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 6, 1997",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on December 18, 1997",
                "Helpfulness": 0.7857142857142857,
                "StarRating": "3",
                "Text": "This is an interesting book that has a great amount of valuable scientific information included, such as the basics (and the not so basics) of many of the technologies employed in all of the Star Trek shows.  The writer does spend alot of the book on nitpicking about details the Star Trek writers got wrong, but I neither like or dislike this.  To his credit, the author does tell of many of the innovations that the Star Trek show led to, and also tells of the particles/concepts that they somehow got right before researchers discovered them.  The shortcoming is the closedmindedness.  All through the book he tells of the impossible energy requirements to accomplish many things, such as warpspeed, but they're only impossible according to current knowledge.  Go back to BC times and ask their scientists about flying machines: impossible.  But the book is still filled with great technical details that'll keep any avid Hawking readers on their toes, and is still interesting to the \"lay\" reader."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PU8MF1L37O6R"
                },
                "Date": "on January 8, 2000",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "4",
                "Text": "I was given this book a few years ago as a gift and I finally picked it up and read it.  It is really mostly about physics and not too much about Star Trek, but the cool thing is that he uses ST to demonstrate some advanced  topics of physics.  This made it more interesting to read than if it had  been a straight physics book.  It rekindled my intrest in these topics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FJSHVW02YAK3"
                },
                "Date": "on May 25, 2012",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUV0EFKWA46TX"
                },
                "Date": "on August 14, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3E8QNDC7CV44"
                },
                "Date": "on November 28, 2009",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on January 15, 1999",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "The Physics of Star Trek explains several of the revered technologies of Star Trek in a comprehensive, interesting, and  manner.  A must for any science/Star Trek fan."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3O2RCKAMSE9X7"
                },
                "Date": "on June 26, 2002",
                "Helpfulness": 0.8,
                "StarRating": "4",
                "Text": "It is not often a cultural phenomenon like Star Trek is responsible for a spurt of growth of interest in the hard sciences that serve as a backdrop for the various television shows and movies in its canon.  Lawrence Krauss in THE PHYSICS OF STAR TREK attempts to confront the unspoken assumptions that go on in the viewer's mind under the helm's countertop when Captain Kirk orders, 'Warp factor three, Mr. Sulu.'  Apparently what goes on in reality is the merging of pseudo-science with some very clever writing that distracts an audience that is not particularly science-literate anyway. Krauss discusses the widespread Star Trek use of holograms, warp travel, matter transportation, phasers, inertial dampers, time travel, and nano-technology.  In each case, he points out with some tongue in cheek the present impossibility of actually developing and using such devices.  Krauss is a physicist who likes to write,or judging by his lengthy list of published books, he is a writer who likes physics.  He has a smooth style of explaining the grotesquely unfamiliar in terms of the beloved familiar world of the Federation.  TPST is a book written for those whose knowledge of basic science is gleaned from watching shows like Star Trek.  He asks many questions, elaborates many details, but provides precious few answers.  In short, he is just like my 10th grade physics teacher.  Perhaps that is the inner lesson of this book: to probe beneath the smoke and mirrors of the writer-magician's blanket to see if the immutable laws of reasonability are being obeyed."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QGDMR4XJOA6N"
                },
                "Date": "on April 15, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book gives a good overview look at each of the major physics-oriented aspects of the Star Trek universe.  Just how likely is it that we will develop transporters, food replicators, or (probably of greatest interest  to most of us) holo suites?  The answers are here in this well written  layman's guide.  This book is best suited for the curious, for those who  wonder if these things will one day be possible.  The authors take us down  each path, sometimes determining that it will be possible, someday, and at  other times, letting us down easy.  I thank the authors for satisfying my  curiosity as well as teaching me some theoretical aspects of physics at the  same time."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHUQNC0CQKOVD"
                },
                "Date": "on January 23, 2001",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Oh, wait ... that's two words.  Must be over my head, like the book thought it would be.  But I understood the thought processes of the author from start to end.  (I learned something in science class after all.)  Good explanation on how it should work.  Too bad it won't work with todays thinking.  Just wait - there will be someone to come along with a gadget like the 'Heisenberg Compensator' to make it all work the way SCI-FI saids it should work.  Even if it shouldn't work because of the Laws Of Physics."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 13, 1997",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I do not pretend to be a physicist, but I did go to school. He is right about these things. Its also a very well written book. Although it has no bibliography and its edit seems a bit jumbled it is a very entertaining book to read. I gave my copy to a friend, and I did not get it back.  Geron L.  a reader"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1T1UHFWP7YQZE"
                },
                "Date": "on February 5, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KNYOLUE89L4U"
                },
                "Date": "on October 20, 2010",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NJO6YE954DBH"
                },
                "Date": "on April 19, 2006",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on December 11, 1997",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I thought this was a very good book.  It was a little difficult to understand, but I should have expected that, considering most of ideas I've never heard of.  Anyons?  Soliton waves?  I had no idea.  I do have an idea for the Undiscoverable Country chapter, though.  I just got finished watching the Voyager episode \"The Gift\" and I noticed something at the end.  Somehow, Kes propels the ship 9,500 light years in a matter of seconds. I didn't do any calculations-the show just got finished-but I'm pretty sure that that is faster than Warp 10, which the Voyager series already proved was almost impossible in a shuttlecraft, let alone a full-sized starship.  That brings me to something else that Dr. Krauss can add.  It isn't really a physics problem, but more of a continuity error one of my relatives informed me of.  As I have already stated, Voyager has proved the impossibility of travel over Warp 10, but in more than one episode of ST:TOS and ST:TNG, ships have gone over Warp 10.  I believe Dr. Krauss noted one such episode in his book, but I would just like to say that there are many more."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AABV21QT1TAOM"
                },
                "Date": "on May 31, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I like this book because it reads like Stephen Hawking's A Brief History of Time, or Carl Sagan's Cosmos: it's a light-hearted discussion of the related science with lots of connections made easy for the reader and lots of examples given, and all in easy-to-understand language.  I think it's clear that Krauss loves and knows his Star Trek as much as he does his scientific research, and his purpose in writing this book must have been both to educate and to entertain, and I think he scores big on both counts.  Plus, the forward by Stephen Hawking, and the references to Hawking's poker game with Data, Newton, and Einstein, sets a fun tone right from the start.  I think there is no way you can read this book and not learn something you didn't know before, or think about something you knew in a different way, I don't care how much of a Trek fan you are.  And there is no way you can not have fun reading this book.  A must read for all Trek fans!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GPL8CJP2PUT5"
                },
                "Date": "on October 24, 2009",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Ever wondered if traveling faster than the light of speed is possible, or if calling out those famous words, \"Beam me up Scotty\" could actually transport you instantly to a different location up 60 000km away? The Physics of Star Trek, brilliantly written by Lawrence M. Krauss, provides an educated look into the reality of concepts Star Trek writers incorporated into the series. Krauss illustrates that vast impossibilities exist due to the constraints of the laws of physics. Krauss takes many advanced ideas that have been developed in physics and explains them so that average people can grasp their complex principles. This is an interesting read for anyone who wants to better understand how our universe operates. I suggest that any Trekker out there, anyone who gazes into the stars at night and wonders if others are out there, or anyone who just loves to have their brain expanded by the intrigue of the vast universe read this book!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36HP0MN6AWP9B"
                },
                "Date": "on April 25, 2005",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on January 30, 1999",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Discusses and explains a lot of intriguing concepts, and has been MUCH more educational than any science class I have taken as yet.  There is a  lot of explanation for people who are not familiar with the physics topics  covered, like me.  There are two problems though:  1) Warp drive is  discussed without mention of the involvement of subspace.  My impression is  that warp drive could not exist without subspace.  2) Nothing about force  fields, on which the holodeck relies to give its holographic objects more  realism.  So if you know a lot about physics already you will probably be a  little bored, but if not, judging by my experience, you will find it  fascinating.  Just do not treat the author's explanations of Starfleet  technology as necessarily the way it actually works, because this is  definitely not authorized by the makers of Star Trek."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1M0YAZ6JV488Z"
                },
                "Date": "on March 14, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Krauss picks up with this book where J Cavelos left off with The Science of Star Wars. For Trekkies (and Trekkers) this book is a must have. I've found, in my years of nerd and geekdom, and in attending many COMICONS, Star Trek fans seem to be the more scientifically-oriented of the two camps (Star Wars vs Star Trek). So, I think this book will appeal to ST fans perhaps even more than Cavelos' book did to SW fans. Now, both books have been out for some time. In fact, I picked up both of them on Amazon in 2005, but, this is another book that I find myself returning to from time to time as it's truly that fun and interesting a read. Grab a copy today, if you're a Star Trek fan, you definitely will not be disappointed."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATN1SSKTJD8Z8"
                },
                "Date": "on January 31, 2005",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HT08P0VGMIK8"
                },
                "Date": "on December 12, 2009",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "This book was great fun to read, it actually made learning about physics fun. Yes, I will admit I enjoy Star Trek which probably made this book even more interesting, but even for those a little interested in both physics and Star Trek I would highly suggest this book. It took what could be extremely dull and made it fun to learn about. For example who knew that the phrase \"Beam me up, Scotty\" could come with so many issues, or warp drive, black holes and laser beams. I am really glad I read this book, it has changed the way I watch Star Trek, I can now spout off useless, yet interesting, physics trivia while watching the classics."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on January 19, 1998",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I ran across this book accidentally while thumbing through some texts in a bookstore on Einstein, relativity, space science, etc. I've always been a Trekkie and have often heard rumors of the \"scientific correctness\" of the show and wondered how fine the line was between science and fiction. Well, this book helped answer a lot of those questions. You don't have to be totally familiar with the laws of physics to read this book, for the most part it's reader friendly. I do, however, recommend the reader acquaint him/herself with some of the terminology...or have a reference near-by."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on April 8, 2000",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "This book was the first of its kind-- to try and relate science to popular culture and science fiction--and it is the best of the bunch. The author is one of the best popularizers of science around. The writing is engaging,  and humorous.  I completely disagree with the reviewer who didn't like the  writing and argued that this is for physics neophytes.  Even those who are  familiar with popular physics will get new insights into the exciting world  of modern physics and astrophysics.  And those who aren't will get a great  first introduction to the wonders of the universe."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10C8MYBRCVVFT"
                },
                "Date": "on July 3, 2000",
                "Helpfulness": 0.75,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BCPERLQXMXTO"
                },
                "Date": "on February 5, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book is a very easy to read and comprehend volume explaining the physics of Star Trek in real world scientific knowledge.  Krauss explains concepts well, gives numerous examples, and provides an interesting and thorough analysis of devices and methodologies in the fictional Star Trek universe.  I would recommend this book to a wide general audience."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKOU5KRC6L8JT"
                },
                "Date": "on March 18, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GGR8353YB8RD"
                },
                "Date": "on December 10, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "A really fun book....  Any Trekkie should enjoy it....  And you don't have to be a physicist either.  I loved it.  Sure, it is a bit dated, and things are happening so fast in quantum physics now!  But comments and discussions still relevant, and fun to note the changes we are seeing.  After all, everything is probability at the quantum level!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on December 19, 1997",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Krauss has taken Physics to a new level of understanding, for the layman. His focus on Star Trek makes it more fun and relevant. Most of the points raised in this book describe similar scientific situations common to all modern science fiction stories and movies. Happily, much of Star Trek's \"technology\" isn't bunk!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Y6XWNASQHJRX"
                },
                "Date": "on July 8, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I really enjoyed reading this book. Being just a fan of both Physics and Star Trek, it made for an entertaining read. Sometimes Physics can be a dry subject when reading, but this book added a nice twist to a topic that I really enjoy. And who doesn't like Star Trek?"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on August 8, 1998",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on January 4, 1996",
                "Helpfulness": 0.6721311475409836,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QPRIVLMV9UMX"
                },
                "Date": "on May 16, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A126QSOAZADA6P"
                },
                "Date": "on July 3, 2006",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28YBV7OYX53KQ"
                },
                "Date": "on February 10, 2012",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QU1O7A2KRAOH"
                },
                "Date": "on April 17, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book was great. not only would it be interesting for a Star Trek fanatic, but anyone even remotely interested in space or physics.  The entire time it keeps you intrigued and open-minded about the possibility of space travel,  wormholes, and the like.  Initially I had no idea how in depth the Star Trek writers went when creating the series.  Each possibility was addressed and backed up by facts and theories of some of the smartest minds our current physics world has ever seen.  This book truly gives insight into the physics of Star Trek, as the name portrays.  I would recommend this book to anyone and it is interesting the whole way through.  After reading The Physics of Star Trek, I was truly curious about Newton, Einstein, and Hawking's work toward time travel and all science fiction related to Star Trek.  The examples given by Krauss are very helpful in understanding how all of this was thought out and expertly wrapped up in this book, in a relatable and comical way, as well.  It is easy to read also, anyone can just pick up this book and read it the whole way through.  The Physics of Star Trek really shows how possible the science is or could be in the potentially near future.  This book is a great introduction to physics in general and provides a good foundation for the fundamentals of astrology.  Overall it's a fun and exciting read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I3U97KUPQB7M"
                },
                "Date": "on May 17, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2K8LG0NQ7W5X0"
                },
                "Date": "on January 28, 2005",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "\"The Physics of Star Trek\" takes a critical view of the science, specifically well physics as they exist in the Star Trek universe.  Every iteration of Star Trek from the \"classic\" first series up to Deep Space Nine is addressed in this very readable book.  This is not a snotty ivory-tower \"Comic Book Guy\" treatment:  the author makes very clear his respect for the series, and the fact the shows do get some things right.  Dr. Kraus takes the reader from warp drives, and phasers to the transporter and cloaking devices, with some time travel thrown in.  His explanations of special and general relativity are, I think, some of the best in print.  (They even drove me to dig out my copy of \"The Meaning of Relativity\" by Einstein-which I quickly put back on the shelf realizing there was a time I actually could follow the equations...)  The bottom line is while some of the technology is theoretically possible i.e. warp drives, just ain't no way Scotty's ever going to/did? Beam anybody anywhere.  The material is written in such an approachable way, that this would make a great supplement text for a high-school physics or calculus class.  Highly recommended-even if you're not a Star Trek fan."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MGQL8V9K9LH5"
                },
                "Date": "on April 26, 2009",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This Book was one of the most interesting books that I have ever read. I suggest this book for everyone to read. Whether you are a fan of Star Trek or have no idea what Star Trek is, whether you like science or think it is all meaningless and boring. If you are a big fan you will love this book because he goes into great detail about individual episodes all the way from Captain Kirk to Captain Archer. The book talks about certain incidences in some of the episodes that not even I can remember and I have seen every episode. If you have no idea what Star Trek is this book will still be one of the best books I think you will ever read. It is very interesting! Talks about how everything you see on T.V. is different than from real life. How you look at one thing on earth and it will read 2+2=4 but then you look at that same thing in space and it will read 2+2=5 everything in space is completely different and this book has the best examples that I have ever seen. I highly suggest that everyone reads this book. Whether you  are a fan of Star Trek or not."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3H6GHT38BY4YT"
                },
                "Date": "on January 29, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "We got this for our Treky teenager and he totally loves it!  Prompted him to speculate of other physics theories of his own.  Would recommend!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 10, 1997",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Fascinating review of how the science and technology of the fictional 24th Century of Star Trek compares to current scientific theory.  From warp engines to wormholes, from teleportation to tractor beam's, Dr. Lawrence Krauss explains how these marvels might and might not(!!) work within the constraints of the universe as we understand them today.  Dr. Krauss credits Star Trek's writers not only with getting much of their science right (at least in theory) but also with frequently making up terminology which is prescience in its accuracy. (Who would have thought that \"anyons\" really exist.)  In addition to pointing out the most egregious of the gaffes like sound waves in space and the subtle problems of quantum theory, Dr. Krauss also enumerates the mind-boggling magnitudes of energy that warping space and beaming folks around would consume.  All in all a quick, fun read, especially for the \"hard\" science fiction fan"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GFDRG2VPH4SN"
                },
                "Date": "on March 14, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "From a old Trekkie and a wannabe scientist, great stuff!  Hoping that our sciences will meet these concepts sooner than later..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TELKVHW8YO8C"
                },
                "Date": "on February 22, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "The book was very interesting.  I liked the correlation between reality and fiction and what could come in the future."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on November 23, 1996",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "One of the best books I ever read!Lawerence and Steven really did  awosome in portraying the charaters and events"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VCG7N8BV7XWC"
                },
                "Date": "on May 27, 2001",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "I'm certainly no expert in physics. But I've always been a fan of \"Star Trek\" and fascinated by the incredibly clever details in the ST episodes that make it a believable world. Speaking of details, this book is full of them. The author explains how and why certain things could work and others couldn't. And I was again impressed by the sheer genius and consistency of the ST writers. Sure, it's disappointing to find out that some of the processes they invented could never actually work. What surprised me was that I actually understood why! This is so well written and so comprehensible that I'll probably read it again just to savor it. I highly recommend it for any ST fan."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7T74AJL32YOF"
                },
                "Date": "on October 22, 2009",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZQ07H85OYPNK"
                },
                "Date": "on August 30, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EPA9BH74TEUA"
                },
                "Date": "on September 13, 2010",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great overview of current physics theories using the popular cultural icon of Star Trek. If you want to brush up on what recent theoretical physics ideas are out there, this book is a good way to do that. Using examples and what ifs from the popular movie and TV series helps the explanations. Don't expect a too detailed, in-depth discussion. Think of this book as an introduction to or a brush up on such topics as partical physics, Einstein's General Relativity, and string theory."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2T2OVNIRFWS4R"
                },
                "Date": "on April 14, 2010",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is a fun and educational book. Lawrence Krauss,a physicist who loves Star Trek, offers gentle criticism of much of the physics in the show. Sound waves do not travel in space, to take one example. At the same time, he concedes some of Star Trek's supposedly far-out ideas are conceivable, if unlikely (e.g. traveling faster than the speed of light).  Anyone who has even a passing interest in Star Trek and has ever wondered \"could that really happen?\" should read this book."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 12, 1999",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I loved this book.  It explained things in two hundred pages that twelve years worth of science teachers have failed at, and I'm no Trekkie.  I assume it is physics in relatively simple terms, given that I could  understand most of it, but I feel like a scientist now (did you know that  quarks come in three colors?).  Its the same idea as A Brief History of  Time but easier to understand.  Recommended for any curious resident of our  universe."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A94J0IZWQKT41"
                },
                "Date": "on August 21, 2008",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Need a crash course in how to create your own warp drive (hint, bend spacetime behind so that it moves away and in front so that they move closer)? Or perhaps want to know what Star Trek writers got right (and horribly wrong)? Well then this is a book for you. Not terribly technical, Krauss does an excellent job of explaining complicated theories so a dummy like me can comprehend them and with a joke."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ASW2ZNIQSG5P"
                },
                "Date": "on February 24, 2006",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "4",
                "Text": "I really enjoyed this book, it really went in depth on how or if certain technologies of Trek work or don't. Be warned, that it can get very scientific, and to the untrained eye may appear to use more techno-babble then trek itself. However, it is laid out in a very concise manner, with several diagrams as well."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AX5SHKUPHTKLV"
                },
                "Date": "on October 26, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AP1Y9A6HE6JCJ"
                },
                "Date": "on June 10, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YKF79R64JCJW"
                },
                "Date": "on January 3, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The physics of star trek teaches you much more about physics than the average star trek episode. This book rocks."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEZSES2UEQG34"
                },
                "Date": "on December 10, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Anyone who is interested in science should buy and read this book.  Like all of Krauss' writings, this will leave you inspired and uplifted.  For Star Trek fans, it is also a fun read and an introduction to the possibilities which open up for minds unrestricted by outdated dogmas."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1A0J9WYRUSTUX"
                },
                "Date": "on December 10, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A most interesting book. I love the Star Trek series ( The Next Generation )  and the references from the book to the various episodes made so much sense for me. I am also extremely fascinated by astrophysics, cosmology, quantum mechanics and this book successfully transcended my understanding of the two subjects I love so much."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GDM2HIU6M21Z"
                },
                "Date": "on October 2, 2010",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I saw Mr. Lawrence on youtube and liked how he articulated scientific ideas for the \"everyman\" so much that I decided to give this book a try. I'm glad I did. It's a great joy to find someone who can make science so much fun and easy to understand. I highly reccomend this book to anyone who has even a mild interest in physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HUNHF73F1JME"
                },
                "Date": "on October 31, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Was gift for son's 28th birthday - he says he's really enjoying it.  I glanced through it before wrapping as I thought I might borrow back when he was done but not sure I have enough science background to fully appreciate.  But then he excelled at math and physics while I'm more of a history and literature person."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29Q3DRTDIPKZW"
                },
                "Date": "on January 13, 2009",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "If you like Star Trek you will like this book, and broaden your knowledge base. If you have any interest at all in science, you will find this very interesting. I bought it for my husband and read it after he finished it.  (He is a Star Trek fan; I am not.) We both enjoyed it and learned a lot from it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4Y4EUP5YQ6PS"
                },
                "Date": "on February 6, 2010",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I bought this book for my husband who loves both Physics and Star Trek -- he says it's great and very easy to understand for non-physicists. The author has a terrific sense of humor and writes in a conversational style. I also bought Krauss's \"Beyond Star Trek\" and it is equally good!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3M9AF9YFE823B"
                },
                "Date": "on April 25, 2007",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This a not-so technical book that many Star Trek fans will love. Of course it requires a previous knowledge of general physics but it is very good. I enjoyed reading it and of course I have to have a college physics book by my side to get the most of it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HUU3EJYHQT6K"
                },
                "Date": "on November 18, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I never thought a book about physics could be fun. But using one of my favorite legends as a background held my attention and opened my (very unscientific) mind to a lot of new concepts and literary imaginations. Thanks, Professor Krauss."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVBOQCVO8DSEL"
                },
                "Date": "on March 19, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AD0JB2LCMXPV6"
                },
                "Date": "on October 25, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book is awesome; especially if you want to get your geek or nerd on!  If you like science, Star Trek, physics or everything in between, you're going to like this book.  It's well written and easy to understand."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3A68O59ROZHNH"
                },
                "Date": "on October 8, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excelente libro, explica de forma amena y al mismo tiempo contundente -dentro de lo posible- la ciencia que ha convertido Star Trek probablemente en la serie televisiva más influyente en el mundo científico real.."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HN37V2SDWHV1"
                },
                "Date": "on November 7, 2009",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This book is informative as well as fun. It is imbued with Star Trek humor and gives a clear explanation of the laws and principles of physics mentioned in the series.I enjoyed reading it and learning from it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LZLO4DUHAHBE"
                },
                "Date": "on June 21, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GA7URRBSKXPR"
                },
                "Date": "on May 5, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "For some one learning Physics this is a good book to get a better idea that just a text book. I enjoyed the details and how Mr. Krauss compared Star Trek to our real life physical world."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RTQC5U7LC63L"
                },
                "Date": "on June 14, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "those haven't read or watch the Star Trek series may find a little confused when reading parts that describe things from Star Trek. But still a great one for ordinary people to read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHXR44HGLU2N4"
                },
                "Date": "on January 16, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great book about physics for the true lay person. Enough references to Star Trek to relate to the title and to explain why, oh my, Star Trek adventures cannot happen."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3831JBB3UUOO5"
                },
                "Date": "on May 29, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is a fantastic book with a great, fun premise. I really enjoyed seeing the connections between the real world and that of the imagined ST universe."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MR7M76C5QSEK"
                },
                "Date": "on February 12, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Learn the secrets of the universe and be the inventor of the actual technology as seen on the show which inspired cell phones, 3D printers and more!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANG4S18RY1RWL"
                },
                "Date": "on June 9, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "this book was one of the most enjoyable reads I have had for a long time, it answered a lot of questions on the physics of space travel."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJHOJYO8F4IPH"
                },
                "Date": "on February 24, 2010",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Because it's 10 years old, it is a tad dated, but lawrence Krauss nails it. Much fodder for a non physicist. It is highly recommended."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZSEJGWB4HM7A"
                },
                "Date": "on August 23, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Fun, factual and generally entertaining. Ever wonder how wrap drive works in theory? Turns out is has a solid real-life basis!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DDD3CWRCSI2E"
                },
                "Date": "on January 25, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "An interesting read. I learned of this book from listening to 'Star Talk' and it is a pretty good read as I am a trekkie."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AB6TIXAB6ZI7V"
                },
                "Date": "on January 11, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This is a good video for everyone's video library, good for the whole family to enjoy,  especially for us older folk."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14GRC1D06YDF8"
                },
                "Date": "on December 27, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Product is as described and was delivered on time and in good condition. I would definitely use this service again."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1X8H6WQ6HT5ZR"
                },
                "Date": "on August 16, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "If you are a nerd and love physics, this is a fun read. It's really more of trip down memory lane but still fun."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A66JELCVRKSB7"
                },
                "Date": "on March 15, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "If you are a geek too (and of course you are if you are looking at this) you will get many laughs reading this."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CYTBE7LLUQ8F"
                },
                "Date": "on April 22, 2004",
                "Helpfulness": 0.6,
                "StarRating": "5",
                "Text": "As a Star Trek fan with a limited background in the sciences I found this book extremely helpful in describing the science in Star Trek. It was a nice easy read. I would highly recommend it to people who are interested in Star Trek and curious about its science. To those without a background in the sciences, especially physics, don't be frightened off! The book is easy to understand."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LVQWYUCPJHZ8"
                },
                "Date": "on February 26, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is a great product. I love to use it frequently. I'm glad I was able to get this for myself."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24DNB0T7RC0BF"
                },
                "Date": "on October 31, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I enjoyed the author's analysis of the technology/physics of the Star Trek TV series and movies."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALEW60UV2TI7O"
                },
                "Date": "on February 3, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Ordered for a relative that is a star trek fan, read some of it and liked it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A97ZNBO8F2JSG"
                },
                "Date": "on October 11, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "What a great read. love the crossover of science and sci-fi. Great read"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CYZSLJK5CJNB"
                },
                "Date": "on September 12, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Love Star Trek ..... Great analogy on how and why everything works!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AH96A8014YF3G"
                },
                "Date": "on October 20, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "As great  as everyone says it is!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QH2ZSSOOA6UL"
                },
                "Date": "on May 2, 2001",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2E3F62FDYTCS3"
                },
                "Date": "on August 14, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Perfect for trekkie nerds!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AU04GU8ECYUSL"
                },
                "Date": "on September 11, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Science fiction revealed."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A144EXCHT8THJJ"
                },
                "Date": "on December 9, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great read."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on January 18, 2004",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "This text is very enlightening for the Star Trek viewer. It gives technical answers to questions concerning warp, transporters, worm holes and other technology and phenomena that do not have the opportunity to be addressed on camera. Despite some deviations in the series, this text offers more plausible explanations for the inner workings of the Star Trek multi-verse."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RI5TNPTC4OHD"
                },
                "Date": "on September 10, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "Good read"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARE59XOOJGKDL"
                },
                "Date": "on December 31, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Amazing."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RLZ2VD2AT8DL"
                },
                "Date": "on November 27, 2012",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1242XAFPOGB6Y"
                },
                "Date": "on June 3, 2012",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Found this a useful resource book to combat little or no scientific reasoning among TV-addicted, unscientific myths adopted by most of our populace - young and old."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOHLDRAV2Q84Q"
                },
                "Date": "on July 16, 2013",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "Reviews very basic concepts in the beginning. Takes a while to get through that - sitting on my shelf while I've gone to read other books."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on September 13, 1998",
                "Helpfulness": 0.5454545454545454,
                "StarRating": "2",
                "Text": "I had high hopes for the book after hearing the author on the radio but I  found the book to be really heavy on physics and lacking in references to  Star Trek.  Einstein's own writings are lighter and more enjoyable to read.  I recommend the Technical Manual instead."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SFXQEMH3IAH1"
                },
                "Date": "on December 4, 2012",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "As a science lover , physics become interesting specialy in sci fy, and waht could be true know or in the near future"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2F35K0ROETD68"
                },
                "Date": "on August 10, 2005",
                "Helpfulness": 0.4,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36N6GK2596TCS"
                },
                "Date": "on November 10, 2010",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "This was a gift for my boyfriend who's a Physics major and a Trek fan. The book itself came in good condition, my only complaint was that there was a little shelf wear. Then again I'm very picky about the condition of my books. Wish this updated version came in hardback."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RYUEQVNCB2AN"
                },
                "Date": "on December 8, 2014",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "I bought this as a gift and thought it was a hardcover as it say it should be but upon getting it, it was not a hardcover.  I didn't want to spend the time exchanging it, thus my fault."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZIFEHP113ERJ"
                },
                "Date": "on October 17, 1998",
                "Helpfulness": 0.4666666666666667,
                "StarRating": "2",
                "Text": "Although the author is great at stating on how impossilbe it is to do  things like warp drive and transporters, according to relativity and  quantum mechanics, the author knows nothing of the physics of star trek.  His interpretation of how warp drive works for instance is not even close  to how it really works.  And all his assumptions on the technology is using  modern day physics, which is portrayed by the author as the absolute truth  to the universe.  500 years ago it was impossible to circumnavigate the  earth, 50 it was the sound barrier, I suprise a scientist would say that  anything(such as warp drive) is impossible no matter what improvement in  physics.  If you want a book on physics, get a brief history of time, if  you want a book on star trek get the tech manual, just don't get this book  for either."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 18, 2001",
                "Helpfulness": 0.25,
                "StarRating": "5",
                "Text": "This is a most awsome book!!!  It is not nessarly Trek centered. However it gives you insight on many questions any fan or general person may have."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IUIRVBU9I683"
                },
                "Date": "on January 31, 2006",
                "Helpfulness": 0.46153846153846156,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A393J4F4Q262OS"
                },
                "Date": "on April 5, 2012",
                "Helpfulness": 0.35,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38S8RYGNWZVFT"
                },
                "Date": "on May 16, 2002",
                "Helpfulness": 0.2903225806451613,
                "StarRating": "2",
                "Text": "Mr. Krauss does a great job of explaining why Star Trek technology is impossible in the real world.  What I wanted to know was how it worked in the Star Trek world.  What is subspace for example and why are they so many domains within it?  If that's a question you have, this books doesn't have the answer."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NTLK0PEHIAEH"
                },
                "Date": "on September 6, 1999",
                "Helpfulness": 0.15625,
                "StarRating": "5",
                "Text": "hellO! i am lawrence krauss' daughter and i havent read the book yet, but i figured i'd review it just to give it the 5 stars! :) yay!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMGHJEPI2ID5B"
                },
                "Date": "on January 31, 2009",
                "Helpfulness": 0.03225806451612903,
                "StarRating": "1",
                "Text": "I was very very dissapointed with this book. It was advertised as a Hard back and when i received the book it was not it was a PLASTIC back. I have always been happy with my purchases from Amazon but i am sorry not this time."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OD9LXA4W78TQ"
                },
                "Date": "on October 4, 2002",
                "Helpfulness": 0.04838709677419355,
                "StarRating": "1",
                "Text": "Ahh! I had to read this book for a class and it was awful. Unless you're a huge Star Trek fan, I don't recommend it!"
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Physics-Star-Trek-Lawrence-Krauss/product-reviews/0465002048/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "125"
    },
    "Salesrank": "#52,284",
    "Timestamp": "2015-05-24 12:37:46.896804",
    "itemurl": "http://www.amazon.com/Physics-Star-Trek-Lawrence-Krauss/dp/0465002048"
}
