{
    "Category": "in Books (",
    "ListPrice": "$19.00",
    "Name": [
        "The Amazing Story of Quantum Mechanics: A Math-Free Exploration of the Science That Made Our World"
    ],
    "OfferPrice": "$15.60",
    "Reviews": {
        "AverageStarRating": "4.4 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOE0XMITAJWDT"
                },
                "Date": "on January 17, 2011",
                "Helpfulness": 0.9310344827586207,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3M8F25NGVO72D"
                },
                "Date": "on January 2, 2011",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZR2K4JOGBYAG"
                },
                "Date": "on January 12, 2011",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Quantum mechanics is the bizarre science of how the world operates at a tiny scale where light is made of particles and particles are waves (or at least defined by wave functions).  The book explains this non intuitive and complex science with real world analogies and very little math.  Although I have had some quantum physics back in college, I enjoyed the book and gained some insight from it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3L7LEJB9I7CFM"
                },
                "Date": "on February 24, 2011",
                "Helpfulness": 0.8,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A83OV9QESQUL"
                },
                "Date": "on December 22, 2010",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": "This is a book I feel I will be certain to reread.  It has done something that I thought impossible; that I might possibly understand, some day, how the high tech devices I use in daily life (such as the iPad I read it on) actually work, sort of (the details are very clouded).  And how the magic of nuclear magnetic imaging occurs.  Highly recommended for the technologically challenged (actually, I'm of such an age that in my childhood 2 tin cans joined by a length of string was regarded as high tech communication ...)."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUXPCV8WDNDOP"
                },
                "Date": "on March 15, 2012",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "There is some math in the book, but if you have had high school algebra you can manage.  It is a comfortable read for a non science major.  Not really easy, but very interesting.  Sometimes you have to work to get it, but the feeling of understanding something new and hard is very satisfing. I liked the explaination of the uncertainty principle.  It makes some sence now.  You are are not going to be doing nuclear physics after reading it, but you will have a fair idea of what quantum mechanics is about. I you want a good idea of what quantum mechanics is about then major in nuclear physics and maybe after five years or so you might get it all.  Maybe.  I never tried that by the way. I am liberal arts major. This book is the best thing I found on it so far."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YCDA2CQHPM7T"
                },
                "Date": "on March 6, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "When I first saw the cover in a local library, I thought the book was a leftover from my youth. On closer inspection of the 21st century technology being used by 'my' 1950s family, I started reading and soon decided that I needed to buy a copy to catch up on what has happened in science in the last 60 years! Most of our modern technology is based on practical applications of Quantum Mechanics. However, the physical processes that it describes are beyond our senses and its principles are often presented as mathematical abstractions. This book makes the science 'touchable'. Prof. Kakalios has a wonderful talent for describing the complexities of Quantum Mechanics in in terms of simple, non-mathematical analogies that provides a physical understanding of the system . . . and using stories from classic science fiction literature to make it fun to read.  It would be a wonderful introduction for anyone thinking about studying modern science in college . . . or even high school."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FZA04N27DQX7"
                },
                "Date": "on March 15, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book describes how atoms operate by using cartoon characters and stories from science fiction. Some of these predated actual atomic age devices. In fact nuclear chain reaction was patented by a Hungarian physicist, fan of H G Wells, four years before splitting a uranium nucleus. The author uses graphic methods instead of formulas. For example the pattern of electrons in a atom are like love seats in an auditorium. Each seat can contain up to two electrons, one is spin up and the other spin down. The first row is one seat, 1 or 2 electrons. The second row is one seat. The third row is 3 seats. The fourth is one seat. The fifth is 3 seats etc. He uses similar descriptions to explain Lazers, diodes, transformers, DVD's, magnetic drives, MRI machines, cell phones, touch screens, and finally  Quantum Computers and Entanglement."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAOP5MKMGE0KL"
                },
                "Date": "on March 26, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Kaklios has written a pretty good book for the non-scientist explaining the basics of quantum mechanics. It is, as promised, math-free, but at times does get a little deeper than one would imagine in such a book. Especially enjoyable were the different ties to golden age comics and pulp fiction that he used to both illustrate concepts and show how prescient some of those authors truly were. At times, it seemed that the scientists were trying to keep up with the science fictionists. The book is definitely too basic for those already with a solid knowledge of the subject, but just the right amount of challenging for those without such knowledge."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AG4D06TQLDFMH"
                },
                "Date": "on May 20, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1M1UD4ECD7MZQ"
                },
                "Date": "on December 27, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I know a little about quantum mechanics and I love super-heroes. This book brings depth to my quantum mechanical knowledge while relating it to some of the favorite comic characters. I think the writing is good and will weave between comics and science, which can be a little confusing at times but over all I love this book and I plan to use chapters of it to teach my students."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A127LUK2CI8KC8"
                },
                "Date": "on May 30, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book was assigned reading in a modern physics class I was taking. The writing is clear and easy to understand. The author writes in such a way to keep the topic interesting, even though parts can be difficult and complex."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGIV1GVJWE8VJ"
                },
                "Date": "on March 26, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Professor Kakalios provides an entertaining overview of the contemporary applications of Quantum Mechanics.  Contrary to his math-free claim, he does use some mathematics but it doesn't rise above the elementary school level.  For some reason, perhaps to make it more interesting, he weaves a lot of comic book heroes and themes into the discussion.  I found the discussion on spin and spintronics particularly interesting since it was a new topic for me.  And quantum computing sounds like it will receive a lot of attention in the coming century."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3F9DTT0UJI9S2"
                },
                "Date": "on March 21, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "James Kakalios is witty as ever and brings complex science to a level that us lay people can understand without sounding like a child's book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NXI9HXTJW9GJ"
                },
                "Date": "on July 22, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I'm not a an expert in science or a scientist trained in physics.  Over the past few years, I have become interested in quantum physics as a hobby.  During this time, I have also gotten asked the question why are you interested in quantum physics.  I have difficulty expressing the reasons because if I say something like \" it explains why solid objects are solid\" I find that doesn't answer the question.  But now, after reading this book, I have many answers to that question.  I want to thank the author for his help."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HO3JKA5G1PUW"
                },
                "Date": "on December 3, 2011",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "\"The Amazing Story of Quantum Mechanics: A Math-Free Exploration of the Science that Made Our World\" by James Kakalios is a very interesting read if you want to learn about out the science behind some of products that we use in our everyday lives. I'm not a science guy, but I still thought it was a very good book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31SQUT2M1G7M4"
                },
                "Date": "on August 3, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Very good explanation of modern electronics and radiation on an atomic and sub atomic level.  It is very enlightening for those of us who had our science courses before the 1990,s.  Written in a clear and amusing way.  Should be interesting to anyone curious about science and not only geeks and nerds.  (He explains the difference.)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AP0F0YXSAIYCD"
                },
                "Date": "on July 30, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This was a birthday gift for my son in Australia.  It arrived as promised, on time, for his birthday, in excellent condition.  Would definitely use this vendor again!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SVFPMNHD11SP"
                },
                "Date": "on April 18, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Very good book, author explains the area of Quantum Mechanics in as close to layman's terms as possible. Morute math than the reviews indicated, but not that bad."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TBH7Z4RK7PRK"
                },
                "Date": "on February 4, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Not unlike other quantum books I have read. But easy enough to digest, and perhaps the comic book cover may appeal to your son to pick it up and learn something."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YV6E02HAZE70"
                },
                "Date": "on August 5, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I've seen Mr. Kakalios speak twice. His lectures are extremely enjoyable and easy to understand for the non-physics majors. Great book!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20025KSM8MW8U"
                },
                "Date": "on February 12, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is a fascinating, informing and personable read for anyone interested in knowing why things are the way they are!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZJHVAB33HUTI"
                },
                "Date": "on April 26, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is a great book. The author makes this complex subject easy to understand even for a simple minded man like me."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SN7J72HCUEJB"
                },
                "Date": "on April 25, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A non mathematical treatment of quantum mechanics to whet your appetite for the main course. Loved it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGDDPVJZ64VUW"
                },
                "Date": "on October 1, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Husband loves this"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PI5YXDSJKELW"
                },
                "Date": "on November 18, 2012",
                "Helpfulness": 0.5,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4GYKTBUKO3KT"
                },
                "Date": "on November 30, 2010",
                "Helpfulness": 0.5161290322580645,
                "StarRating": "2",
                "Text": "From a book of this kind, I expect information, and in this respect, the book is disappointing. The cinnections that the author wanted to establish between quantum mechanics and the transistors, semiconductors etc, that make up our present expolosion of information storage are tenuous. You learn that if energy development had followed the same rate of development as information storage,we would now be free of coal and oil. Yes, but it has not. I picked up other pieces of information here and there (why you had to invent quantum mechanics to explain the atom), but there are too many jumps that are not explained. Very original is the author's attempt to correlate solid state physics with the comic books predictions of discoveries, but since by the time I came to this country I had outgrown them, the similarities did not mean much to me. Perhaps the author is a victim of the famous dictum : If you think you understand quantum theory, then you don't know quantum theory..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3038ERALT8QLA"
                },
                "Date": "on April 24, 2011",
                "Helpfulness": 0.375,
                "StarRating": "1",
                "Text": "I finished the book! That is an accomplishment not a compliment to the author. I really liked the cover of this book, It was fun and filled with exciting prospects of what might be inside. However, what I found was a textbook with a very fancy cover. I have read many physics and chemistry textbooks while going through university and this was only slightly better. I enjoyed the comic book references and the old time TV show comparisons. The rest of the book was all too dry! Every chapter had a very ingenious name that allured me on. After a chapter or two of being let down, I decided that no matter how boring it was I had to finish. The only thing I got out of this book was the joke about Heisenberg, and even that was not his own. The claim about math not being used is mostly true, however be prepared for some equations that are overly complicated and explained in excruciating detail."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RMZKC1WN8G40"
                },
                "Date": "on December 20, 2010",
                "Helpfulness": 0.36,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BAWHHMWEQSOR"
                },
                "Date": "on December 8, 2010",
                "Helpfulness": 0.16666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SY587HEXKKN4"
                },
                "Date": "on November 11, 2010",
                "Helpfulness": 0.07894736842105263,
                "StarRating": "5",
                "Text": "The book is excellent and the service and delivery were as exceptional as always.  Amazon is a great place to shop."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Amazing-Story-Quantum-Mechanics-Exploration/product-reviews/1592406726/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "31"
    },
    "Salesrank": "#344,144",
    "Timestamp": "2015-05-24 13:00:35.432909",
    "itemurl": "http://www.amazon.com/Amazing-Story-Quantum-Mechanics-Exploration/dp/1592406726"
}
