{
    "Category": "in Books (",
    "ListPrice": "$181.40",
    "Name": [
        "Physics with MasteringPhysics, Volume 1 (4th Edition)"
    ],
    "OfferPrice": "$41.45 - $41.46",
    "Reviews": {
        "AverageStarRating": "3.3 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BD75F9BWLFFF"
                },
                "Date": "on January 29, 2013",
                "Helpfulness": "",
                "StarRating": "1",
                "Text": "The main thing I needed from this purchase was the mastering physics part. After I recieved it I tried logging in and the code that they sent me said that it had already expired! When I called all they said they could do was put 23.50 back on my card. This was unexceptable! If your getting this for a class do not do it! It's a huge inconvinience!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SM5LL7H2Z8BN"
                },
                "Date": "on July 22, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "This product came as advertised and the price was great. Needless to say I love it and it deserves a positive review."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28IOL442SEUKS"
                },
                "Date": "on September 27, 2010",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "Didn't realize it was only half of the physics series. But nevertheless its what I needed for class."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34HOC6440S4FP"
                },
                "Date": "on August 30, 2011",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KFPPFFFY6HV0"
                },
                "Date": "on January 23, 2010",
                "Helpfulness": 0.25,
                "StarRating": "1",
                "Text": "This review really has nothing to do with the book, because really, its a Physics text book, what do you expect.. its boring. My gripe is with the \"service\" from Amazon. I payed over $20 to overnight this book to me because my school bookstore was out of it and then I get an email from them regretfully informing me that oops they didn't ship my book in time, sorry. And five days later I still didn't have it. This caused me to not only miss one homework assignment, but two. If you want something shipped to you quickly then I definitely suggest finding somewhere else. I have ordered from Amazon many times before and have had stuff delivered faster using standard free shipping than this. Extremely disappointed."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BGNGSBDII3DR"
                },
                "Date": "on October 8, 2009",
                "Helpfulness": 0.25,
                "StarRating": "4",
                "Text": "This book came as advertised, new in good condition.  The problem was that I paid a considerable amount (over ten dollars) for two day shipping and it was not even shipped for over a week after I paid for it.  Beware if you are purchasing a textbook or something you need fast. I cannot find a way to dispute the shipping with amazon, and the late shipping caused me to lose points in class."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Physics-MasteringPhysics-4th-James-Walker/product-reviews/0321597516/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "6"
    },
    "Salesrank": "#430,259",
    "Timestamp": "2015-05-24 13:07:28.578740",
    "itemurl": "http://www.amazon.com/Physics-MasteringPhysics-4th-James-Walker/dp/0321597516"
}
