{
    "Category": "in Books (",
    "ListPrice": "",
    "Name": [
        "Physics for Scientists and Engineers, Vol. 1: Mechanics, Oscillations and Waves, Thermodynamics (Physics for Scientists & Engineers, Chapters 1-21)"
    ],
    "OfferPrice": "$12.99",
    "Reviews": {
        "AverageStarRating": "3.1 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EEBE82C3HYRD"
                },
                "Date": "on November 19, 2002",
                "Helpfulness": 0.875,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on April 1, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "It is a pleasure reading the Optics in Dr. Tipler's volume II. The part is much better than the Waves which is somewhat confusing. So I gave 4 stars to the Waves part. Actually what I wanted to say in the previous reivew is  that the explanation of SOME of those mathematical expressions and of those  optional sections are not very clear--like written informally."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25FORNKFCXATU"
                },
                "Date": "on July 29, 2004",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "2",
                "Text": "What a bulky book, my all time companion during those long walks to the city library. How I would open you and reopen you and close you and reclose you every other day! How I kept all my stuff in you so that I might not have to spend hours searching for the appropriate answer pages! How I'd cuss when you got some of the answer solutions wrong! How I'd get annoyed when your problems did not occur in real world situations. How I'd struggle to keep my mind when I encountered on of those Niko problems. I still remember the dread I used to feel when I saw a three-dot problem. And the agony that a two-dot would sometimes be harder than a three dot. You gave me many hints to solve those problems, but why didn't you give sufficient explanations? Why? Why did you make me do the same lengthy problem with a differnt set of numbers and then speculate about the different results? Did I learn anything conceptually from you? I think it was all plugging in stuff, and making sense of diagrams. That's why now all that I've learnt seems like a distant memory. You are not welcome in my thoughts any more, oh bulky book!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2T1A688IYIK98"
                },
                "Date": "on March 16, 2000",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "5",
                "Text": "This is the best physics book I have ever seen.  The text is well written, the examples are great.  What sets this book apart from other physics textbooks I have seen are these advantages. Examples are set up in columns  so that on the left, it tells u whats going on in english and on the right,  whats going on in math.  There are great section summary pages and problem  solving guides at the end of every chapter. The problems are each labeled  with a difficulty, and they are creative problems.  There are optional  sections which you do not need to read but enhance what you are learning in  lecture and reading.  Overall, a great book."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on May 12, 2003",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXJJOXCSCY4YL"
                },
                "Date": "on January 17, 2014",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": "This physics book is good for somebody with a completely practical mind, with no depth, nor complexity this book lacks what creates a fundamental understanding needed for a career in engineering/physics. This book gives you completely unoriginal analogies one after the other, giving you absolutely no explanations for mathematical complexities behind the physics, it just gives bare minimum, it is indeed simplicity at its best. If your a person with a practical mind with no interest in truly understanding the physics this is the book for you. (no offense)"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 30, 2003",
                "Helpfulness": 0.6363636363636364,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3H0Y19BM2UBY"
                },
                "Date": "on January 5, 1999",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": "I liked the book. It was well written and at times even amusing. but I don't hink it was succinct enough, and I also felt that the author explained the easy concepts far too much and the hard ones not enough."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on May 12, 2003",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on April 1, 2000",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": "Overall, Tipler's physics series is a successful introductory texts for physics majors who have had good high-school physics background. For me, it is not a good choice. It is very obvious that Dr. Tipler explains those  basic concepts in a very informal manner. Physics is, I believe, a  systematic study of the complex phenomena of the universe. Surely we shall  develop our sense of appreciation of the beauty of Nature and our  creativity of modeling the physical phenomena. However, in presenting the  laws of physics, there is no need of being informal. That is what I  believe. Probably I haven't understood enough physics and English. If so,  forgive me!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQ6R8XSCZLYI5"
                },
                "Date": "on September 27, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Fast ship. Item as describe."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on September 30, 2002",
                "Helpfulness": 0.2857142857142857,
                "StarRating": "1",
                "Text": "I'm a straight A student, and I've never had any problems in any of my classes.  But this book is making me failing my physics class.  It is sooooo hard to read and understand.  It's making me  so afraid of physics."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on November 27, 1999",
                "Helpfulness": 0.3076923076923077,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5HWEP8U7F300"
                },
                "Date": "on May 10, 2003",
                "Helpfulness": 0.23529411764705882,
                "StarRating": "1",
                "Text": "this book is BAAAD.  i hated it.  it's very hard to understand.  it's too technical.  i think it should explain the concepts more in english, instead of all technical then it'll be easier to understand."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Physics-Scientists-Engineers-Vol-Thermodynamics/product-reviews/1572594918/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "14"
    },
    "Salesrank": "#173,792",
    "Timestamp": "2015-05-24 13:06:18.113402",
    "itemurl": "http://www.amazon.com/Physics-Scientists-Engineers-Vol-Thermodynamics/dp/1572594918"
}
