{
    "Category": "in Books (",
    "ListPrice": "$19.95",
    "Name": [
        "Fundamentals of Musical Acoustics: Second, Revised Edition (Dover Books on Music)"
    ],
    "OfferPrice": "$16.25",
    "Reviews": {
        "AverageStarRating": "3.7 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A309HIZVFIK5I3"
                },
                "Date": "on August 3, 2004",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32A2GR1SPPAS6"
                },
                "Date": "on December 31, 2000",
                "Helpfulness": 0.9318181818181818,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on December 1, 1998",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "In my opinion, a wonderful work that introduces the principles of waves and vibrations, musical perception and instrument physics without too much mathematics. Specific chapters on violin, piano, clavicord and harpsichord,  winds (brass and wood). Several references to guitar. The book is a little  old, which shows in the references, but is an excellent text for self  study. Most chapters have at the end a list of interesting experiments that  one can perform. Overall a must first book if you are interested in the  field."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 13, 1997",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I think this book has taught me more about the instrument I make (uilleann bagpipes) and it does not even mention it. When it says fundamentals in its title it means it. you will get to the bottom of why instruments work in thye way they do and so improve yuor own  acoustical design."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18QV3U3W3XNZ"
                },
                "Date": "on November 30, 2006",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31BD4RXCON7QO"
                },
                "Date": "on December 17, 2008",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HTBO0TBEPTIO"
                },
                "Date": "on October 6, 2000",
                "Helpfulness": 0.7391304347826086,
                "StarRating": "3",
                "Text": "This book, like practically all Dover science books, is a reprinted old book that does not incorporate any of the recent research in acoustics.  For example, much research on acoustics as related to the design of a theatre is not in here.  However, if you have a good grasp of fundamental physics (say, you took some good college physics classes but it has been quite a few years back), and now you just want to see how the physics you learned apply to the making of musical instruments, this book provides a nice overview."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3L8V7MBS95YCV"
                },
                "Date": "on May 18, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is a great book for musicians (or soundpersons) who are not afraid of some high school level physics. Benade, a musician himself, gives details about individual instruments, their playing quirks, and imperfections in intonation. If you like to tinker with instruments, this book is for you. There is an amazing amount of detail. Your respect for instrument designers will grow as you learn about the compromises they must deal with."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33ZMM2T1XUWC4"
                },
                "Date": "on April 17, 2011",
                "Helpfulness": 0.75,
                "StarRating": "1",
                "Text": "This book starts out promising, but it takes a turn for the worse very quickly.  The author tries to explain all the details of the acoustics in lay terms without using any equations that a high school student wouldn't know.  The result: a book with too much repetitiveness, very little information density, and overall very boring.  One of the few books that I would consider sending back.  I'll be looking for another book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A359H8M3SRUCF1"
                },
                "Date": "on March 16, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 1, 2000",
                "Helpfulness": 0.68,
                "StarRating": "2",
                "Text": "Of historical interest only, this book never was a comprehensive overview of musical acoustics, instead focusing on Benade's interests.  Now, it is horribly outdated.  Much interesting work is not in here...in fact there is no really top notch acoustics book with modern research available at this time."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25EK4RAG0EYZD"
                },
                "Date": "on May 19, 2015",
                "Helpfulness": "",
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YJN70KF4TQ60"
                },
                "Date": "on January 28, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I found this book to be fascinating and fairly easy to read. It comes in handy for me because I'm a musician  who also makes instruments. It has a lot of examples to solidly explain the idea's."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32468MF3RWD44"
                },
                "Date": "on April 20, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "An excellent text for a sound course for both physics majors and other majors.(speech and hearing and music, for example)."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1C16AHVX6PKIX"
                },
                "Date": "on September 12, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARL7XKZMM4GVF"
                },
                "Date": "on August 9, 2007",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "The best book on this topic that I have seen. Benade is a master of writing clearly and giving great examples that help the reader to visualize or imagine why sound is acting the way it does. I am using it in my quest to design a new kind of guitar, and it is extremely helpful. I also have Horns String and Harmony by Benade. He is a nuclear physicist with a penchant for audio, and I am glad he beat his weapons into flutes."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3W1GTPE4S4DN2"
                },
                "Date": "on June 23, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I originally purchased the book due to an interest in Irish Whistles (Penny whistles).  At the time I was interested in the idea of possibly learning how to make Irish whistles ... however once I ran across Michael Burke's whistles on the internet I soon shifted more to an interest in playing the whistle rather than making it.  While I wouldn't consider the book to be the bible of musical acoustics it is good book and I wouldn't discourage anyone interested in musical acoustics from purchasing it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21TDVW9PDKKXK"
                },
                "Date": "on November 24, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book is a must-have for anyone studying/interested in musical acoustics. Benade writes for the layperson, so anyone can understand the basic principles outlined here. Lots of illustrations also help immensely!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A391W1FAUDBF7L"
                },
                "Date": "on August 26, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "It is good for the beginner in Musical Acoustics. However, it no longer accounts for the numerous advances in acoustical science in the last twenty years."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1H29EQRN5Y9B0"
                },
                "Date": "on February 23, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Awesome!  Very Technical"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DK6TWK2ZFMNX"
                },
                "Date": "on January 17, 2015",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": "I'm o.k. with slightly used and worn books, especially ones like this. However, there was a fair amount of yellow highlighter pen throughout the text."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZBUAIHAX9JYI"
                },
                "Date": "on May 15, 2007",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "This book is close to exhaustive and can be an excellent addition to any reference library."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8NGPHJULMI9R"
                },
                "Date": "on January 18, 2011",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": "I purchased this book as it was recommended by one respected guitar maker.  Turns out this is a heavy duty physics book on sound.  It is mostly theory and very little applied physics/engineering that would help me in building better sounding guitars or musical instruments.  If you are interesting in building better sounding guitars you are better off listening to or reading books and videos by William Cumpiano and Ervin Somogyi.  Just my opinion, I would save my money and get their books.  I rate this book at two stars for those who feel you need to suffer with advanced sound physics concepts."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AW11F7ZJ0EUT7"
                },
                "Date": "on August 6, 2010",
                "Helpfulness": 0.36363636363636365,
                "StarRating": "1",
                "Text": "I was looking for a book to enrich my knowledge of acoustics and musical instruments. Having a BS in mechanical engineering, I am not a stranger to differential equations, but I don't particularly want to spend my leisure time solving them. This book is not for someone like me. This book is for someone who wants to read a novel about musical acoustics. Physical descriptions are not concise, but rife with draw out analogies. The ideas are miles apart. After having read a good deal of technical material I have come to expect a certain cold precision in descriptions of physical phenomena. This book doesn't deliver what I wanted. Now I get to decide if it is really worth the effort of extracting whatever knowledge I can."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIKJZ14PEGU02"
                },
                "Date": "on May 28, 2002",
                "Helpfulness": 0.4423076923076923,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30W3Q399G9XY3"
                },
                "Date": "on November 25, 2011",
                "Helpfulness": 0.08333333333333333,
                "StarRating": "3",
                "Text": "Bought this book when I was starting to get into building my own drum set and then never really had the time to as life just got in the way."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Fundamentals-Musical-Acoustics-Second-Revised/product-reviews/048626484X/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "26"
    },
    "Salesrank": "#260,451",
    "Timestamp": "2015-05-24 12:43:11.201639",
    "itemurl": "http://www.amazon.com/Fundamentals-Musical-Acoustics-Second-Revised/dp/048626484X"
}
