{
    "Category": "in Books (",
    "ListPrice": "$47.80",
    "Name": [
        "Student Solutions Manual for Essential University Physics, Volume 1"
    ],
    "OfferPrice": "$37.73",
    "Reviews": {
        "AverageStarRating": "3.5 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18TFXAREWMIL"
                },
                "Date": "on November 6, 2014",
                "Helpfulness": 1.0,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2581HGSNS50P6"
                },
                "Date": "on October 7, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "I choose four stars because the manual was very clear, but left a star off because sometimes a hard even problem would be presented that had no counter part in the odd number solution given. Just setting up the problem was entirely different from every other problem in the section, though of course physics (at this level) depends on the same few equations for each section."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CECSSD2LHWQO"
                },
                "Date": "on March 12, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Some basic mathematical mistakes can drive you crazy for few minutes until you conclude that the book is wrong and there is no way they got the answer written in the book. But as an overall solutions manual, it breaks the problems into many parts, verbally and mathematically, so you can actually understand what you are doing. It also has \"check the answer\" section when they try to teach you how to check your answers - logically, mathematically and in terms of physics concepts. I wish though that they actually write the full formulas instead of writing the numbers of the formula in the text - but I just made a list of all the formulas/numbers and that's how I go around it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3U7XCBS0SOO1W"
                },
                "Date": "on November 1, 2011",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "It's good how they worked out the solutions to the main text in this manual.  for the price of the book, it could have been better if they worked out all the examples.  It is a very useful study aid in getting the essence of how to work out the problems for those situations where you just don't have a clue on getting to the problem and you want more than the answer, you actually want to learn how it's done."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MLENJ2NYLW9K"
                },
                "Date": "on October 17, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This is pretty good. Maybe I seem like I am stating the obvious, but even though you have this you must still read your book. It is a very helpful tool/resource/guide.  With that said, I would recommend a year subscription to Chegg over this. The reason is, Chegg gives you all of this book, plus any other book you might need and includes the even numbers."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DWAV6QWURUZO"
                },
                "Date": "on October 19, 2011",
                "Helpfulness": 0.6,
                "StarRating": "2",
                "Text": "This wasn't required for my physics class, but I bought it figuring I needed all the help I could get.  Unfortunately, this book creates as many problems as it tries to help the student solve.  Not only are their silly typos and such, but even the mathematics are simply being carried out incorrectly.  Accidentally evaluating a vector with sine functions instead of cosine functions, forgetting to multiply an equation by all of the terms then presenting the wrong answer... these are SOME of the issues I've come across in my first 3.5 weeks of physics, and I'm not even using it all that often!  I will probably try returning this book to the school bookstore.  I advise you find another solution in place of this manual."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DCK0KE7M3FBT"
                },
                "Date": "on September 16, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Good Book. Student Solutions were helpful by providing step by step solution. Good details and everything about the book. Helpful physics book to learn materials."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FP58J8OORV7S"
                },
                "Date": "on October 1, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Cheap and just what i needed."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Student-Solutions-Essential-University-Physics/product-reviews/032171203X/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "8"
    },
    "Salesrank": "#114,162",
    "Timestamp": "2015-05-24 13:19:52.943420",
    "itemurl": "http://www.amazon.com/Student-Solutions-Essential-University-Physics/dp/032171203X"
}
