{
    "Category": "in Books (",
    "ListPrice": "$17.95",
    "Name": [
        "The Tao of Physics: An Exploration of the Parallels between Modern Physics and Eastern Mysticism"
    ],
    "OfferPrice": "$15.78",
    "Reviews": {
        "AverageStarRating": "4.1 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18RQ2URRGIIEA"
                },
                "Date": "on January 30, 2005",
                "Helpfulness": 0.9751552795031055,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WYIDGR8ZG21X"
                },
                "Date": "on November 11, 2000",
                "Helpfulness": 0.9072164948453608,
                "StarRating": "4",
                "Text": "I've read \"The Tao Of Physics\" two and one half times. The first time was fifteen years ago (the original paperback was a different edition, with a far more thought provoking cover). I then read this edition when it came out (I need to read it a third time, this time with more life experience to draw from). I'm sure most readers struggled with the technical dialogue and laws of physics throughout. I was more able to intuitively appreciate these tougher chapters than intellectually understand these sometimes very abstract and  difficult theories and concepts. Mysticism at times can seem equally abstract and difficult when one has not expereinced specific \"mystical\" experiences or enough of life itself. However, I intuitively connected to the threads which Capra so painstakingly weaved into his book. I was not looking for the answers to the universe in this book. What I was hoping to find was guidance, and a springboard in which to think in a larger universe. And when I look back, I realize my awareness and receptiveness to a \"universe\"and \"consciousness\" which is infinitely larger and wiser than the human experience and consciousness does indeed exits. \"The Tao Of Physics\" opened a window or two for me, and the inertia in which I had formed my opinions and prejudices and, then, learned to see and feel and judge the world around me, seemed embarrassingly narrow, lacking and unwise. That was a great insight for this young man at that time. \"The Tao Of Physics\" remains one of those books and experience that initially changed me in a small way, that eventually evolved into a substantive life change in how I think and perceive the world around me, and my relationship to it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2B9Y0WXNSN17U"
                },
                "Date": "on September 25, 2002",
                "Helpfulness": 0.8736263736263736,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AO7YNL3WLLYPE"
                },
                "Date": "on September 26, 1998",
                "Helpfulness": 0.9583333333333334,
                "StarRating": "4",
                "Text": "The book is a well organized presentaion of the simple observation that  science, religion, and philosophy are all trying to describe the same  reality in different terms and from different perspectives.  Taoism and  modern physics both take a minimally subjective approach to the task of  realizing what life is and are both extremely helpful to anyone searching  for the source of true spirituality.  The first review in this set refers  to Taoism as a branch of metaphysics, which it certainly is not.  Although  the book deals with various major Eastern religions, it is a good  introduction to Taoism and, for those searching, should be preceded by,  concurrently read with, and perpetually followed by reference to the Tao Te  Ching.  Most importantly, awareness of ones own life and its relationship  with the rest of the universe is the key; the answers can not be found in  any book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35ZPRESFHGXVA"
                },
                "Date": "on January 21, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Capra takes a step backwards to get everything into the picture and shows how a selection of eastern schools of thought and modern physics think so much alike.  He manages this without shoving religious dogma down your  throat or losing you in mathematics.  As a physicist, I was sceptical  about this book as often modern physics has been taken completely out of  its context and misinterpreted. Capra shows a thorough understanding of the  quantum mechanical and relativistic principles illustrated in this book.  For the non-physicist I would advise reading up some material on  introductory relativity and quantum physics beforehand, just as I felt  disadvantaged not having a good background in eastern philosophy. This book  strengthens my belief that an understanding of the human situation comes  not from a single spiritual or intellectual paradigm,  but from a  unification of the fruits of all human endeavours."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GDM2HIU6M21Z"
                },
                "Date": "on September 11, 2004",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "Shows interesting parallels between Taoist philosophy and western science. I've read three different sources in Taoist thought and I have to say that Mr. Capra has done a great job in making this book readable to the average \"joe\". Although I've long given-up my \"eastern philosophy phase\", I would still recommend this book. To put it simply, it's poetry in motion. Whatever your thoughts, I would suggest you read Lao Tzu's TAOISM first, then after reading this book make-up your own mind."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TZPRIVAK2C1P"
                },
                "Date": "on October 14, 2003",
                "Helpfulness": 0.9523809523809523,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23DN9GUMV0QS6"
                },
                "Date": "on July 5, 2004",
                "Helpfulness": 0.8809523809523809,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A134JIH42C64SO"
                },
                "Date": "on January 16, 1998",
                "Helpfulness": 0.896551724137931,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21QJ6WV3K2X74"
                },
                "Date": "on November 1, 2005",
                "Helpfulness": 0.9047619047619048,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SRZQU1SZG4RR"
                },
                "Date": "on March 6, 2003",
                "Helpfulness": 0.9375,
                "StarRating": "5",
                "Text": "This book weaves a magical spell over the reader who is fascinated by both science and mysticism. It covers both in great depth and detail. The essential teachings of Hinduism, Buddhism, Taoism and Zen are carefully distilled and the unifying principles of these paths are identified. The one characteristic all these '-isms' share is the awareness of unity of the connectedness of the whole. Capra compares and contrasts classical and modern physics while integrating the mystical truths as discovered in these religions. It is a daunting undertaking but he succeeds with aplomb! The close parallels between Eastern mysticism and modern physics (quantum physics) is amazing - each approaches reality from a different starting point but arrives at the same place. Capra writes about the cosmic dance of particle, energy, and consciousness - highly complex topics, in a very readable manner. He touches upon Geoffrey Chew's S-matrix theory (bootstrap philosophy) and Bohm's theory of Implicate Order. He calls the paradigm shift we are experiencing \"a crisis of perception\" from which all problems in the world arise. The manner in which scientific ideas are interspersed with mystical concepts is truly astonishing! Fritjof Capra manages to precipitate the essential kernal of truth from apparent divergent viewpoints ...This is a great book for anyone exploring the relationship of the rational scientific view and mysticism, i.e., the spiritual journey.  This is a very valuable book for the modern world. Erika Borsos (erikab93)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6CJ68FMJ014L"
                },
                "Date": "on December 31, 2006",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RUDKH1BAK4MC"
                },
                "Date": "on August 27, 2006",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is a great book.  My husband is an Engineering student.  This book helped me understand a lot of the things he was learning about and trying to talk to me about from his day in class.  It covers basic concepts like Newtonian/Classical Physics very clearly to help prepare the reader for the leaps away from classical physics and into the much more abstract concepts of unity and movement in the universe that come into play after Einstein.  This book was very helpful to me in that I find the mathematical approach to the sciences tedious so I never got into this that much...  I have a much more organic way of approaching learning.  I was an art history major in collage and am used to learning about large concepts then exploring how they relate to things.  The mathematical approach just never appealed to me.  So I missed out a lot on just how cool physics is!  I'm grateful to have a book that takes a comprehensive approach and made this information so accessible.  I have a background in Zen, Buddhism, Budo, Christianity, and some Native American spirituality and have felt a connection between them all.  I also grew up, oddly enough, rather synical so a book that takes a scientific approach to mystical understanding is just a phenomenal idea to me!  This book along with \"The Portable world Bible\", and actively taking part in art, meditation, martial arts training, and ceremony really helped me find those connections and come to a much fuller level of appreciation for life and the physics within it.  I got a great deal out of this book, not only in understanding science and my husband a bit better but in understanding the unity and movement of the nonphysical universe as well.  All in all I give this book two big thumbs up!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on April 8, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BF064E90TOW1"
                },
                "Date": "on November 2, 2000",
                "Helpfulness": 0.9166666666666666,
                "StarRating": "3",
                "Text": "This was one of those books that I had read when younger, but could not fully arrive at a conclusion until recently. This time I re-read afresh after spending a better part of a decade studying both science as well as Indian philosophy and language. The book is well written overall, but in overemphasizing the mystical view, the author tends to unintentionally give a misleading view to the non-specialist with regards to the need of the scientific method. (ref. my own personal experiences) As a rationalist, I also needed more emphasis on the fact that all ancient thinkers (Greek, Indian and Chinese) DID NOT understand modern physics in the same way the scientific community at large does today, as this tends to be what some readers take home. In that sense, I can only agree with the global correlations and parallels because they can be the product of a philosophical thought process. The micro parallels are Dr. Capra's vision, which is an independent debatable viewpoint. However, this was a very good attempt to show that these people were nonetheless leading intellects of their time and deserve due credit (often prejudged negatively) for a unique ancient philosophical approach to understand nature.  I wanted an equally detailed discussion of the other half of the picture, as all eastern thought was not limited to mysticism as many in the West tend to conclude. Thinkers of the time also frequently chose a very systematic method.  Examples include Panini, Aryabhatta, Brahmagupta and Bhaskara, whose contributions to modern Mathematics and Sushruta to plastic surgery are profound. For the future, I would like to see a composite rendition of  eastern thought in a new book by ??."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A99VHK0TNMHIE"
                },
                "Date": "on March 22, 2002",
                "Helpfulness": 0.85,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GZWCEITXDPTC"
                },
                "Date": "on July 5, 2002",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "The fact-of-the-matter is that conventional explainations of reality do not suffice to incorporate all of the phenomenon, or any of them really, if one takes consciousness as a starting point. The Tao of Physics does not explain reality either, as reality can only be lived, but it does begin to provide a 'hard-core' science-based-perspective that allows for mystical and parapsychological experiences. Capra does a good job at explaining the concepts and history of quantum physics. For me personally, I can say that this book is the most important book I have ever read because it opened the door to Eastern religion and so much more. We in the West are taught the primacy of science, reason, and logic, and because of that are led to discount certain types-of-thought as mumbo-jumbo. But quantum physics is wholly logical, and wholly proven, and if fully excepted, should blow your mind."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ROEAB9YU6EZW"
                },
                "Date": "on September 7, 2011",
                "Helpfulness": 0.7735849056603774,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on December 18, 1999",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVXGN90BU95P8"
                },
                "Date": "on March 13, 2005",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "I don't have a scientific background, so this book was a struggle for me.  There were many aspects of the similarities between Eastern Mysticism and Quantum Physics that I found to be quite interesting, but I have to admit that some of the scientific discussion was over my head.  I think the author did an excellent job of explaining a series of difficult subjects.  Mystic experiences are difficult enough to put into words, but I don't even think a language exists to explain recent developments in physics.  In any event, there is something to be gained from reading this book, even if you don't have \"a scientific mind.\""
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on September 10, 2003",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Although there are many books in the modern day market that deal with the overlap between eastern mysticism and recent discoveries in physics, this book is a pioneer in this field.  Even though it was orignally written a long time ago, I still think it is enlightening and important at this day and age.  The originality of the analogies discussed in this book still stands out as one of the best. If you like these types of east meets west books, you will also love \"The Ever-Transcending Spirit\" by Toru Sato. It is a book that relates eastern philosophies to many of modern western psychological theories.  It is also quite an amazing piece of work as well."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KTGW480O2H2V"
                },
                "Date": "on July 26, 2003",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17FHNIQ738LVI"
                },
                "Date": "on May 26, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGIRPW4M80NHN"
                },
                "Date": "on August 13, 2003",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "I read this book some 20 years ago, and can recall marveling at the directness of its insight and the balance in its presentation. Capra's work is one of those books that unfortunately becomes somewhat demonized because its very insight becomes distorted in the mass media. I'm sure you've heard and been frustrated by the new-age hyperbole about how science is \"proving\" Buddhism and all sorts of mystical beliefs, as if Buddhism or any spiritual insight needs or deserves to be \"proven.\" Capra was not trying to tell us to see quantum mechanics and relativity theory as proof of any religious or mystical ideology: he was merely pointing to parallels in the way different perspectives enrich our knowledge of ourselves and our universe. He was an articulate voice asking us to question the dualisms and oppositions that we have allowed to creep into our experience of the world and of our inner lives. This is why Capra's work has endured, and why it will continue to do so."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EJT905S6ZS4K"
                },
                "Date": "on April 2, 2005",
                "Helpfulness": 0.7619047619047619,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on April 24, 2002",
                "Helpfulness": 0.7307692307692307,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1W3I9QFPXNEYN"
                },
                "Date": "on October 17, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KUKRMJ79VQI4"
                },
                "Date": "on December 28, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IIGIXBH9NX4J"
                },
                "Date": "on September 19, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PW8X747LROSG"
                },
                "Date": "on January 28, 2012",
                "Helpfulness": 0.8,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AR2DE47VCY1C8"
                },
                "Date": "on July 31, 2000",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4IGGPAA7QAXR"
                },
                "Date": "on March 15, 2000",
                "Helpfulness": 0.8,
                "StarRating": "4",
                "Text": "Despite the fact that this book was written more than a decade ago..it still continues to be the the most sought after book for anyone who in intrested in the intrincically interwoven relationship between Modern  Science and Mysticism. This is primarily so because over the ages ,as  science advanced bringing forth the most sophisticated tools to observe and  explore the physical world,mankind not only became aware of the complexity  of the physical world but also of the limitations of the scientific method  itself as one approaches some of the deep and fundamental questions of our  very existence!This is so because we observe the universe through the  eyes  of what is known..which eventually leads us to the realm of the  unknown!Here the scientest stands baffled at the marvel of creation...and  it is this feeling of awe and wonder(as Einstein put it)that eventually  leads to deep contemplation of metaphysical reality...which can only be  perceived at the experiential level.No wonder the Nobel Prize winning  Physicist John Wheeler  coined the term\"The Participatory  Universe\"!This forms the very foundation of Dr.Capra's work!  Delving deep into the latest advances of modern Physics and ancient Eastern  scriptures/Mysticism Dr.Capra brings forth startling parallels between the  revelations of the Sage rooted in the Realization of the underlying reality  of our physical universe and the the Scientest's  rationalisation of the  obsevable universe!This is the point where Physics gets metamorphosised  into Metaphysics...\"What the Scientest experiments outside...the Sage  experiences within....Both encounter the same reality criscrossed\"!  Religions of the east were rooted more in Spirituality...and precisely  because of this reason the Sages of the yore realised the Universe within  as well!They saw the Universe as a Whole.. in it's entiriety!..Modern  Physics now talks of the \"Systems world view,Chaos theory,Bootstrap  theory\"..and a whole lot of so called new theories which are nothing  but the limited verbal expressions of the Vision of reality experienced by  the Sages!This is clearly reflected in a beautiful Vedic hymn chanted  honouring one's master..one's Spiritual Perceptor(Guru):  \"The vision  of the truth  an indivisible whole  encompassing the static and the  dynamic  living and the nonliving...  to that master my  Salutations\"! The Tao(way)of Physics this vision of Life as seen from  the Scientific perspective!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVITY65Q4OZGC"
                },
                "Date": "on January 8, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMAY6A2K0TN7G"
                },
                "Date": "on August 24, 2011",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GP36ZBGFP9PR"
                },
                "Date": "on June 30, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "This is a very useful comparison of eastern thought and ideas in modern physics.  That's all the author promised.  Really.  It will probably not convince physicists of parallels, as they are as fundamentalist as Billy Graham, in their way.  Eastern thinkers might enjoy the comparisons.  Those who pay attention to patterns will find this book fascinating.  Interesting book, and for its time, revolutionary."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2B8IJRK63KPZP"
                },
                "Date": "on February 9, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VDI1GQKNVA7U"
                },
                "Date": "on August 16, 2011",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1H7Y5XKPGT0OS"
                },
                "Date": "on April 21, 2009",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASG73OTRR0ZXQ"
                },
                "Date": "on September 6, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Everything that is boils down to energy. Two belief systems that show that most clearly are quantum physics and eastern spiritual concepts. This book makes that clear. It's brilliant."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AR2DE47VCY1C8"
                },
                "Date": "on April 19, 2000",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on April 25, 1997",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FT9F1JOVDZHR"
                },
                "Date": "on June 13, 2000",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZGHOQIHK7GIN"
                },
                "Date": "on March 3, 2011",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "5",
                "Text": "Are you wondering if you should read this book? This book translates abstract physics into something enjoyable, approachable and full of meaning of what life is in its essence as motion and transformation. In fact, I gained more of an intuitive understanding about quantum (really absolute) reality from reading this book than I did from my physics classes at the University of Chicago. Having also studied eastern mysticism in the Tao te Ching and other works, I was interested in a book that demonstrated the similarities. I didn't learn very much new about Eastern mysticism, but having physics taught in this way was remarkable, as if the science was transcending the intellect and speaking directly to the soul about life's mysteries."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7ZJV6RBFQVL2"
                },
                "Date": "on September 5, 2001",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "A good companion to Gary Zukav's \"The Dancing Wu Li Masters\", Fritjof Capra's classic _The Tao of Physics_ weaves the delicious semantic structure of Maya (illusion / creation) and the empirical world of particle physics into a crisp, entertaining Unity.  If you get only one book on the topic, get this one, then check his sources for background.  Especially good are Capra's treatment of 'S'-theory and the implications for how we should view time and space."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7ZJV6RBFQVL2"
                },
                "Date": "on September 5, 2001",
                "Helpfulness": 0.75,
                "StarRating": "4",
                "Text": "A good companion to Gary Zukav's \"The Dancing Wu Li Masters\", Fritjof Capra's classic _The Tao of Physics_ weaves the delicious semantic structure of Maya (illusion / creation) and the empirical world of particle physics into a crisp, entertaining Unity.  If you get only one book on the topic, get this one, then check his sources for background.  Especially good are Capra's treatment of 'S'-theory and the implications for how we should view time and space."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RKM79H3ANKJ6"
                },
                "Date": "on March 30, 2005",
                "Helpfulness": 0.7,
                "StarRating": "5",
                "Text": "I continue to recommend and give this book to anyone that I suspect might enjoy an adventure of the mind.  It is a wonderful read.  If you took physics in college and have ever read about world religions, you should be fine with the material.  This is a book you'll read and give away, and then buy yourself another copy...  Enjoy!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TG7HEZZ1QH55"
                },
                "Date": "on December 17, 2000",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39589MV4PHL2Y"
                },
                "Date": "on March 10, 2012",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AF2U6GA6ATJ9M"
                },
                "Date": "on April 19, 2010",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1J93EGDYK0IWA"
                },
                "Date": "on March 30, 2007",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17NT1ZWCBRXNY"
                },
                "Date": "on March 13, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "If one approaches this work with a preconceived determination to find in it mysticism and spirituality, or conversely, to adopt it for misguided religious reasons, they may be offended or disappointed. Certainly there is much righteous offense offered under the guise of science in many of the reviews. Neither approach fits my understanding. I saw Capra as trying to harmonize the rationality of the West with the empiricism of the East. Beginning with equating the unknowable essence preceding the big bang theory of the West with the unknowable essence of the Tao, he then extends the comparison of Aristotle's concept of the Golden Mean with the concept of ying/yang. Taoism proposes not rationality and second hand explanations of Western science, but direct experience as the keystone of living. That Capra's science may in fact be dated is hardly the point. That there is a balance of nature found in both systems is his thesis. The West is uncomfortable with nature as such and has generally treated it as a an external mechanism that has been constructed and therefore can (and should) be deconstructed like any machine. Taoism sees nature as an organic whole grown, not assembled. Western science seems to increasingly concur the latter view."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12G1W2Y1J9EU1"
                },
                "Date": "on February 24, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20EEWWSFMZ1PN"
                },
                "Date": "on April 6, 2009",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADZ63Y54ECKR8"
                },
                "Date": "on January 3, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The Tao of Physics is an oldie but a goodie! And, of course, adding your \"old friends\" to the huge library you can fit onto a Kindle is a no-brainer! The Kindle version includes the preface for the fifth edition and the afterwords to the second and fourth editions. The \"index\" is...well...I would not call it an index. It's a list of words, terms and names, some of which are listed under subheadings of other words, terms and names. It says it is for doing searches but one would assume one would already know what one was searching for...I don't know. It may be my first generation Kindle. I suppose the younger generations have more navigating options..."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on November 25, 1997",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "3",
                "Text": "Capra gives very good inroductions into the worlds of Eastern mysticism and modern physics.  Anyone interested in learning more about these two topics will enjoy this book merely for content.  But, Capra tries to draw parallels between the two worlds using very general and obscure arguments.  Religion and physics have nothing to do with each other, and in the end Capra proves this, the opposite of which he intended.  All in all the general reader will enjoy this, but an educated physicist will either laugh or become too frustrated by Capra's generalities to ever finish the book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SKEUMKWYKTOR"
                },
                "Date": "on October 18, 2007",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on November 3, 1999",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1P29IO67V0O9F"
                },
                "Date": "on August 24, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Capra was a pioneer of this idea of comparing, harmonizing and unifying Eastern mysticism and contemporary physics. It has now become a trend. In fact, thinking I was original in some of my propositions I find Capra postulated them more than 30 years ago. But he offers much more than this, he has the rare ability to translate the complex concepts into simple and beautiful phrases. I did not give him the 5 stars because some of the later chapters are arid. Truly a classic in its field."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MQIKD8FLTABX"
                },
                "Date": "on March 9, 2007",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "I think this book is one of the best books, if not the best I have ever read.  I have been reading about quantum physics and the unified theory for quite some time, and this book lead me in a good direction.  I think if you are interested in this kind of stuff this book is a must!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KV4RQE2FVIZ0"
                },
                "Date": "on July 31, 2009",
                "Helpfulness": 0.6363636363636364,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BAHNILX591F4"
                },
                "Date": "on April 22, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UJZISL3X88GQ"
                },
                "Date": "on September 25, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Fritjof Capra has delivered a remarkable piece of work in this book. Though the scientific study in this book may not be for everyone, it is a pleasure if one can persevere with it. I must admit that The Tao of Physics goes into more science than mysticism, but it has to be that way considering that most people who read this book will probably not be spiritually inclined. In saying that, I got a lot out of this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FRRTSFD5POYF"
                },
                "Date": "on April 28, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is my second copy. I Loaned my first copy out, and never got it back.  This book makes so much sense.  It not only explains sub-atomic physics in an Eastern-philosophical way, but it explains Eastern Religious Philosiphical thought in scientific terms — and makes it vitally interesting.  After fruitlessly looking for my first copy, I bought this one, just so I could read it for the third (or more) time."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AZYE2WWPLMPN"
                },
                "Date": "on August 24, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "Heavy on the mysticism, a little light on the physics.  If that's your bag, this book is for you.  If what your into is the history of science and quantum physics, you may want to look elsewhere.  Still, it's something of a new age classic; and for those folks for whom the name \"Eschelon\" and Shambala Press mean something, this book is a must read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MGHQTSA6J3X7"
                },
                "Date": "on March 20, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Mr Fritjof makes in this book a travel through the best parts of the physics esplained in a common and regular language, just for you and me and uses common points between the occidental and oriental cultures to put a foundation in his asseverations, really very good book with a magic touch to understand our world."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RFQ9EI3J3I13"
                },
                "Date": "on March 24, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Although many passages related to modern physics were nearly incomprehensible to me, the author enlightened me in mystical ways.  I want to explore his later books."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AP8XJPTALMB10"
                },
                "Date": "on February 18, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUQK1JDB55M49"
                },
                "Date": "on December 6, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I originally read The Tao of Physics in 1975.  That was my first intro to the parallels between modern Physics and Eastern Mysticism. Nice to re read in 2013."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3T79VHPTR9J97"
                },
                "Date": "on December 22, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "A new way to look at physics, but the premise gets lost in the monotonous nature of the writing.  Still enough philosophy to enjoy this with coffee and cake!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17BGCZCCJ8K6H"
                },
                "Date": "on March 14, 2015",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "Had this awhile . . . may be over my head . . . some stuff I like & helped me along in understanding . . . I look forward to some day enjoying this fully :)"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on January 30, 2003",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "What a wonderful book full of wonderful ideas!  When it comes down to it, \"truth\" is what resonates in our hearts, whether it is an object that you believe you are seeing or something you feel inside.  Many of the things explained in the tremendously insightful book resonates in our hearts.  That is why people keep buying it after almost 30 years of publication.  I enjoyed joining the author in his exploration and will continue to do so on my own.  I recently found another fascinating book that puts eastern and western thought together called \"Rhythm, Relationships, and Transcendence\" by Toru Sato.  If you like these types of books you'll probably love this one too!  Happy exploration..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NACX7AK29SF6"
                },
                "Date": "on March 18, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Beautiful. Poetically written. A fabulous introduction to the subject. I say ignore the negative reviews, because the writers are missing the point of this book. This is not intended to teach you the intricacies of physics. It is also not intended to preach eastern religion. It's an examination of the movement of science toward faith, and how the two are inseparable. If you're not opposed to such a view, then I think this is the book for you. If you can't handle the notion that the two go hand in hand, then yes, you will hate this. As for me...it was fantastic."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQ3J8LR1DUFWH"
                },
                "Date": "on March 27, 2005",
                "Helpfulness": 0.6382978723404256,
                "StarRating": "2",
                "Text": "Everyone I know in physics, like myself says \"I don't know about the Taoism, but he doesn't have the physics quite right.\" Everyone I know from an Eastern Philosophy background says \"I don't know about the physics, but he doesn't have the Taoism quite right.\""
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HJ5VYST9Y38M"
                },
                "Date": "on April 21, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Fits right on my book list as I try to understand physics...as a non-physicist. :)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AN6BMWHNZVENG"
                },
                "Date": "on September 18, 2000",
                "Helpfulness": 0.6,
                "StarRating": "5",
                "Text": "Man has two components: his essence and his social/cultural context. What  the author tries to convey is, no matter the surroundings, the nature of  his thoughts are always the same. It is unescapable. Simply put, regardless  of when and where, his substance remains unchanged."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28SKHNQUPBO59"
                },
                "Date": "on December 23, 1997",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "This book is marvellous of beauty. One of my source of enIightment is  gotten from this book. Since before I was hard to believe about God, because of our rational and immanent thinking. But this book is giving a bridge between those two.  But not only that, if you have the basic (knowing the theory of Taoism), it will give you an inspiration of  the other perspective of reality found useful in the practical living."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AY2L5OFK07KVQ"
                },
                "Date": "on December 9, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Worth reading. A good review of physics and thought provoking. Ronald Turco"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13CY4ZWSAA4IL"
                },
                "Date": "on November 27, 2003",
                "Helpfulness": 0.625,
                "StarRating": "3",
                "Text": "I'm one of those who believe that Eastern philosophies and religions are, in many respects, superior to Western scientific knowledge and values.  Although this is a very interesting book, the author appears to have tried too hard to find analogies for  modern physical concepts about the universe in Eastern philosophies."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on January 3, 1999",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "The thesis is that quantum mechanics were understood by Eastern Religions (e.g., The sutras of Buhhda, the Upanishads , etc.) 2000 years ago.  And that reality is much closer to the Taoist view than the western view.  It  is extremely profound. Capra explains many basic atomic physics concepts  clearly.  It does require some discipline to read all 341 pages. It is  worth it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RJD10TTI568L"
                },
                "Date": "on December 1, 2000",
                "Helpfulness": 0.6,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AH2TQ5FY584RU"
                },
                "Date": "on March 24, 2008",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27R4SM787VN98"
                },
                "Date": "on January 3, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Timely shipment, quality construction, interesting contents."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VHHI3VXHIQZV"
                },
                "Date": "on January 7, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Very interesting but lacks in depth quantum concepts."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32GGHNOVN6ASX"
                },
                "Date": "on February 12, 2008",
                "Helpfulness": 0.6324786324786325,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RGNT0PMSGK60"
                },
                "Date": "on November 18, 2009",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 20, 1998",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Some people get stuck on misconceptions (their own)or misunderstandings between the text and their own subjective minds (note reviewer above). The book is a wonderful telling, in a 'western' kind of way, of the simple and beautiful truth that embodies everything. It draws fascinating parallels between what we thought was the 'heartless' creed of science and ancient wisdom of the East; what deep and releasing insights follow every word! Capra (read also Web of Life!) gives all of us a new perspective to see the world, to \"experience the wholeness of nature\" and offers a meditative approach to \"the art of living in harmony with it\". Like 'the Prophecy' it adds to our ever-growing awareness of the universe and its intricate network of love, light and life; it is so undoubtedly true in the path that it follows, a simple miracle in an everyday Zen-life. Spread the word: mother Earth is transforming her  consciousness and while we help we rise with the waves and view the absolute ocean-floor...the timeless, whatever the meaning, and the simple beauty. Thank you, Fritjof Capra, for your contribution!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A360U395FFYYRH"
                },
                "Date": "on April 17, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "So much food for thought, truly a worthwhile read.  The artwork is also delightful.  As another reviewer said, this book is for people with open minds.  Capra gives the reader many different things to consider."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WYIDGR8ZG21X"
                },
                "Date": "on November 11, 2000",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "I've read \"The Tao Of Physics\" two and one half times. The first time was fifteen years ago (the original paperback was a different edition, with a far more thought provoking cover). I then read this edition when it came out (I need to read it a third time, this time with more life experience to draw from). I'm sure most readers struggled with the technical dialogue and laws of physics throughout. I was more able to intuitively appreciate these tougher chapters than intellectually understand these sometimes very abstract and  difficult theories and concepts. Mysticism at times can seem equally abstract and difficult when one has not expereinced specific \"mystical\" experiences or enough of life itself. However, I intuitively connected to the threads which Capra so painstakingly weaved into his book. I was not looking for the answers to the universe in this book. What I was hoping to find was guidance, and a springboard in which to think in a larger universe. And when I look back, I realize my awareness and receptiveness to a \"universe\"and \"consciousness\" which is infinitely larger and wiser than the human experience and consciousness does indeed exits. \"The Tao Of Physics\" opened a window or two for me, and the inertia in which I had formed my opinions and prejudices and, then, learned to see and feel and judge the world around me, seemed embarrassingly narrow, lacking and unwise. That was a great insight for this young man at that time. \"The Tao Of Physics\" remains one of those books and experience that initially changed me in a small way, that eventually evolved into a substantive life change in how I think and perceive the world around me, and my relationship to it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JGXAIK1FR1QR"
                },
                "Date": "on December 16, 2013",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "A classic. Capra is a great teacher. He makes quantum physics accessible to the non-science person unlike anyone I can name. The link between mysticism and deep science continues to be fascinating."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A291K5KCZ2NLC6"
                },
                "Date": "on March 29, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great way to obtain spitural healing"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GSKESIXR8IR"
                },
                "Date": "on December 30, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Wonderful read and very informative."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AVI41Y3XNOZ8"
                },
                "Date": "on April 16, 2013",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Anyone interested in the themes that the title presents has to read this book. It is an amazing achievement and will illuminate your mind and being."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOUNRCANTO5QD"
                },
                "Date": "on August 13, 2013",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "I first read this book about 30 years ago and now it explains where I got so much of my belief system. I liked it then and love it now!!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WG08FJIQOWBK"
                },
                "Date": "on December 14, 2013",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "this is a fantastic book for exploring the workings of the inner and outer universe.  an amazingly simple view of things."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on January 6, 2003",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "I thought this was a fascinating book!  The author allows us to see the parallels between eastern philosophy and quantum mechanics with ease even though they are slightly vague at times and perhaps necessarily so.  It helped me take another step toward understanding our own nature.  If you'd like something like this that relates more directly to your personal life I'd also recommend Rhythm, Relationships, and Transcendence by Toru Sato.  It's also a fascinating book!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FMNJ81L2VAUH"
                },
                "Date": "on March 9, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXIT475Q1T7TM"
                },
                "Date": "on April 22, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "An elaborate summary of the understanding of fundamental physics at about 1970. Posed as a comparative reflection on the similarities of the tenets of eastern mysticism and the energy packets perceived through experimentation, Capra brings a rational and logical tapestry to light that helps conceptualize an overall hypothesis of the energy (deity) that is pervasive in the universe, and is instructionally meaningful to our meager intellect. He provides an alternative explanation to superstition and miracles for our (not just humans, but all things as well as time) being and existence."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KZO93JNPOXYG"
                },
                "Date": "on December 26, 2012",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CDDQFUHSPLR1"
                },
                "Date": "on August 17, 2014",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": "Gift for the father in law, he like some of the ideas"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26J7WCYNKMRJQ"
                },
                "Date": "on September 16, 2009",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XD1M963W8D2I"
                },
                "Date": "on September 15, 2001",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I have to admit that I haven't finished reading The Tao of Physics yet. I finished the section titled \"The Way of Eastern Mysticism\" and raided the library for many of the referenced books. For a brief but helpful overview on Hinduism, Buddhism, Taoism, Zen, & Neo-Confucianism as well as information about the important scriptures & texts for each. I've never found any source more helpful!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CYVR2YGQRYVL"
                },
                "Date": "on January 30, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "It brings more light about the scientific search for truth of how nature works. This book will stand as a milestone, like a guide to understanding  the transformational process from separation to unity that is in progress."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TH012FRXIFFK"
                },
                "Date": "on February 28, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Clear explanation of the outlook of a mystic / buddhist/taoist  and a quantum physicist. These outlooks which seem to have different terms of reference can be expressed using the same words."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PDXT843YNPSH"
                },
                "Date": "on May 6, 2014",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "It was a college sociology class book review option.  It made for a good group and verbal  report but not something I would choose to read on my own."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OWU349LYKQ0C"
                },
                "Date": "on February 14, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "This is really the book that began way ahead of the curve. This field is changing rapidly but the updated edition brings it pretty current."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3A8P3WZIBMOJA"
                },
                "Date": "on November 16, 2013",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": "This is exactly what I needed! I am a physics graduate student and interested in spirituality, and this book does a great job of tying the two together. The author explains how contemporary physics is starting to understand some of the established teachings of spiritual traditions, such as oneness. He clearly knows how to think outside the box of standard physics interpretations, which have failed to address many of the pressing questions we have about the universe we live in."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1T5MSVU0KCSU4"
                },
                "Date": "on March 18, 2010",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "It has been the first time I have read a book that compare both concept that at the end, share the same view."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2P5RFZMBBJH2T"
                },
                "Date": "on October 12, 2011",
                "Helpfulness": 0.4,
                "StarRating": "5",
                "Text": "Somewhere in the 1970's I had studied enough physics and worked at enough depth spirituality to appreciate the words found in The Tao of Physics. I treasured my copy through five personal property moves and four decades. It wandered from shelf to shelf among many other books who would come and go as even the best friends often do. Recently, I wanted to read the Tao again. Failing to find it, anguished, I searched Amazon and ordered a replacement. Before it's arrival my dusty companion emerged, so I gave the new one to a friend for Sweetest Day."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DFI7BJ5V5E7U"
                },
                "Date": "on September 12, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Cannot live without this book"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19OORKBG1VUGU"
                },
                "Date": "on January 9, 2008",
                "Helpfulness": 0.42857142857142855,
                "StarRating": "5",
                "Text": "Scientific fundamentalists have all sorts of bad things to say about this and similar books.  Hey, guys, you don't like it, do a better job.  While I'm waiting for that better job, which I doubt you are capable of doing, since criticism is so much easier, and you are too lazy to do a better job, I will enjoy this book and books like it.  I read it when it first came out, and I still read it.  THis is an exercise in fascination."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A156BI27RGKP2U"
                },
                "Date": "on August 4, 2001",
                "Helpfulness": 0.4,
                "StarRating": "5",
                "Text": "This book clears the mysteries about God, life, science, religion etc.  Extremely reader-friendly."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10IBX4EW94E5L"
                },
                "Date": "on June 29, 2009",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IMX1JFK3JEOT"
                },
                "Date": "on July 14, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Perfect"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A198M7Z0YSLN32"
                },
                "Date": "on February 18, 1998",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Recommendable to anyone looking for answers to \"life\"........... My life has changed..!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25VSVN4KVJA3Y"
                },
                "Date": "on May 15, 2009",
                "Helpfulness": 0.25,
                "StarRating": "4",
                "Text": "A VERY interesting book, I was thrilled to find it at such a good price.  The book was shipped the same day I ordered it and arrived within a few days; it was in excellent condition.  I'm thrilled with the find."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LHWCVMZWHVBR"
                },
                "Date": "on April 5, 2005",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "4",
                "Text": "Essentially the trailhead for me on my best and happiest path to an understanding of life.  After reading the \"Tao of...\", I knew I wanted a consilience between all religions, science and philosophical thought.  Now after more than a decade, thanks to Capra I have found that joy and peace.  With my understanding now, there are no conflicts, no frustrations, even with the bipolar hypocracies of Christian beliefs.  I highly recommend that all begin their Tao and as with Joseph Campbell, \"find their Bliss.\""
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on September 18, 2000",
                "Helpfulness": 0.25,
                "StarRating": "4",
                "Text": "This is a good book, could use some more chapters on very cutting edge  material on the year 2000 discoveries or rather expansions of science."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OMUW894VBUAN"
                },
                "Date": "on July 29, 2001",
                "Helpfulness": 0.5538461538461539,
                "StarRating": "1",
                "Text": "I hope for the sake of the masses not all literature on physics and/or metaphysics written for the layman are simply incorporated as truth just because it's been written, and this is one very reason.  Capra's relations bewteen mysticism and physics are quite objectable and some references made to theory confoundingly irrational.  His assertion at times that subatomic particles can \"think\" and are almost \"organic\" are simply contradictory to sensical physics.  Many of his \"parallels\" are perspective-sensitive beliefs with basis on unsupported theory.  It is exactly information of this nature that keep the world of science balancing on its ears trying to keep from falling into the abyss of superstition from which we spewed less than half a millenia ago.  My advice to the reader of this: do so for the sole purpose of experiencing just how unscientific books categorized under \"science\", can be."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KNX2EYTW072N"
                },
                "Date": "on September 13, 2000",
                "Helpfulness": 0.25,
                "StarRating": "4",
                "Text": "I learned A LOT from this book.  Very readable."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OR6P1KO70128"
                },
                "Date": "on August 18, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Arrived as promised."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20XCJ8Y19CPK0"
                },
                "Date": "on February 11, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "WOW, MUST BUY, HAVE, READ!!!!!!!!!!!!!  ONE OF THE BEST. UNBELIEVABLE, MUST READ you must judge for yourself, but I highly recommend it. one two three four five six seven eight. nine!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3L0J23D02WD9I"
                },
                "Date": "on April 3, 2000",
                "Helpfulness": 0.4782608695652174,
                "StarRating": "2",
                "Text": "The subject matter is fine, but _The Tao of Physics_ is dull, repetitive, and superficial.  Many of the physicists who developed quantum mechanics had their own highly developed views on metaphysics; it's ironic that so few readers are aware of their writings and that a lightweight book like  Capra's is so popular.  Read _Quantum Questions_, edited by Ken Wilber, and  you'll understand why _The Tao of Physics_ is a weak book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38RYS33FFN5M6"
                },
                "Date": "on September 16, 2007",
                "Helpfulness": 0.2,
                "StarRating": "5",
                "Text": "I have been searching for for an explanation of impact of E=mc on the society for ages. This book has it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PZED7NQN2RUO"
                },
                "Date": "on March 25, 2004",
                "Helpfulness": 0.532608695652174,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TKMWHUXZJSYR"
                },
                "Date": "on March 31, 2003",
                "Helpfulness": 0.2857142857142857,
                "StarRating": "3",
                "Text": "This is a good comparison of the \"new physics\" and Eastern mysticism, however some of the chapters are hard to read and understand."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TGO5OUZMJDCL"
                },
                "Date": "on May 15, 2013",
                "Helpfulness": 0.38461538461538464,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4GAU0R7X4GCF"
                },
                "Date": "on August 28, 2007",
                "Helpfulness": 0.25,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YZ0YXXF657YE"
                },
                "Date": "on November 17, 2013",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "1",
                "Text": "I read this book before studying either Eastern mysticism or modern physics. Even then I got the feeling that the book can be summarised: \"here is a statement from a modern physicist which the author doesn't understand, and here is a translation of a statement from an Eastern mystic which the author also doesn't understand. Both statements contain the same word, so they must be saying the same thing\". Having now studied both, I have to say my view has only been confirmed."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIQP6FB2WO4CJ"
                },
                "Date": "on July 7, 1999",
                "Helpfulness": 0.45901639344262296,
                "StarRating": "1",
                "Text": "Physics is interesting and often profound.  Taoism is interesting and often profound.  But they are not related to each other, despite some loose parallels.  Ever watch Wizard of Oz while listening to Dark Side of the  Moon?  Interesting parallels.  But not profound.  Do yourself a favor and  skip this tedious exercise in self-delusion."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZP4BLYYQN7ZP"
                },
                "Date": "on February 7, 2011",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I got this i tem yesterday.The condition is not really bad ( used).I didn't resd it yet but I'm starting it.I think it must be a nice book and i got it in really cheap price and good condition.! thanks!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2W16CPZGFD7F5"
                },
                "Date": "on August 23, 2011",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "The book was received in excellent condition. The Tao of Physics was as described. Thank you. Althought I haven't really had the time do read much of it as I'm currently torn between reading 3 books. So I'm reading all three of them. =)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EFEQB9T9NPI8"
                },
                "Date": "on February 5, 2008",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on November 10, 2003",
                "Helpfulness": 0.35051546391752575,
                "StarRating": "1",
                "Text": "Early on in this book, Capra describes Nepal as a Buddhist country. The 90% of Nepalis who are Hindu might disagree. If he can't get such a basic fact right, how can we trust him on anything else? And as for Capra's avowed use of \"sacred herbs\" to enhance his knowledge of the universe, well,no matter how you choose euphamistically (or mystically) to dignify taking it, a drug is a drug is a drug, and the only thing it teaches you is what it feels like to take that drug. Wooly-minded tosh."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24AIRXQAK0WZO"
                },
                "Date": "on February 12, 2013",
                "Helpfulness": 0.06666666666666667,
                "StarRating": "1",
                "Text": "Not Good.  This was a real snoozer.  I only purchased this book becasue it was referenced in another book I was reading.  No truth found in these pages."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FOXDQ37C4ITI"
                },
                "Date": "on February 12, 2013",
                "Helpfulness": 0.19230769230769232,
                "StarRating": "1",
                "Text": "As the late Christopher Hitchens said, Faith is the surrender of the mind. Why do you need the mystic to understand anything? The mysic is basically the explenation of things that we cant understand, YET the explenation is a lie. Why does water flow downward? Because a magic water pixie wills it. Science will tell you its gravity. Science and the Mystic are not brothers, not even distant cousins. If they were, the mystic would be that relative that science kept in the basement."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A327WROB65O95F"
                },
                "Date": "on September 9, 2014",
                "Helpfulness": 0.06666666666666667,
                "StarRating": "1",
                "Text": "Tries to merge science and religion. I hate that."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on April 19, 1999",
                "Helpfulness": 0.26,
                "StarRating": "2",
                "Text": "Capra's  physics says virtually nothing about religion or the human condition.Words such as \"soul\", \"spirit\" and \"religion\" don't appear in the index.In the physics sections of  the book, religious questions are not addressed.His new physics seems to be  no more than an unrelated subjectivism, coinciding with flabby New Age  ideas such as creating your own reality.He over-simplifies physics and  Eastern thought.His answer is a simplistic \"all is one\", \"go  with the flow\" approach.This is re-cycled '60's stuff!I don't see much  that is of use in Eastern religions anyway.Their approach, especially  Buddhism, is to deny human problems and seek a stae of non-attachment to  life.They don't come to grips with living, they  say all is illusion,just  turn off your mind and deny life.Capra links his ideas with green politics,  feminist spirituality and other fashionable trends in a dubious attempt to  give his own ideas some credibility."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Tao-Physics-Exploration-Parallels-Mysticism/product-reviews/1590308352/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "137"
    },
    "Salesrank": "#53,445",
    "Timestamp": "2015-05-24 12:50:56.780160",
    "itemurl": "http://www.amazon.com/Tao-Physics-Exploration-Parallels-Mysticism/dp/1590308352"
}
