{
    "Category": "in Books (",
    "ListPrice": "$16.99",
    "Name": [
        "The Physics of Christmas: From the Aerodynamics of Reindeer to the Thermodynamics of Turkey"
    ],
    "OfferPrice": "$15.29",
    "Reviews": {
        "AverageStarRating": "4.2 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on December 28, 1998",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "This is a wonderful gift book, even better to own (but it is clearly a seasonal read). The author is a scientist of wonderfully broad knowledge, and he puts all of it to work to examine and evaluate virtually all of the  things that mean \"Christmas\" to the western world: from formulae  for estimating the cooking time for a plum pudding, to the history and  derivation of Santa, to why evergreens stay green, and beyond. Did you  know, for example, that there are serious efforts to clone Christmas trees?  Or that Santa's reindeer would only have had antlers at Christmas time if  they were female, or castrated? The title is a little bit misleading - it  is really the various sciences of Christmas, not limited to physics. This  is a book for adults or teens - dense with information and fun. There is a  wonderful bibliography, too, for further reading on specific subjects, and  a helpful index. My only complaint is Rudolph's battery-powered blinking  nose built into the hard cover, which not only raises the price of the book  but results in a poor quality binding that is not durable. This book should  be a \"keeper\", but the eccentric binding probably limits its life  span. That is a shame."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3Q3RL6828NUUL"
                },
                "Date": "on November 18, 1999",
                "Helpfulness": 0.9473684210526315,
                "StarRating": "5",
                "Text": "The title is a bit misleading.  This book is light on the physics while covering many other disciplines, including history, anthropology, sociology, psychology, chemistry (the author is a chemist), biology, and  physiology.  However, the broad range of topics keeps the reader's  interest. The author was also able to keep everything on such a level that  a reader with a minimal background in science can appreciate the book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GT3ZY6XN6F04"
                },
                "Date": "on February 25, 2000",
                "Helpfulness": 0.9375,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACSWT27EVE62E"
                },
                "Date": "on October 22, 2004",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Bought this book for my husband & he loves it.  So I bought a few more for presents for other people.  Not deep \"boring\" science, but good for those who lean a bit that way in their interests."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on November 11, 2003",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "For those who believe curiosity killed the cat, this book proves such cliches to be incorrect.  Dr. Highfield has done well to organize the massive amounts of research in sociology, psychology, chemistry, physics etc. in such a way as to explain much of the mysteries and associations of the holidays.  Despite such \"debunking\", Highfield somehow manages to retain much of the mystery and joy of Christmas in his writing, which balances humor and academic rigor nicely.  This is a must read for the perpetually curious, and holiday revelers of all sorts."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on December 31, 1998",
                "Helpfulness": 0.8888888888888888,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1T6PXM2M3N84A"
                },
                "Date": "on December 15, 2001",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AF9UVT3TIOE1Y"
                },
                "Date": "on January 11, 2001",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "As a fan of trivia, I found the scientific and historical accounts contained within fascinating.  It gives, as a whole, a sort of evolution of Christmas and it's traditions, interesting scientific information, and riduculously unimportant facts that are still a lot of fun to read.  Also, the book is wonderful coffee table reading because it is not required, or even recommended, to read it from cover to cover.  It is essentially a compendum of interesting essays, and a good buy."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WLMNEB3VTO8"
                },
                "Date": "on November 23, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TGV4BNJ9P4TW"
                },
                "Date": "on August 28, 2005",
                "Helpfulness": 0.6363636363636364,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2R0PCWJ4X9F5C"
                },
                "Date": "on December 10, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Perhaps the name isn't spot on since it covers so many other realms besides physics, but who cares. To me it's a Christmas staple, I listen to it each year to help me get into the spirit of the holiday, (I'm listening to it right now in fact) and each time I do I find different parts of it especially interesting or memorable, pretty soon I'll know it by heart :)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEL5FW72KVV8L"
                },
                "Date": "on January 15, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "My son's science teacher read a small fact a day for a couple of weeks before winter break to keep the kids interested in science and that sparked my son to request this book on his gift list.  Not a read thru book, but fun to pick up and see some facts broken down to imagine what is possible or not."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XKYHYO6GP2TH"
                },
                "Date": "on March 23, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This is a fun read but has very little in it pertaining to physics (just as an FYI). It should be called \"The Science of Christmas\" instead, because much of the book covers social sciences, etc. and not the physics of Santa's job."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RKBDAPJHI3P0"
                },
                "Date": "on January 24, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "this book made a wonderful gift for my boyfriend studying physics! you don't have to be a physicist to enjoy it, though! i really liked it! it makes a great gift for anyone interested or educated in the sciences and is also educational!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PKOVWV28MIYZ"
                },
                "Date": "on December 21, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book is great! It runs the gamut from botany to neuroscience to paleoclimatology to religious history! What more could a curious person want to read!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A310Z9KFHQE5V9"
                },
                "Date": "on January 19, 2007",
                "Helpfulness": 0.5,
                "StarRating": "2",
                "Text": "A bit of a disappointment. While \"The Physics of Christmas\" had some interesting science material and some bits of humorous writing, to me, it ultimately didn't have quite enough of either."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAMPGLZWIHJX3"
                },
                "Date": "on May 25, 2008",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": "A fascinating look at the Christmas holiday and its traditions, answering such questions as what was it the wise men saw and do candles burn in space. Easy to read, no math formulas. Fun!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EQ4YAZ5OEVK9"
                },
                "Date": "on February 27, 2000",
                "Helpfulness": 0.16666666666666666,
                "StarRating": "3",
                "Text": "Well, it is not about Physics. Unfortunately, my physics teacher recommended this book to us, thinking it was about physics, we have to read a physics book, and I started it. I was very unsure that it was about  physics, and now I realize that it has sooooooo little to do with physics.  What will I do now?  It is a pretty good book, although i have  read almost 150 pages of it.. it is very interesting, it give a large view  on christmas, explanining it. Although a lot of it is obvious, it  introduced some ideas and things that I would have never even though of  before. THis is definently not a physics books. Now I just have to figure  out what to do for my physics book project due next week, any ideas?lol:-)"
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Physics-Christmas-Aerodynamics-Reindeer-Thermodynamics/product-reviews/0316366951/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "18"
    },
    "Salesrank": "#747,923",
    "Timestamp": "2015-05-24 13:08:42.863450",
    "itemurl": "http://www.amazon.com/Physics-Christmas-Aerodynamics-Reindeer-Thermodynamics/dp/0316366951"
}
