{
    "Category": "in Books (",
    "ListPrice": "$19.95",
    "Name": [
        "The Emperor's New Mind: Concerning Computers, Minds, and the Laws of Physics (Popular Science)"
    ],
    "OfferPrice": "$17.77",
    "Reviews": {
        "AverageStarRating": "3.8 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1P0ZB4YAA312R"
                },
                "Date": "on December 18, 2003",
                "Helpfulness": 0.9134615384615384,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NZRPQ9TQ2M88"
                },
                "Date": "on May 10, 2011",
                "Helpfulness": 0.9361702127659575,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3I5CSD4ND60LQ"
                },
                "Date": "on September 11, 2007",
                "Helpfulness": 0.926829268292683,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 24, 2000",
                "Helpfulness": 0.85,
                "StarRating": "5",
                "Text": "First, what this book is not: It is not \"creation science\"...it doesn't address evolution...or the existence of God...or existence of the human soul.  In other words, it is NOT special pleading against modern  science by someone with a religious agenda.  What it IS rather, is a solid  study of cognition, theories of artificial intelligence, and the enduring  problem of the nature of human consciousness by one of the world's top  physicists (a professed materialist by the way, not a religious believer),  who together with Stephen Hawking developed the astrophysics of \"black  holes\" in the '60's.  What Penrose suggests here (a theory he expands  on in his subsequent \"Shadows of the Mind\"), is that science, and  specifically physics, is inadequate now, and more importantly will always  be inadequate, to describe the nature of human intelligence, cognition, and  consciousness--a thesis similar to the showing of Godel's 1931 Theorem that  certain fundamental axioms of mathematics were incapable of proof within  any mathematical system.  In other words, Penrose suggests that there are  elemental restrictions within science itself limiting our understanding of  our own mental processes, which concomitantly limit the possibilities for  development of artificial intelligence.  And that obviously doesn't sit  well with those for whom naturalistic science is itself a kind of  \"religion,\" as some of the dismissive reviews on this page show.  My advice: just ignore them and read this book, and well as its successor,  \"Shadows of the Mind.\"  It's a challenging read and not for  intellectual lightweights, but it will richly reward those with the  patience to make it through."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XD7GV792SZ22"
                },
                "Date": "on August 27, 2002",
                "Helpfulness": 0.8260869565217391,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUO1KTAZZV6HQ"
                },
                "Date": "on October 14, 2005",
                "Helpfulness": 0.7692307692307693,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10TIXSIN0HVNF"
                },
                "Date": "on October 2, 1997",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PMJ961NM8P86"
                },
                "Date": "on April 17, 2001",
                "Helpfulness": 0.875,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12QO7MGNSSKJU"
                },
                "Date": "on February 16, 1999",
                "Helpfulness": 0.7727272727272727,
                "StarRating": "5",
                "Text": "Roger Penrose, one of the world's top physicists, summarizes modern science, examining topics including Turing machines, relativity, quantum physics, black holes, etc.  At the end, he argues that the human mind can  not be simulated by computers or anything algorithmic. The Emperor's New  Mind is my favorite book, although I didn't feel that way the first time I  read it.  It is quite technical, compared to, for instance, A Brief History  of Time, which covers some of the same topics.  The second time I read the  book, I really dedicated a lot of time to understand the material as well  as I could, often working out problems with paper and pencil.  This was  necessary for me to see that his conclusion was related to the rest of the  book.  While Penrose obviously can not \"prove\" his belief, he  gives a strong, fascinating arguement, and the book has definitely affected  my philosophical views concerning consciousness."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WZ1B92F81LJJ"
                },
                "Date": "on October 9, 2004",
                "Helpfulness": 0.7235494880546075,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AENXJM2CKEN5L"
                },
                "Date": "on February 13, 2002",
                "Helpfulness": 0.7857142857142857,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16DO4SKKDBVR9"
                },
                "Date": "on April 13, 2011",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BKE8B96MMQER"
                },
                "Date": "on September 25, 2010",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BXTLX92ITBXC"
                },
                "Date": "on January 3, 2013",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YTWU8PZWZ39C"
                },
                "Date": "on September 26, 2011",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NCSRZAR4LDWX"
                },
                "Date": "on February 29, 2004",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NGJCCMZUNC3C"
                },
                "Date": "on September 16, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOW49ONCGPCJX"
                },
                "Date": "on February 3, 2009",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "5",
                "Text": "As a professional mathematician, I find Penrose's serious work colorful. So I bought this easy-reading book. The table of contents listed material that is the focus of many popularizations [yawn]. But this book is so far beyond the usual treatments that I am being drawn in deeper and deeper. My morning reading stretches on and on into office hours. Penrose writes beautifully!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30WRE5N6JRFJZ"
                },
                "Date": "on September 21, 2008",
                "Helpfulness": 0.7333333333333333,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVXKXKID66M7C"
                },
                "Date": "on June 9, 2000",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 31, 1998",
                "Helpfulness": 0.7222222222222222,
                "StarRating": "5",
                "Text": "Describe Yams to the English - \"they're like potatoes\", only they're not. You realise that when you first taste them, feel cheated by the description others have offered you, then find yourself using it yourself, for want of a better. So it is with books on modern physics, or modern mathematics. These are subjects in which the inmates are in charge of the asylums. It doesn't have to be so, but looks like being so for the forseeable future, for organisational and economic reasons. Who can exorcise, in six hundred pages, the terror of fifteen years of incompetent teaching, half-baked syllabuses, and horrifying examinations? Most attempts merely repeat that trauma. This book is quite the best account of modern physics and mathematics that I have ever come across. It's written by a visionary who has the deep respect of both physicists and mathematicians, and, to me at least, seems to represent a popularisation of the merging of pure mathematics with the mathematic! s of physics, which has been going on since the time of Dirac and Eddington. Penrose makes you believe that it's reasonable to cross the corridors of academe from Quantum Mechanics to Algebraic Topology, and back via Logic and Machine theory without being conscious of barriers; and, that it's reasonable that the people who pay for these games with their taxes might be initiated into them. A beautiful, brilliant book, by a master mathematician at the height of his powers. How do we relate to a subject? In my view, through  inspirational journalism. We all \"know\" that mathematics is a game for young men; because elderly, elegant, Hardy told us so, despite being an obvious counterexample. Just about every distinguished mathematician is rushing into print with their own impenetrable view of the world. In a situation in which the unreadable \"Brief History  of Time\" is an international best seller, you'd suspect  that no-one could come up with an account of mat! hematics which is accurate but which also captures the shee! r joy of being involved in it. If anyone has managed that, it is Penrose, with this incredible  book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38IVE56ANUPKN"
                },
                "Date": "on April 17, 2002",
                "Helpfulness": 0.7333333333333333,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEIPFPY9PE9LC"
                },
                "Date": "on October 18, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book is a classic. In it Penrose reasons about why the mind is not like a computer using theory of computation. I have studied theory of computation and find some of his results in this section doubtful. The second part is more about how a quantum field is responsible for our reasoning. This part is fascinating. I also recommend Shadows of the mind as it expands on some of the ideas in this book and describes a solenoid effect in the micro-tubules creating a collapsed quantum state. Really cool. Do't worry it makes sense if you read the book :)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15DE9EBYDVCVS"
                },
                "Date": "on March 19, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OJW07GQRNJUT"
                },
                "Date": "on May 23, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38HMHGUWGLMNM"
                },
                "Date": "on August 30, 2004",
                "Helpfulness": 0.6944444444444444,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DECZ2YDZVNFW"
                },
                "Date": "on July 3, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "There are other reviews that explain the book in depth, and did a good job, so I will just provide the basics. I am not a physicist, but I am a computer scientist. Bottom line this book is an excellent review of the state and history of physics. In fact I had to go back to some physics texts just to recall certain things. I must have taken 50 pages of notes while reading this book, while sketching through some of his ideas, it got my mental juices flowing. I loved that aspect of the book, he made you relearn or challenge old assumptions. His chapter on Quantum Mechanics was a little rough to get through, do not read that chapter at bedtime :<)). He makes the argument that what we understand to be consciousness cannot be imitated by an algorithm, that there is something more fundamental going on that algorithms cannot capture. In the final chapter he tries to explain the alternative answer, but to be honest his suggestion was a little weak in terms of presentation and argument. In the follow on book \"Shadows of the Mind\" he goes further in saying that even emergent algorithms cannot imitate consciousness. I do not agree with Roger Penrose's conclusions. But that does not prevent me from recommending this thoughtful book. It is a good read for those laymen who wish to go a immerse themselves in this subject for a while."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YEUL0KJW9J1L"
                },
                "Date": "on August 9, 2009",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "I'll have to admit: at first I had my qualms with this book.  I found the general idea extremely interesting - take us on a tour through mathematics, computer science, physics, philosophy, and biology to prove that a thinking computer is not possible.  However, upon first reading the book I found the material to be extremely difficult.  It just seemed that so much detail was omitted that it was incomprehensible.  However, after further reading, I realized that I wasn't reading the book in its proper perspective.  This should not be read as an air-tight mathematics text.  Instead, Penrose gives a big picture view of the logic and mathematics of most concepts; you would be better off trying to simply get the gist of the ideas as opposed to trying to obtain a full-fledged understanding (because such an understanding would probably require several volumes to be written).  In any event, this is now one of my favourite books.  (I also suggest that if you want a more detailed view of some of the concepts, you read \"Shadows of the Mind.\")"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GJGDRFQBK17M"
                },
                "Date": "on March 19, 2007",
                "Helpfulness": 0.7272727272727273,
                "StarRating": "5",
                "Text": "Jeez, twelve bucks and one hell of a good read! Stick your neck out and find out for YOURSELF if the book is any good. I'm suspicious that Penrose is being persecuted for theist tendencies."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DBXZY8JN2VEX"
                },
                "Date": "on April 24, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on September 2, 1998",
                "Helpfulness": 0.7,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QML1NJUS4BP8"
                },
                "Date": "on November 3, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Penrose uses Godel's Incompleteness Theorems to posit that conventional computers can never replace animal brains (artificial intelligence).  Remarkably, current writers on artificial intelligence seldom reference Penrose's idea, I think because it spoils the party.  As someone else pointed out, if Penrose is only partially correct the implications are enormous.  For the average reader much of the value in this book is in Penrose's penchant for thoroughly explaining the underlying ideas.  For example, he finally explained, for me, a fundamental technique in computer programming.  Excellent."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RGV05DY43ESV"
                },
                "Date": "on February 15, 2015",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Most people in this field consider Roger Penrose to be a bit 'off the wall', and perhaps he is, but he writes clearly and powerfully.  One of the better discussions of the difference between soft and hard AI.  Even people who don't believe in his theories acknowledge the power of his ideas - and crazy as they may be, we don't yet have any hard evidence that they are wrong..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A141UFFSFMGE54"
                },
                "Date": "on July 24, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RPTVW5VEOSI"
                },
                "Date": "on March 11, 2005",
                "Helpfulness": 1.0,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OSFQX30UASD1"
                },
                "Date": "on August 12, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OJW07GQRNJUT"
                },
                "Date": "on May 23, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OJW07GQRNJUT"
                },
                "Date": "on May 23, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OJW07GQRNJUT"
                },
                "Date": "on May 23, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OJW07GQRNJUT"
                },
                "Date": "on May 23, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKY9RPPIHNQGC"
                },
                "Date": "on October 6, 2013",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AN773TPE66SEK"
                },
                "Date": "on September 13, 2003",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "3",
                "Text": "Five hundred pages of extremely dense technical exposition leading up to a somewhat disappointing sixty-page argument.  If you already know advanced physics and discrete mathematics at an academic level, you can probably follow his explanations.  But then you wouldn't need them - you could just skip to the end.  If you don't already know this stuff, you're in for a real battle.  To keep from giving up in despair, I recommend additional web research on the topics as you go along to complement the book."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on April 5, 2000",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "I do not believe that previous reviewers are at all correct when calling this book a \"cult book\" or attempting to completely refute the conclusion of this book.  For one thing, this book provides a lot more than  just Penrose's conclusion, written in an understandable, yet extremely  in-depth style.  The discussions of Turing machines, quantum physics, and  consciousness are very thought-provoking.  Although Penrose's conclusion is  not proven, and may even be incorrect, the ideas he presents are well worth  the read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LEDLBIKXOYCJ"
                },
                "Date": "on May 30, 2002",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "Roger Penrose, a renowned mathematician and physicist, has put together a highly readable account of some of the most significant and yet perplexing ideas of modern mathematics and physics.  His writing is more detailed and more understandable than the popularizations of his colleague, Stephen Hawking.  This book renewed my interest in modern science."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AE9J2C24IMHUV"
                },
                "Date": "on February 7, 2011",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "Although Penrose basically reviews most recent theoretical physics in order to \"prepare\" us for his argument that our mind is not \"a computer\", it is not necessary to discuss all these different aspects of physics to bolster his views. A more simple approach would have helped readers not scientifically directed to understand his approach. Good reading for the converted."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1F0G9ZK8PZFK7"
                },
                "Date": "on June 4, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Very good book written by a real philosopher. Sets out the hard stuff by the elegant and simple way. I've really enjoyed it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OJW07GQRNJUT"
                },
                "Date": "on May 23, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6ZZEWZ88ARS4"
                },
                "Date": "on March 18, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMUNEV2BTL88W"
                },
                "Date": "on March 6, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13SJGE6ZIP66A"
                },
                "Date": "on November 12, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BSO9E3ZGRKV6"
                },
                "Date": "on June 25, 2001",
                "Helpfulness": 0.625,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on August 23, 1998",
                "Helpfulness": 0.6,
                "StarRating": "4",
                "Text": "Rather too rigourous and pedantic for the tastes of the fringe dabbler in  popular science,  it is all too easy to dismiss this book as  tedious. The  fact is, Penrose has been careful  not to oversimplify a controversial and  poorly understood subject. The crucial weakness of more readable books like  Godel Escher Bach is that, in the interests of clarity, no attempt  is  made to present opinions on the controversial aspects and to elaborate a  lot on the better understood aspects. Not a good book to start  with - GEB  is a better introduction, but  ultimately a more satisfying read simply  because there is more depth here. I would  label this book as halfway  between being  true 'popular' science a la GEB, Metamagical Themas and a  textbook. Not an easy read, approach with care! And if you want even more  detailed speculation look at Shadows of Mind which gets even closer to  being a textbook."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FKY3N6XOUPJ8"
                },
                "Date": "on December 2, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A challenging read for the lay person; but well written, clearly written and expect to get out of it commensurate with what you put into it.  Enjoyable, rarely travelled paths through the human mind."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DJUIGIXDOGE5"
                },
                "Date": "on September 12, 2000",
                "Helpfulness": 0.6153846153846154,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on August 4, 1997",
                "Helpfulness": 0.625,
                "StarRating": "2",
                "Text": "Readers must wade through a several-hundred page  exhaustive, sometimes interesting, always tedious, usually irrelevant review of modern physics before the author even begins to address the supposed main subject of the book -- will a computer ever be able to do everything a human mind can do?  The final conclusion is this:  Scientists don't understand consciousness; another area of poorly-understood scientific inquiry is quantum gravity...therefore, the two must be related somehow.  As an intellectual exercise this book is extremely disappointing, and I urge readers with even a remote interest in the subject matter to immediately purchase Douglas R. Hofstadter's Godel, Escher, Bach instead"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29OLWIETRSMU5"
                },
                "Date": "on September 25, 2013",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "i find this book to be the only one i know on what is close to being computational neuroscience translated to popular science material."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XTC1OJZLORMJ"
                },
                "Date": "on July 31, 2013",
                "Helpfulness": 0.5,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BL95GW5EPX1V"
                },
                "Date": "on September 3, 2000",
                "Helpfulness": 0.5714285714285714,
                "StarRating": "5",
                "Text": "This book is an extremley challenging read but of all the science books I  have read I feel this one covers the subjects concerned in the most depth.  While I would agree with the reviewers who feel that Penrose has put  together a patchwork arguement I am nevertheless grateful that he has  delved into the areas of chaos theory, relativity , Godel's theorom ,  quantam physics and others  as his descriptions are thought-provoking and  fascinating. Penrose ,rather than giving brief outlines of the area he is  covering , is prepared to go  into the intracises , leaving one deeply  enriched. Rather than treating the book in a single context , I would  recommend taking  each chapter as it comes , paying carefull attention to  the wonders of what Penrose is describing. Although I doubt very much if it  was his intention, I would like to believe that Penrose needed an excuse to  put all these ideas in a single book , and  the Artificial Intellegence  debate provided him with one"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 17, 1998",
                "Helpfulness": 0.5714285714285714,
                "StarRating": "5",
                "Text": "This is a book of insights. Penrose is touching the edge of the truth about the human mind but just missed it. I am now reading another book that has a section called \"Emperor Penrose's Mind\".  In my opinion, that book is truly revolutionary in helping us understand the nature of reality and of the human mind. The author suggests that the square root of -1 is the psy-factor in laws of quantum mechanics and theories of relativity. He also shows why John Searle, Douglas Hofstdater and Denial Dennett all committed the Fallacy of Unity Projection. the author agrees with Penrose that quantum mechanics is a possible key to the mystery of the mind, and the mind is more fundamental than material. The most fascinating part is that all these ideas are demonstrated in sci-fi like adventure stories (thought experiments) in virtual reality. The title of the book is, Get Real: A Philosophical Adventure in Virtual Reality, by Philip Zhai."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12D1TNXP8HX50"
                },
                "Date": "on October 5, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A great take on the mind as not being a computer"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EC1IG3LOB0NF"
                },
                "Date": "on September 30, 2001",
                "Helpfulness": 0.5714285714285714,
                "StarRating": "4",
                "Text": "The book is about Alghorithm, Modern Mathematics, New Physics and limitations on making a thinking computer. Half of the book provides necessary background in Mathematics more precisesly Turing Machines thamn author goes into fundamentals of Classical and Modern (Quantum Physics, Cosmology, Arrow of Time, Quantum Gravity, Brain and conciuosness. Although it is one of the best seller it is not for faint heartedly. There are no hard mathematics but a lot of hard logic. Turing Machine, summary of summary of Godel's Proof is all in there. Certainly requires a good knowledge of new Physics to understand what Penrose is saying."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10W44E0SR5GSW"
                },
                "Date": "on November 21, 2006",
                "Helpfulness": 0.5833333333333334,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A126KX6FVI4T66"
                },
                "Date": "on July 29, 2001",
                "Helpfulness": 0.6,
                "StarRating": "5",
                "Text": "It is probably his use of the Weyl tensor in cosmology that most sets this book apart. Some of it is a wing and a Prayer and not much more... like his fractals and Chaos parts, but he covers so much and gives so much light that it is a classic of popular physics. No one can say Penrose is not the man he thinks he is: he proves it over and over...."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on January 14, 1997",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 10, 1998",
                "Helpfulness": 0.5833333333333334,
                "StarRating": "2",
                "Text": "This book was recomended to me and some colleagues when I was in college. I read it after college, tho, and I think it's probably the worse science-divulgation book I've ever read. The writting is messy (\"check page xxx back there\", or  \"will be further discussed in chapter yyy\"), the AI arguments he presents are weak and were long refuted (just search the net), and his \"insinuation\" that there are quantic processes involved in out mind is totally without fundament/proof - pure speculation. The book is mostly about physics (with some depth to it), and hard to understand."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12A08OL0TZY0W"
                },
                "Date": "on July 8, 2005",
                "Helpfulness": 0.5714285714285714,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 15, 2000",
                "Helpfulness": 0.5789473684210527,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1M75NWB1L17L2"
                },
                "Date": "on October 28, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "It was in perfect condition. This is a great book for any writer.  I purchased this book as a required text for an english writing class. Perfect condition"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYJNG40HRY6Y4"
                },
                "Date": "on March 15, 2002",
                "Helpfulness": 0.59375,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APQIW0XW7RYJU"
                },
                "Date": "on April 19, 2010",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I loved this book.  I have a basic math & science background, and I am interested in physics but by no means an expert.  This book was fascinating and informative and was written in a way to make the knowledge accessible to an educated layman.  I cannot recommend it enough."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AJHH6AIAO8TK"
                },
                "Date": "on September 10, 2001",
                "Helpfulness": 0.6,
                "StarRating": "1",
                "Text": "The book covers a lot of ground, but the grand tour of physics and mathematics is designed primarily to support the author's argument that machines will never be capable of matching human intelligence. The author's main argument for this is based on Godel's Incompleteness Theorem. Unfortunately, this argument is just plain wrong. It assumes (without explanation) that human intelligence bypasses the limitations of the theorem in a way that computer intelligence cannot - as if humans somehow know it's better to be incomplete than inconsistent. The presentation of 'alternative' theories about the physical nature of intelligence seem unnecessary when the central argument falls down."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DJUIGIXDOGE5"
                },
                "Date": "on September 3, 2000",
                "Helpfulness": 0.4,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29KOUMEOY9CBT"
                },
                "Date": "on March 25, 2005",
                "Helpfulness": 0.55,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 21, 1996",
                "Helpfulness": 0.42857142857142855,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on January 6, 1997",
                "Helpfulness": 0.4,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 16, 1998",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Penrose is DEAD RIGHT. Strong AI is a nonsense. The irrational,  subjective, mishmash of the childish and the spiritual; the experience of  sudden inspiration, the emotionally biased reasoning to get the result we  WANT as opposed to the result dictated by pure logic; these will NEVER be  replicated by computers. The fact that anyone would even support this idea  is proof of the unstable way in which we reason - why passionately support  something which will never work? (How can you smugly announce that a  machine can have the same definition of Intelligent as a human when the  study of the mind and its workings are at an infantile stage of early  development. Such arrogance! You cannot argue by saying that a selected  number of outcomes are the same. If I wear my hair the same way as  Pavarotti and put on 120 pounds does that mean I am a great singer? DUH!!).  Because you are subjective and emotional you are attached to strong AI in  the way a child is attached to a comfort blanket. You have committed so  much time and vocal support to your backing of the idea that you CANNOT let  go of it without losing face. It is a beautiful example of Dr. Robert  Cialdini's description in \"Influence: The Psychology of  Persuasion\" of the fatal human propensity to consistency. (And there's  another quality you will not find in a strong AI machine!).  Strong AI is  strictly for Trekkies - \"strong AI machines are better than humans;  strong AI machines do not have to deal with human emotions (nasty  unquantifiable things!!); therefore as a supporter of Strong AI machines I  do not have to deal with my emotions. Viola! It is all right for me not to  be able to cope with life ... because it's LIFE that's wrong, not me!.\"  If anyone can put the irrationality WHICH IS PART OF THE DFINITION OF BEING  HUMAN on a glass slide, they will be in Penrose country. Handle it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15QWV5UBZUW13"
                },
                "Date": "on July 8, 2001",
                "Helpfulness": 0.42857142857142855,
                "StarRating": "4",
                "Text": "As a self educated, high school graduate I thoroughly enjoyed this book. I have read and re-read sections many times. While I do not agree with everything Penrose says here, I do agree with his position on AI. What I most enjoyed however, was his frank and enlightening discussions of relativity, QM and cosmology (and the problems thereof). Unlike many authors, Penrose is very honest about what science does and DOES NOT know. For me, the exaustive substance and clarity of the presentation makes this an excellent resource book, regardless of what one might think about AI. This is a book for the educated layman (or beyond) and as such, a high level of mathematical skill is not required. I give it three thumbs up!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 27, 1999",
                "Helpfulness": 0.5681818181818182,
                "StarRating": "2",
                "Text": "While parts of this book devoted to the popular description of concepts of modern physics and mathematics hold a pedagogical value for a lay reader, the rest of the book is really poor. The author makes an extremely loose  connections between completely unconnected problems, and with surprising  immodesty puts forward an extremely contrived theory of mind without  providing any semblance of logic, let alone proof. For any scientist  familiar with both quantum mechanics and some basic knowledge of biology of  the CNS, the main thesis of the book that consciousness is somehow  connected to the quantum mechanics of the brain function should certainly  look ridiculous; it's a completely arbitrary connection, and no proof is  even suggested. The author in effect attempts to employ a very cheap trick  to solve two of the greatest problems of modern science and philosophy, the  problem of consciousness and the problem of (apparent) ambiguities in the  formulation of quantum physics, by deciding to cancel them against each  other, linking them with an arbitrary mental construction. How convenient!  The suggestion that Godel's theorem proves that human thought is  non-algorithmic is laughable; while the theorem is one of the greatest  achievements of modern logic, it is only relevant for symbol-based  computation, and our brain certainly isn't a purely symbol-manipulating  machine: most neural-network computations are not based on applying  symbolic rules, although they can be implicitly algorithmic. Besides, to  suggest that humans can never encounter a statement that can be neither  proved nor disproved is almost humorous in its arrogance: the problem of  consciousness alone holds lots of such examples; problems of ethics is  another great example. Penrose's argument will only be applicable when we  discover a theory of everything and there will be no philosophical  questions left to be solved for humanity; only in that case one could say  that there are no contradictory statements for a human mind. ...I could go  on and on, but this is too long already. I personally find it fascinating  that an undoubtedly talented scientist like Penrose, one of the greatest  mathematicians of our times, can come up with something as absurd. I guess  this can teach the rest of us something about how the human brain works,  after all..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1G4YJEUIZ1CVJ"
                },
                "Date": "on May 29, 2010",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 29, 1999",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1U20CUTG6I28X"
                },
                "Date": "on May 18, 2000",
                "Helpfulness": 0.45454545454545453,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WN20C6JLWZIY"
                },
                "Date": "on November 7, 1999",
                "Helpfulness": 0.5793650793650794,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A55MRYPUAX4QU"
                },
                "Date": "on October 28, 2003",
                "Helpfulness": 0.45454545454545453,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3B1AHNG0ORLSL"
                },
                "Date": "on August 20, 2004",
                "Helpfulness": 0.5263157894736842,
                "StarRating": "5",
                "Text": "A wonderful survey of physics, mathematics, philosophy, and the mind. It is a welcome reality check to \"Strong AIers\" who are for the most part people who have read too much science fiction."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2O49E3PMV3ZPK"
                },
                "Date": "on January 16, 2004",
                "Helpfulness": 0.5,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on August 6, 2000",
                "Helpfulness": 0.4166666666666667,
                "StarRating": "2",
                "Text": "This book has basically two parts: one is an explanation of quantum  physics, and the other is an attempt to show that the human mind cannot be  represented by a computer, possibly because of quantum interactions in the  brain. The first part was hard for me to understand, not because it's  poorly written, but because the subject is very difficult. The second part  I found very flawed. The author seems determined to show that the brain is  not just a computer, and gives all benefit of the doubt to this theory, and  none to any counterarguments. Much of his argument is based on intuition -  the conscious mind *seems* to work a certain way, we *feel* that a certain  kind of thinking is non-algorithmic - which is not very persuasive."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39F539WIA7P8Q"
                },
                "Date": "on February 8, 2004",
                "Helpfulness": 0.5094339622641509,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31VZCVB7WBHZT"
                },
                "Date": "on September 6, 2004",
                "Helpfulness": 0.5,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KF6149KPKP43"
                },
                "Date": "on January 2, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XHBYXM8ONJ5M"
                },
                "Date": "on August 4, 2005",
                "Helpfulness": 0.5,
                "StarRating": "1",
                "Text": "I received my Ph.D. in Theoretical and Applied Mechanics from one of the best U.S. universities, and for more than thirty years was teaching and researching in the field of solid mechanics.  Before starting the reading of this book, I was in the agreeable mood with the author's that machines can never be human, and that AI will retain (if not forever) for a very long time its name - unreal.  But, now, I am dismayed.  The author unsuccessfully used 450 pages full of topics in mathematics and physics to support his point of view, making simple topics sound difficult, and making diffcult ones look impossibble.  The inclusion of his strange tilings is strange.  All in all, the book does not make sense. Moreover, his 'Note to the reader' (which is patronizing, arrogant and deceiving), and his Prologue and Epilogue (which are at best cynical) should have warned me not to venture any further.  I cannot help feeling sorry for myself and for several other readers; and most of all, if this is the author's usual way of communicating his ideas, for his students.  Luckily, I did not buy this book; for one person, who could not stand reading through it, dared me to finish his unfinished endeavor."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1B6WRKYNYAM0A"
                },
                "Date": "on December 24, 2009",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I didn't see it yet, my parents say it's good enough. It was also delivered before estimated date, which is good i guess. We expected a book that is used but in very good condition, and that's what we got. Thanks"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 20, 2000",
                "Helpfulness": 0.4634146341463415,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BFU6R8KAG1L8"
                },
                "Date": "on April 17, 2009",
                "Helpfulness": 0.46511627906976744,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FH3PGMV2OSML"
                },
                "Date": "on December 17, 2000",
                "Helpfulness": 0.4523809523809524,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A151LF9CPBNBLT"
                },
                "Date": "on April 19, 2006",
                "Helpfulness": 0.42105263157894735,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MMYG8669ECNE"
                },
                "Date": "on November 21, 2009",
                "Helpfulness": 0.125,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25MW9XAMMBMP4"
                },
                "Date": "on August 17, 2005",
                "Helpfulness": 0.43103448275862066,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 29, 1999",
                "Helpfulness": 0.3,
                "StarRating": "1",
                "Text": "Couldn't finish the book.  It was too whimsical to take seriously.  Generally, it simply skipped all the fantastic reality there is to modern  physics, and substituted speculation."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 5, 2000",
                "Helpfulness": 0.25,
                "StarRating": "1",
                "Text": "its a very very boring wrting style and has no material except of science history, if any body is looking for a hisory book.. then he will not find a better one, if there were less than a star for rating i would give it to  this book, i recommend hyper space for kaku for any body looking for a nice  science book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1444AL3QDUQKE"
                },
                "Date": "on December 23, 2013",
                "Helpfulness": 0.17647058823529413,
                "StarRating": "1",
                "Text": null
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Emperors-New-Mind-Concerning-Computers/product-reviews/0192861980/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "100"
    },
    "Salesrank": "#116,738",
    "Timestamp": "2015-05-24 12:46:18.291921",
    "itemurl": "http://www.amazon.com/Emperors-New-Mind-Concerning-Computers/dp/0192861980"
}
