{
    "Category": "in Books (",
    "ListPrice": "",
    "Name": [
        "Physics, Volume I (3rd Edition)"
    ],
    "OfferPrice": "$19.79",
    "Reviews": {
        "AverageStarRating": "3.9 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16X7GKCK83WUE"
                },
                "Date": "on April 30, 2004",
                "Helpfulness": 0.9354838709677419,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VE83MZF98ITY"
                },
                "Date": "on January 27, 2004",
                "Helpfulness": 0.9259259259259259,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CL76F15WQQJ3"
                },
                "Date": "on July 29, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGHLD1V2MAZJD"
                },
                "Date": "on April 27, 2007",
                "Helpfulness": 0.875,
                "StarRating": "1",
                "Text": "This book is for a non-physics major physics class, which is mostly going to be biology majors and a few others who are required to take a year of physics but don't need the calculus-based physics. The concepts of physics are explained fairly well, nothing spectacular.  The problem with this textbook is the inadequate explanations of the many and varied word problems encountered in a physics class. The homework in this book is a lot more complex than the simplistic explanations given in the chapter.  The hardest questions, which invariably show up on the exams, rarely have step-by-step explanations on how to solve them.  Physics professors like to talk about the concepts and how important they are to learn.  I agree they are important, but when was the last time you saw a physics exam that wasn't 90-100% physics PROBLEMS.  I may be odd but I find the concepts of physics fairly easy to understand and almost common sense.  The math problems of physics, on the other hand, are long, complex and difficult to understand.  The solutions manual isn't worth the money either.  If this is a required book for your physics class I would definitely supplement it with a physics book with good explanations of the problems and practice practice practice doing the problems from many different approaches."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QXV7PMCNY3WM"
                },
                "Date": "on January 25, 2007",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "1",
                "Text": "This book gets very wordy on its introductions and then just leaps into problems without explaining or outlining the concepts that need to be learned.  I am a chemistry major at Missouri State and I have come across a lot of scientific books that are difficult to understand.  This one beats them all.  Unless you have an instructor that is an amazing physics teacher, you will not be able to succeed in the class with this book. 'Most worthless book' award definitely goes to Walker."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3T6AC7FF5TPN1"
                },
                "Date": "on January 14, 2002",
                "Helpfulness": 0.7777777777777778,
                "StarRating": "5",
                "Text": "As a self-taught student of physics (age 53), I find this book extremely clear, nicely illustrated, and easy to work with.  The carefully explained and graded sample problems are exceedingly helpful for students who need to see how the pros solve problems before tackling any on their own.  The level is reasonably sophisticated without getting into calculus--perfect for many students.  Of the physics textbooks I have encountered, this is the best."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KO3Y12LM6OJW"
                },
                "Date": "on April 9, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "A great physics textbook. Has lots of illustrations and worked out examples. Also provides a plethora of different types of problems on the same material. Chapters are well organized and easy to read. A great text."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARA0EKH2IIL1X"
                },
                "Date": "on November 5, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book is algebra based with no calculus in any of the equations. This is helpful because I am a student returning to school after 20 years who never took calculus and this is my first physics class. The examples in the book are clearly explained and easy to understand. My class does not require a particular book but we were advised to purchase \"a\" Physics book. After my lectures I do my homework with this book and it follows the same format as my professor. This book is an older addition but that didn't matter at all. I would recommend this book to anyone who is new to physics and have no calculus."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWYYMMJG6TU6N"
                },
                "Date": "on February 25, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I tutor physics at the high school level.  All of my old physics books were from college and were calculus based.  I needed a reliable reference for tutoring without worrying about how to explain to the appropriate high school level without calculus.  This book is perfect for the task.  It has excellent examples, color to highlight pertinent points and is the appropriate level without having math be a stumbling block to learning."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AB5ITMQIF6AIY"
                },
                "Date": "on March 13, 2002",
                "Helpfulness": 0.7,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Z61QVBMKSI6K"
                },
                "Date": "on November 13, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I am doing a self-study of physics. Found early on that it takes a number of different general text books and several books focused on areas of interest (electromagnetics, in my case). So I have seen a  lot of the books around this topic. I can safely say that this is one of the truly BEST general physics textbooks. Well organized text, plenty of pictures, and for those that want to get their pencils into it, lots of practice problems."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on November 30, 2002",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "1",
                "Text": "Walker often takes leaps in conceptual explanations that leave the students wondering where the heck they lost track of what he was saying. I find Cutnell&Johnson's textbook to be much more concept friendly."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15Q17T81VZTB7"
                },
                "Date": "on August 2, 2005",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "3",
                "Text": "Of course, that may be because I didn't like the course all that much. I thought that the text was too wordy and did not present concepts well enough. The example problems are good to have and so are the chapter summaries. All in all, I thought the concepts could have been explained much better and with less words."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1S9WERPDRTGUY"
                },
                "Date": "on May 19, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "I really hope that someday someone will write a solid intro physics textbook that explains clearly the problems and equations that arises in test questions. the end of chapter questions are completely in a league of themselves from the in-chapter solved examples. there is a very big disconnect between them. the concepts, however, are explained pretty well."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3U7H7GX3U0EYO"
                },
                "Date": "on February 24, 2011",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "The book gives good examples when it gives examples, and is detailed enough when going over concepts so that you understand it. But when it doesnt give those examples you do have to do a little more searching. Overall its a good a book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XTSECK31CZIS"
                },
                "Date": "on July 5, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Best physics book I have ever read. Particularly the illustrations and amazingly good."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2A1W6X3NXCR7"
                },
                "Date": "on September 30, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "pleasant reading if you like that sort of thing"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MYEVHF2PH9GI"
                },
                "Date": "on February 14, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Just what I needed and arrived as described"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A327L0BRN33OUR"
                },
                "Date": "on April 26, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great value on a good algebra based text."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALP6SL2TQ0IPL"
                },
                "Date": "on September 18, 2009",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": "Nice diagrams, good explanations, and problems ranging from basic to very challenging.  Good for an introductory physics course that is trig-based."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZBE5N5O773XG"
                },
                "Date": "on October 13, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I hate physics!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TQ1AI1M0CZLF"
                },
                "Date": "on March 2, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31DDU0XA5X3CO"
                },
                "Date": "on February 12, 2013",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RA7S4DV9AL17"
                },
                "Date": "on July 4, 2009",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "This book is pretty good at explaining things, but my teacher usually comments that she doesn't like a lot of the problems at the end of the chapter. Personally, I feel that having the book has helped me a lot in understanding physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1O6KQQCIRKEFP"
                },
                "Date": "on February 13, 2010",
                "Helpfulness": 0.25,
                "StarRating": "5",
                "Text": "The book came within a few days after purchase, which was perfect timing. I purchased the same book prior to placing my order on Amazon at the school book store for 160.00 (used), and I was shocked at the rate I purchased this book which was in similar condition. So I quickly returned the book purchased from the book store. A huge thank you goes to Campbell's Book Bin..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33C8DIGBUG4QO"
                },
                "Date": "on November 30, 2008",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "when buying used, you don't get codes to access certain information, but otherwise there is some interesting information in this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FG0QJ0PKYEEH"
                },
                "Date": "on June 21, 2011",
                "Helpfulness": 0.25,
                "StarRating": "4",
                "Text": "The condition was quite nice and the item was perfect. The only issue I had was that there was no mention of the fact that the book was paperback instead of hardcover. Some copies are paperback and some are hardcover, but it was not made clear to me which was which."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JKSS0KMQCKUM"
                },
                "Date": "on June 28, 2009",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Good Condition. The book did not take too long. I am very pleased with the purchase."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PUSCW7HES7YU"
                },
                "Date": "on September 24, 2009",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "Book was a little rough around the edges, but for the price that was minor (and it was in the description!). No writing anywhere; great buy. Came within the week after being purchased. Thanks a lot!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11O8E6BIWGM3K"
                },
                "Date": "on July 8, 2011",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "i did not expect it to be so new considering that it is an older volume and i got it for a fraction of the newer versions so i am still pretty excited saved a lot of money"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PIKJ9KP8QUB"
                },
                "Date": "on August 15, 2009",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I ordered two.  One came quickly.  The other one has not yet arrived.  Excellent condition.  Great buy.  Thank you."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IS7HXEMQ6YIO"
                },
                "Date": "on October 23, 2010",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": "i bought this book because the book was in the -like new- category, and those are the only books i will purchase through amazon. i'm very particular about no highlights, no pencil marks, and good binding. i received the book a few days after purchase without delay, so i was initially very happy. once i opened the package, i noticed the book smelled awful. there were no highlights, no pencil marks, and the binding was great but the book smelled musty and old. if i had to describe the smell, it would be a mixture of ground up multivitamins and urine. i tried to get rid of the smell by closing it up in a plastic bag with coffee beans (trial 1) and then dryer sheets (trial 2), but the book still stinks. i haven't been able to open it up, thus, haven't been able to read for my physics class. i'm very unhappy with my purchase from this individual."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1260ZVFESIO9T"
                },
                "Date": "on October 11, 2009",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "The book was in the condition it said it was and it arrived in the time they said it would. I would buy from them again."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Y7VLBA18IV4O"
                },
                "Date": "on June 20, 2009",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": "The Seller was not honest about her return policy. When I purchased the book, there was not mention about return policy... I also emailed her numerous times so that she can send the book overnight since the class I needed the book for had already began and she ignored my emails and never responded not even to say \"I'm sorry but I can't\" so I had to purchase another book because I needed the book asap when I tried to return the book she said \"no\" I emailed her my situation (over two weeks ago) and to please allow me to return the book and again still waiting for a reply... I have been a customer of Amazon for over 3 years and until now, I have never had a problem with a seller or a purchased item until now... I DO NOT RECOMMEND THAT ANYONE PURCHASE A BOOK FROM THIS SELLER.... She does not reply to customers and does not care about your experience, only cares about getting rid of the books.... HORRIBLE EXPERIENCE AND SERVICE......"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMMBP52NDJ73"
                },
                "Date": "on February 23, 2009",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "This is a very good site to buy books from. I tried other websites before coming to amazon to buy this book. And this is where I got the cheapest price. it came to me within 5 business days. I am very happy with my purchase."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Physics-3rd-James-S-Walker/product-reviews/0131963929/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "35"
    },
    "Salesrank": "#650,738",
    "Timestamp": "2015-05-24 12:58:54.043110",
    "itemurl": "http://www.amazon.com/Physics-3rd-James-S-Walker/dp/0131963929"
}
