{
    "Category": "in Books (",
    "ListPrice": "$20.00",
    "Name": [
        "Chaos: Making a New Science"
    ],
    "OfferPrice": "$12.13",
    "Reviews": {
        "AverageStarRating": "4.3 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WXM6ZZYAIY1S"
                },
                "Date": "on July 12, 2005",
                "Helpfulness": 0.9846153846153847,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JVEZEL9C2DM5"
                },
                "Date": "on December 8, 2008",
                "Helpfulness": 0.9555555555555556,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KQ5QL4MWAJH0"
                },
                "Date": "on April 10, 2011",
                "Helpfulness": 0.9428571428571428,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9QT2VJ48SJG4"
                },
                "Date": "on August 1, 2004",
                "Helpfulness": 0.9315068493150684,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16S0CNPC88RXH"
                },
                "Date": "on September 2, 1999",
                "Helpfulness": 0.8943089430894309,
                "StarRating": "4",
                "Text": "I read this book when it was first published, and it was the beginning of a journey that led me to my present job (at a Santa Fe Institute spinoff  company), so I must admit to feeling a debt of gratitude to Gleick!  He  writes engagingly about the people who founded \"chaos theory\" and  explains their discoveries in easy-to-understand terms -- other  \"popular science\" works (e.g., \"Goedel, Escher, Bach\")  from the same era were beyond me mathematically, but I feel that Gleick  gave me a clear and accurate sense of what the theory was all about.  On  the other hand, he seems to focus too much on the \"who\" and not  the \"what\" of chaos theory, a habit that, unfortunately, has  persisted in other authors' books on the subject -- granted, some amazing  \"characters\" work in the field, but I think emphasizing their  eccentricity detracts from the solid science they're doing and the  real-life applicability of the theory.  To me, the best overall  introduction to this subject is Mitchell Waldrop's \"Complexity\";  Gleick deserves credit for piquing everyone's interest, but this book is,  to my mind, only an appetizer."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KJO5VP4K3CHU"
                },
                "Date": "on March 11, 2006",
                "Helpfulness": 0.9347826086956522,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VXF6ZN6S3715"
                },
                "Date": "on July 20, 2000",
                "Helpfulness": 0.9230769230769231,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1H7Y5XKPGT0OS"
                },
                "Date": "on July 13, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3V10H0ZIY8Y7L"
                },
                "Date": "on January 18, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is one of the finest books I have ever read.  It explains a difficult subject with clarity and enthusiasm.  It should open your eyes to an entirely new way of viewing the world around you - not the linear world of  cause and effect, but a world where things are not always as they appear.  Gleick compells you along with his fine writing and obvious love for the  subject.  A great read for the scientifically inclined and the curious."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12KSQJIS7F3W0"
                },
                "Date": "on April 9, 2000",
                "Helpfulness": 0.9333333333333333,
                "StarRating": "4",
                "Text": "I found this book in a second hand clothes store under a pile of paisley print ties. It would be no exaggeration to say that it changed my whole way of viewing the Universe. I had heard of the  \"Butterfly Effect\",  (although I had even that wrong.) But I read with a mixture of awe and  elation, that occasionally brought me close to tears. I promise you, after  reading this book, you will never look at a cloud speckled sky, or  raindrops suspended on a washing line (yes, go have a closer look at the  intervals!) the same again. I read it three times, not because the first  time was too hard to grasp, but just for the sheer joy of the journey.  However, I did find the last sections, about the applications a little  dull. It was like the final flat straight coming into the station after a  thrilling roller-coaster ride. Anyone can make a simple subject  complicated. Gleick has made a complex subject simple and appealing. Read  this book and start seeing again."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AB2AJPEN8DWNA"
                },
                "Date": "on May 17, 2001",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHXAPVSHPJ6OJ"
                },
                "Date": "on September 23, 2002",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VHAA20ZXGL4Y"
                },
                "Date": "on May 27, 2004",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NOZB6VZCTOI4"
                },
                "Date": "on May 29, 2005",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZM45NJ4DPG4N"
                },
                "Date": "on March 21, 2002",
                "Helpfulness": 0.9166666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SHYIS7SOIU2O"
                },
                "Date": "on January 10, 2003",
                "Helpfulness": 0.9166666666666666,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HVL7MRK1OWIE"
                },
                "Date": "on January 11, 2000",
                "Helpfulness": 0.8666666666666667,
                "StarRating": "4",
                "Text": "To put it simply, the book is a very good read for someone unfamiliar with the science of Chaos as it traces both the history and developement of the science. However, the book has very little mathematics. As such, the more  technical minded might find it far too general for their taste. This is a  book for the man in the street, not the scientist in the ivory tower. The  only question you may want to ask youself before you buy it is, which one  are you?"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 15, 2000",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "4",
                "Text": "This is an advice to potential purchasers: if you buy this book, I'm sure you're going to by other books about chaos. James Gleick presents chaos in such a clear and simple way that it's impossible for you not being  interested in learning more about this."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZY0WJYBWSJS2"
                },
                "Date": "on July 3, 2001",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "This book should have been called the \"Collective Biography of Prominent Names in Chaos Theory\" - Poincare, Mandelbrot, Lorentz etc. and not Chaos per se. It centers more on the lives of the scientists than on the field itself. For anyone looking for a comprehensive introduction to chaos, which will not be possible without at least some math (its like trying to explain what sweet is, without ever letting the person taste it) Gleick's book is not quite the answer."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVKRXU7HAL4E6"
                },
                "Date": "on October 1, 2001",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MS488V9WC48O"
                },
                "Date": "on January 4, 2011",
                "Helpfulness": 0.8888888888888888,
                "StarRating": "4",
                "Text": "This book was recommended by my adviser during my PhD, and it was mt first real introduction to chaos theory.  The book starts off very strong, and I really appreciated the author's willingness to tell some of the details of the creation of chaos theory that make this book read like a collection of stories of discoveries.  My most significant complaint, however, is that the author's attempts to draw all these stories together into a cohesive narrative and lay them out in context of one another isn't particularly well done.  It seems like the author went over some of the same information a few times in an attempt to bring things together, but for me the big picture view of the history of chaos remains a series of rather discretized discoveries, not a mounting wave of new ideas.  Regardless, each of the individual accounts is well done and the book as a whole provides a worthwhile introduction to the topic and its history."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QJZXPLSF6DAI"
                },
                "Date": "on January 18, 2002",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "James Gleick has put together an interesting portrayal of the development of chaos theory, through the lives of its makers and practioniers. Despite a lack of mathematical material, the book gives the reader a surface understanding of chaos in an easy to read format, much like reading a novel. The book moves through the timeline of chaos theories' development and looks at the people who have worked in the area, and also provided support to research in what had come to be known as a \"taboo\" subject. If you haven't had any exposure to chaos theory or you are a curious scientific mind, this is a good book to cut your teeth on, especially if you wish to shirk away from more mathematically detailed works."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 13, 1996",
                "Helpfulness": 0.875,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A635NWWHR6GVL"
                },
                "Date": "on August 11, 2013",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACF246F29L2F1"
                },
                "Date": "on June 19, 2000",
                "Helpfulness": 0.875,
                "StarRating": "4",
                "Text": "Well, this is a pretty good read that introduces how and why this weird theory called Chaos came about to explain things that are too complicated for reductionistic science to handle. It's long on history and short on  theory, so for some that may be a selling point and for others (masochists  who want the nitty-gritty of the theory) that fact may be a drawback. At  any rate, as far as science books go this one is pretty readable - most are  about as interesting as a missionary's bachelor party. Could use a bit  clearer organization and it left me thirsty for a little more meat in terms  of explanation of the Theory itself - but you can extract it from the  narrative to an extant. I liked it b/c it shows how little we REALLY know  about the universe and its design. enjoy..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23SB6VGGB9E8U"
                },
                "Date": "on September 13, 2004",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5EMI8VF1FPVX"
                },
                "Date": "on January 10, 2004",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIMR0B39ZSY66"
                },
                "Date": "on November 22, 2005",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": "It's very well written. It's not a textbook, nor a history, and not a novel, but it meets some of the standards for each. Should be fully comprehensible to any numerate person (cf. literate...). It's almost 20 years old, and it's still worthwhile; and don't forget, it was there first. It was the first book in ages that informed the rest of us about what the mathematicians were doing."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKFGK7WX2S4YQ"
                },
                "Date": "on August 13, 2002",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "A few years ago I was the only Psychology major in an upper division math course, Dynamic Systems and Chaos Theory. Though I was a minor in math with a decent mathematical background, the complex systems of equations were at first very daunting. This book was recommended to me and I read it in two days, it was so clearly written. It provided me with enough history of the development of dynamic systems theory (a more appropriate name for the science than Chaos) to give the math I was learning some context. I recommend it to anyone who is trying to apply the theories of Dynamic systems to social sciences, whether they are interested in the math or not."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on August 5, 1999",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I've been to several conferences that had plenary speakers discussing chaos and I always walked away unsure of what chaos theory was, but feeling that it was something important that I needed to find out about. A  professor recommended this book as a great introduction to chaos and I must  now recommend it to others. The book presents profound insights and ideas  in a manner that is understandable to someone, like myself, with a limited  background in mathematics and physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3I38S0783CKKA"
                },
                "Date": "on January 18, 1999",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "i was expecting something much more technical than what was delivered. Gleick goes into the story about the creation of the science of chaos without giving any explanation of actual discoveries: most of the chapters  read 'and then (x) discovered something really amazing, and i won't bother  to really develop it... on to the next guy'. it could have been so much  better."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2V8OBWKIA47R1"
                },
                "Date": "on December 3, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I read it once... and then again! Now, after a year, I'm reading it a third time. If you find of modern science history to your liking, you'll do no better than \"Chaos\" by James Gleick. One of my top five lifetime reads! Easily worth the Amazon price."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D7L0R1281COX"
                },
                "Date": "on May 17, 2004",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1S1YJT4DN3TEC"
                },
                "Date": "on March 16, 2002",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MCRFCQ9Q183Y"
                },
                "Date": "on October 20, 2001",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book is a history on chaos as a science; much like what \"Sophie's World\" does for Western philosophy, \"A Brief History of Time\" for physics, and \"The Elegant Universe\" does for string theory.  This book will change the way you look at the world in its seemingly random state.  The data turned picture or phase space, is truly amazing-especially the \"Koch Curve\", which is a geometrical shape that is infinitely long and finite in space; infinitely reproducing smaller triangles.  The idea of things going infinitely small racked my brain for months-to this day!  It's readable and interesting--it's theories on the workings of chaos for Christ's sakes!  Do your self a favor and get this book."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on September 25, 1998",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3R2TMP0E63M0J"
                },
                "Date": "on October 14, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Great read on the history of the emerging field of chaos theory as a loose multi-disciplinary field applicable to almost every discipline and yet adopted by no discipline as its own.  The pioneers are as varied, free-thinking, maverick, and ostracized as the discipline itself.  Approach this book from the standpoint of 'history of chaos science' rather than 'technical introduction to chaos theory,' as the work doesn't quite take upon itself to teach the reader the rigorous field of chaos theory even at an introductory level.  It is a book for the lover of science for science sake and a qualitative introduction to chaos at that."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 21, 2002",
                "Helpfulness": 0.7083333333333334,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2P6M135RRV62R"
                },
                "Date": "on September 3, 2001",
                "Helpfulness": 0.75,
                "StarRating": "4",
                "Text": "My interest in chaos started with a screen saver. The screen saver I downloaded is called juliasaver and basically calculates different fractal patterns in real time and displays them. I would sit and watch the everchanging patterns of colors on my computer screen in the dark for long periods of time (not hours, but long enough). They were complex and beautiful, I've even saved a few to use as backgrounds. I know very little about chaos, I knew that the chapter on chaos was towards the back of my calculus text book (a book I must admit, I hated opening). I also knew that it wasn't a simple concept but I was curious about how it worked. So I got this book. The book gives a good description of how the field got started and what the basics are. This isn't a textbook and it doesn't require a degree in math to read it. At times I had to stop and reread passages to understand what was going on, but given the complexity (no pun intended) of the subject, you'd almost have to. I liked the book a lot and it was a fast read given the subject matter. Gleick is an excellent writer, this isn't his best book (Faster is his best), but that is due to his choice of subject matter and not his writing. If you want a good review of chaos that doesn't require a math degree to understand, then this is the book for you."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18IAQ3V5923I4"
                },
                "Date": "on June 13, 2002",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on August 23, 1999",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "There is no other reasonable way to approach and even begin to appreciate and understand the function of any biological system without being familiar with chaos theory.  In writing \"The Care and Feeding of Your  Brain\" chaos theory had a key role in bringing me to some workable  explaination of how this beautiful organ functions and how we as  individuals can influence it.  This book by James Gleick was my first intro  to chaos theory that was understandable and yet fully comprehensive. Since  then I have gone much further but the insights provided by this book have  proven invaluable in my further studies of the chaos inherent in complex  biological systems.  I have now gone back to it twice in the interim and  have recommended it to several colleagues. It is very well written and was  fun to read even on the third go-around. All the best to Jim  Gleick...Kenneth Giuffre MD, author, \"The Care and Feeding of Your  Brain\", Career press, 1999."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MRYZTRUS1ZTL"
                },
                "Date": "on April 7, 2000",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "This book has enlightened me as to chaos theory, and yet is not so complex that it requires a doctorate in higher mathematics.  I found that it can be somewhat slow reading, but that is only because there is so much information given in every chapter. there is no extraneous material  involved.  I think this a very good introductory book in the actual  \"theory\" of chaos, as opposed to the \"mathematics\" of  chaos."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39THY6FURLCIM"
                },
                "Date": "on June 3, 2006",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on January 27, 1999",
                "Helpfulness": 0.7272727272727273,
                "StarRating": "5",
                "Text": "I read the other reviews and I hope this reaches at least one enthusiast because it is a required first-read for all. The whole point of chaos is a deviation from traditional science. James Gleick paints a vivid picture of  Chaos science and its  revolutionary change to the world. Chaos brings an  element of truth to endless formulas and departmentalized science. It puts  every branch of study on life into a full-perspective. The  point of this  book was not to give the reader a  math book, it was to descibe the  revamping of modern science and what it took for the world to get there. To  truely understand the math you  must first realize its purpose. Chaos is  about  life,motion and flow, it takes the lab back to nature... where it  belongs!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A245R7CULIL5RJ"
                },
                "Date": "on October 31, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25FDX17O3QKLT"
                },
                "Date": "on April 16, 2005",
                "Helpfulness": 0.75,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AYGXMH34R18Y"
                },
                "Date": "on September 15, 2003",
                "Helpfulness": 0.8,
                "StarRating": "4",
                "Text": "I'm on the heels of 72 other reviewers so there's not much sense saying more.  I found the book understandable and enjoyable.  A rare combination where physics is concerned."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JNK8I4IC8KV1"
                },
                "Date": "on March 28, 2007",
                "Helpfulness": 0.75,
                "StarRating": "4",
                "Text": "Mathmeticians, physicists, and others that unlike me did not find college level calculus challenging may be slightly disappointed with this book.  There are no real equations for the Mandelbrot Set on the cover or any of the other areas of the discipline that are illustrated so well throughout the book.  I have to say that the book was extremely interesting and difficult to put down.  The visual presentation rather than equations seemed effective to me and Gleick is a very good science writer.  There is possibly no other book that has stirred interest in this subject as well as this book for the layman in its 20 years.  If you're not disappointed that you won't need a calculator to read this, I think you would appreciate the explanations for this new perspective on physics, meterology, biology, geology and math.  I think of this book many times when I see alluvial flow patterns in the sand, the veination of leaves, mammotous clouds.  It's an eye opener to part of the world that you may not perceive or begin to understand without reading this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ET9V5JNVFOLY"
                },
                "Date": "on July 20, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Chaos by James Gleick is a must read if you like keeping up with science or just like reading things that broaden the perspectives of your thinking.  Gleick does a masterful job of simplifying the science of Chaos to a level any bright kid can understand while not diminishing any of its importance or ignoring any of the details.  If you're curious about what a Klein bottle actually is or a Lorenzo's butterflies, this is the book for you.  The illustrations of the Mandlbrot sets are truly amazing and worth the cost of the book just to look at.  With his clear, concise style Gleick leads the reader through the history of Chaos science while building a strong foundation for the understanding of it.  You don't need to know how to use a slide rule to read this book and it would be a memorable gift for any adult or child interested in science."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DJDQGVQOZCBY"
                },
                "Date": "on December 10, 2001",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27A6LUMBFWJGM"
                },
                "Date": "on August 20, 2006",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Chaos is a book about modern trends in physics; it is about the people and the history of a completely new trend in thinking about physical systems. In this fascinating book James Gleick does a very good job of integrating our knowledge about `randomness', `fractals', and of course `chaos'. The book is written in an engaging style that can appeal to everybody that is interested in our physical world and the people that is creating new ideas and insights into what we know about it. We all should know something about this new phenomenon because it is going to shape our understanding of the world around us in the future. Chaos theory is having an impact on medicine, weather forecasting, and just about anything you can think about."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHCF9XGK6IGPS"
                },
                "Date": "on February 5, 2010",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Gleick does a great job of chronicling the many (many) intersting characters who contributed to the study of chaos and simplifies it  enough to make it understandable. However, I think even a hardcore mathmetician/physicist/whatever would find it goes deep enough into the material to be interesting. Throughout the book he continually refers back to other people from earlier in the book. If you are anything like me you will not be able to keep these people straight and it gets confusing. I lost steam reading this thing about five times but eventually got through it. It was enlightening but not always riveting. If you are interested in chaos and learning about people much smarter than you, this is the book for you."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A325MODT9B090"
                },
                "Date": "on January 16, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 19, 1998",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "You want to know about people and concepts, then this is your book. If you want to know about actual chaos research today, then this is an historical account of the past. Because of this work chaos was pronounced dead by some, because it had all been done! Which is far from the case. Gleick appears to know a lot: he is a good biographer and science writer, but is not really a chaos scientist! As an outsider he gives a somewhat distorted view. The book is a classic and a must read, but the truth is still out there and it isn't called \"complexity\"!  Your unique Associates ID is:  thefractaltransl."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOIVLBZ8CH071"
                },
                "Date": "on August 20, 2001",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16EGSKWWTYIMW"
                },
                "Date": "on March 13, 2001",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is a very imformative book on the subject of Chaos Theory.  If you are interested in this topic you should start with this book since it goes through the history and development of Chaos Theory.  If you are looking for straight up mathmatics this is not the book for you.  But for a laymen like myself who has only a limited knowledge of mathmatics and physics this book was a great start.  I have moved on to more in-depth books on this topic and find myself always refering back to this in order to find out who or what person or theory was used to explain or develop a new facit of this subject."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26SNVGKGN2EZH"
                },
                "Date": "on February 17, 2001",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "Everyone should read this book, at the least it will shift your perspectives.  That is ultimately what the book is about; it does not present anything startlingly new, it is merely an attempt to presentthe world of science and nature in a new light; and Gleick opens our eyes gently and welcomes us to a new world view!  I came to this book from a non-science back ground, but it's sheer beauty lies in that it does not have to be confined to science; it has many applications in history for example, my field.  Believe it or not, I have found 'chaotic fractals' reepresented in historical events.  One day if I get published you can read about them!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARP7VAI1WFWLJ"
                },
                "Date": "on August 20, 2006",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on September 23, 1998",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SFMJLZ22O7Z9"
                },
                "Date": "on June 8, 2001",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "James Gleick has done a fantastic job here explaining the rudiments of the chaos theory in an easily understandable yet salient way that grabs readers.  If you are at all interested in Chaos, this is the book you need to have already read.  If you are afraid of math, it walks slowly into it and details more broad concepts rather than get elbow deep.  The book has great illustrations and interesting concepts that will intrigue your mind for months.  Imagine your self pondering the swirls in your latte..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADB8XCKNSDY5Z"
                },
                "Date": "on July 28, 2006",
                "Helpfulness": 0.6818181818181818,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A72L0MOARHKTJ"
                },
                "Date": "on January 27, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASW77A8J0I068"
                },
                "Date": "on January 17, 2012",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Q8HMSXQE3G6V"
                },
                "Date": "on January 5, 2002",
                "Helpfulness": 0.6923076923076923,
                "StarRating": "2",
                "Text": "this book tells novel-like stories about the scientists and mathematicians, but doesnt go very far into their actual discoveries/theories.  gleick touches on some powerful material, but fails to explain it.  he includes no equations, so if you dont consider yourself mathematically oriented, this book is fine.  i do like the pics of fractals though!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on December 21, 1999",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "A fascinating study of the history of chaos theory.  Although Gleick's writing got tedious about halfway into the book, it did not detract too much from the overall feeling of discovery and excitement I got from  following the stories of the chaos researchers.  Also, cool pix of  fractals."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KSWT4ZK59L2W"
                },
                "Date": "on May 26, 2006",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17SOKF4JF7JHF"
                },
                "Date": "on April 2, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OJW07GQRNJUT"
                },
                "Date": "on May 28, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NXO3XUJ6K32Z"
                },
                "Date": "on April 3, 2010",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3J1BRVN7GXC1E"
                },
                "Date": "on November 16, 2001",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1S3C5OFU508P3"
                },
                "Date": "on November 24, 2000",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Q5IWRPWBJWBT"
                },
                "Date": "on December 10, 1998",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Just to repeat the comments on the other reviewers. The history is interesting, but does wander about a bit and it is difficult to see how all the people who worked on different bits fit together. Well worth a read as  your first book on Chaos."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VF4BV5ONRSL6"
                },
                "Date": "on January 25, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 7, 2002",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I found this book fascinating, not just because of the look at the science, but also from a historical perspective, as Gleick traces various ideas and approaches' development and transformation within the science of chaos. I liked the passage in which he moved from Newton's conceptualization of light and color to Gothe's (better known as a writer, considered by some the 'father of German literature') more wholeistic look at the problem, which sounds rather silly until it turns out that scientists moved on to this type of approach when the tools of chaos made it possible, allowing new insights to be made.  Gleick thankfully avoids the patronizing tone and \"superiority complex\" which many science writers use to deride non-scientific persuits as having less depth than a kiddie pool. However, the framework of the book chaos owes a lot to Thomas Kuhn's book, The Structure of Scientific Revolutions, and while this approach allows Glick pull together many interesting and disparate bits of information (ie Newton/Gothe) that I like as a non-scientist, I wonder what the scientists, especially those mentioned in the later, paradigm-shift focus the book, would have to say about this book as a chronicle of their work. The strict Kuhn-ian terms provide a nice narrative structure, as well as heroes for the story, but I wonder how this might be misleading."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GRZWIF2GOX4J"
                },
                "Date": "on February 16, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "For the layperson to understand modern science and philosophy, some grounding in this subject of chaos is essential. One cannot do better than Gleick's book. First class."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1O3SZ5I2F42A"
                },
                "Date": "on November 19, 2007",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Okay, so it was a bestseller. That doesn't mean you didn't miss it. It doesn't mean you shouldn't read it again. Order in chaos and vice versa, the butterfly that creates a typhoon, fractal geometry, wildlife populations and dripping faucets (about which, more in a future Soupletter) - a book about ideas formerly on the scientific fringe that are now considered on a par with Relativity Theory (which, you will remember, made a considerable bang). ContempIating this review, I picked up CHAOS at the library (three or four years had elapsed since my first read) and was sucked in afresh. Meet a scientist who experimented with 26 hour days, another who found an operational definition of free will. Fascinatin' Rythms, Smooth Noodle Maps, Ice Ages and heartbeats. This is physics where the rubber meets the road. You don't need to follow the math (I don't, I just roll on by ...) to appreciate the ride.  \"Beautifully lucid,\" according to the San Francisco Chronicle which one notes, is published beside a once lucidly beautiful bay."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3S1YIQQW7AZO"
                },
                "Date": "on March 20, 2001",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I normally read fantasy and science fiction. I ALMOST NEVER read non-fiction. When I read Jurassic Park I was intrigued by Ian Malcolm and his Chaos Theory. How he proved the scientists wrong. I guess I liked his smart-alec-ness. Anyway, I ended up reading Chaos and ended up loving it. I appreciate the fact the Mr. Gleick does not bog the reader down with equations and mathematical terms that only a chaotician or nuclear-physicist would understand. Just about every person can read this book. Whether you'll enjoy it or not is another story. I agree with some of the other reviews that he did concentrate mostly on the people, not what they did. But I haven't read any other books on this subject so I'm a poor judge as to whether Mr. Gleick was justified in doing that. This book definitely changed my life. I see the world differently. A cloud is not one big structure, but a structure made up of infinitely many smaller structures. By all means give this book a shot, it's well worth your time."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1S1YJT4DN3TEC"
                },
                "Date": "on March 16, 2002",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1P697AISQIC2F"
                },
                "Date": "on September 17, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKY1C8WAQ92KO"
                },
                "Date": "on September 7, 2007",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UTKLUBN2J2DD"
                },
                "Date": "on September 24, 2006",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "I think it's weird how other readers have given this book a low rating because Gleick writes about the scientists involved in chaos theory and doesn't include enough math.  The subtitle is \"Making a New Science\" so I don't know what they expected.  I read this many years ago and found it a fascinating read.  I really enjoyed it, and reading it whetted my curiosity to learn more -- not a bad thing!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1P5LBGCIBEVU8"
                },
                "Date": "on December 19, 2009",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PELKPZ7DWXHK"
                },
                "Date": "on May 28, 2003",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Please don't read this book and think you know very much about Chaos, but it is a fun read. I really like Gleik's writing. I read Genius First, but found this book a real page-turner also. I especially liked the romantic description of Lorenz torwards the beginning in the book. I am fascinated by and find much beauty in clouds, so this book really set it's hook into me effectively. It also has some nice illustrations and descriptions of more popular algorithms."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AX4WT9X4BSODE"
                },
                "Date": "on January 5, 2010",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Mr. Gleick delivers to the reader a concise and approachable narrative of the history, science, and mathematics of chaos theory. Much as he did with his biography of Richard Feynman, Gleick managed to make the complex understandable for a non-scientist and manage to keep the reader engaged/interested. If the reader has an interest in chaos, this would one of the first books to read. Highly recommended (just sorry it took me 20 years to getting around to it!)."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKOAVUCLLGOJB"
                },
                "Date": "on November 5, 2007",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "James Gleick changed my view on the scientific world forever in his book Chaos.  I feel that I've removed my old, Euclidean perception of the world and have replaced it with a more complex, organic, and dynamic view.  This book is a great introduction to chaos and is not meant to describe the applications of this theory.  The applied sciences of chaos, complexity, or systems theories are readily available in journals and other pubs, just do a little research."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2F1FMNU0USC1T"
                },
                "Date": "on July 15, 2003",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book is an excellent book.  It clearly explains the concepts and the history of chaos theory.  This book shows the reader some very interesting and deep insights into the way the universe works.  I am an electrcial engineering student, and I have seen how chaos can be used in engineering.  This book explains some of the applications of chaos theory.  I would recommend this book for anyone wishing to gain a better understanding of chaos theory."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MRYZTRUS1ZTL"
                },
                "Date": "on April 7, 2000",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This book has enlightened me as to chaos theory, and yet is not so complex that it requires a doctorate in higher mathematics.  I found that it can be somewhat slow reading, but that is only because there is so much information given in every chapter. there is no extraneous material  involved.  I think this a very good introductory book in the actual  \"theory\" of chaos, as opposed to the \"mathematics\" of  chaos."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CXA62HV1PJHA"
                },
                "Date": "on March 25, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "If you are not a science major then you do not have the background to appreciate this book.  Not too much math but it explains a lot about experimental error and hidden mathematical patterns that are important to scientific types.  Even more interesting are YouTube videos starting with \"hologram universe\"  Physics is coming up with some every interesting ideas."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KEDNNJ3WXDAD"
                },
                "Date": "on January 16, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book is my favorite and I was so very excited when the seller had it to me in a matter of just a few days...in time for a very special Christmas present! I can't rave enough about the book or the seller, and can't wait to hear how the recipient that I give this book to likes it. If you have a little bit of that scientific type brain then check this one out!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3H6FNPU0JHXZM"
                },
                "Date": "on July 8, 2001",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A well written book, it deals with a rather esoteric subject matter, and doesn't always put that subject matter into non-technical terms.  It is, however, an excellent read.  I don't know that I really subscribe to chaos theory per se, but this book is definately a good primer for someone who is new to the concept of the enormous effect of butterfly flappings."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D7GMMQ5UDHZE"
                },
                "Date": "on March 7, 2003",
                "Helpfulness": 0.6,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A115VTDOOFUVG4"
                },
                "Date": "on July 19, 1998",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "The book is very interestingly written. It draws you in to the world of chaos. But then, where you're deep in, you have to look in other places to try it out and apply the ideas in it. For example, seeing the fern image on your computer is very simple, but as a young reader years ago I searched Scientific American for an explanation of how it's done."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CSLNA9UUDJXM"
                },
                "Date": "on July 13, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "cant recommend this enough. read it couple of times."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FDZUH0TEEF5P"
                },
                "Date": "on July 7, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DWVFKGL38G3T"
                },
                "Date": "on May 27, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A308FBCEIT7O06"
                },
                "Date": "on May 7, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book is intended for those individuals that have a significant amount of scientific background, and that could relate to the fundamental theories deployed within it. The novice shouldn't even pick it up."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CDU6HA4KKG5Y"
                },
                "Date": "on April 23, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Good place to start"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UHU0JRM7JNNM"
                },
                "Date": "on March 21, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "The author tryed to transform a very exact scientific matter into a popular palatable romance. I think he was not quite successfull. But it makes for a good reading."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HYL6HRJE21VC"
                },
                "Date": "on December 20, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Studying Calculus in high school, this book clearly portraits complex chaos and nonlinear dynamics with such a simple language that did not require me to get any additional information regarding the topic. Further more, at parts it was easy for me to understand the whole beauty of Chaos dynamics. Chaos: Making a New Science consist of various examples and applications of unpredictable patterns in real life. It shows why Chaos Theory is an important scientific field to work with, from huge weather modeling and economic systems to small biological and quantum examples. This book really shows the potentials for the fairly new field, in part because James Gleick gives the readers the entire history of the field. Majority of the book examines specific examples of how chaos dynamics became famous. It does not specifically gets into complex math analysis of chaos dynamics, which is why it is much easier to follow for beginners, but instead shows why chaos dynamics is important and opens up the whole knew world for those who have never encountered these kind of complex patterns before. This is why this book amazed me. I was fascinated by how much this field can do. As i want to continue my education either in economics or engineering this book definitely draws my attention to chaos theory and i will definitely continue researching and studying this field in the future."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Y58CG2XOI3E6"
                },
                "Date": "on September 3, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Great book a little bit over my head but I learned a lot about everything. Needs to be read :)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33LVMWUOSRPOK"
                },
                "Date": "on July 2, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Really interesting book. Very easy to read. It outlines the history of the science of chaos and its properties. Highly recommend it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4DZC7346I0NA"
                },
                "Date": "on June 9, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SBJM1Y3D4RDK"
                },
                "Date": "on February 14, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I have only gotten through the first chapter of this book but I have already received incredible insight into understanding the basics of chaotic systems. This book is meant for the laymen and is not to difficult to read through. I would recommend for anyone that has questions about complex patterns in weather and animals."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10BZSGALQPS0V"
                },
                "Date": "on December 22, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15RZ1A2BD4JTI"
                },
                "Date": "on December 21, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book not only gives historical perspective about the development of chaos theory, but also gives the non-specialist and educated layman a glimpse of how science is done, and the motivations of scientists. James Gleick has done a very good job of explaining important ideas without sophisticated mathematics. This is especially important as one cannot understand the material much better than is presented here without some measure of exposure to topological ideas."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39REGSZMVGTFI"
                },
                "Date": "on August 5, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A261ZLNLNRU6SD"
                },
                "Date": "on June 16, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I thought maybe I should buy the new hardbound version, but this paper copy came through just fine, with color prints to boot. Now I'm learning about math and formulas I never knew about!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IU9VPCBKZPE8"
                },
                "Date": "on April 22, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NQCUIMG9EE5W"
                },
                "Date": "on April 16, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I haven't gotten all the way through the book so yet but so far its been fascinating and its the first book Ive read in quite a few years."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13R6HAMP86QER"
                },
                "Date": "on November 22, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book is the most interesting book I've read since my formal education ended.  Seriously, take time to work through it - figure out the examples, study the drawings.  Master this subject, and James Gleik makes it relatively easy, and you'll never see the natural world, or the entire field of social behavior in the same way.  Chaos theory (better title: non linear systems) is that important a subject, and the book is that good a way to learn it. Go to the trouble.  It's worth it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFKMBR6QL54Y6"
                },
                "Date": "on September 5, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book gives a great overview and history of the study of chaos and bifurcations. My professor suggested this book as a fun read to accompany his graduate-level class. By the way, for those who want a more in-depth analysis of chaos, I'd recommend the text book for that course. The book is called \"Nonlinear Dynamics and Chaos\" by Strogatz."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NRC2N9N0ATTH"
                },
                "Date": "on July 29, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "My studies of quantum mechanics and string theory led me back to an old intuition of mine called chaos. After devouring many books on all of the above, I found that John Gleick's book got me right back up to speed with the history and progress of chaos.  He writes it like a novel, without getting bogged down in all the details that us non-scientists would be overwhelmed with.  He sticks to the heart of the matter, the over-arching message.  And for that, I greatly enjoyed the book and has led to more advanced study and some pretty wild discussions with my wife.  This book offers insight to what we all take for granted or just choose to ignore.  I thank the author for the insight and also the direction for further study."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28ESNLBAF04GF"
                },
                "Date": "on October 4, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "this book is precise, clear and completely understandable...we are using it in a college course, and the class agrees that this is the best of the books on CHAOS.  High school students can easily learn from this book and probably 8th graders also...the illustrations are clear, the sources clearly explained...i would buy it again!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on January 8, 1999",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "A good (and incidentally inexpensive) introduction, but it is doubtful if the concepts discussed can really be appreciated without actual reader mathematical involvement.  I have FORTRAN available on the PC, and it  helped a lot to slip out some of the math. With this as a given, the book  is fascinating indeed."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 11, 1999",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Best non-fiction book I've read in years.  The concepts of chaos are mind-expanding, and this author makes them interesting and accessible to us non math and physics majors. Explains how simple biologic codes can produce  complex organic structures among other things. Wonderful!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 3, 1999",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I read the portuguese version of Chaos and I just loved it. Simple and easy to read. The only problem is that it is not for everybody. Not everybody is able to read it. Anyway if you are curious go for it... Maybe  you'll love it too!!!!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 22, 1999",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Before reading this book, i felt that chaos theory was a way for a dry and dusty professor to impress gullible first year students.  Now, i still feel the same, but also i feel that i would be more than glad to be gullible  too."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TG7HEZZ1QH55"
                },
                "Date": "on November 16, 2000",
                "Helpfulness": 0.6,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NARTCSSNAC4Y"
                },
                "Date": "on April 1, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Interdisciplinary journey to the sources of chaos theory. For me, the greatest discovery in this book and at the same time the greatest inspiration is an attractor."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26GKBPVOJY1WB"
                },
                "Date": "on May 20, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent intro to the new science of complexity and chaos (non-linear dynamics) and its relevance to everyday life. (It's also a good intro to approach Kabbalah)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1E8IAF911ZSSL"
                },
                "Date": "on June 21, 2002",
                "Helpfulness": 0.6333333333333333,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29BKUBPWA1BP1"
                },
                "Date": "on April 18, 2015",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": "decently well done.  no way does it measure up to The Information, though.  same writing style, but this book's subject matter isn't nearly as enthralling."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A884FZF7M6ZHL"
                },
                "Date": "on July 22, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "The book was in a very good condition and it was a great deal for such book. The material seems interesting and I will use it for my upcoming grad-class."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A298Y226HKWCYD"
                },
                "Date": "on March 31, 2000",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Like Sao Paulo (below) says, it opens the doors to  Chaos Theory, and from an interest grows a passion. One of the most memorable books I've ever read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CYRTQ04LYI55"
                },
                "Date": "on March 11, 2007",
                "Helpfulness": 0.6,
                "StarRating": "5",
                "Text": "Is Chaos theory a new title?  Or a catchy name tacked on to the science explained by non-linear math?  Either way, James Gleick explains the emergence of a new non-mainstream science movement.  Like most of his pop science work, Gleick delves into the history, personalities and impacts of the science, as opposed to the in depth mathematics behind it.  Taken as that, it's a worthy book that meets it's goals - documenting what might have been the beginning of a great scientific revolution."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JUO03T3KAQ9V"
                },
                "Date": "on June 24, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "the book is lovely. Its made for anyone to understand the subjects and ideas it has, it would be nicer if it included more math."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VFTQ2A11XCX4"
                },
                "Date": "on September 27, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Favorite science book of all time. Hands down. It's a page turner, even for those of us most comfortable in the humanities."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OJ91LUY51QZ"
                },
                "Date": "on June 25, 2007",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is another excellent book from Gleick, surely one of the best writers alive right now."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 23, 1998",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The book is easy to understand. It amazed me. I would recomend it to any college student."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OD6RUL4CWT99"
                },
                "Date": "on January 5, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "A Good review of history and the characteristics of this interesting field of science"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 2, 1998",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": "The book is overweighted with the history behind chaos theory and therefore never dives too deeply into chaos itself.  I knew some about chaos before reading the book, but after, I wasn't much better off; I came away with but a handful of new ideas.  However, it is a good layperson's read as an introduction to chaos; math and high scientific speech is almost non-existant.  I recommend it for the physics-interested middle or high school student."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AN6NIGBUDEXI8"
                },
                "Date": "on May 6, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Interesting. A bit difficult to read for someone not familiarized with the theory."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2U82IFJLPZXJT"
                },
                "Date": "on May 5, 2010",
                "Helpfulness": 0.6153846153846154,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MZJ7ZLHT7I0F"
                },
                "Date": "on April 8, 2010",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": "\"Chaos\" made an interesting read especially for someone like me fasciated by the mysteries of the nature. It is as if the nature has been playing hide and seek with us and not revealing its true colors. At times, the narration drags a bit and needs extra concetration to hold on to the flow. But a good introduction overall to an  \"armchair scientist\" like myself."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADEDN0DH1YGD6"
                },
                "Date": "on March 29, 2013",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZD0F3U5HP4NJ"
                },
                "Date": "on February 2, 2013",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21MDNBC3I2L0T"
                },
                "Date": "on January 4, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A must for anyone both amateur and professional of system theory"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9H3ABJYSGMUM"
                },
                "Date": "on September 25, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Dr. Gleick makes a difficult subject comprehendible"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KYJ079V2RST"
                },
                "Date": "on January 17, 2005",
                "Helpfulness": 0.5714285714285714,
                "StarRating": "3",
                "Text": "This book tells the stories of the scientists responsible for giving birth to and developing chaos theory. These stories are extremely well-written and engaging, but unfortunately the author does not give the science part equal attention. It is a very entertaining book, and you will come away from the book with a genuine curiosity for science in general and chaos theory in particular, but you won't find out much about chaos theory itself. Which is kind of tragic, cos you just finished reading a whole book on the subject. Maybe the writer did not want to get into mathematics. But I still feel kind of cheated."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32HUFR3ZWK86B"
                },
                "Date": "on February 23, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Still in the process of reading the book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7UMC95YCRGTS"
                },
                "Date": "on July 2, 2003",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "This is good coda and accompaniement to Gleick's recent book on Isaac Newton and is a classic chestnut in this subject, the 'later career' of the mechanics, born to such exactitude and the solid hopes of hard-wired physical law. The troubles began in the eighteenth/nineteenth century as the new analytical mechanics began to reckon with the Newtonian implications of the three body problem, and Poincare, the real discoverer of chaos, takes it from there. His prodigious powers of visualization of the problem short of the real instruments, before the days of computers, to calculate the details is practically a myth of the ancient giants. Resurfacing in the age of the brainy digit crunchers, physics will never be the same, even subtracting the hype that tends to mystify the onrush of complexity theory."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACFTPKBAVA1F8"
                },
                "Date": "on September 8, 1997",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "One of the few non-fiction books that I continually re-read. If you found the brief (semi-accurate) glimpse of Chaos theory in Jurassic Park intriguing, this is your path to deeper understanding. This is completely accessible to the layman, and so profound in its implications that it should be required reading. The basic asumption of our era, that knowing enough, understanding enough, would make the universe perfectly predictable and our systems absoluterly efficient, is so clearly destroyed by this work that you will never look at the world the same again"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2V8WDJYG4MYXU"
                },
                "Date": "on July 28, 2000",
                "Helpfulness": 0.5714285714285714,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NUP3RN0JWS1M"
                },
                "Date": "on June 17, 2003",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "The book provides insight into the science of complexity and chaos. The author presents the field in an easy to understand language and provides fascinating observations from real life. There is no doubt that chaos and complexity theory is making a strong impact in the various scientific fields for example physics, biology, epidemiology, genetics, chemistry, management science . The book provides a non-technical introduction to this growing field and takes the reader through the various stages of the historical development of this area. I would recommend this book to anyone who is fascinated by science and who at some point in time wondered about many aspects in nature that doesn't have a good explanation based on our conventional knowledge of science."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14HFU0L07YVHY"
                },
                "Date": "on November 30, 2006",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Here is a readable and fascinating account of the development of the new science of chaos theory, the only body of ideas that describes how the natural world as experienced by human beings emerges out of basic quantum processes.  The different explorers and innovators of the new science are introduced in a personable way that will enchant the interested reader."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHCORNQ04KO07"
                },
                "Date": "on February 3, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "fantastic book"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2O2GNN3N5LFFN"
                },
                "Date": "on April 4, 2012",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "This book on complexity theory explains chaos concepts through the history of the discoveries. You not only learn about Strange Attractors and Bifrication, but also about the men who first coined these terms, and the conditions under which the discoveries were made. Fewer pictures than Turbulent Mirror, but if you're going to read two or more books on Chaos Theory, this should be one of them."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BB5TMQTYNVMG"
                },
                "Date": "on November 21, 1998",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "This book is great.  There's no other way to put it.  Gleick takes a seemingly complicated topic and makes it palatable to even the casual reader.  Presented like a novel, this book reviews the entire history of  the science of chaos.  Anyone serious about studying chaos should read this  book.  It will give you great insights into the history that this unique  science has gone through"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 16, 1997",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "This book describes very well how did the study of chaos developed. It goes from the time the science was just emerging, to the period, when chaos was beginning to be found in many different branches. After I read this book, my first reaction was that I wanted to get off, and try the experiments from that book out myself!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32J8GNZHQTQEE"
                },
                "Date": "on March 6, 2012",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "The product was in excellent condition and just as reported in description. Shipping was faster than I expected. This book was exactly what I expected. It gives a good summation of exactly what chaos theory is."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHOEGSC2WAOZ6"
                },
                "Date": "on May 23, 2009",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A383746LFAIRWM"
                },
                "Date": "on October 16, 2001",
                "Helpfulness": 0.4,
                "StarRating": "4",
                "Text": "In \"On Linearity\", Chapter XXXIII of \"Science and Sanity\", Alfred Korzybski wrote, \"...when we combine elements, and the results have new [italics] characteristics absent in the original elements, the new problems are structurally no more of an additive [linear] character, and the synthesis must be different\" (607). He also wrote, \"Unfortunately, the study of non-linear problems is structurally very difficult and largely a problem of the future\" (613). The future Korzybski wrote about is upon us. In the words of Yale physicist Roderick V. Jensen, 'chaos' theory involves the study of \"...irregular, unpredictable behavior of deterministic, nonlinear dynamical systems\" (Glieck 307). Such systems include smoke curling from a cigarette, water dripping from a faucet, the turbulent flow of heated fluids, branching patterns of a tree, stock market patterns, weather trends, etc. 'Chaos' theory has begun to provide a common language and mathematical tools for understanding phenomena in a broad swath of disciplines. Indeed 'chaos' does not seem a very good name since it implies a mess in what has been revealed as an area of complex order in apparently random processes. Glieck follows the story of some of the developers of this new field. He does a good job of giving a feel for his topic both in the text and the fascinating illustrations he has chosen. So-called 'chaos' studies seem quite in keeping with the broad Non-Aristotelian view of nature and science that Korzybski enunciated in his system known as General Semantics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1P0YCUU4463BZ"
                },
                "Date": "on September 20, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Very interesting and fascinating book; I will defenitly read others from same author."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADEQE5VVMEK7L"
                },
                "Date": "on January 11, 2009",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32NUR740CAUFR"
                },
                "Date": "on May 26, 2006",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on January 23, 1998",
                "Helpfulness": 0.5,
                "StarRating": "2",
                "Text": "Although I have a strong background in chaos and physics, I picked up this book for some background and enjoyment. While I didn't expect a mathematical treatise on chaos, I think Gleick's book is very shallow. There's much more to chaos than butterfly's wings!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on January 19, 1999",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "2",
                "Text": "The book does hardly exhibit technical deep in the issues described. If you are looking for some weird maths or formulas that can amaze you, try a high-school book instead!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 15, 1999",
                "Helpfulness": 0.5,
                "StarRating": "2",
                "Text": "I read chaos right after completing the Waldrop essay on complexity, three years ago,craving for more development on artificial life, etc... but I found the book confusing, shallow."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AT5WUF187TB2W"
                },
                "Date": "on October 8, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Excellent, fascinating read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A320UHVVRL41LM"
                },
                "Date": "on September 8, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Fast Deliver/Good Product"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SGR7LE899LGG"
                },
                "Date": "on January 21, 2004",
                "Helpfulness": 0.56,
                "StarRating": "2",
                "Text": "This book is more of an history book than a science book by volume. It drags on and on over the history of the scientists, however when it gets to explain the chaos characteristics it does so in a choppy way which might make the reader distracted and confused. Overall: MEDIOCRE."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEWHZ01F69GXZ"
                },
                "Date": "on May 3, 2005",
                "Helpfulness": 0.5454545454545454,
                "StarRating": "2",
                "Text": "Gleick does indeed cover some very difficult material in a very readable way.  However, he misrepresents some of the ideas dangerously.  The book is full of hero worship and idolization of the scientists he writes about, and he comes across sounding like Moses come down from the mountain carrying the stone tablets of chaos theory.  In the end, the facts are right, but the interpretation would make any of the scientists he describes grimace."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AP4XUJDXYVYYE"
                },
                "Date": "on August 21, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Great book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUAETP9M2T3KE"
                },
                "Date": "on June 13, 2013",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "This is a good history of the whole new approach to fractals and systems in chaos theory, but, a little too technical for me.This is for math brainiacs."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1X8VZWTOG8IS6"
                },
                "Date": "on April 8, 2008",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on December 21, 1999",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "A fascinating study of the history of chaos theory.  Although Gleick's writing got tedious about halfway into the book, it did not detract too much from the overall feeling of discovery and excitement I got from  following the stories of the chaos researchers.  Also, cool pix of  fractals."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1O88KXJX13G3G"
                },
                "Date": "on March 16, 2009",
                "Helpfulness": 0.5555555555555556,
                "StarRating": "3",
                "Text": "Chaos: Making a New Science is intrinsically a bunch of short essays based on the author's research into a number of Chaos experiments and the scientists performing them. One after another with nothing tying them into some sort of progression or main point. Still, many of the stories were very interesting and thought provoking. Some even included insightful tidbits about the inspirations or influences that guided the scientists. But overall it was a tedious read with no real conclusion other than this theory can mathematically describe many seemingly random events."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A150ZXS1C6R9MI"
                },
                "Date": "on April 17, 2011",
                "Helpfulness": 0.25,
                "StarRating": "5",
                "Text": "The book came quickly and in great condition. I have not yet finished the entire book, but the first 100-200 pages that I have read have been great. The book deals with several different aspects rather than only focusing on a single area of chaos theory. This is a great read for anyone interested in math."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2323K8AUM8W49"
                },
                "Date": "on May 21, 2012",
                "Helpfulness": 0.25,
                "StarRating": "2",
                "Text": "The book presents a lot of important ideas, but they are not well organized. The anecdotes about the earlier discoverers of this field are unnecessary and distracting. The book does not discuss nonlinear dynamics in math and theoretical physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HDZSUH1RVJGM"
                },
                "Date": "on August 29, 2005",
                "Helpfulness": 0.52,
                "StarRating": "2",
                "Text": "This author talks about \"chaos\" without ever revealing defininitive examples.  For example, he relates that Lorentz modeled complex (i.e., non-linear) behavior with just three equations, and that these were inpired by the fluid motion of convection.  But does he (the author) reveal what the equations are? No Way.  In fact, there is not a single equation in the entire book!  For someone who is mathematically challenged by balancing their own checkbook, this book gives a big picture (with stunning displays of fractal pictures) of chaos, without required the reader to get his hands dirty.  For this mathematically bent, Ph.D. engineer, the book was a disappointment. I now know some physical examples of chaos, but I know no more about the details than I did when I picked up the book."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on August 24, 1999",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "4",
                "Text": "Gleick provides the reader with a first hand glimpse into the world of chaos theory.  Time will tell if this mathematical construct will find an application in the physical world other than artistic renditions for  computer screen savers.  In the interim, we should all be wary of  psychoanalysts, new-age theologians and other psuedoscientific types who  are quick to wrap themselves in this discipline in an effort to give  themselves an aura of respectability."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EVIFUW7TVCE0"
                },
                "Date": "on February 16, 2012",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Y309MKQRJ8PX"
                },
                "Date": "on December 11, 2010",
                "Helpfulness": 0.4,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2E0HQZNJ9NP3"
                },
                "Date": "on January 15, 2000",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": "I really liked this book because unlike most other books, it kept me on the edge of my seat. I finished it and then read it again. I was unaware that the theory of chaos was so widely used in a variety of sciences."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZL5OFYN4BZCI"
                },
                "Date": "on January 12, 2004",
                "Helpfulness": 0.2857142857142857,
                "StarRating": "4",
                "Text": "Chaos is a great book, however for an under-achiever (not passed calculus) person, it can and will be difficult in some chapters.  The author does a pretty good job explaining Chaos Theory and gives excellent background information."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LLWJ4O4ZFCRM"
                },
                "Date": "on February 9, 2013",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "2",
                "Text": "This is an extraordinarily boring book, unless you are interested in reading about chaos and the people involved, blow by blow. It is about the people who somehow contributed in some way to the development of the theory but you will find very little about the theory itself, and much tangential comments and anecdotes. There are other MUCH better books about chaos. My advise is to skip this one."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 22, 1999",
                "Helpfulness": 0.3,
                "StarRating": "5",
                "Text": "this is the most interesting book i've ever read.  it allows me to perceive the world in a different way.  it makes me see things in a fourth dimension. i also enjoyed the book Godel, Escher, Bach by Hofstadter."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21HGJMGWICSK"
                },
                "Date": "on December 28, 2009",
                "Helpfulness": 0.15384615384615385,
                "StarRating": "4",
                "Text": "A summary of the field and some contributors. Some figures are not labeled properly and some descriptions are too detailed."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TNG2A1GAG14B"
                },
                "Date": "on January 30, 2001",
                "Helpfulness": 0.3488372093023256,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on October 30, 2001",
                "Helpfulness": 0.12244897959183673,
                "StarRating": "1",
                "Text": "This book contains lots of words but absolutely no information.  I wanted to read a good book to introduce me to the concept of chaos but this book doesn't even define what chaos is.  This book is a real peice of crap."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Chaos-Making-Science-James-Gleick/product-reviews/0143113453/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "180"
    },
    "Salesrank": "#9,793",
    "Timestamp": "2015-05-24 13:34:29.675623",
    "itemurl": "http://www.amazon.com/Chaos-Making-Science-James-Gleick/dp/0143113453"
}
