{
    "Category": "in Books (",
    "ListPrice": "$16.00",
    "Name": [
        "The Physics of Miracles: Tapping in to the Field of Consciousness Potential"
    ],
    "OfferPrice": "$13.30",
    "Reviews": {
        "AverageStarRating": "4.6 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GFDVML12TSSH"
                },
                "Date": "on October 8, 2009",
                "Helpfulness": 0.9540816326530612,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJPPO3S7XX2S2"
                },
                "Date": "on October 15, 2009",
                "Helpfulness": 0.9487179487179487,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12CO1I2DOMH05"
                },
                "Date": "on October 16, 2009",
                "Helpfulness": 0.95,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7D6WW0M3BFR4"
                },
                "Date": "on October 19, 2009",
                "Helpfulness": 0.9622641509433962,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HVTW0I40MB71"
                },
                "Date": "on November 12, 2009",
                "Helpfulness": 0.9090909090909091,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAF83T9VL5DVB"
                },
                "Date": "on October 23, 2009",
                "Helpfulness": 0.9333333333333333,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GGOE42H6106O"
                },
                "Date": "on April 5, 2011",
                "Helpfulness": 0.8533333333333334,
                "StarRating": "1",
                "Text": "I bought and read this book and then took the first one out from the library to read.  After subsequently enrolling in a weekend workshop, the huge disconnect between the book and the heavily staged over priced road show that masquerades as a workshop has me absolutely convinced that Bartlett did not write this book, although he may have done some of the research.  For a \"technique\" any one can supposedly learn and use successfully, the liability release everyone had to sign before you were allowed into the room ran a full page, and there were signs prohibiting anyone from filming anything or taking photographs - makes me wonder about subliminal stimuli.  It was reminiscent of the faith healing sessions evangelists used to have, without any Christianity, combined with stand-up comedy, at times with profanity for its shock value, a la Lenny Bruce. His son ran the video camera that  broadcast him live on two screens, one on each side of the stage, and he enters to music like he's some kind of rock star.  My personal impression is that the whole thing was stage directed and put together by his sidekick, Melissa Joy, whose Facebook page says she has a degree in Psychology and an MBA in marketing, not something that anyone is told in any of the Matrix Energetics materials or during the program. Her outfits were sexy and showed cleavage,and his daughter, the other \"Vanna White\" of the show, appeared to be dressed in stagey outfits as well. The people they chose to come on stage who did not close their eyes, or look continuously at whoever was doing the 2-point appeared largely unaffected.  The only way to get off the stage, once on it, appeared to be to fall backwards onto your catcher like they wanted you to.  It all appeared to me to be a psychological manipulation game designed to earn them lots of money, with a table of trinkets and other Matrix Energetics items for sale as well.  Makes it hard to recommend the book all that highly."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2D7BPZEX44F5J"
                },
                "Date": "on October 21, 2009",
                "Helpfulness": 0.9411764705882353,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FXT4UPI30K7S"
                },
                "Date": "on December 18, 2009",
                "Helpfulness": 0.8888888888888888,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18VTAOHSFGXQN"
                },
                "Date": "on October 17, 2009",
                "Helpfulness": 0.8636363636363636,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MUXN8JTJET97"
                },
                "Date": "on October 21, 2009",
                "Helpfulness": 0.8636363636363636,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33Y11434WD5HH"
                },
                "Date": "on April 18, 2011",
                "Helpfulness": 0.8823529411764706,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VPEM25TD5PM9"
                },
                "Date": "on October 11, 2009",
                "Helpfulness": 0.8235294117647058,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A299FBLUAMX6SQ"
                },
                "Date": "on September 10, 2012",
                "Helpfulness": 0.9230769230769231,
                "StarRating": "2",
                "Text": "There are many books on the market that will review the scientific probabilites of miracles as discribed in the Bible. I thought this was one scientist's view on how miracles might occur. BUT this is not the case. After recounting his personal \"Road to Demascus\" phenomenon the author provides a personal opinion of how life could be lived if you are spiritual enough. No explanation how to do that, only a constant commercial for his seminars. The book is one long boring commercial selling himself as a teacher and leader of some other reality."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26B6NW819AID2"
                },
                "Date": "on April 10, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I was told for Physical Science class that I had to read a book that had to do with either math or science and do a project on it. While searching Amazon for books I came across this one. Immediately I found it to be very interesting based off of previous customer reviews. Yet I did not read the first book but I was able to keep up with all the information and understand it as if I did. While reading the book I found all of the stories in the novel by people who attended his seminars to be very intriguing. My favorite one was about the man who was illiterate yet he could \"read\" a book simply by putting it under his pillow at night. I am only fifteen and I do not know much about physics yet Richard Bartlett makes everything understandable. I will admit however at times I was completely lost with what I was reading but simply because I could not believe that these kind of things could happen, such as being invisible or levitating. I love the way that as you read the book it is literally as if he is sitting in front of you and talking directly to you. The ideas in this book could change the views of many if more knew about all of this and how Matrix Energetics worked. Again because of only being fifteen I have yet to attend one of his seminars however it is definitely on my list of things to do. I think seeing all this come to life in person would be an amazing experience. I definitely suggest you read this amazing book!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATOX6B7EO6O1G"
                },
                "Date": "on November 16, 2009",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A77EO8HXDT3II"
                },
                "Date": "on August 12, 2010",
                "Helpfulness": 0.8461538461538461,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AR7556Z1EAF8U"
                },
                "Date": "on June 17, 2011",
                "Helpfulness": 0.7567567567567568,
                "StarRating": "1",
                "Text": "If you read all the reviews of all his books, here's what you find out. The technique he proposes is apparently extremely simple, yet too difficult to learn from a book. And in the \"workshop\" there's a big motivational pep rally type atmosphere. Sure, if you put people in that state, they'll have \"miracles.\" And there's certainly nothing wrong with him doing that. What's wrong is his deception and marketing practices, and positioning himself as some kind of messiah. If there was anything remotely real or valuable about his \"technique\" it would have gained a little bit of momentum by now. It hasn't. It's a sham and a scam. Given the lack of credibility, believability, and integrity...I wouldn't buy any of the guys books. And this is a subject I'm greatly interested in, but you don't have to be a rocket scientist to weed out the phony authors fast."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHXJ5KZWT1BB"
                },
                "Date": "on November 9, 2009",
                "Helpfulness": 0.8181818181818182,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARAWEPKQWUGF2"
                },
                "Date": "on October 24, 2009",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": "Richard Bartlett never fails to startle me out of whatever habits and illusions I have slipped into...or he at least threatens to disassemble the inner matrix where I have most recently found a kind of comfortable complacency. At times I think he's Mary Baker Eddy come back from the dead in a male body wearing a Superman cape (or at least tee shirt) and with a zany, uplifting sense of humor. Don't get me wrong, this isn't mysticism or faith healing, at least not the woo woo kind. In this book, his down-to-earth writing style and blending of cutting edge physics, healing stories, and wonder, give us more than a glimpse of working with the invisible truths of our lives. Richard's ideas induce positive change, expanding our beliefs about what's possible...and every few pages he makes me smile or laugh out loud at his self-effacing antics--enjoying his pleasure with being both hero and fool (two major archetypes of change). Anyone interested in energy healing, the impact of quantum physics in our own lives, or just healing and change in general, should read this book. It's informative, eye-opening entertainment for the soul. This book seeds possibilities for the miraculous. Very good stuff here!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TFM9ZT49V7GA"
                },
                "Date": "on October 21, 2009",
                "Helpfulness": 0.8181818181818182,
                "StarRating": "5",
                "Text": "I totally loved reading the Physics of Miracles by Dr. Bartlett.  My right-brain self went to beautiful, mystical,magical states, while my left-brain was happy with the science mumble jumble stuff. I found The Physics of Miracles to be amazing, insightful and visionary. I am recommending this book and his first book, to all my clients and friends.  Thanks Dr. Bartlett I'm loving the 21st century with you in it,you rock! barbara z"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GJ9LPZMZVIB2"
                },
                "Date": "on July 1, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "The Physics of Miracles expands on the basic principles introduced in Matrix Energetics.  Quantum energy fields surround everything and getting into sync with these Source energy fields through our own connection by inner spiritual work can open the ability to cause miracle healings in body, mind and our world of existence since mind/consciousness is the controlling element.  Structure and process are discussed in this book to further understanding of energy work, a good reference."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QG6KM9LV0ZSP"
                },
                "Date": "on February 3, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I have personally attended a Matrix Energetics seminar, and this information is the way of the future.  Our collective consciousness is expanding and evolving to new and profound heights of understanding.  Dr. Bartlett is on the leading edge of these simple yet powerful truths that guide and carry us as spiritual beings having a human experience.  We can create anything.  This book gives you the opportunity to explore and understand these profound truths."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35DHG14ESR3B1"
                },
                "Date": "on January 24, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book is interesting.  I was able to use the two point, as he calls it, just from reading the book.  I have no idea why, or how, and maybe it was just coincidence, but it helped sick relatives to do this.  What Richard is about is basically noticing Quantum Mechanics in action, in daily life, at human scale.  This is really powerful.  He's not the only writer on this.  Ryu Takahashi has a small book out on it.  Frank Kinslow deals with the same area, in a slightly different way.  Frederick Dodson does, also.  Melissa Joy Jonson has a new book out, which is also helpful.  Martha Beck and Penney Peirce's books are very helpful, in the same area.  Bartlett's stuff is a lot easier to read than, say, Roger Penrose's book, on Quantum Mechanics.  The seminar state that people get in, after Dr. Bartlett's seminar, is propelled in part by the number of people in resonance, the music, and by what Dr. Bartlett and crew have to say.  Books by the authors I've mentioned so far are good, to get me back into seminar state.  I ran across an odd little book recently, though, which is really good at getting me back into seminar state.  It is Multidimensional Dowsing Questions.  OK, Tony Robbins talks a little about power questions, but he says only a little bit.  This book, on Multidimensional Dowsing Questions, goes way beyond, it is a collection of questions designed to open up quantum awareness.  I went through Dr. Bartlett's seminar, it was great.  I wish I could get it bottled.  When I'm independently wealthy, I'll take it every 2 months.  In the meantime, I use books, to remind myself of the state.  What you see is what I've found so far.  I hope others will list books they've found useful."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18EI7RT30RLH0"
                },
                "Date": "on October 22, 2009",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "5",
                "Text": "I've read Dr. Bartlett's first book and attended a Level 1 seminar in San Diego this August.  He really is tapping into some exciting stuff.  This book highlights previous discussions and points and continues to build their fields.  I was most excited with the newer insights and examples of people doing wonderful and amazing things.  I'm looking forward to Level 1 & 2 in Austin this coming January."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APVJLI3H4M4GR"
                },
                "Date": "on January 15, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "This whole area is difficult to put in words.  Having said that, I wish this was more focused.  It is still a very interesting book, which breaks a lot of new ground, and is useful.  You don't have to do his seminars to understand this."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EIFDYFQRZ3KM"
                },
                "Date": "on July 17, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Dr. Richard Bartlett has compiled an amazing amount of new information in addition to actual exercises in quantum physics experiments..a fun and valuable read for anyone on a healing journey."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19OORKBG1VUGU"
                },
                "Date": "on April 29, 2012",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AY2Q66UHAD449"
                },
                "Date": "on October 31, 2012",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "This is an intriguing book.  he doesn't really come out and say what he's trying to say, but maybe he can't.  he just hints at it.  Worth the read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOU8979I771RU"
                },
                "Date": "on February 19, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "As a seeker of the greatest forms that truth can take, I have enjoyed Mr. Bartlett's views on how to see life and our roles as co-creators more than most other views that I have experienced on my journey. I believe that he was born to this role of teaching co-creation more than any other role that he has played and hope he continues to look for new ways to express those concepts which he \"knows\" in as many ways as he can find to reach as many souls as he can. This book is a fine example of life reaching out to find more life and expand on itself. If you have an open mind and the heart of a child you can reach new levels of growth in less time than it takes to read this book. Savor the feelings generated by the beliefs being transmitted from his heart to your own and you can awaken with a whole new look at life and your connection with it!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A344IYYN5QNYYI"
                },
                "Date": "on August 30, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I've been to several of Richard Bartlett's seminars and his style is consistent, overall over the top!  This book was a wonderful read and I enjoyed it very much.  For reviewers who felt they were reading a religious book: referencing The Bible or another person's religious views does not make a book a religious one.  We all live in a context that includes religious opinions, after all.  I thought this book was a great quantum physics meets energy healing manual and highly recommend it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16RJ5T09LILZ7"
                },
                "Date": "on August 14, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is an amazing book that I am giving 5 stars.  I have attended Richard Bartlett workshops 1 & 2 and found it a bit confusing even though miracles happened during and after the workshop.  After reading \"The Physics of Miracles\" and listening to his new CD's, I have signed up to attend workshop 3 Magic.  This book and his new CD's cleared many questions that I had about his miracle system and about the miracles of life."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8N5VS2RZV8NC"
                },
                "Date": "on September 25, 2010",
                "Helpfulness": 0.75,
                "StarRating": "3",
                "Text": "Leaves alot of blank space between doing and receiving...something is missing.  Maybe you pick it up on the second time around..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1USQ8MRD5H040"
                },
                "Date": "on February 27, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Richard and Matrix Energetics use quantum physics to do \"miracles\", by just using the engery of the universe and asking for change and knowing what you already know.  Recommend his books and his worlkshops to open you up to all you are capable of in healing and manifesting your desires."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38UFZPW4S8VUN"
                },
                "Date": "on November 8, 2009",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A47Q0AAOLC894"
                },
                "Date": "on March 25, 2010",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "Exciting. Inspiring. Beautiful. Powerful. Mind-bending. Mind-opening. Unlike anything I've ever read. Richard is changing the world. He is teaching us how to change our own. Read his books. Be changed. And change the world. Yours, and the world of others."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33NMLHEVU1FT0"
                },
                "Date": "on January 20, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I have read it 3 times now and still have to read it again as this book has so much info on healing in it.  Hope to attend one of Dr. Bartlett's seminars."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SF0294RC2OBF"
                },
                "Date": "on May 3, 2010",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "5",
                "Text": "Matrix Energetics is awesome. Here is a recent quote from Mark Kalina, MD on Matrix Energetics and Multiple Sclerosis: \"Matrix Energetics and Integrative Manual Therapy (IMT) are also a break from standard physical rehabilitation. I am sure these fields must also face disbelievers and nay sayers. Thank God that there are individuals who can look into the eyes of their doubters and simply look back into their own hearts and minds and follow what they believe.\" Mark Kalina, MD April 29, 2010 Del Mar, California Healing Happens: How does that happen? [...] . I am getting interesting results with people with many neurodegenerative diagnoses, including Multiple Sclerosis, Parkinson's and Macular Degneration. Matrix Energetics is easy and mindblowing fun to learn. -- Kimberly Burnham,PhD, Author of Our Fractal Nature, A Journey of Self-Discovery and Connection, Balancing the Sleep-Wake Cycle: Sleep Better, Learn Faster, Contribute More, and Enjoy Life to Its Fullest (Recover Your Life Through Brain Health) and have a chapter in Pearls of Wisdom: 30 Inspirational Ideas to Live your Best Life Now! and the upcoming book, The Nerve Whisperer."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MT3TR0H0E1CU"
                },
                "Date": "on September 26, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "If you didn't get enough information from Matrix Energetics of how Richard Bartlett enters into the Flow, you will find more here.  From this book I've developed a reading list including books by Arthur Koestler and Rupert Sheldrake.  I checked out a former guru of Mr. Bartlett, Elizabeth Prophet.  Glad to know he is not part of her following any more.  It is fun to follow a thread as see where it leads.  Who would have dreamed 10 years ago that I could read these books on Kindle.  Imagination is a wonderful thing and Mr. Bartlett has a lot of it and seems to have fun sharing his ideas and again he is clear that he himself has made his methods up."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Q3O39072T4F4"
                },
                "Date": "on November 21, 2009",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "This book simplifies ideas in quantum physics.  Loved the book.  The healing techniques discussed really work and are easy to to."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQ3F29WQO2STV"
                },
                "Date": "on October 24, 2009",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3L2C9FG71X35F"
                },
                "Date": "on February 12, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "This is the second book I have read by Richard Bartlett, both very inspiring.  Be sure to see his videos though in order to grasp the technique quickly.  The only thing I was disappointed in was that the \"how-to\" was not totally explained so that I could actually learn and do these miraculous cures myself.  Maybe it takes more than the technique, but he says \"no.\"  He does inspire you to take his workshops, and I would do so if they were not far away from where I live."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A356U8W3QNRZJI"
                },
                "Date": "on January 27, 2010",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "If your heart doesnt burst open during the delightful exitement it is to read this book, you will understand how to make it so anyway, by intention. The physics of miracles shoots like a spearhead into a new and releasing paradigm, understandable for anyone. Want more.  Racheel"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22BRDJP35J4GT"
                },
                "Date": "on June 14, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Richard Bartlett takes incredibly complex information and makes it completely relate-able. He has a fun and engaging way of explaining things that makes you feel confident believing in yourself and your ability to create your own miracles."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUZ3WUKBE0LFE"
                },
                "Date": "on January 6, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Another fantastic book of Richard Bartlett showing the way to effortless living and enjoying life more fully. I enjoy re-reading it again and again."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A138BVEJUYSD2X"
                },
                "Date": "on October 27, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IA6MZ6LPX12Q"
                },
                "Date": "on December 2, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LDF711GYCHMV"
                },
                "Date": "on January 3, 2011",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "There's lots of science in this for any left-brain oriented individuals who use reason more than intuition. And yet there's more. You can feel the energy that allowed this book into being, and it's enough to just connect to and marinate in that. This book comes complete with useful pictures, experiences from practitioners, and more of that deeper knowing that lets you connect to the deep Intelligence within yourself. That's ultimately what it's all about and where it's all leading to!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2I11G5QO67OH1"
                },
                "Date": "on January 1, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book material from his course, I guess.  I would like to take his course.  For now I have to use his books.  What this is, is like Frank Kinslow, or Ryu Takahashi's books, or say the book Imaginal Healing, by William Wallace, is playing with Quantum Mechanics in daily life.  That sounds wierd, but that's what it is.  This field has got to be the most fun I've had in my life.  I love playing with these ideas.  I am getting results, which is really all I care about.  I don't need to know how, and you won't, using these methods."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PNN4SB0LM9J2"
                },
                "Date": "on February 23, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZYDRCQJ4VQN7"
                },
                "Date": "on September 20, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3H4TJ87AHZ7VV"
                },
                "Date": "on November 21, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Fantastic book. I highly recommend it. Dr. Bartlett was my chiropractor when I lived in Montana. I always knew he was a gifted healer but did not know that he has figured out how to teach what he knows. This book is a must read for anyone but especially for energy medicine practitioners. What a great gift to the world. Can't wait to get to a seminar."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DIUC5H39T736"
                },
                "Date": "on June 1, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I had my first copy and loaned it out. Had to have my second copy for myself and now I will be ordering a third copy to pass on to a daughter."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1J35N6U5PYLHA"
                },
                "Date": "on November 25, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I've read both of Richard's books and have attended one of his workshops, and loved them all.  He's developed a way to tap into the Zero Point Field and is able to teach others how to do that and change their lives in real time.  Just reading the book engages you in the energy field and can create shifts.  Highly recommended!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZAYZWDS0RLKT"
                },
                "Date": "on January 13, 2013",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATIHHWEVEIHZW"
                },
                "Date": "on May 14, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I guess sometimes we read a book just in the right time. This book assured me that what i am experiencing right now as a healer and human being is not crazy, but the way life can be if you are open to its miracles."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1V5WR4QZSYOTU"
                },
                "Date": "on November 5, 2012",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "Possibly the most influential, fun, easy to comprehend book I have ever read in my 36 years of my conscious spiritual journey. Love it love it love it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D8R59Y1PDLL9"
                },
                "Date": "on May 28, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Matrix Energetics is a great method to change your life. This is a very good book discussing the theory and practice of ME. Would have been much better if it has a few more exercises."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I8GSX1PZTRT4"
                },
                "Date": "on January 15, 2013",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "well some of it is easy.  the physics takes some focus; but you can skip that and still gain a huge benefit from the book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3V6DL6GO7IJNJ"
                },
                "Date": "on November 14, 2009",
                "Helpfulness": 0.6,
                "StarRating": "5",
                "Text": "Shift your reality and lift the boundaries you put on the possibilities unconsciously. This will be the result of reading this transforming and inspiring book. So beware!  Life might not be the same, after reading this. If you are ready for it, it is the best gift you can grant yourself! Enjoy and submerge in this new reality. It is fun to read, and Richard Bartlett does really have an important message for you!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TROJ00V1KUI6"
                },
                "Date": "on March 2, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Amazing up to date info using laymans language for quantum physics and techniques on how. To apply them to life"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ONSWRIPRIU7G"
                },
                "Date": "on September 14, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "There is no doubt there is no end to the book. Wisdom and learning for years. Thank you dr Bartlett"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NE7XML65CQV7"
                },
                "Date": "on May 14, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "His ideas are interesting. Some folks I know have gotten benefit form the process."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23069COKE4DEP"
                },
                "Date": "on December 17, 2011",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23ZNA5L6FRUKC"
                },
                "Date": "on July 29, 2010",
                "Helpfulness": 0.6,
                "StarRating": "5",
                "Text": "The book was easy to read and follow.  For such a complex subject as Quantum physics, this book makes it easy to follow  Dr. Bartlett's thoughts on the subject.  The instructions of his technique is clearly written."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A80C8GLCY8YXW"
                },
                "Date": "on August 1, 2011",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VYFVMAW6JRKK"
                },
                "Date": "on January 17, 2011",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "I found this book to be a great source of information to supplement the seminar experience. It gives you more insight on techniques and ideas behind new consciousness. Easy to read and use."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CBKZ1XD6S2WM"
                },
                "Date": "on July 22, 2010",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "A beautiful book. Richard is so out of the box that I get the feeling we're stepping into a much bigger box. Thanks Richard."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9P490LBXZ3P6"
                },
                "Date": "on September 4, 2011",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28FQESE0JHE1V"
                },
                "Date": "on November 17, 2009",
                "Helpfulness": 0.5714285714285714,
                "StarRating": "4",
                "Text": "This new book takes up where the first one ended. It explains the practices and how we are to engage the right brain to Let Go and use the power of the Matrix. An easy read for such complex thoughts. It is a must for my Energy Medicine Library."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1C32QM2HBFIF7"
                },
                "Date": "on July 26, 2010",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14OJS0VWMOSWO"
                },
                "Date": "on January 18, 2010",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "THE PHYSICS OF MIRACLES will change ideas about what is possible, based on physics, transformations, and applications for healing. He follows up his popular MATRIX ENERGETICS with a guide based on his seminars, offering new views on healing and transformation and supporting energetic healing work with physics. New age collections will find this involving."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KMUPOCEGLFU8"
                },
                "Date": "on October 10, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AC4VNXDHPPM0"
                },
                "Date": "on April 14, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "great book"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26LNFL5QVDJTA"
                },
                "Date": "on March 27, 2010",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": "This book is more technical than Matrix Energetics. I would have given it five stars if Dr. Bartlett had included some information about the healing frequencies he is using. As it was I found some of the information immediately useful and applicable. I would recommend this book to anybody who wants to expand their horizon in the field of energy healing. I suspect though that very few readers will be able to tap fully into the potential of Matrix Energetics without attending one of Dr. Bartlett's workshops."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1H54YNKJQETBC"
                },
                "Date": "on December 9, 2009",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EG2PP3MN7PEN"
                },
                "Date": "on October 22, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "\"Matrix Energetics\" was Dr. Richard Bartlett's first books explaining how he developed tools that work consistently and that are easily taught and used by anyone."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A99D80NXZU8FK"
                },
                "Date": "on September 8, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Robert Bartlett is an amazing person.  This book has changed my life for the better.  This has helped me to be the potential that I am."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2O66L5MR4P53N"
                },
                "Date": "on March 14, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "enjoyed it very  much.  read it with family and friends ,  passed it to many friendsi feel it impowered me to face a difficult time"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AV9MBRARC7QQM"
                },
                "Date": "on March 3, 2013",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A176N0TG6P0SVF"
                },
                "Date": "on April 4, 2012",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": "This book has a vibe that will assist you in opening your consciousness into a wider arena of functioning.  There is a layer of information beneath the words.  I read the book and definitely has influenced my play.  [...]"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BDU30NYYR582"
                },
                "Date": "on April 3, 2015",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": "The book did not give any information. It is an ad to sell."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1H1RNHBQHXZF5"
                },
                "Date": "on September 29, 2010",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": "I was surprised by the amount of truly useful information. Definite techniques are given, not just a lot of theory. I have been able to include some of the practices in my work."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3T11V6ZOR1LL4"
                },
                "Date": "on April 8, 2010",
                "Helpfulness": 0.4,
                "StarRating": "5",
                "Text": "The Physics of Miracles is a fun read. I managed to finish it in a minimum of sittings. Richard Bartlett's writing style is definitely reader friendly, in my opinion. I am not a physician or chirapractic so i don't know if I would try some of the medicine-related experiments or scenarios he described. That leaves plenty of other exercises to try, such as maybe finding a parking space. This book, along with 'Matrix Energetics\" are definitely on my list of books to keep in my personal library. Thank you, Dr. Bartlett for providing inspiration in an entertaining way."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KO8T5RG26UJK"
                },
                "Date": "on January 7, 2010",
                "Helpfulness": 0.576271186440678,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UM3NW5LCJ6ZP"
                },
                "Date": "on January 17, 2011",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "good book - clear helpful explains the reasons for shifting my eating . I have lost weight and my energy level has evened out. Much more consistent more balanced and long lasting my  alertness is fone in the afternoon and evening. Before my attention woud drift and my ebergy would fluctuate way too much."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A312YR4SXE06FK"
                },
                "Date": "on September 25, 2010",
                "Helpfulness": 0.25,
                "StarRating": "5",
                "Text": "Good book. Can read one chapter at a time. Richard adds much physics research (ugh) and tie -ins plus more applicable technique information than the first book plus added seminar and personal experiences. Should be understandable and usable to ME wannabes and eye openning and stimulating to the uninitiated. Those who are looking for any real solid science should perhaps wack themselves silly with the hardcover before reading. This one's a keeper for me. And one I'll read several times."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UPCO106UBRA4"
                },
                "Date": "on September 27, 2010",
                "Helpfulness": 0.25,
                "StarRating": "5",
                "Text": "In my opinion, this book pulled many of the pieces of the puzzel together for me...  The time has come to let got of the old, (the old had a purpose to bring us to this new understanding) and receive the evolution... its exciting time to be aware .... Make a Miracles, no more excuses, its a given"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QREXFCY30EGF"
                },
                "Date": "on August 25, 2010",
                "Helpfulness": 0.25,
                "StarRating": "5",
                "Text": "This book has a lot of physics references which are a bit confusing, but also make sense. The author has a very down to earth way of writing, and is understandable with humor as well. I am so intrigued, I am looking into going to a seminar now!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2133D5PXDYGRX"
                },
                "Date": "on February 11, 2010",
                "Helpfulness": 0.25,
                "StarRating": "5",
                "Text": "This book can change your life. Bartlett is a living treasure. He helps us see Reality  Recommended Highly."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3S092E3CFGANF"
                },
                "Date": "on March 5, 2010",
                "Helpfulness": 0.25,
                "StarRating": "5",
                "Text": "I am only into the second chapter and miracles already are occuring!  I would defintely recommend!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MLA8SWIPZ3PR"
                },
                "Date": "on May 10, 2012",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "4",
                "Text": "Great introduction and presentation into using the quantum matrix to heal and work with light vibrations.  O am excited about Matrix Energetics because of this book.  Very lay-person presentation of the theories..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HNLQXTCV40O6"
                },
                "Date": "on May 29, 2011",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "Great book to learn to connect with the Universe and \"heal\" yourself and others. My favourite aphorism is: there are no rules!  However, some parts were too much physics for me."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30ZA07HOM0IN8"
                },
                "Date": "on March 21, 2010",
                "Helpfulness": 0.2,
                "StarRating": "4",
                "Text": "This is a must have book to read for those who want to stay on the cutting edge of the year 2010."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A321S1TOCW8JNY"
                },
                "Date": "on November 20, 2009",
                "Helpfulness": 0.5119047619047619,
                "StarRating": "1",
                "Text": "The title pretty much says it all. There is a segment of the population that wants to get rich any way possible. What better way than to simply make up a bunch of baloney and see if anyone will pay you for it. Worked for L Ron Hubbard and countless New Age whacko's and now it looks like it is working for this guy as well."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Physics-Miracles-Tapping-Consciousness-Potential/product-reviews/1582702497/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "95"
    },
    "Salesrank": "#188,584",
    "Timestamp": "2015-05-24 12:36:26.395115",
    "itemurl": "http://www.amazon.com/Physics-Miracles-Tapping-Consciousness-Potential/dp/1582702497"
}
