{
    "Category": "in Books (",
    "ListPrice": "",
    "Name": [
        "Physics by Inquiry: An Introduction to Physics and the Physical Sciences, Vol. 2 (Volume 2)"
    ],
    "OfferPrice": "$70.56",
    "Reviews": {
        "AverageStarRating": "3.4 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALLNRV4MYKGEA"
                },
                "Date": "on October 9, 2012",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3B2UH13JG73LG"
                },
                "Date": "on August 5, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I have used parts of this curriculum with middle school and high school students over the past fifteen years, after having taken the summer training course for teachers.  The curriculum is engaging and hands-on, with students required to build their own knowledge and understanding in order to learn.  That said, this is not a book that a teacher can just pick up and start teaching out of--you really have to do the activities yourself in order to understand them, so it is a commitment, but one that is well worth it.  There are a wide variety of modules to choose from, including optics, motion, and astronomy.  This also works best in a small class, as the teacher has to check in with students frequently to make sure they understand what they are doing.  If you have the opportunity to teach from this curriculum, your students will be very lucky indeed."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EEOH5T6J1OLU"
                },
                "Date": "on October 2, 2011",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "This was not what I expected. It it kind of hard to follow. I would not recommend it for teachers to follow."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7IIG6IMN3HD1"
                },
                "Date": "on February 17, 2010",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "This was a smooth transaction. I received the book within the time frame needed and as stated. The book was in the condition I was expecting, slightly used. Great transaction overall."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AVVINL56Y4SJ"
                },
                "Date": "on July 14, 2009",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": "I am taking a Physics class using this text this summer.  When we got to the Optics section, I turned to the page the professor asked for and realized I didn't have that page or the next 30 that followed.  My book was missing pages 531 through 561.  To say the least I was very upset and am having trouble passing this part of the course without the pages.  I don't want to buy from this bookseller again."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Physics-Inquiry-Introduction-Physical-Sciences/product-reviews/047114441X/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "5"
    },
    "Salesrank": "#323,042",
    "Timestamp": "2015-05-24 12:32:14.144847",
    "itemurl": "http://www.amazon.com/Physics-Inquiry-Introduction-Physical-Sciences/dp/047114441X"
}
