{
    "Category": "in Books (",
    "ListPrice": "$109.80",
    "Name": [
        "Essential University Physics: Volume 1 (2nd Edition)"
    ],
    "OfferPrice": "$88.55",
    "Reviews": {
        "AverageStarRating": "3.6 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DNX3CHTHG062"
                },
                "Date": "on September 8, 2012",
                "Helpfulness": 1.0,
                "StarRating": "1",
                "Text": "I am a college student.  MANY of the answers in the back of the book are wrong, plain wrong. I have wasted too much time trusting the book.  My professor and I even did out the questions and some of the answers in the back of the book are wrong.  You cannot trust the book.  Can't even learn."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A273BHKHN0Y6MO"
                },
                "Date": "on November 17, 2012",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MXF3HV2QE5PK"
                },
                "Date": "on September 22, 2011",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "This book is great.  Its simple and very useful.  It is easy to read and follow so you won't have a problem understanding many of the concepts.  The only downside of the book is that many of the answers in the back of the book are wrong so be careful and use common sense when looking up the answers in the back"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AA5VRZNKTCCNS"
                },
                "Date": "on September 16, 2013",
                "Helpfulness": 1.0,
                "StarRating": "1",
                "Text": "You will not understand the material you are trying to learn. I have used other physics books before that explain it better than this malarky. Spend your money elsewhere."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30996U3WGNTUK"
                },
                "Date": "on December 26, 2014",
                "Helpfulness": "",
                "StarRating": "1",
                "Text": "This book assumes you know your college physics and calculus. This is more like a review book for Graduates and PhD's, rather than an introductory survey. The physics presented isn't presented wrongly which is a good, but the discussions are too brief to be of value and the examples are too confusing. For example, the section on relative motion is a mere Half a page, and the example just confuses and doesn't help cement the discussion.  You get the gist, and that is all.  You could learn something from this book, but you would have to develop all the details between the lines.  Just too much to ask for a beginning student. Definitely buy the student solutions manual if you have to use this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3P4SI8BPG11IB"
                },
                "Date": "on September 11, 2013",
                "Helpfulness": 0.6,
                "StarRating": "1",
                "Text": "Okay I never ever write reviews, but this time it is a must. I absolutely DO NOT RECOMMEND THIS BOOK! In reference to one of the other reviews, they say that students with \"STRONG mathematical background\" will find this useful. Well I am barely taking my first physics course which is calculus-based, And let me tell you EVEN IF YOU DO come from a strong mathematical background this book is garbage. I am taking calculus III along with university physics and this book is poorly written. I am familiar with introductory physics (as you will learn some doing calculus and in chemistry which I've taken). There are so many things wrong with this book. They did not put in any effort to explain concepts correctly. In fact, there is a lot material missing that is crucial to understand the physics behind the concepts. Not to mention alot of the practice problems are not correct nor are the answers. They complicate ideas when they shouldn't and when they should in the form of rigor to understand deeply they do not. Also they will throw random equations at you with out any relevance to what you're reading no derivations or reasons for the equations, and trust me I would find some relevance if there were. At my university I haven't gotten anything less than an A from college algebra to calculus II so you know that there is a problem with the book. With all due respect to the Author and collaborators, it is not a good book. I would stay away from this book atleast until an 8th edition comes out. Maybe they'll fix it up more by then. I'm actually going to buy another book completely different from what the university requires because I don't just want to half a** my way through physics I actually want to learn and understand it. So if your university or course asks you for this book don't get it. Get another like young and freedman or Halliday or Resnick."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A301J2PVATVG70"
                },
                "Date": "on March 6, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Ordered for my grandson in college, received in great condition."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16JNYXY7EXZRH"
                },
                "Date": "on February 9, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Just as advertised. Excellent."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGX945QB6P5X0"
                },
                "Date": "on February 19, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Came in Good condition"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20U72SRSMBNSG"
                },
                "Date": "on February 8, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Very helpful resource."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37NSJD8U038W5"
                },
                "Date": "on July 3, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Good"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1G2IPQ5FJXXUT"
                },
                "Date": "on July 8, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Delivered and works as indicated.  No issues."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20LAW62NVQOR0"
                },
                "Date": "on December 8, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Needed this for General Physics 1 next semester and got it here for good price and arrived in a timely manner. The cover was a bit bent up but nothing major, it'll work for class."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VHDL8U6IWKUI"
                },
                "Date": "on September 4, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "This is a great product. Along with great service .  This is just what I needed for my class and got here in plenty of time to spare."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25KH2BVFRTIWB"
                },
                "Date": "on July 24, 2011",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "The book came within a couple of days (earlier than I had expected), in the used condition that was described."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Essential-University-Physics-1-2nd/product-reviews/0321706692/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "15"
    },
    "Salesrank": "#18,040",
    "Timestamp": "2015-05-24 12:51:42.527397",
    "itemurl": "http://www.amazon.com/Essential-University-Physics-1-2nd/dp/0321706692"
}
