{
    "Category": "in Books (",
    "ListPrice": "",
    "Name": [
        "Physics of the Soul: The Quantum Book of Living, Dying, Reincarnation and Immortality"
    ],
    "OfferPrice": "",
    "Reviews": {
        "AverageStarRating": "4.1 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EJT905S6ZS4K"
                },
                "Date": "on May 14, 2005",
                "Helpfulness": 0.9605263157894737,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RQB5DDN9T01K"
                },
                "Date": "on January 3, 2002",
                "Helpfulness": 0.9340659340659341,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1H7Y5XKPGT0OS"
                },
                "Date": "on November 25, 2009",
                "Helpfulness": 0.8666666666666667,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SXS2SF58V4NC"
                },
                "Date": "on August 24, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Physics of the Soul: The Quantum Book of Living, Dying, Reincarnation and Immortality by Amit Goswami was for me a look at the possibility that life continues on. I am a believer in God, so what was I worried about? Because not much is said about our state of existence in the scriptures, except for resurrection, then heaven. But where is heaven, our personality? Our soul. If there is no such thing as communicating with the deceased, then why do we as Christian profess the \"communion with Saints\"? I got a clear picture of some of these things in Mr. Goswami's book. By the way you will want to read all of his books!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SICA514ASJAV"
                },
                "Date": "on April 3, 2007",
                "Helpfulness": 0.7894736842105263,
                "StarRating": "5",
                "Text": "As a student of Dr. Goswami, i very much enjoyed his thoughts and the models that he proposes. While so many in hte west have been taught since childhood that we have a 'soul', we're never given much of a context within which to hold that concept. Dr. Goswami provides some interesting models, based on The Upanishads, that i am still thinking about and applying months after first reading this book. If you are a student of consciousness, metaphysics, or just curious about the possibilities, Physics of the Soul is a must read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMQVTGAQ4OY3T"
                },
                "Date": "on December 10, 2008",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ERU005ES1IHT"
                },
                "Date": "on December 6, 2009",
                "Helpfulness": 0.75,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEGMBR3D6UNXD"
                },
                "Date": "on March 23, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Goswami's basic theory - that consciousness is primary and the phenomenal world is a product of consciousness - is a given in all esoteric traditions.  His contribution is to illustrate how quantum physics supports this view of reality.  Many others have asserted this, but Goswami's background as a physicist gives his writings an authority others lack.  Unfortunately, his brilliance also makes his books somewhat impenetrable at times, and leads him into areas that canonly be speculation at this point, and that tends to undercut his credibility."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16NADGSY6QCTP"
                },
                "Date": "on April 21, 2004",
                "Helpfulness": 0.696969696969697,
                "StarRating": "3",
                "Text": "Mr Goswami appears to be on the right track with this research, however where the book falls down is that the sources he cites in support of his argument seem to be taken at such face value. I find this lack of 'scientific' methodology quite surprising since he has taught physics for 32 years. Certainly I agree with Mr Goswami that the standard 'proofs' are not available for this work, but even so, he needs to find a middle road, so that it doesn't just end up as just another 'new age' book. And that would be a shame! Somewhat different, but a good example would be 'Old Souls : Compelling Evidence from Children Who Remember Past Lives' by Thomas Shroder. In addition, chatty idea's sessions with his wife, limit one's ability to take his writing seriously. Finally, Mr Goswami should pick up the phone and call his publisher, who just-so-happens to publish 'Astral Dynamics: A New Approach to Out-of-Body Experiences' by Robert Bruce. Goswami will have many questions answered by reading this book. And, in the case of Bruce, I was willing to ignore any lack of scientific method, because from the moment you pick up the book, you KNOW that he knows what he is talking about. By comparison, Bruce's book is a groundbreaker."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OE8O35GF7RBV"
                },
                "Date": "on August 12, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "If you are a searcher of truth through the ancient knowledge, then THIS mans information is BEYOND required knowledge for you. Get your brain off all the junk science out there, and learn how new Physics is proving and will continue to prove the detailed truth about the human soul, which religions worldwide for the most part have totally destroyed. This book should be required learning for all humans."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABPDB2T97BVTC"
                },
                "Date": "on September 20, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NYMKTX62V49"
                },
                "Date": "on February 6, 2011",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "I haven't finished reading the book yet so keep that in mind. I am enjoying the book and at many moments I have thought, yeah, that seems possible. I stress, however, that this book suggests possibilities. At times the author claims that science has established the points that he is making, and as far as the basic quantum physics principles on which he relies, that is true. But as to reincarnation and other related topics, this book presents merely a hypothesis. The substantiating 'data' he cites is comprised of experiences people have claimed to have had to which the author refers us to other sources. I am not aware of any objective verification of this data. I am skeptical. But overall the author is quite reasonable about his approach, which he ties in with the Tibetan Book of the Dead, and what I have seen so far does suggest a plausible explanation of why we are here, what happens when we die and other related concepts. I think he has made a good use of science but there are still leaps of faith, or should I say quantum jumps, that must be taken to accept his approach. So far though I think his theories are interesting, are excellent grounds for further research, data collection and study. Perhaps the most exciting thing I have read about the 'data' that the author in part relies on, such as children remembering past lives, was actually grudgingly accepted by Carl Sagan in his book \"The Demon Haunted World, Science as a Candle in the Dark\" as worthy of further study, though the late and venerable Dr. Sagan made it clear that he did not believe in such things. I am not sure that I do either, but like Neo in the first Matrix movie, perhaps I am beginning to believe. It is a wonderful feeling."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2H627XE9S5ESN"
                },
                "Date": "on March 3, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Here is a book that shows how science and not religion will lead us to spiritual enlightenment.  It's a real treat to consider Prof. Goswami's views."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A469BMFVGVUL1"
                },
                "Date": "on December 24, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A very scientific look at what is going on in levels of life heretofore difficult to discuss scientifically. it is heavily both scientific and deeply spiritual, plus it is fascinating. Not a light read, but truly worth the investment of time and thought. For all even a little aware of the new physics, I hope you will read this."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1C2K6PNR79PIZ"
                },
                "Date": "on March 17, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I love all Goswami's books. And this is a book I had to share with a friend with vast life experience, and he was amazed at what Goswami had put into writing. Fascinating stuff. If you were hoping for a peaceful deep sleep after death, the book will not necessarily be comforting though . . ."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AB6N6DEH8DK7K"
                },
                "Date": "on September 10, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This book presented some interesting theories, which encourages the reader to explore some of their beliefs from another perspective. You have to keep an open mind whenever you tackle a book of this nature."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A92YVR80RJ8XJ"
                },
                "Date": "on November 25, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Quantum physics is showing us life as we know it doesn't end with death. For years I've had difficulty wrapping my mind around Quantum physics but Goswami really helped me make the leap!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BIEYSNTS4GBR"
                },
                "Date": "on July 28, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XG5IYS4QKOG2"
                },
                "Date": "on December 20, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Dr. Goswami's application of quantumn dynamics to life's deepest mysteries of death and reincarnation is both insightful and compelling.  I was moved."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DDX69HIEIZD6"
                },
                "Date": "on October 28, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "A impressive work that does explain a lot about life and death and the correlation between science and Tibetan Buddhism"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36LPUHGNPJS9H"
                },
                "Date": "on March 25, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Dense with verbiage, but hey, it is a book. He does make some leaps of faith, but it is a good read and stimulating."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BTMYT3MTC8SE"
                },
                "Date": "on April 17, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Book was in condition just as stated"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HD9ZNVO4K7IJ"
                },
                "Date": "on February 27, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent and shipped on time."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8IGGU1J1C125"
                },
                "Date": "on December 26, 2012",
                "Helpfulness": 0.5454545454545454,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KA5HGIZYPZCQ"
                },
                "Date": "on February 24, 2013",
                "Helpfulness": 0.5,
                "StarRating": "2",
                "Text": "Book was not what I expected. Thought from the description that it would have more information then it did. Not a fan of this author and will avoid this author."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SM367E57VS3X"
                },
                "Date": "on January 9, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KLGKA96HNK4J"
                },
                "Date": "on April 14, 2014",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "If you are on a Spiritual Quest, this may the book for you to read.  A very easy to understand of Quantum Physics and believe me.  I am not a physicist in any way, shape or form, but I understood it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19QPN8702GESH"
                },
                "Date": "on August 31, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "Good"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CB8HVWQCVC2Q"
                },
                "Date": "on March 23, 2013",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": "This is amazing. He doesn't just offer his own random thoughts, he presents all sorts of research and shows you all the parallel points between what the research demonstrates and the way it would be should his theory be correct."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUJ6UQ0MROABZ"
                },
                "Date": "on December 31, 2001",
                "Helpfulness": 0.2833333333333333,
                "StarRating": "1",
                "Text": "English is obviously not the native language of Mr.Goswami.  There is no flow to his writings.  He also has a knack of making simple concepts seem complicated.  Although there is good content and direction in his book, the considerable energy needed to complete it, may make it not worth the effort.  This book is best suited for a retired person with unending time and patience, and a knack for converting Sanskrit into English."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Physics-Soul-Quantum-Reincarnation-Immortality/product-reviews/1571743324/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "30"
    },
    "Salesrank": "#357,403",
    "Timestamp": "2015-05-24 12:36:13.328053",
    "itemurl": "http://www.amazon.com/Physics-Soul-Quantum-Reincarnation-Immortality/dp/1571743324"
}
