{
    "Category": "in Books (",
    "ListPrice": "",
    "Name": [
        "Mathematics of Classical and Quantum Physics (Dover Books on Physics)"
    ],
    "OfferPrice": "",
    "Reviews": {
        "AverageStarRating": "4.8 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HX6QSV6BDYVR"
                },
                "Date": "on June 6, 1999",
                "Helpfulness": 0.9818181818181818,
                "StarRating": "5",
                "Text": "This book introduces the reader to the basic mathematical structures of theoretical physics: mainly Quantum Mechanics, Electromagnetic Theory, And Classical Mechanics. I used this at UC San Diego for a year long graduate  course on Mathematical methods in physics and engineering.  If one has the  time, there is really a lot to be gained by carefully studying this book. A  big part of the book is geared toward developing in detail the mathematics  of the Quantum Theory. This is a good thing because in my experience most  QM books are too eager to \"get to the physics\". It is true that  you can get by with a superficial understanding of functional analysis and  still do QM, but this book will give you an immensely deeper understanding  of the underlying structure of the theory.  In particular, the  treatment of Green's functions and integral equations is good. There is  chapter on Group Theory and it's uses in QM. Also is a chapter on Complex  analysis, although it is a wise idea to read a book entirely devoted to  this subject. Overall, I like this book very much."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A336IIPVQMGQGG"
                },
                "Date": "on September 27, 2005",
                "Helpfulness": 0.9666666666666667,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CKCIKPTQTZRH"
                },
                "Date": "on May 29, 2003",
                "Helpfulness": 0.911504424778761,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D4Z9QQ6F06QI"
                },
                "Date": "on November 10, 2002",
                "Helpfulness": 0.9642857142857143,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on January 11, 1999",
                "Helpfulness": 0.9655172413793104,
                "StarRating": "5",
                "Text": "This book has in-depth info on some of the topics that get less attention than they  deserve in other physics texts, such as  integral equations and hilbert space. The section on tensors is one of the clearest I've ever  read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUU89A0J5KNVQ"
                },
                "Date": "on August 29, 2005",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKBXOD1X1KUG1"
                },
                "Date": "on September 24, 2003",
                "Helpfulness": 0.9565217391304348,
                "StarRating": "5",
                "Text": "If you're tired of reading descriptive physics like Paul Davies' books and want to be able to read the original papers and follow the math, this is the book.  It presumes a strong undergraduate math background in some areas but the explanations are clear and the proofs are easy to follow.  If you want to read quantum physics, the chapters on vectors and operators will give you the math foundations."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HHSCH9YA57GL"
                },
                "Date": "on May 25, 2006",
                "Helpfulness": 0.8717948717948718,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2B229G1Q3NYQY"
                },
                "Date": "on January 26, 2002",
                "Helpfulness": 0.8787878787878788,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JSHJ65OLQZHT"
                },
                "Date": "on August 15, 2005",
                "Helpfulness": 0.9411764705882353,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2E3F04ZK7FG66"
                },
                "Date": "on August 16, 2009",
                "Helpfulness": 0.9047619047619048,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on April 14, 1998",
                "Helpfulness": 0.9090909090909091,
                "StarRating": "5",
                "Text": "This book is a great summary of the essentials of applied math used in physics.  (A lot of stuff I missed since I took mostly pure math classes.)  It gives enough of a start to tackle something like Courant & Hilbert or Morse & Feshbach.  Plus it sometimes has information useful enough to solve problems from Jackson.  :)  At the price, nothing can beat it.  Both thumbs up!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZ9FDV76PVB5G"
                },
                "Date": "on July 11, 2002",
                "Helpfulness": 0.8125,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARY0SLBCLKWH"
                },
                "Date": "on May 3, 2006",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "One should buy this book just because of the way Green functions are explained. I wish I had had this book during my studies. It would have made things much clearer..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACD0A5Q08C7EZ"
                },
                "Date": "on June 15, 2005",
                "Helpfulness": 0.875,
                "StarRating": "4",
                "Text": "I am an undergraduate, and while I find the book interesting and good, I just wanted to emphasize that it is very sophisticated and dense.  I am a rising junior, and I have been reading the book on and off for about a year.  The book is well-written and interesting, but it's very sophisticated and I probably should have gotten a lower-level book even though I have more than the mathematical prerequisites.  It's a bit discouraging since I historically am extremely strong in math.  So just to warn you, it's good but it might be over your head."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJ1C7056W1ENI"
                },
                "Date": "on April 20, 2008",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12B29LCH6RIDS"
                },
                "Date": "on November 26, 2002",
                "Helpfulness": 0.9090909090909091,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MOREONNEU6X0"
                },
                "Date": "on July 31, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Great mathematical physics book.  I bought it as a supplement text for a mathematical physics course as well as help in quantum physics course.  Got me through a lot of Quantum homeworks.  I still use this book as a reference for math and physics concepts.  The ordering of the book is a little weird and skips the some of the basic concepts in linear algebra but explores a wide variety of other topics including Green Functions, Cauchy-Riemann, Fourier analysis and transforms, Dirac notation, ect.  At the end of topic the book works through examples.  A must have for physicist, engineers, and mathematicians."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16OX4GFCQTCNG"
                },
                "Date": "on February 28, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "If you are a graduate student in the field of physics, this book is a MUST HAVE. Inevitably as an undergraduate you will be ill-prepared for what you are expected to know as a graduate student in physics. This book as thoroughly filled in the mathematical gaps that I was missing. This book was used as a text for my Methods of Theoretical Physics class and I can say that it is clearly leads you through every topic without much confusion. I will be using this text as a reference for years to come."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1M7G3CM83PZG3"
                },
                "Date": "on December 19, 2002",
                "Helpfulness": 0.8181818181818182,
                "StarRating": "5",
                "Text": "I have learnt from this mathematical book more physics that from many physics textbooks. I wish these guys wrote a book on differential geometry to save us time and money. Buy it while it is still available (at this price), it is a beauty."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HEVCT8CAVAOS"
                },
                "Date": "on June 7, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "this book chose the best way to convey the mathematics behind a physical idea just by proving it through the mathematics involved . With that , one has a lucid idea about the language of physical laws . I can simply assure anybody who wants to buy this book that it is worthy ."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZD7C4ZW00YKH"
                },
                "Date": "on March 21, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YPR837LATNSH"
                },
                "Date": "on August 12, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "In my eyes this book is must-have if you want to be introduced in theoretical physics. The authors understand to invite you into in a never boring journey of deeper understanding. It would have been wise for me to study this book when I began with the graduate level of my studies. I like the introduction to the calculus of variations very much. Finally the introduction of Green functions are more clear than I ever saw before. Simply  great, if I could get back in time this book would have helped me a lot."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30696HV4TIBF9"
                },
                "Date": "on August 17, 2012",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "This book contains an enormous amount of insight into a great amount of mathematics that is largely taken for granted in undergraduate courses on the subjects of Classical and Quantum Physics. This book, despite it's age, does a wonderful job of filling the gaps between undergraduate math courses in Linear Algebra and Calculus, and the mathematics that is used in these two foundational fields of physics. I highly recommend this book for any aspiring graduate student in physics, particularly after one has taken a good number of math courses and both classical and quantum physics at the undergraduate level, in preparation for graduate studies. In particular, it is best for someone who is interested in the details of the thoeries. It helped me a lot."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1192ZVWRV7HDO"
                },
                "Date": "on August 30, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Byron and Fuller is a must have for anyone studying mathematical physics. It's presentation is thorough and complete as an introductory book for this massive field."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LN64UE3NEZOA"
                },
                "Date": "on April 3, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AW8MUJU9Z3424"
                },
                "Date": "on February 1, 2014",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on May 25, 1999",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I wish all textbooks would be of this high caliber and price. It is one of my favorite books.  Don't hesitate to buy it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MAK66HW9P2ZR"
                },
                "Date": "on February 22, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Good book, but very difficult.  Be prepared to do outside research to flesh out their explanations."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AKAGBYJYCJ3Z"
                },
                "Date": "on March 21, 2003",
                "Helpfulness": 0.6,
                "StarRating": "5",
                "Text": "Concise and complete.  I find myself coming to this book not only for Physics courses and Physics research, but I find it helpful in most Math courses.  This book is a must for anyone in Physics and applied mathematics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GJGDRFQBK17M"
                },
                "Date": "on May 15, 2007",
                "Helpfulness": 0.5555555555555556,
                "StarRating": "5",
                "Text": "Over my head, but clearly a solid rung in the ladder for those who are capable of mastering quantum physics. Not that I couldn't - it would just take 10-20 years that I don't have."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UYK3NBI427YG"
                },
                "Date": "on August 6, 2007",
                "Helpfulness": 0.375,
                "StarRating": "4",
                "Text": "As the title says, it's one of the best books for mathematics in physics. Not simple at first glance (not indicated for first students, I guess), but good to review some math..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34UJHS0FC7TIL"
                },
                "Date": "on October 4, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Great boot! Received on time. Very satisfied with the services and I recommend to a friend!"
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Mathematics-Classical-Quantum-Physics-Dover/product-reviews/048667164X/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "33"
    },
    "Salesrank": "#138,432",
    "Timestamp": "2015-05-24 12:30:28.322145",
    "itemurl": "http://www.amazon.com/Mathematics-Classical-Quantum-Physics-Dover/dp/048667164X"
}
