{
    "Category": "in Books (",
    "ListPrice": "$21.95",
    "Name": [
        "Pythagoras's Trousers: God, Physics, and the Gender War"
    ],
    "OfferPrice": "$19.50",
    "Reviews": {
        "AverageStarRating": "3.7 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28IJZ2N9EXH4F"
                },
                "Date": "on December 17, 1997",
                "Helpfulness": 0.8928571428571429,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on December 22, 2002",
                "Helpfulness": 0.8529411764705882,
                "StarRating": "5",
                "Text": "A number of (male) chemistry and physics colleagues  recommended this book to me before I read it.  After I read it (one of my first books about gender and science)  I had to agree with them that it was outstanding  - a delightful and eye-opening book for scientists and science students  who, like me, had never been exposed to more rigorous writings in gender studies. Wertheim's message is not one that the die-hard, non-feminist, scientist wants to  hear.  The looseness of the historical and philosophical writing gives feminism's detractors ample  grounds, therefore, on which to denigrate it.  But truth is truth - and this book rings true on all levels that I (a Full Professor of Physics) can probe.  Now that I have read other books in the field of gender studies,  I know that there are plenty of extremely tightly reasoned and readable books by e.g. Shapin, Noble and Sheibinger that one can follow up with.  (These would convince the skeptical reader - if he will allow himself to be convinced - that Wertheim's conclusions are extremely well-founded!)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SYUEGXPOSYDK"
                },
                "Date": "on December 5, 2005",
                "Helpfulness": 0.9285714285714286,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on January 7, 1999",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": "As a female engineer -- somewhat cynical about  organised religion and having experienced the maleness of scientific academia and profession -- I found this to be one of the most interesting, entertaining, and intelligent  books I have read in a long time. Firstly, it presents a concise and very  readable account of the illuminating history and sociology of science,  mathematics and engineering (to which their students sadly gain far too  little exposure).  Secondly, the argument adds a new dimension and depth  (for some reason hidden until now!) to our understanding of the perceived  barriers facing women to the study and practice of science, mathematics,  and engineering. This issue has gained increasing attention from  universities and professional institutions, who at least claim to be  attempting to remedy the situation. All our attempts would be wiser for a  better understanding of the deep-seated cultural and institutional bases of  this bias, and for a better appreciation of the significant but largely  unsung contributions of women to our scientific progress. Concerning the  debate about the \"feminisation\" of science: the author's  point-of-view is not a new one, but she certainly argues the case with more  vigour and valid evidence than previous accounts I have read. As a fresh  and enlightened contribution to an ongoing debate, I think this book  deserves a place in the literature. Credit where credit's due to the author  for her hard work and boldness!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on September 29, 1997",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TPIG59MVQUL0"
                },
                "Date": "on January 10, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DXVAI08P00HD"
                },
                "Date": "on August 1, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZ7QNRPFJ2IW1"
                },
                "Date": "on January 3, 2006",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2L29B8AP0BUI8"
                },
                "Date": "on October 29, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AW1G0WOQRWOI1"
                },
                "Date": "on January 20, 2012",
                "Helpfulness": 0.5555555555555556,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MC4SRC0ZOCOS"
                },
                "Date": "on April 21, 2010",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "This book should be compulsory reading for all science teachers, yet the science is simple enough that the book can be appreciated by the non-science focused. The complex vocabulary keeps the reader on their toes, but is well worth the effort for the fanastically simple portrayal of the history of science and mathematics, and the implications of this history on persceptions and directions of science today."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1X2V3GTAYJZ3R"
                },
                "Date": "on February 24, 2000",
                "Helpfulness": 0.4444444444444444,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BC233TH3JQEZ"
                },
                "Date": "on January 5, 2007",
                "Helpfulness": 0.38235294117647056,
                "StarRating": "1",
                "Text": "This book is cliche ridden vitriolic feminist rant against the physics community. The author thinks that male physicists interested in the Theory Of Everything need \"a major personality realignment\". She thinks that universal suffrage is one of the primary forces that has shaped modern Western culture along with physics and parliamentary democracy. To support this she unconvincingly attempts to upgrade the role of women in physics with long boring sections about obscure women physicists. Did you know that Barbara McClintock's notions have revolutionized genetics or that Lovelock's Gaia theory was enabled by his female colleague? There are various insinuations of God, religion, and Christianity in various arguments through the book. The conclusion is that if we re-populate the physics community with a different type of male and a lot more women, including some with the force of religion in their lives then physics can focus on \"different goals and dreams\", not particles and forces. Bah! Don't waste your time and money on this one."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 26, 2002",
                "Helpfulness": 0.27450980392156865,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on August 25, 1999",
                "Helpfulness": 0.22388059701492538,
                "StarRating": "1",
                "Text": "As a student of an Ivy League Institution, I thought that Wertheim's \"man-bashing\" was inappropriate and unfounded.  Her interpretation of historical facts were deceptive and misleading.  She  twisted these facts in conniving ways to support her feminist thesis."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Pythagorass-Trousers-God-Physics-Gender/product-reviews/0393317242/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "15"
    },
    "Salesrank": "#40,792",
    "Timestamp": "2015-05-24 12:46:01.697772",
    "itemurl": "http://www.amazon.com/Pythagorass-Trousers-God-Physics-Gender/dp/0393317242"
}
