{
    "Category": "in Books (",
    "ListPrice": "$16.00",
    "Name": [
        "The Black Hole War: My Battle with Stephen Hawking to Make the World Safe for Quantum Mechanics"
    ],
    "OfferPrice": "$13.96",
    "Reviews": {
        "AverageStarRating": "4.4 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYI7566VPC77G"
                },
                "Date": "on July 22, 2008",
                "Helpfulness": 0.9705882352941176,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A355Y35NKD3SOS"
                },
                "Date": "on March 22, 2010",
                "Helpfulness": 0.8536585365853658,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A373ZCB1AYOZC"
                },
                "Date": "on July 16, 2008",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "5",
                "Text": "This is absolutely the greatest example of what popular science book about theoretical physics/cosmology should be !! Writing is so brilliant, witty, straightforward, direct and succinct, that regardless of education level, anybody can enjoy interesting content (history of science as well as author's personal story) of \"The Black Hole War\". Author uses analogies in the best possible way, comparable only to Brian Greene and Michio Kaku. Drawings are frequent, well selected, informative and easy to understand. He writes: \"The real tools for understanding the quantum universe are abstract mathematics: infinite dimensional Hilbert spaces, projection operators, unitary matrices and a lot of other advanced principles that take a few years to learn. But let's see how we do in just a few pages\". AND HE DELIVERES !! While this book could be a starter for anybody, I recommend it to all who know Kip Thorne's famous work. For reason unknown to me, important black hole \"war\" is not mentioned in \"Black Holes & Time Warps\" at all, therefore Susskind's work becomes great extension to BH history of science. Professor Susskind created a true masterpiece where he even acknowledges coexistence of science and faith by writing: \"The British intellectual world seems to be big enough for both Dawkins and Polkinghorne\". Nothing but big applaud for the author and his effort !!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FW4UB3JA7KUI"
                },
                "Date": "on November 16, 2008",
                "Helpfulness": 0.7916666666666666,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RJXMODMW7K2B"
                },
                "Date": "on October 9, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17BUUBOU0598B"
                },
                "Date": "on June 30, 2009",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IL3152HI3SF3"
                },
                "Date": "on November 28, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I really enjoyed this book.  I received my Ph.D. in experimental physics over 40 years ago so the words and ideas were new to me.  For the clear exposition of string theory I am grateful.  I believe this book is understandable (with a little digging) by anyone with an undergraduate degree in the physical sciences.  The illustrations filled a conceptual gap for me.  However, I have one criticism.  The author seems to believe that having a description of the object is the object and so the world must act as the mathematics says it should act.  I am not so sure.  This has been a philosophical problem from Plato's day.  Thus it appears that cutting edge physics is again within the \"event horizon\" of philosophy.  When you read the book, just remember that the item is a thing and the description is just the current description of the item."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VD6DG51IZE3U"
                },
                "Date": "on April 13, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Excellent reading for those interested in the latest developments (~2008) in theoretical gravitational, high-energy, and string physics, straight from one of the field's most distinguished and original practitioners. Most valuable are his anecdotes from being on the front lines of this scientific debate, particularly his interactions with Hawking and 't Hooft. There are also many imaginative and graphic explanations of black hole physics, for example the \"dumb hole\" (or \"acoustic black hole\") analogy and the \"Alice's airplane\" description of de-localization near an event horizon. Though the black hole war may be over, others rage on. Perhaps Susskind will treat us to an account of some of those in the future..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KJO5VP4K3CHU"
                },
                "Date": "on April 25, 2011",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADXCXX15KNZC9"
                },
                "Date": "on September 15, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MJSAAIAB84KX"
                },
                "Date": "on August 1, 2008",
                "Helpfulness": 0.7777777777777778,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AF0267NG7XYLT"
                },
                "Date": "on December 17, 2010",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": "I've read Weinberg's DREAMS OF A FINAL THEORY, and Greene's ELEGANT UNIVERSE multiple times.  I am on my 4th reading of THE BLACK HOLE WARS.  I have only recently started Randall's WARPED PASSAGES.  However, I can say Susskind has done the best job overall if your objective is receive the same message that the author intended.  That's the problem:  all of these authors are capable of simplifications and good writing, but I find that Weinberg leaves you shaking your head and Greene's simplifications actually causes you to generate incorrect images in your mind that differ from what he intended.  EXAMPLE:  I've heard Susskind refer to entropy as a measure of \"hidden information\" versus the common description as a \"measure of disorder.\"  I've heard physicists such as Sir Roger Penrose \"poo poo\" Susskind's interpretation.  But the fact is, if you understand Susskind's association of entropy with hidden information (as discussed in this book), you will be much closer to understanding entropy than 99% of people on earth.  I applaud Leonard Susskind for getting me closer to understanding reality than any other theoretical physicist attempting to communicate with the rest of us mere mortals.  So far, this book does the best job of explaining to me the basic workings of string theory.  The other books leave me believing Lee Smolin is correct in questioning the dominance of string theory as the path to the final theory."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQLKG5111HY85"
                },
                "Date": "on January 6, 2009",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17W94UUANQ0T9"
                },
                "Date": "on October 2, 2010",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AE09KH6TXAGUB"
                },
                "Date": "on September 9, 2008",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABDLE8SNF67OS"
                },
                "Date": "on October 29, 2010",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VX6A9UZBLEPI"
                },
                "Date": "on October 31, 2008",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "There is a lot of physics contained in this excellent book - modern, cutting-edge theoretical physics, that is. In 24 chapters and almost 450 pages, the author guides the reader through a maze of seemingly contradictory scientific arguments in order to resolve an important issue in the physics of black holes: whether information is forever lost to the universe after it has passed through a black hole's horizon. In essence, this involves a type of reconciliation between General Relativity and Quantum Mechanics. Although this involves very abstract and difficult-to-grasp concepts, the author, one of the main adversaries in this so-called black hole war, gently guides the reader through the various issues, starting from first principles right up to the cutting-edge subject at hand. The book is amply illustrated with many diagrams, drawings, figures and pictures in order to help further clarify the already-lucid descriptions that are given in the text. But, in addition to all the technical issues, the author has included much of the human element in this war. Interpersonal matters, many personal anecdotes, people's backgrounds and even the odd joke all contribute towards illustrating that the main theme of this book is a truly human endeavor: to understand a bit more about our universe. The writing style is clear, authoritative, friendly, even chatty and very engaging; the 450 pages fly by amazingly quickly. Although science buffs are likely to be those who will enjoy this book the most, the writing style is such that its contents are easily accessible to a much broader readership."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OCNCN9YQH53K"
                },
                "Date": "on June 3, 2010",
                "Helpfulness": 0.7,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PRXRGIASP6YF"
                },
                "Date": "on July 28, 2008",
                "Helpfulness": 0.6792452830188679,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27VAPW9LSI9RS"
                },
                "Date": "on June 2, 2011",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALJGXOJOM145S"
                },
                "Date": "on August 3, 2008",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJR4KI8P6QXF3"
                },
                "Date": "on August 20, 2011",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "That Leonard Susskind could choose to become a Physicist instead of remaining a plumber is a great part of our past that is now lost. Susskind attended CCNY when it was free to all who were accepted - but only the best and brightest were accepted. Leonard Susskind is a clear and understandable writer and one of the great physicists of our era. This book is built around a question by another great physicist, Stephen Hawking that lead to some remarkable discoveries of the Universe as it is, and it's a very strange place. A book well worth reading, possessing and rereading."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A167ZJQ9M0HC6S"
                },
                "Date": "on August 16, 2008",
                "Helpfulness": 0.75,
                "StarRating": "4",
                "Text": "Quantum theory seems to work mathematically, but verbal descriptions have left most of us scratching our heads at the paradoxes. Suskind has excellent  analogies and descriptions that minimize (though can't elemeninate) some of these problems. His knack for using one- and two-dimensional worlds to describe the \"real\" world are especially enlightening and understandable."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UTKYA2U8542F"
                },
                "Date": "on June 16, 2009",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZDPQA6FLY8XM"
                },
                "Date": "on July 5, 2008",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17SOKF4JF7JHF"
                },
                "Date": "on December 18, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2811NY0VQ1TNE"
                },
                "Date": "on March 3, 2009",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGCCTBVFXVTCX"
                },
                "Date": "on January 10, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APY8HFPRGUBTT"
                },
                "Date": "on March 26, 2009",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3F0HW9CRYKR1L"
                },
                "Date": "on May 31, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2J70ERTLL8OD"
                },
                "Date": "on October 1, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Who would have thought that a book pitting the ideas of two differing groups `General Relativists' and the camp of `Quantum Mechanics' would make for a good read? Okay lots of brainy types out there may have thought as much but the rest of us likely wouldn't get it unless it could be explained in terms we could understand. On the GR side is Stephen Hawkings and on the QM team we have the author Leonard Susskind. Not much in the way of a battle as it all happens between the brain cells but I thought for a subject that the masses neither care about nor could comprehend the author did bring it down to a level we could at least digest if we so desired. I admit I took the bait and read the book. Not always getting everything without re-reading (two or three times) but that is my personal issue and not a fault of the writer. I thought it was crazy that he took on the challenge because how many people will really read this book? I guess time will tell but I do thank him for putting it out there for our consideration....and for me I sided with the QM team...."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30ITY1MY857A"
                },
                "Date": "on July 24, 2013",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26CUPEEMYHBZM"
                },
                "Date": "on April 23, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SI212TR1ERRG"
                },
                "Date": "on February 23, 2011",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PYGRFALCMZC3"
                },
                "Date": "on July 3, 2008",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "highly recommended.  very interesting read, even for those not familiar with the underlying physics.  suskind is a talent writer, able to make esoteric concepts accessible to the lay-reader.  he is also one of the vanguards of later 20th century physics.  there is an on-going, vigorous debate swirling around the dark corners of our universe.  for anyone with an interest in that debate, this is a must read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RAEKPXTI1DR1"
                },
                "Date": "on November 19, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RP4OSZYD22FS"
                },
                "Date": "on April 25, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AS6EPVW1IRRP5"
                },
                "Date": "on March 16, 2009",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Susskind's second popular work is as lucid and compelling as his first.  The subject matter of this book, though abstruse in the extreme, is rendered as intelligible as I imagine is possible to a non-specialist readership.  Susskind has a great gift for explaining and illustrating difficult concepts.  Though I emerged from TBHW lacking the mathematical sophistication that would enable me to understand a journal article on black holes, I nonetheless emerged with a deep understanding of, and appreciation for, this area of scientific research and speculation.  I would rank TBHW on par with another outstanding treatment of similar subject matter: Kip Thorne's Black Holes and Time Warps.  Towards the end of TBHW, Susskind voices the hope that he will write another book, one day, on future advances in his field.  Here's very much hoping he does just that."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21E8JTMB27HIB"
                },
                "Date": "on March 25, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NRZ7840IDAXN"
                },
                "Date": "on August 20, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "My BS in physics is over forty years old. This was a great way to catch up. I had forgotten that string theory was beginning to play a big role in nuclear physics. When the book pointed out some of the things that were well proven about it at the nuclear scale, it reduced my scepticism about all the mathematical hard labor being devoted to string theory in order to understand what is happening at much higher energies. As usual, physicist have looked at very simplified special cases in order to make the math tractable and clarify basic processes. The book explains many of these clearly. It is also a reminder that the most advanced human minds barely have the capacity to begin unravelling quantum mechanics and cosmology at their limits, and a lot more humility would probably be appropriate!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GB4WEW3WWEAR"
                },
                "Date": "on September 9, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2H650P49NTKMR"
                },
                "Date": "on May 23, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RCCPRSLQKPQF"
                },
                "Date": "on March 22, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XVT3NJQONXGO"
                },
                "Date": "on March 17, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OY0F7YY9NIL1"
                },
                "Date": "on November 8, 2010",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "As far a science non-fiction goes, this book is well above average.  You learn about black holes and the physics behind them.  The author does not talk down to you or over your head.  You don't need to know any math but will get more out of it if you know a bit of algebra.  It's a bit of a thriller since you are in the middle of a competition to see who is right about black holes and you get to know a lot of fun inside information about the personalities of well known physicists.  Overall, a lot of fun."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GPKZCHFCQ8VU"
                },
                "Date": "on August 7, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMD2BHOH5XF8R"
                },
                "Date": "on November 6, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is a book written in the manner that the author speaks in lectures or ordinary conversation. I have listened/viewed many video lectures by Dr. Susskind as aired from Stanford, and his way of lecturing is typical of someone with an inquiring and active mind.  He wanders off topic as easily as taking a different path on a walk in the woods, but....he always comes back to the main idea and relates all that he ventured into on the aside trip to the main topic."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZJ0P9M48O5SE"
                },
                "Date": "on September 4, 2008",
                "Helpfulness": 0.6470588235294118,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MX6VLC601GVL"
                },
                "Date": "on July 2, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Dr. Susskind writes in a style that is very easy to understand. Each chapter is tied into the one before and the one to follow making it very difficult to put the book down or take time to go through some of the math that is presented. For me, the math is very helpful but is not necessary to follow Dr. Susskinds arguements. The descriptions of various meetings attended by the author add a very nice historical note to this most interesting text."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3R6Q5O7MKG4FV"
                },
                "Date": "on February 23, 2010",
                "Helpfulness": 0.6,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AHBAFEL87HCM"
                },
                "Date": "on July 27, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2O2Q03UMRCB3O"
                },
                "Date": "on August 6, 2008",
                "Helpfulness": 0.6363636363636364,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A172TA2NLU3SC1"
                },
                "Date": "on February 11, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26CLEYDB9PYDA"
                },
                "Date": "on October 12, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I found this book both informative and entertaining. Leonard Susskind did a good job of making some key concepts such as entropy, temperature, and information (as used in phyisics) understandable. His personal discriptions of his interactions with some of the most well known theoretical physicists of our time was fascinating."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFAF7PUG7CN51"
                },
                "Date": "on November 16, 2009",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AG4F138TG4ETM"
                },
                "Date": "on March 30, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book will take you on a trip to places far stranger than Alice's Wonderland. It seems that humans will never be able to comprehend (grok) the ultimate nature of physical reality even if a few of us have the mathematics to describe it. Is it time for a bit more evolution?"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1F1NEYH7ZK0YA"
                },
                "Date": "on November 4, 2010",
                "Helpfulness": 0.6,
                "StarRating": "3",
                "Text": "I read this book mostly because I have been following the physics lectures by the author on the Internet and he gave the impression of being a good educator and thus assumed he would the same as a popular science writer. Thus my disappointment with this book...the first chapters are quite interesting and an easy read. Problems start when the author tries to get deeper into the subject. The main problems I had with his way of presenting things are: 1) the flow is quite non-uniform for my taste...lots of interruptions to explain other concepts that confuses a bit the core issues. A better approach would have been to provide most of the background early on and then apply it to the problem at hand. 2) Some of the most important issues are not presented in a easy-to-follow manner, specially in the chapters linking strings and BH. This is a pity given the background of the author. 3) I really did not care much at all for the \"character\" descriptions....that again just kept muddling the core message. I can see that the author tried to provide some sort of \"diary\" of how things evolved during the years of the \"war\", but the book has been (to me) quite less pedagogical than expected."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2X9TL6HJW9TUO"
                },
                "Date": "on May 9, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15R54461ZDXB"
                },
                "Date": "on December 28, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Some very difficult concepts to wrap one's head around but nevertheless a fascinating read. It's inspiring that we live amongst people who through sheer force of intellect solve some of the deepest questions in the universe."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFXQH9559H62J"
                },
                "Date": "on October 21, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CYWLKTN5Q1B3"
                },
                "Date": "on January 21, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I've always enjoyed Susskind's sense of humor.  After seeing him on several Nova specials I thought I'd read one of books.  Was not disappointed, and recommend this to anyone who laughed at the title."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVKY8AN5SR73"
                },
                "Date": "on December 25, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Of all the many physics books I have read, I have enjoyed this one the most. Having a peak into the personalities of the scientists involved along with well-explained science was a real treat."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3E33B936SI3WE"
                },
                "Date": "on April 30, 2010",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "This book explains very difficult concepts in simple terms for a general audience. The book is specifically about a war between relativists and quantum physicists about the properties of black holes and information as a physical quantity. Susskind is a great writer. His style enthralls the reader all the way to the end of the book. I give this book 5 stars for the writing style, analogies, and introduction of very difficult concepts in simple terms. I have formal training in Physics and I am familiar with a fair amount of the Mathematics needed to work out problems in Quantum Field Theory, General Relativity, and String Theory. So I understand the challenges a writer faces when trying to put these concepts in simple terms and I have read both very technical books and also books for the general audience on these subjects. Susskind does an excellent job. This is one of the best books I have read on modern Physics for a general audience. I highly recommend this book to both students of Physics and professional scientists and to anybody who is interested and enjoys Physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ULT0DH7BS1JD"
                },
                "Date": "on January 23, 2010",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2R0R2BCI8MIUQ"
                },
                "Date": "on March 2, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Very well written and a good effort at making theoretical physics accessible to the interested reader. It also another example of history being written by the winners."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZC5QLDHLWA7Y"
                },
                "Date": "on August 14, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book is for anyone interested in physics. It really explains he truly believes Dr. Stephen Hawking got wrong and does it a way anybody can understand."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PPU9JD6YVI2X"
                },
                "Date": "on April 12, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Fascinating in every way! The background jabs between the main physicists as well as the theories explained in a way most people can comprehend."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARFATH83RFXCL"
                },
                "Date": "on September 24, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "It was really a very good experience regarding the purchase of the book. Even the shipment service was very good as well"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14OJS0VWMOSWO"
                },
                "Date": "on October 13, 2008",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A336NUPO07VIB0"
                },
                "Date": "on July 6, 2010",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1B7XVE802JUCT"
                },
                "Date": "on September 30, 2009",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BN7GLKN2OE2S"
                },
                "Date": "on November 18, 2008",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "At first I was put off by the simplicity of the narative. Appeared and felt like a book on physics simply dumbed down -- but as I got further into the writing I found the writing style grew on me -- that this is an excellent writing on QM that is accessable to my nieces. L. Susskind is very thorough in his presentation, and after the first 100 pages or so, just paints an exciting picture that is very easy to follow, and, again, what is more impactful -- one simply WANTS to find out the \"next step.\" OK -- Christmas gift for my nieces??"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3830RDUGH0HEX"
                },
                "Date": "on May 18, 2015",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "It was OK - a bit long winded - I have read more engaging books on Black Holes and Quantum mechanics"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UE5KJDQT48WA"
                },
                "Date": "on February 21, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Amazing book,truthful and useful for rewriting your brain,great respect to Leonard Susskind,cheers"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2V45K1X8UEDG9"
                },
                "Date": "on April 11, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Good book about Leonard Susskind's quest to prove information is not lost in black holes."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1D1P9JQKWW8N"
                },
                "Date": "on October 31, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent all the way around. I would buy from them again. Very satisfied overall."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KJYX0VTHHS09"
                },
                "Date": "on October 8, 2008",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": "This  book demands some concentration by the layman, some acceptance of presumably factual statements without further discussion, and concerns a topic not at the height of curent concerns.  On the other hand, it does allow sifnificant insight into the various modes of thinking about major issues in cosmology and, in particular, the role of gravity-normally a very  weak force-in keeping us all together."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2B3J06VN113PE"
                },
                "Date": "on March 13, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "the best explanation of some of the current topics in modern physics yet."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OIHDPBU13JPW"
                },
                "Date": "on April 29, 2009",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": "Very entertaining read.  Susskind is able to put complex concepts into the easy reach of the novice physics enthusiast.  A good explanation of quantum mechanics.  Overall I really enjoyed this book but I felt the crux of the \"War\" was more than a little self-serving.  Worth reading but also give Hawking's books serious consideration."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17RIV990H8I7Z"
                },
                "Date": "on May 15, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Loved it. Well written, easy read, fascinating ideas."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1M0PYXW1WEZC0"
                },
                "Date": "on September 7, 2009",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AL9ZLDLKG1R29"
                },
                "Date": "on November 11, 2009",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAD0UN7NQAA55"
                },
                "Date": "on October 24, 2009",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I really enjoyed reading this book! Susskind loves physics and it shows. He is very enthusiastic when he talks about his \"battle\" with Stephen Hawking, along with string theory and other theoretical physics. I would recommend this book to anyone interested in learning about black hole physics in non-technical language. Or to anyone looking for a fun and interesting book!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1W5G2MQCUN615"
                },
                "Date": "on October 4, 2009",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Dr. Susskind does a great job explaining, in non-mathematical terms, some very hard-to-grasp concepts. Read this one first, then Brian Green's \"Fabric of the Cosmos,\" followed by Lisa Randall's \"Warped Passages\" for a thorough non-credit course in quantum mechanics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3391MD4OZXRQ3"
                },
                "Date": "on November 5, 2011",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IS9MYEASLFJP"
                },
                "Date": "on December 26, 2008",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": "Susskind has such a lucid mind that he can't help but reveal personal foibles while giving us a window into the way a truly scientific debate unfolds.  It's fun to see how even super geniuses can stubbornly resist the results of their own insights.  Einstein's intransigence about Quantum Dynamics, Hawkings' insistence that information is lost in black holes, and Susskind's obsession and rivalry with Hawkings.  I loved this book (though most of the string theory was beyond me).  It's fun to spend time with such minds and bask in the energy and optimism that comes from those who puzzle with the universe."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EFY3XXO335MZ"
                },
                "Date": "on January 14, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I get more than I expected. It's very good for me. I recommend the products in 100% for all that can get it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11C4SOV7XP596"
                },
                "Date": "on September 10, 2013",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": "Susskind's war with Hawking inspired me to start a war of my own.  Black Hole War 2: The Revenge of the Machinist has already begun."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BX22OFAMN11L"
                },
                "Date": "on August 19, 2009",
                "Helpfulness": 0.4444444444444444,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11PNZVNZ91DSC"
                },
                "Date": "on September 5, 2009",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I loved this book. Good if you read Susskind's previous book, the Cosmic Lanscape. This book talks about the Black Hole war, an argumentative dispute between two different laws of physics. Mr. Susskind takes you through his head, tells you exactly what lead him to his conclusions and after finishing this book, you should be able to understand most of the basic concepts of black holes, quantum gravity, relativity and many more. Great story together with great physics textbook."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QEE4A6O9UK74"
                },
                "Date": "on November 30, 2009",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32IYHDV0ATWIK"
                },
                "Date": "on August 27, 2009",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "This is one of the best books on physics I've ever read.  Susskind does a superb job with explaining what black holes are...something I have never been able to understand before, since I have taken very few science classes.  But Susskind is a great master and makes the theory behind black holes, quantum mechanics, relativity, and other topics in physics both understandable and fun.  Great read!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38N6WK8H850FF"
                },
                "Date": "on April 3, 2011",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "I bought this after catching Susskin on the Science channel.  The material is still interesting, but it does not have the same impact as hearing him speak about it in in person.  Also, some of the book is dedicated to the mental challenge aspect between him and Hawking, which I find boring."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3619VAU8TI2LI"
                },
                "Date": "on February 11, 2010",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DAJXN1QVAIM0"
                },
                "Date": "on September 15, 2010",
                "Helpfulness": 0.5263157894736842,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5TVAK91WHTMU"
                },
                "Date": "on October 15, 2008",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "On the whole good, but lacks clarity in parts. It tends to go from A to C without explaining what happened to B."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HBFW3WXIGJBR"
                },
                "Date": "on October 2, 2008",
                "Helpfulness": 0.2,
                "StarRating": "5",
                "Text": "WELL WRITEN CHRONICLE OF A FAIRLY ARCANE SUBJECT. INTENDED FOR READERS WITH AN INEREST IN QUANTUM MECHAMICS, COSMOLOGY AND PHYICS IN GENERAL."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38L1FZNX9MU0X"
                },
                "Date": "on September 16, 2009",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "I found this book a little dry at times but my son really enjoyed it. Of course, he is an engineering student at Georgia Tech with a 3.92 GPA (at one of the top ten engineering schools in the world) so maybe he is not to representative. But it does give you real insight into the kind of thinking that is going on in the world of physics today- there is far more excitement there than the general public realizes."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32054N42263IH"
                },
                "Date": "on July 5, 2009",
                "Helpfulness": 0.16666666666666666,
                "StarRating": "5",
                "Text": "I have to admit it- the first few pages, with anecdotes about popular physicists and the personal enrichment cult of the eighties attracted me more than Susskind's breakdown of the laws of physics. All in all, though, Susskind's style is easy, relaxed, readable. Didn't finish the book. Yet. Maybe never."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18F429K1L764Q"
                },
                "Date": "on August 28, 2008",
                "Helpfulness": 0.35294117647058826,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AR382IRU9MQRL"
                },
                "Date": "on August 24, 2013",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": "The author is a Demi-god of modern string theory. His subject is more interesting than this book suggests. As he and I have shown in independent publications, if you jump into a black hole, you get something akin to resurrection of the flesh: In this reality you're burned to a crisp when you fall theough the horizon. In your own reality, you fall though unscathed. The author's motive seems to be to rant against lay people with dumb ideas and those who disagree with him. Such is the privilege of Demi-gods."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AK4WFL881OTBW"
                },
                "Date": "on May 26, 2011",
                "Helpfulness": 0.18181818181818182,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15X60NOGL3WDW"
                },
                "Date": "on January 25, 2009",
                "Helpfulness": 0.15789473684210525,
                "StarRating": "2",
                "Text": "The author does a great job when he sticks to topics which he is educated on.  However in some sections he goes off on religious topics which quite frankly don't belong in this type of a book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SRQ9QJ1CJKGB"
                },
                "Date": "on December 22, 2013",
                "Helpfulness": 0.13513513513513514,
                "StarRating": "1",
                "Text": null
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Black-Hole-War-Stephen-Mechanics/product-reviews/0316016411/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "104"
    },
    "Salesrank": "#60,014",
    "Timestamp": "2015-05-24 13:00:49.651094",
    "itemurl": "http://www.amazon.com/Black-Hole-War-Stephen-Mechanics/dp/0316016411"
}
