{
    "Category": "in Books (",
    "ListPrice": "$24.95",
    "Name": [
        "Lectures on Gas Theory (Dover Books on Physics)"
    ],
    "OfferPrice": "$19.81",
    "Reviews": {
        "AverageStarRating": "4.5 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on August 20, 1999",
                "Helpfulness": 0.9655172413793104,
                "StarRating": "5",
                "Text": "I must say I'm a beginner in statistical mechanics but I believe Boltzmann is really worth reading because he was one of the creators of statistical mechanics. One can learn a lot by reading the works of masters. His book is  of course old fashioned 19th century book and his notations are not the  kind of thing you can love, but I found his book readable and enjoyable.  Boltzmann works out every theorem rigorously and explains every single  points in detail. It might exhaust you but at the end you can see the  picture. I definitely recommend Boltzmann to everyone.  P.S I also  recommend Ehrenfest's book as companion of Boltzmann."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1K00PHVDVUMWN"
                },
                "Date": "on April 25, 2011",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Ludwig Boltzmann pioneered the theory for statistical physics.  So much so that his Boltzmann equation defined the field.  During his lifetime, he wrote many publications regarding his theory.  Toward the end of his life, he wrote this book to bring everything together.  The book does not represent a modern presentation of statistical physics, but rather insight into the mind and thinking of Ludwig Boltzmann as he developed the original theory.  The translator's introduction gives a very good overview of the history of kinetic theory that preceded Boltzmann, and the schools of scientific thought that Boltzmann debated during his lifetime."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Lectures-Theory-Dover-Books-Physics/product-reviews/0486684555/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "2"
    },
    "Salesrank": "#103,751",
    "Timestamp": "2015-05-24 12:39:05.214245",
    "itemurl": "http://www.amazon.com/Lectures-Theory-Dover-Books-Physics/dp/0486684555"
}
