{
    "Category": "in Books (",
    "ListPrice": "$72.95",
    "Name": [
        "The Classical Theory of Fields, Fourth Edition: Volume 2 (Course of Theoretical Physics Series)"
    ],
    "OfferPrice": "$53.34",
    "Reviews": {
        "AverageStarRating": "4.5 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2J1WDI0RFQNFI"
                },
                "Date": "on September 3, 2001",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D7XC7USJ9X7J"
                },
                "Date": "on July 18, 1998",
                "Helpfulness": 0.9767441860465116,
                "StarRating": "5",
                "Text": "When I need the real explanation of something concerning relativity, electromagnetism or gravitation, I know this is the place to go. I know I will find the essence of the problem clearly yet tersely written. Some highlights: the derivation of the retarded Green function, where a clever mathematical analogy avoids lots of contour integration; the frequent use of the powerful Hamilton-Jacobi equation, again avoiding long Riemannian-geometry computations; the explanation of why nothing, not even light, can escape the attraction of a black hole. When it overlaps with Jackson's rightly famous textbook on Electrodynamics, you'll see the difference between a good (Jackson's) and a remarkable book. Though not up to date in matters of cosmology, it is still the starting point to be recommended."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AU7ND6NOCX9IA"
                },
                "Date": "on November 30, 2004",
                "Helpfulness": 0.9615384615384616,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3APNP8YIH09RB"
                },
                "Date": "on November 19, 2004",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I expected this book to be dense and incomprehensible, like I have found other of their books before, but the material is actually clearly presented, and not as terse as it may seem from a first glance. While not as comprehensive in coverage as Jackson's Classical Electrodynamics, I find it easier to follow. As far as coverage of GR goes, it's succinct: I found it very helpful to work through this book before tackling MTW."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AY6Q7ASZT7Q8S"
                },
                "Date": "on June 1, 2001",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is the best book on gravity. General relativity can be presented in purely mathematical form with differential geometry and topology, or in physical form, using only algebra and tensor calculus. L.Landau and E.Lifshitz have chosen the second attitude, which is simpler and more useful for physicists. All derivations and constructions are clear, logical and seem to be natural. I learned general relativity from this book and this theory became my favourite, as well as this book. The part on classical electrodynamics is also very good, I like that the authors begin with special relativity and Maxwell equations (as well as the fact that in their Classical Mechanics they start from the least action principle).  Although The Classical Theory of Fields was written about 60 years ago and there is no topics, such as radiation of black holes, it is in my opinion the best book for everyone who wants to learn Einstein theory of gravitation."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJ151094CBFFF"
                },
                "Date": "on August 15, 2006",
                "Helpfulness": 0.9047619047619048,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12SV7KM2ZW9AP"
                },
                "Date": "on November 22, 2000",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Please forgive my devotianary language, but after perusing this text, one is simply overwhelmed as if subjects long obfuscated by other texts have suddenly been revealed in an almost religious epiphany. The sections devoted to relativistic electomagnetism are beyond criticism while that on General Relativity cannot be found elsewhere. Compare Weinberg or MWT, and you will see the marked difference. Highly recommended to any intermediate to advanced student who has been exposed to GR or relativistic E&M."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIL2WOS0J61K3"
                },
                "Date": "on January 23, 2006",
                "Helpfulness": 0.8888888888888888,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ABABZIT5EAW7"
                },
                "Date": "on July 23, 1998",
                "Helpfulness": 0.9230769230769231,
                "StarRating": "5",
                "Text": "This is the Volume 2 of the famous Course of Theoretical Physics by L. D. Landau and E. M. Lifshitz. All serious students of theoretical physics must possess the ten volumes of this excellent Course, which cover in detail and rigour practically all the branches of theoretical physics. The Volume 2 treats the subject of microscopic electrodynamics(electromagnetic fields in vacuum) and the whole of the theory of relativity. The book opens with the special relativity and, with this basis, constructs a detailed theory of the electromagnetic fields in vacuum, moreover including the theory of diffraction of the light. The last five chapters describes all the basic concepts of general relativity and some more specialized topics, such as the gravitational collapse, gravitational waves and in the last chapter, an excellent account of relativistic cosmology. It is noteworthy as the authors describe elegantly and efficiently all these subjects in the same book. A unique book!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1H9XZA55ADA95"
                },
                "Date": "on July 6, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQMBVCKN57ES"
                },
                "Date": "on December 25, 2006",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Landau's approach to Classical Field Theory demonstrates his ability to be clear, concise, and elegant without drowning out the physics with math. I will say, however, that Landau requires a certain maturity to appreciate his style (same goes for Rudin's books of analysis). I would recommend this title to those with a working knowledge of classical E & M, vector/tensor analysis, and of special relativity. It is also wise to work through the author's Theoretical Mechanics to get a taste of their style. I believe, contrary to many, that this book is appropriate for self study if one is willing to do the work (not only the exercises but following along pencil in hand). I suggest reading a passage and then covering it up and then trying to do the derivations by hand. My only complaint is the quality of print, which has is not the fault of the authors. It is especially annoying at first."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UFEBPIOJRVFG"
                },
                "Date": "on January 25, 2003",
                "Helpfulness": 0.9166666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RFXU3P0XKKF4"
                },
                "Date": "on May 25, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36K2N527TXXJN"
                },
                "Date": "on June 16, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IEV3REXKOAB6"
                },
                "Date": "on November 1, 2000",
                "Helpfulness": 0.9,
                "StarRating": "5",
                "Text": "This is a magnificent book carefully crafted by two of the leading theorists of the twentieth century. If you have a basic grounding in mechanics, vector analysis and tensor analysis then much of this book will be accessible. The early parts of the book are concerned with Special Relativity and the classical electromagnetic field using the action principle and tensor form of Maxwell's Equations. Later in the book there is in depth presentation of the General Theory of Relativity. This is very much a reference book rather than one to approach these subjects for the first time. There are no exercises or problems but it is a truly masterly work and well worth the money  spent upon it and time invested studying it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZTXYX8OB9DLC"
                },
                "Date": "on February 26, 2004",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 15, 2004",
                "Helpfulness": 0.7857142857142857,
                "StarRating": "4",
                "Text": "Seriously, a cult classic.  And one should beware of cults.  It's a very elegant, pristine presentation.  However, this is often at the expense of sweeping some messier issues under the rug.  Landau's reasoning has a very fluid intuitive quality, and it is easy to float along with as long as you don't stop an notice that sometimes it doesn't really make sense.  I once heard a prominent physicist say of Landau's papers \"everything's wrong except the answers\".  An exaggeration but some truth to it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACTEKUQIV8SKE"
                },
                "Date": "on September 10, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on January 16, 1998",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": "This is a classic. Elegant, but like all books in the series, quite dense. The first half, on the field theory associated with classical electrodynamics, is a 'must-read'. The approach mirrors that of volume 1, Mechanics, in that the  dynamical equations are derived from more fundamental principles: Hamilton's principle, the principle of Lorentz invariance, and the isotropy and homogeneity of space-time. The second half,  on general relativity, is becoming a bit dated with the advent of  modern symplectic approaches."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25ZLA0XAI72VV"
                },
                "Date": "on June 11, 2011",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HKBD770DM98G"
                },
                "Date": "on March 12, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is a great upper-level E&M; book. Every problem in the book has at least a partial solution to get you started and many have complete solutions. It's a great resource for studying E&M; as well as general field theory."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30NU40HH7T2FH"
                },
                "Date": "on August 9, 2013",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A126T33BYOWXJ"
                },
                "Date": "on June 16, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QRBZLXHHBYSM"
                },
                "Date": "on November 13, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "It's so simple to read and just to the point.  I honestly had to use the Jackson book, which was not that great, but made a great grade because of the Landau-Lifshitz classic.  Then there was the advanced MIT EM book which made so much more sense, but it was all math.  Those 3 books alone will give you a pretty adequate understanding of EM, enough to make over 95 out of 100 on every assignment.  The Landau, MIT book together are well pretty cool themselves."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HGO48VV9QTNE"
                },
                "Date": "on December 30, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I just got this book in and haven't had a chance to read past chapter 1, so if you're looking for a book review see the below comments.  However I just wanted to state that the print quality of the new addition is fantastic and is like that of more modern texts.  Perhaps the quality of the older texts is sub par, but rest assured that if you buy the newer addition you will get your money's worth."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AULJWM8TQO0T0"
                },
                "Date": "on October 29, 1999",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "Landau & Lifshz \"Course of Theoretical Physics\" is a famous and respected set of books in Physics. The vol.II, \"Classical Theory  of Field\", is mandatory for any one seriously interested in Physics.  Unfortunately, Butterworth-Heinemann, who currently prints those books in  English, prints them with very poor quality. The books seem to be  \"printed\" on old copy machines and the paper used is also a cheap  one. In many pages, it is really hard to read the text, due to such poor  printing."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on November 16, 1999",
                "Helpfulness": 0.625,
                "StarRating": "5",
                "Text": "on making me want to become a physicist.  This book contains the best and the most original presentation of E&M, period.  It also presents GR in a unique way.  This book must be in every theorist's library.  It will be  consulted and  appreciated a hundred years from now."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A118GOQ15P7XT0"
                },
                "Date": "on January 20, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great book for amature theorists to begin with....."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on July 20, 2001",
                "Helpfulness": 0.6190476190476191,
                "StarRating": "3",
                "Text": "We used this book for the first semester of graduate e+m.  I found it, like all of Landau's books, very dense.  It doesn't have enough examples and doesn't expound on many topics (especially magnetostatics).  The only thing I liked about the book was that it built up e+m from special relativity.  However, I almost immediately bought Jackson, which is a much better book to learn from."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VOIOG87TPHS7"
                },
                "Date": "on October 28, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent overview with thorough computations"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on December 30, 1995",
                "Helpfulness": 0.6,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXD5ZDE29HX0D"
                },
                "Date": "on September 23, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Its a very good textbook for studying Electrodynamics as a graduate student. L. D. Landau solves problems in a very elegant way, and you'll definitely learn a lot from his books, specially this one."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A150YF1WLLIL24"
                },
                "Date": "on December 30, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "college book, delivery good"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EUU3OVM133IU"
                },
                "Date": "on February 22, 2007",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": "This is an absolute necessity for a graduate student!  Studying math/physics.  One of the very best available.  I was very pleased in the condition of the book, and the price made it affordable for me."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QSMYI0G98COH"
                },
                "Date": "on December 1, 2006",
                "Helpfulness": 0.5172413793103449,
                "StarRating": "2",
                "Text": "L&L;, while elegant, is umotivated in the justifications that start their derivations.  If the subject matter is grasped, then L&L; is excellent for its directness.  In brief, the volume is far from a learning tool."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJ6CEI4Y1BMTI"
                },
                "Date": "on November 23, 2003",
                "Helpfulness": 0.35,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30HXVQGHGML8Y"
                },
                "Date": "on July 30, 2013",
                "Helpfulness": 0.07142857142857142,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2V32AAESFQGCP"
                },
                "Date": "on March 26, 2006",
                "Helpfulness": 0.04938271604938271,
                "StarRating": "1",
                "Text": "I bought this book for a graduate E & M physics class and found it utterly useless.  Maybe it would be good for a math class, but even then I doubt it."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Classical-Theory-Fields-Fourth-Theoretical/product-reviews/0750627689/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "38"
    },
    "Salesrank": "#86,687",
    "Timestamp": "2015-05-24 13:05:07.633062",
    "itemurl": "http://www.amazon.com/Classical-Theory-Fields-Fourth-Theoretical/dp/0750627689"
}
