{
    "Category": "in Books (",
    "ListPrice": "$16.95",
    "Name": [
        "The Fabric of the Cosmos: Space, Time, and the Texture of Reality"
    ],
    "OfferPrice": "$11.41",
    "Reviews": {
        "AverageStarRating": "4.5 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQDPM3VFDVQY0"
                },
                "Date": "on March 5, 2004",
                "Helpfulness": 0.9797297297297297,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJRUXLNC6SWE5"
                },
                "Date": "on March 17, 2004",
                "Helpfulness": 0.9840425531914894,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 5, 2004",
                "Helpfulness": 0.9779411764705882,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MDSA2Q4AII8W"
                },
                "Date": "on February 22, 2005",
                "Helpfulness": 0.9690721649484536,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 3, 2004",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACBVFR8QLUXSZ"
                },
                "Date": "on February 19, 2004",
                "Helpfulness": 0.9767441860465116,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SQ5LI1Y8SK6J"
                },
                "Date": "on April 7, 2004",
                "Helpfulness": 0.8801498127340824,
                "StarRating": "5",
                "Text": "No one could read the first chapter and not finish this book!  I savored every page of it from start to finish.  Brian Greene has a unique combination of talent that you JUST DON'T SEE in such an outstanding scientific mind.  1) He can write!  2) He is clearly one of the top physicists in the field of Superstring/M-Theory.  3) He is a born teacher.  4) Did I mention he can write?  Through brilliant use of analogy, Greene makes the most mind boggling concepts easy to grasp.  This is a book for lay people, as evidenced by the absence of equations in the text...they are included in the notes section at the end along with more robust theoretical details.  The book takes you through the usual history of quantum physics and cosmology, as it must do to provide the background necessary to understand where we are now.  He moves from the earlier understandings to the most current developments in a manner that makes very difficult subjects accessible to everyday people.  The question of why the arrow of times moves relentlessly forward is answered in this book, and that is no mean accomplishment.  In fact, the infusion of knowledge is so gentle that after 500 pages I was amazed at how much was covered and even more amazed that I understood it.  The subject matter itself is fascinating.  Greene's writing ability makes it enjoyable at the same time.  His injection of humor put the icing on the cake.  A small example: \"...Ordinary experience confronts us with two types of phenomena: those that have a clearly delineated beginning, middle, and end...and those that are cyclic, happening over and over again (the changing seasons, the rising and setting of the sun, Larry King's weddings).\"  Now some might find his highly imaginative analogies can get a bit corny, but I saw them as brilliant--and they do the job of illuminating complex ideas.  I really can't recommend this book highly enough to those who want to learn!  One last thing...you can read the whole book without consulting the notes at the end.  This is great for continuity and readability.  Just don't fail to read the \"Notes\" section when you finish.  It serves as a brief refresher to cement the new ideas into your head, and expands on the more complicated concepts.  Whatever happened to the 10-star ratings?  5 stars are not enough!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 17, 2004",
                "Helpfulness": 0.9333333333333333,
                "StarRating": "5",
                "Text": "This book answers questions that I never even knew enough to ask. It broadens the mind and makes physics and the mysteries of the universe accessible, even to me, a nonscientist. I'd never heard about quantum entanglement (distant things influencing each other without anything travelling between them) and the discussion was so thrilling that that chapter alone was worth the price of the book. There is so much here, cosmology, M theory, universes on branes but the author pulls it all together in a totally coherent and entertaining way. Physics is developing rapidly and this book provides a foundation for understanding today's breakthroughs. It's a great read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HO83G1ORV7SK"
                },
                "Date": "on January 17, 2005",
                "Helpfulness": 0.9428571428571428,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PZLKJH19HS8L"
                },
                "Date": "on September 4, 2005",
                "Helpfulness": 0.9375,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 14, 2004",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I thought The Elegant Universe was an excellent book. But without any science background, I must admit that I found it a difficult read. I got alot out of it, but frankly, I kind of skimmed the last third. My experience with The Fabric of the Cosmos has been very different. I just got it a couple of days ago, and I couldn't put it down. I read the whole book, cover to cover and it was *amazing*. I was blown away. The book has a wonderful--and wonderfully unexpected--feel, quite different really from The Elegant Universe. Yes, Brian Greene's trademarks suffuse the text: It is challenging, engaging, compelling, and at times very funny. But this book does far more than open the mind to the stunning insights revealed in recent by physicists. It shows how physics is rewriting the rules of reality and how so much of what we take for granted is, in fact, an illusion borne of misleading qualities of human perception. This book tears down misconception after misconception and reveals a deeper level of reality than I ever imagined existed. This is one of those rare books that provides a life altering experience."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZDPQA6FLY8XM"
                },
                "Date": "on February 14, 2004",
                "Helpfulness": 0.9024390243902439,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UWPMG51SFKAX"
                },
                "Date": "on January 18, 2005",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book made me wish I was a physicist! I'm an economist by training, with no physics background--and now I'm an enthusiast of M-Theory!  I got on this quantum mechanics kick after reading Bill Bryson: \"A History of Nearly Everything.\"  Since then, I've read all of Hawking (horrible writer, not worth the time), biographies of Newton and Einstein, and Green's other great book, The Elegant Universe.  However, this book should be required reading!  His ability to give clear and consistent analogies for incredibly complex concepts is cunning.  I especially liked his repeated, and successful, attempts to explain what is important, and why, and reminding the reader when the eyes start to gloss over.  It's almost as if he knows you've just got lost, and brings you back to where he's trying to take you.  He is also a master at building on successive, complicated concepts, and literally \"threads\" you through the book, one stitch and sentence at a time, with each new idea.  While some of his details on experiments can seem tedious, I respect these attempts as he tries to explain the significance of grounding outlandish concepts in down-to-earth observable experiments and realities.  Take your time reading it.  I understand probably just 40-60% of what he wrote, at best, but I'm still blown away.  Enjoyable for everyone."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PLMMVM7J0128"
                },
                "Date": "on April 28, 2006",
                "Helpfulness": 0.9545454545454546,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KO24JAY3VCZF"
                },
                "Date": "on November 16, 2006",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31K884TAZTUHE"
                },
                "Date": "on June 23, 2004",
                "Helpfulness": 0.90625,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AH4IRHFUFERTZ"
                },
                "Date": "on February 27, 2004",
                "Helpfulness": 0.9,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3T4KN9XO3PIXG"
                },
                "Date": "on January 21, 2005",
                "Helpfulness": 0.9473684210526315,
                "StarRating": "5",
                "Text": "This may be the best written science book I have ever read.  It has all the qualities of good science writing:  it is carefully organized;  it has an implicit model of what the reader will be able to comprehend, and warns the reader when some material is perhaps too difficult, as well as making good use of footnotes; it fairly discusses issues which have not been settled, making clear where the author stands; it is up to date; it has a sense of humor and a lively style.  What makes this book absolutely stand out, is its brilliant use of metaphor and image, both word images and illustrations.  Having said all that, I am not particularly motivated to read other books in the same subject area:  while Greene provides the reader with a real feel for the material, the understanding is necessarily superficial. In fact, I was happier with the latter, more exotic,  part of the book than with the earlier more familiar material about relativity: Greene even got me comfortable with 4 and more dimensions of space.  And it was nice to read, for my sanity, that all forces are implemented via actual movement of particles of force, be it photons or gravitrons (which Greene is certain exist and will be observed as our tools get better, and he is not prone to being dogmatic). One warning: for some reason, Green unaccountably delays mentioning that the probability concept used by quantum physicists does not really track conventional interpretations, wherein probabilities, being non-zero, cannot cancel each other."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAITY5VX3IEC2"
                },
                "Date": "on February 18, 2004",
                "Helpfulness": 0.803921568627451,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IS9FVR9WG5TY"
                },
                "Date": "on March 19, 2007",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZMYFN8JJIYJC"
                },
                "Date": "on November 24, 2005",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35UJ6CR8ESGFD"
                },
                "Date": "on February 23, 2004",
                "Helpfulness": 0.9130434782608695,
                "StarRating": "5",
                "Text": "I was surprised to find a few negative reviews for this book.  There are many deeply sophisticated ideas offered up here and I appreciate Greene taking the time away from his research to offer help for the rest of us who would like to catch a glimpse of his view of the cosmos.  The detailed notes at the end of the book are nearly a second book in themselves and despite having read many other books on these topics there was much freshness in Greenes approach as well as some new angles I had not encountered before.  It would take a severely jaded person to fail to appreciate the wealth of material presented here.  However the reader must be prepared to think carefully and bring some serious mental exertion to the table.  Understanding the cosmos does not come free or easy; the effort is certainly worth it. I was impressed that the author really did draw distinctions between what is solidly known vs where the contemporary uncertainties lie.  Study the footnotes at the end of the book - carefully!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A373ZCB1AYOZC"
                },
                "Date": "on February 23, 2004",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QD4VQQGZDLBP"
                },
                "Date": "on March 3, 2004",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3I5ECGN9DDKAI"
                },
                "Date": "on February 23, 2004",
                "Helpfulness": 0.9411764705882353,
                "StarRating": "5",
                "Text": "This book a radiant gem. It provides an uncompromsing tour through modern physics. It is the best science book I've ever read. Personally, I even liked it a bit more than Elegant Universe because the material strives deeper into the foundations of accepted physics, rather than heading straight for theories that are so far without experimental verification. There is some superficial overlap with Elegant Universe (both books need to lay the foundation of relativity and the quantum) but very different concerns are central to the discussion in this book. Everything Greene discusses here is geared toward shining as bright a light on space and time as one can. Unification (the topic of The Elegant Universe) comes into the late chapters, but not as an end into and of itself, instead, as part of the newest views on space and time. If you are ready to examine the reality you experience and have your preconceptions challenged, you are ready for the adventure this book brings."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 6, 2004",
                "Helpfulness": 0.9375,
                "StarRating": "5",
                "Text": "As an artist and a math-phobe, I stay away from all things science. After hearing this articulate, plain-speaking author on Leonard Lopate's radio show, I decided to break my patterns and give science a try. I am stunned myself, but I actually just finished Fabric of the Cosmos. I can't say I've mastered every last word but I think I got the essentials. At times I had to put the book down because, in teenage lingo, it was blowing my mind. The last week with this book has shaken me up and opened my eyes. I recommend it to artists and scientists a like. Immerse yourself in the strange world that is our universe."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AT97QO0UWWXIK"
                },
                "Date": "on March 24, 2005",
                "Helpfulness": 0.9333333333333333,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36CLO3FZQ91D6"
                },
                "Date": "on March 11, 2004",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "The Fabric of the Cosmos creates a great debate-how can we live in a world that seems real to us that does not reflect the true nature of reality. We take time for granted as some kind of matrix that life just systematically unfolds in, but why? I am not a scientist interested in the equations behind these discoveries, but a avid fan of science and the inspiration to be found in scientific inquiry. For a amature like me, Fabric of the Cosmos delivers information, ideas and inspiration in abundance."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABN5K7K1TM1QA"
                },
                "Date": "on October 16, 2004",
                "Helpfulness": 0.8695652173913043,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CWIYIETNBAK3"
                },
                "Date": "on November 29, 2005",
                "Helpfulness": 0.9285714285714286,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TCU1FGUVH0ZS"
                },
                "Date": "on March 22, 2004",
                "Helpfulness": 0.8888888888888888,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 20, 2004",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "After having read Brian Greene's \"Elegant Universe\", I found his \"Fabric of the Cosmos\" book quite a bit easier reading, since I am a lay person who has been interested in the subject for many years.  His discussions of a \"probability wave\" gives thought to how our \"free will\" might possibly function.  I will surely look at the world around us with an ever-increasing awe for the mysteries contained within.  Great book!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3S9Q3S8CEP9I1"
                },
                "Date": "on December 9, 2005",
                "Helpfulness": 0.9285714285714286,
                "StarRating": "5",
                "Text": "If you're curious about the universe, if you don't really understand relativity theory or you think you do but you are unable to explain it to your kids or to your friends without being stuck on their first question, if you've always wanted to know about quantum theory and string theory but you thought you needed a PhD on the subject, if maths is not your strong, if you've read Stephen Hawking's \"The Universe in a Nutshell\" and wandered what the hell was he talking about, then this book will be the best thing that ever happen to you."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1F6OPXM5LDZ4M"
                },
                "Date": "on May 19, 2005",
                "Helpfulness": 0.9230769230769231,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AN2WCDXNBRQC8"
                },
                "Date": "on November 16, 2004",
                "Helpfulness": 0.8823529411764706,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A366EWY7SM4ZL"
                },
                "Date": "on May 29, 2005",
                "Helpfulness": 0.9166666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JF92TFJYGMDV"
                },
                "Date": "on September 29, 2004",
                "Helpfulness": 0.875,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AD0J5KK4WQXNS"
                },
                "Date": "on May 9, 2008",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MJMYLRTZ76ZX"
                },
                "Date": "on April 14, 2004",
                "Helpfulness": 0.8260869565217391,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NC338IF5OOUS"
                },
                "Date": "on April 6, 2006",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36CLO3FZQ91D6"
                },
                "Date": "on March 21, 2004",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Any rascal who attempts to delve into the world of pure mathematics, turn and expound on the discoveries found to the likes of me -- and succeed in me \"getting it\" deserves his accolades. Brian Greene does a remarkable thing in both The Elegant Universe and The Fabric of the Cosmos -- he manages to engage his reader with discovery and inquiry that teases us into our own imaginings. Of course there are similarities -- only so far as too remind us where we were and where we are -- but treat yourself. Read past the first two chapters. Theories built on years with a piece of chalk and a blackboard that expand our understanding of the nature of reality? This guy is gold!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 17, 2004",
                "Helpfulness": 0.9090909090909091,
                "StarRating": "5",
                "Text": "I am a retired physics prof. From the old school some would say. I don't like most popular physics books. They often skirt around the hard stuff to make physics understandable to more readers. But, finally, this book has the courage to take on the hard, difficult, but profoundly important questions associated with discoveries over the last century. I don't always agree with the authors perspective, but I respect his willingness to \"sweat the big stuff\". Bravo. I will likely read it again."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12A08OL0TZY0W"
                },
                "Date": "on April 22, 2005",
                "Helpfulness": 0.9,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on April 24, 2005",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23US54A0OILE4"
                },
                "Date": "on March 16, 2004",
                "Helpfulness": 0.9,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BB2L04IA08YK"
                },
                "Date": "on January 26, 2006",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RJD10TTI568L"
                },
                "Date": "on October 30, 2005",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RJD10TTI568L"
                },
                "Date": "on October 30, 2005",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DBCDR8RY69NB"
                },
                "Date": "on August 23, 2005",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "I haven't made it all the way through but it is a good book for those who do not know much about how our universe truly works. For reading that is little more advanced but just as easy to read I highly suggest Brain Greenes other book \"The Elegant Universe\". I would say it contains more interesting information and insight."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NUM3JIE6II0F"
                },
                "Date": "on March 30, 2006",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YDSOPEERSP9L"
                },
                "Date": "on March 6, 2004",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADFVAEKXTEDP"
                },
                "Date": "on June 18, 2005",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29MZ1F7A4KUGS"
                },
                "Date": "on September 11, 2005",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AALV9O83JPNAJ"
                },
                "Date": "on November 1, 2006",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 17, 2004",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "If I could give this book 6 stars I would. The concepts are heavy but the writing has just the right touch. You can read on many levels (the author tells you when you can skip harder sections, and summarizes so you can get on with the reading), depending on how much detail you'd like to take in. If I read this book as a kid, I think I would have gone into physics. Reading this book is the next best thing to being in on the discoveries. My praise and thanks to Mr. Green."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AD3ELYBZW8LHW"
                },
                "Date": "on July 11, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A180EH6RZ1QT3P"
                },
                "Date": "on December 14, 2006",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A279GMN4CIX1TG"
                },
                "Date": "on February 26, 2006",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YF4ZMECJVLK9"
                },
                "Date": "on December 31, 2004",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 19, 2004",
                "Helpfulness": 0.8125,
                "StarRating": "5",
                "Text": "A deep, incisive look at the universe according to modern physics. The material is mind stretching, the ideas tough to grasp, but the journey this book takes you on is worth the effort. Hugely worth the effort. With this author's masterful handholding, his constant attention to making the material as accessible as it possibly can be, you can go far from conventional ideas of how the universe works. Where was Mr. Greene when I was a student?? This is how science should be taught. With artful analogies and great little stories, you learn so much from this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1N2M571EOA46Q"
                },
                "Date": "on August 22, 2005",
                "Helpfulness": 0.8125,
                "StarRating": "3",
                "Text": "For some reason this book contains dialog between fictional television characters.  Complex concepts are explained as if they were an episode of the Simpson's.  I don't think most people who read this type of book care to have physics related to television.  Green repeats himself and treats the reader as if they are mentally handicapped.  I enjoyed the book because I love the topic; however, I found it necessary to skip a few sections."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IC683USUWHJR"
                },
                "Date": "on June 19, 2005",
                "Helpfulness": 0.8,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19PV9ALHA9S1N"
                },
                "Date": "on March 6, 2004",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is a deep and thoughtful look at reality through the eyes of one of the new generation of leading physicists. I thank Professor Greene for taking valuable time away from his research to bring the latest advances to the masses. It takes a special talent to take a mathematical subject and de-mathematize it and Greene's talents here are without equal. With more books like this the world would be a different place."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LTTEF4XZXJ4E"
                },
                "Date": "on April 2, 2005",
                "Helpfulness": 0.875,
                "StarRating": "5",
                "Text": "I found this book impossible to put down.  It is even  better than his previous book The Elegant Universe.  The Fabric of the Cosmos  is well written, the ideas are clearly explained and it gives an excellent summary of Cosmology's  theories up to date.  It describes how physicists work and develop one idea after another in their search for a final explanation.  Apparently, the more scientists try to understand reality, the harder it gets.  Greeene shows the various attempts to understand modern String Theories as they try to connect Einstein's General  Relativity and quantum field theories.  Greene describes how these theories try to explain the origin and evolution of the universe and the tremendous mathematical and conceptual challenges scientists face today.  It seems clear that  Twenty First Century Physics will require the cooperation of many Einsteins exchanging ideas and working together trying  different approaches.  To me the FAbric of the Cosmos also suggests that that in the absence of experimental data, physicists have to refrain from talking like Theologians who instead of the Bible use mathematical symbolism."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KJO5VP4K3CHU"
                },
                "Date": "on December 31, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1D9Z20TCUH6ZX"
                },
                "Date": "on February 9, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2B21POKQ3N09H"
                },
                "Date": "on May 28, 2004",
                "Helpfulness": 0.7727272727272727,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHEW91ZUQDSKR"
                },
                "Date": "on September 18, 2005",
                "Helpfulness": 0.8181818181818182,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VVKAIS45TOWF"
                },
                "Date": "on April 15, 2005",
                "Helpfulness": 0.8181818181818182,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A95G23AR2GDXD"
                },
                "Date": "on July 4, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DIQDO2TBNLKG"
                },
                "Date": "on January 17, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PJDV044CLYCY"
                },
                "Date": "on March 19, 2006",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QP7CTPSORASZ"
                },
                "Date": "on May 8, 2005",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SUK7XF5ROPCB"
                },
                "Date": "on January 28, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book is a hurricane of fresh air, putting previous general-audience books about physics to shame.  It covers an enormous range of topics, and takes you deeper into each area than you thought you could go, carefully holding your hand the entire way.  Having previously read similar works by Stephen Hawking, Richard Feynman, etc., etc., I thought this would be mostly a review for me; what a joy to find everything I thought I knew greatly expanded, re-examined, explained in greater detail and illuminated philosophically, all with a breezy, humorous writing style.  For a rollicking tour of the most mind-blowing issues in modern physics, this is the single book to read.  Unequalled."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEXDKZ8ILSWSX"
                },
                "Date": "on January 7, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I know so very little about the subject Brian describes but I DO want to learn as much as I can. I could not follow into the book very far because I do not have that kind of a back ground and I am 82 years old. HOWEVER I got through enough chapters that I was able to retain more than I knew before. He is a wonderful writer and he did a good job of putting it into \"people \" words."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NOZB6VZCTOI4"
                },
                "Date": "on November 15, 2008",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SJECY32I75WQ"
                },
                "Date": "on September 30, 2007",
                "Helpfulness": 0.8,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31KUJYNTPZNPK"
                },
                "Date": "on May 7, 2004",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FSR4DIOUKJFW"
                },
                "Date": "on February 18, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADK7VC7CROJVC"
                },
                "Date": "on February 7, 2008",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "I am a biologist and don't ordinarily read a lot of physics. But this one somehow got my attention and I bought it, learning later that this author wrote a highly acclaimed previous book \"The Elegant Universe\". Perhaps I'll read that at some point. However, this one was very good, engrossing in fact. I don't know much about relativity or quantum theory, but this book went a long way to making things clearer for me. Even the explanation of string theory made some sense. Only when we get to the discussion of branes did things start to break down, but I don't know whether that was due to my lack of attention or to the author's failure to communicate branes as well as strings. Anyway, this book is 493 pages of text, not counting the extensive notes, glossary, and index, and will take some effort to get thru."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATN1SSKTJD8Z8"
                },
                "Date": "on June 2, 2006",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 29, 2004",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4Q65S8MUUMY5"
                },
                "Date": "on May 14, 2004",
                "Helpfulness": 0.7777777777777778,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYBJ83T02TM7N"
                },
                "Date": "on January 3, 2005",
                "Helpfulness": 0.7777777777777778,
                "StarRating": "5",
                "Text": "It has been over 20 years since my college physics class.  The world of physicists have not stopped discovering and Greene makes a reasonable effort to explain these advances in non-mathematic terminology.  His style is quite readable, though at times trite.  Certainly, the many references to the Simpsons, Star Trek and X-Files confirm his status as a geek.  I found his review of physics (from Newton to Einstein) valuable.  I admit that his explanation of multidimensional m-theory looses me at a certain point, but I assume that some of these ideas are best experienced as mathematic entities.  It is hard to visualize 10 dimensions!  I don't know of any contemporary physicist who has come close to explaining cosmology in such an accessible manner.  E.g., Greene makes Sagan look infantile in his accomplishments.  I would recommend this book to anyone with a college level background- it will be to abstract for most others.  PhDs in physics will be better served reading the original scientific literature.  I thought this book was better than his first book, since it dealt with a broader subject.  Finally, while I have no idea if Greene is really an important scientist in his field, he is certainly an accomplished communicator and writer and his students are undoubtedly lucky to have him."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 17, 2004",
                "Helpfulness": 0.75,
                "StarRating": "4",
                "Text": "I guess the reader from Washington DC just proved the recent pronouncment that Amazon reviewers are often masked competitors trying to demean their targets. To call Greene, a distinguished scientist-teacher, a pseudo physicist is ludicrous. This comment in toto is a sophomoric attempt to show off. No wonder it has been found to be decidedly non-helpful. When Greene makes the cutting edge of the almost inconceivable open to laymen who care to understand without having spent their lives in the active pursuit of the sciences he does us all a very great service. I must wonder if the commentator isn't a failed PhD student"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2I6ZD9YOME07Q"
                },
                "Date": "on June 2, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANPMUNW501V4Q"
                },
                "Date": "on June 11, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BT7PRPVH8HBI"
                },
                "Date": "on July 29, 2006",
                "Helpfulness": 0.7368421052631579,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30AYAVE8CCHNJ"
                },
                "Date": "on June 1, 2005",
                "Helpfulness": 0.7777777777777778,
                "StarRating": "5",
                "Text": "Brian Greene, with this book, has become one of my preferred scientific authors. His descriptive method is not only clear and concise, but also leads to train our minds to understand the complexity of quantum mechanics with real world examples. I have read several other books related to this matter and I wish my start-up book would have been this one. In short, I conclude and suggest that this is a must read book even for non starters as it chronologically assembles the concepts that need to be well understood to learn the scientific reality."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Y1AU2VTU0EAG"
                },
                "Date": "on July 6, 2004",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALLEO1LMVM1BO"
                },
                "Date": "on November 4, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I read with relish Greene's earlier work, The Elegant Universe, and had the experience of learning something new in almost every sentence. The Fabric of the Cosmos lived up to the precedent set in its predecessor. Rather than merely repeat information in The Elegant Universe, it deepened my understanding of the topics covered in the previous work. I absolutely love this book and consider the method of presentation to be the perfect balance between scholarly and accessible. That is, Greene does an excellent job of presenting a pretty arcane topic in language accessible to the public. I've never taken a physics course in my life and was able to understand the concepts presented because of his own insight as well as his creativity in fashioning analogies. I recommend this book to any lay person who wants a better understanding of what goes on in the universe at the quantum level."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14J919YUOJ2YH"
                },
                "Date": "on May 17, 2005",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Greene tells us the story of modern Cosmology and the Physics supporting it in an almost non-technical manner.  Using a fun loving style and upbeat tone, Greene employs popular iconic characters from classic Americana to teach.  Mulder and Scully, Bart and Lisa, Homer and Marge have never worked together so well. For those, who like me are Physics and Mathematically ignorant, this book will indeed be a fun and educating read.  I found chapter four, dealing with the phenomona of Quantum Entanglement and the Non-Local nature of Quantum theory, especially enlightening.  Greene's description of Inflationary Expansion in the Big Bang model of the beginning of the Universe was clear even to me. I look forward to reading Greene's other book \"The Elegant Universe\" to learn even more about Super-string and M-Theory.  This book is worth reading."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A167YN5KNE3A2H"
                },
                "Date": "on March 25, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JBKE8MZXCAJ5"
                },
                "Date": "on December 13, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5M3MLF0FSWZV"
                },
                "Date": "on May 31, 2007",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATN3TR89D3QCR"
                },
                "Date": "on April 28, 2004",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "The Fabric of the Cosmos is a thought provoking and rewarding book on a complex subject. The observer who considers the phenomena in different reference frames troubles me in the current understanding of the universe.  The fabric of the reference frame and the origin of the observer are uncertain. The appearance of life and thinking creatures is mysterious. It is very likely that the observer complicates the picture of reality as he develops it in his mind. You will find observer independent, based only on the discovered properties of existence, qualitatively new texture of reality that also includes the phenomenon of consciousness in the book Theory of Interaction the Simplest Explanation of Everything by Eugene Savov."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1K6AA9Q9XF77P"
                },
                "Date": "on December 4, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "There are some very glowing reviews for this work, but I would add a caveat: this work is dense, despite its playful examples. Anyone looking for 'Quantum Physics for Dummies' will be ill-served by this work, which retains a high register of intellectual and theoretic discourse. Greene is generally quite dry, except where he brings examples into the context of \"The Simpsons.\" This book is comprehensive, detailing the history and theory of quantum mechanics, string theory, etc. There is a detailed section on time travel near the end, which was a great way to end the work. Several key insights (like the discover of the Higgs boson) have made the work slightly outdated. Overall, it's solid!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JH315XUPKAC0"
                },
                "Date": "on February 13, 2004",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": "I continually felt a sense of awe throughout this book, and new direction which is definitely realistic. Space and time have been hashed out over and over by leading writers and scientists for decades but nothing reads like Brian Greene and no one expands and advances as much. This is a step forward and I only wished Brian will get the attention Carl Sagan had to bring the world a wonderful and helpful awareness as this goes seriously beyond Sagan. This is surely Needed forward thinking with applied advancing thought for anyone reading. Much new material is discussed that I havnt encountered anywhere else, discussions that details superstings, other theories, and many good illistrations which aid the reader. The book is not overly complicated and will not leave the novice waivering, a Junior High School student can get seriously and easily engrossed in The Fabric of the Cosmos. I do seriously recommend prereading a fine book on the cosmos fabric, big bang, and time direction which will aid in understanding this, SB 1 or God by Maddox."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1REULGYFIPAGG"
                },
                "Date": "on July 22, 2006",
                "Helpfulness": 0.75,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17RG4CS9EYYUS"
                },
                "Date": "on January 16, 2006",
                "Helpfulness": 0.8,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Z3IXZ17E88J4"
                },
                "Date": "on July 12, 2004",
                "Helpfulness": 0.7272727272727273,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HG2B42DNN70D"
                },
                "Date": "on September 2, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AFDB56B30UY4"
                },
                "Date": "on March 16, 2006",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "The book gives the reader a brief history of the surviving theories of physics, their contributions, and the extent of their applicability in the light of todays latest findings. It also explains to the non-scientific reader, in an exciting and easy-to-follow manner, the latest achievements in quantum mechanics, string and branes theories and the possibility of their success in explaining the mysteries of the univese we live in. An excellent book!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30E1NNKCPPZPQ"
                },
                "Date": "on June 2, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I bought this book when it had just barely came out and I couldn't put it down. Greene delves into areas of physics that will fascinate even the novice reader. I also listened to the CD version. The only drawback in either is that the narrator's style on the CD can be monotonous and his pronunciation errant. Nevertheless this is a book that is well worth the read for anyone hoping to better understand our elegant universe!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VCHWAXJBEYBN"
                },
                "Date": "on February 20, 2006",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": "Brian Greene builds a navigable bridge between Newton's classical physics, Einsteinian relativity, & quantum mechanics. The book steers clear of the often needed mathematics allowing the lay reader to understand the problems inherent in three theories explaining one set of natural laws. Greene then introduces his readers to String Theory & other Grand Unified Theories with clear reasoning that overrides the apparent mutual exclusivity of current competing beliefs. Greene earns all 5 stars on this one......"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FNVJVHP9RROC"
                },
                "Date": "on February 21, 2005",
                "Helpfulness": 0.7272727272727273,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1872LVC70AANV"
                },
                "Date": "on November 23, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Anyone who has completed advanced level courses in physics in high school and with a penchant for physics, will find this book a great read. This book clearly and in simple terms explains some very complicated theories and discoveries in modern day physics. Overall, a strong recommendation to read this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OJW07GQRNJUT"
                },
                "Date": "on May 7, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DVH7OO1C6VUC"
                },
                "Date": "on May 8, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FTYJ9TTN7ZEV"
                },
                "Date": "on October 30, 2012",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3T2VTT72C0KLA"
                },
                "Date": "on July 16, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UTKYA2U8542F"
                },
                "Date": "on March 8, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQZD37NXALOZK"
                },
                "Date": "on August 29, 2011",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JVEZEL9C2DM5"
                },
                "Date": "on April 8, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AE2RDPOYEGCG1"
                },
                "Date": "on December 30, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "For anyone briefly versed in physics or quantum mechanics, this is a fantastic book. The theories that are presented to the reader, and the well worded format they are offered in, make for a fascinating look at our universe, our world, and the very core of our existence."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YJLGQC9A6VKF"
                },
                "Date": "on August 16, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I have read all three: Elegant Universe, Fabric of Cosmos and Hidden Realities. This one is definitely the best. I might not bother with Elegant Universe, its the weakest of the three and Cosmos covers all the same material but is more up to date and better written."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JVEZEL9C2DM5"
                },
                "Date": "on April 8, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VMS3W84PZY2S"
                },
                "Date": "on May 6, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "It will blow your mind but... in a good and healthy way. First of all, I love Brian Greene's work at Columbia University. I first fell in love with his \"Elegant Universe\" (2000) where he so eloquently discusses 'String theory,' a large piece of quantum physics theory, and now his \"Fabric of The Cosmos\" (2005), followed up with a recent special on Nova (2011) under the same name. The great things about Prof. Brian Greene is that he doesn't hold back. The amazing things here is that he blows your mind with sheer possibilities in how the universe - multiverse theory works. In light of this, there's a great new book out called \"Seven At The Sevens\" (2012) that plays on this multiverse theory and with the clever use of fiction, has the ghost of Walt Whitman coming back as \"The Good Gray Ghost\" to assist a group of writers in Boston. It's awesome. Both books are awesome. In fact, there are lines in Whitman's \"Song of Myself\" (Leaves of Grass, 1855) that are more than quantum physics like and are eerily similar to Greene's quantum physics theory in that all of us, including Whitman could be in more than one universe simultaneously. Perhaps... in hundreds of thousands simultaneously. And, the degree or distance that separates us could be very small. And, Yes... this could also mean that Walt Whitman is both dead and alive at the same time but distributed in many many universes hence the multverse theory."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A330FTZTW57U32"
                },
                "Date": "on February 24, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11JMMUU3WH034"
                },
                "Date": "on April 13, 2011",
                "Helpfulness": 0.75,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28N2AWOVO2PB"
                },
                "Date": "on March 20, 2006",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMELQSDRBQX50"
                },
                "Date": "on February 8, 2006",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1R4VHGGF1H23Y"
                },
                "Date": "on August 3, 2006",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IU9VPCBKZPE8"
                },
                "Date": "on April 28, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OJG3G6INH68U"
                },
                "Date": "on April 21, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFXWF92BX9Y4U"
                },
                "Date": "on January 6, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XKU36LHSX6FB"
                },
                "Date": "on December 29, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "My introduction to physics before reading this book was a few high school physics classes, two introductory classical physics classes in college, and many readings of \"A Brief History of Time\" and \"The Universe in a Nutshell\" by Stephen Hawking. He touches briefly on string theory and M-theory but I found his explanations a little harder to digest than Brian Greene's. This book explains in sufficient detail the concepts behind String Theory, Quantum Mechanics, and M-theory and the implications they have on our concept of reality, space, and time. I have not read \"The Elegant Universe\" yet but I do plan on picking it up and reading through it because of the way the author conveys the complex and hard to understand ideas. It's impossible to fully comprehend a 11-dimensional reality, especially since our brains have only evolved to understand 3 space and 1 time dimension but I think his explanation has gotten me the closest to full comprehension as possible. I look forward to reading more of his books."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QF1GUK9PYT0V"
                },
                "Date": "on March 9, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SSHW3ZOP8T25"
                },
                "Date": "on August 1, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GVK5RGCZY632"
                },
                "Date": "on August 23, 2005",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3A8PC10JJIDAR"
                },
                "Date": "on August 8, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3K0W8B1JGXGHG"
                },
                "Date": "on May 23, 2012",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZPSJQ8FC5V7M"
                },
                "Date": "on June 24, 2009",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGYGIPFPKDAEB"
                },
                "Date": "on March 1, 2004",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A317R06LEDLXAQ"
                },
                "Date": "on April 25, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BM5NTLX7CES1"
                },
                "Date": "on December 26, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMENIUURQJT2C"
                },
                "Date": "on March 18, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "First and foremost this book has given me the best understanding of string theory that I have had.  I also clarified my grasp of Einstein's relativity - especially the concept that one's moving at near light-speed will slow time.  I don't get along with math above the algebra level, so this all-verbal approach to explaining current theoretical physics is critical for me.  Toward the end, he spends some time theorizing about time-travel and worm-holes which I consider science-fantasy, but following that there is a final analysis of some additional aspects of string theory that I found informative.  There is a good chance that I will not live to see a final determination on the applicability of string theory to the fabric of the universe, so I appreciate any opportunity to get a better grasp on it while I can."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NATT3PN24QWY"
                },
                "Date": "on January 23, 2006",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "We highly recommend this excellent introduction to theoretical physics, which is accessible to any determined reader, even those with no mathematical and little scientific background. Pulitzer Prize-winning author Brian Greene is scrupulous about clarity, and has a gift for metaphor that makes it possible for him to discuss even the most abstruse, esoteric physics with skill, clarity and wit. Readers will discover baffling wonders that flatly contradict ordinary quotidian experience, and will come to realize that what they perceive as real is anything but real. Moreover, they will learn that physicists seem to have a great deal more success at demonstrating what is not real than at discovering what is. The most commonplace things - the difference between yesterday and tomorrow, between here and there - continue to baffle the greatest minds in science. Now you can begin to understand why."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VP7JOT3K7PFM"
                },
                "Date": "on December 3, 2004",
                "Helpfulness": 0.6875,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SSGWK75R20I3"
                },
                "Date": "on June 4, 2006",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIG3KMYSPNFX4"
                },
                "Date": "on May 31, 2004",
                "Helpfulness": 0.7,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2C5990997ABJE"
                },
                "Date": "on January 4, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "The cover of Roger Penrose's The Road To Reality looks alot like this book by Brian Greene, viz. The Fabric of The Cosmos.  I was invited to write a review of Penrose's book, but I have not yet finished reading it.  Besides, I was excited at the prospect of adding my two cents to the stack of opinions about Greene's book, and all I have to say about it is that it is the book I would have loved to have written. The Elegant Universe was pretty good, but The Fabric of The Cosmos is superlative.  It is extremely informative and very entertaining.  It is a masterpiece."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DQ87UKOZ9QCG"
                },
                "Date": "on September 11, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "I'm a no fill, frills kind of guy.  I like to get right to the point without all the blah blah that seems to just add legnth to a book.  I anjoy Lawrence Krauss because that's how he writes.  Brian Greene is colorful and adds a lot of unnessesary filler information that you don't need.  You might like it, I don't.  I love the subject, and Brian is a fantastic author, but for people like me that just want to get to the point, this might not be your best bet."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11G33PSOAAZYL"
                },
                "Date": "on April 18, 2005",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "5",
                "Text": "I have just finished reading The Fabric Of The Cosmos and found it most astonishing in the way is challenges the mind of a non-scientist like myself. Greene somehow manages to explain complicated mathmatical formulas in non mathmatical terms, and I would recomend this book to anyone who interested space-time and the universe we all live in. The only flaw in the writing is that Greene sometimes uses silly names for hypothetical characters (for example Itchy and Scratchy) that do jar the eye. But that is a minor flaw in a major science book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AT8ETAIC7SCGH"
                },
                "Date": "on November 20, 2005",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "I'm baffled by the folks who gave this book anything less than 4+ stars.  It's a superb book for the 99.99999% of the \"rest of us\" who didn't receive A's in every physics and math course we ever took.  If you have a degree in physics, DON'T READ THIS BOOK.  If you're a lowly software engineer like me, you'll find this book extremely entertaining and fascinating.  It's fabulous how Brian Greene brings you through the history of spacetime.  He is THE teacher you always wish you had had."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1A4LT6JTLM8V2"
                },
                "Date": "on January 10, 2007",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "Quality contemporary physics presented in small, sequential steps with amusing analogies and a hefty dose of humility make this an engaging read.  Greene is one of those rare scientist (or 21st Century \"specialists\") who admits that 1) today's wisdom may be tomorrows foolishness, and 2) there are other, equally adept physicists who disagree with his particular pet theories.  That sort of intellectual honesty carries a lot of currency with me."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZOW85UZ8HB3A"
                },
                "Date": "on October 10, 2009",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "With 5 hundred and thirty some pages of text, Greene certainly has a lot to say.  Fortunately, most of it is very good - as others has said!  Not as much on the Zero Point Field and applications as I had hoped but stayed relatively pretty free of New Age conversations.  My only reason for 4 stars is not content but the size of the print, especially the notes.  Use good light or glasses.  Thumbs up."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3M8SJGUSUK2S0"
                },
                "Date": "on May 14, 2012",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "When I first got this book I thought it was just going to be more of the same information from his first book, just worded differently.  I was completely happy after finding out that it was completely new information.  A deep exploration about time and the strangeness of the quantum world.  I would highly recommend this book to anyone who is interested in physics and the way the universe works."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QUDS5POFHNTS"
                },
                "Date": "on January 12, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "If you have a reasonable background in, and passion for, physics this book will bring you right up to the newest discoveries, mathematical and experimental proofs of today. Not only does the author know his physics, but he is an excellent writer. There is no settled science and each step forward brings both answers and new questions to be solved by a new generation of physicists."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOIKJMPZ8TDS5"
                },
                "Date": "on January 5, 2006",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "You do not need to be a scientist or a mathematician to read and enjoy this book. Brian Greene has an uncanny knack for finding just the right metaphors to help you understand the most advanced theories we have for explaining our universe. This was a pure joy to read, and will gave you many \"wow\" moments that will change how you see and experience the world around you. Highly recommended for anyone."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AV4OKXO1DG0C6"
                },
                "Date": "on January 15, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Because it permits the average person to contemplate the essence of the Cosmos without having to have a doctorate in physics and mathematics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NWEB098CQP75"
                },
                "Date": "on February 17, 2012",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "I've read all of Brian Green's books. One thing I found, however, & I'm sure this is just me, is that I needed to read them twice to really understand his books. It was well worth it. His explanations are wonderful when he is talking about the evolution of the universe.Also, he doesn't talk down to the lay-reader who doesn't have a physics degree."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LJT9KF7HGVRU"
                },
                "Date": "on October 13, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Yet another great work by Brian Greene.  His ability to make complex concepts, on the forefront of modern science, accessible to non-physicists impresses again.  If you are interested in understanding some of the research that is being done in string theory and the search for the Grand Unified Theory, I recommend you pick this book up!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BUYENEJOALWY"
                },
                "Date": "on January 2, 2006",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A198CYUVUFH1AS"
                },
                "Date": "on October 25, 2005",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "5",
                "Text": "If you want one book that spans most of current leading edge thinking in physics and cosmology written in an elegant and accessible style this is it. The other thing I liked about this book is the parallels with eastern mysticism and the concept of the limitations our sensory experiences may im pose on our capacity to understand the world around us."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 13, 2004",
                "Helpfulness": 0.7,
                "StarRating": "5",
                "Text": "This is an extremely well thought out and well written book written by one of the world's leading physicists. \"The Fabric of the Cosmos\" presents the information in such a way that anyone could read and comprehend. I read Brian Greene's last book, \"The Elegant Universe,\" and this is certainly a good follow-up."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3U7D3ZVTNRTCT"
                },
                "Date": "on June 12, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I already had a fair idea of most of the concepts in this book but this book made everything much clearer. Relatively speaking that is.  The concepts in this book are amazingly complex but Brian presents them in a way that makes them accessible to \"ordinary folk\" like myself."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZUO6GXIPB3OL"
                },
                "Date": "on August 15, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I found this book to be excellent.  The author really understands how to take a complex subject like this and not make it read like a tedious textbook,  also without dumbing it down to the point you feel like a 2 year old..  excellent read.  Fascinating.  Highly reccomend"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KKT1VTGF5NL5"
                },
                "Date": "on March 11, 2015",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": "Judging by the reviews i'm seeing it's clear i'm in the majority here but i really thought Brian Greene's Fabric of the Cosmos was a bit underwhelming to say the least. It's not that the material isn't interesting, because it definitely is and it really gets you thinking, but i wasn't nearly impressed as i thought i would be. I get that this book is meant to appeal to a broader audience but even then i think it makes the material much more difficult and complicated than it has to be, and that's ironic given how much the book tries to baby you with borderline irrelevant examples and an overdose of explanations. From the superfluity and redundancy to the lack of clarity he seems to have a great deal of trouble getting his point across. I understand this isn't exactly trivial stuff but i honestly think he could've gotten all his points across in a book 1/4 the size. I think it's much more impressive to see someone explain a concept in the simplest way possible, than it is to write a whole novel on something explained in a couple pages. I also think Greene assumes a bit too much in this book. We don't know the true nature of reality, anyone that says we do is lying. I get that most of what he's saying is backed by popular scientific belief but he doesn't have to speak as if nothing is up to interpretation or scrutiny. I'd be much happier if he simply told us about the results of various experiment, rather than what they imply without knowing the complete picture yet. We're allowed to have our own opinions on things because until we've figured out reality, no one is dead wrong and no one is dead right. Those smart enough will probably be able to think for themselves anyway but i'm a bit disappointed at how confidently he tells a story to vulnerable minds, that he himself must surely be able to admit might not be true. It's not all bad, he brings up many interesting things, there's some parts though that are just very inconcise and possibly misleading."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A329GF6BX7EZYJ"
                },
                "Date": "on December 22, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1R7K1ORMCOIRD"
                },
                "Date": "on July 11, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AA25V8QOWGQO3"
                },
                "Date": "on June 17, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A157THZ4A9SUPF"
                },
                "Date": "on December 23, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KL132JMW31IU"
                },
                "Date": "on November 16, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The recent discovery of what may be the Higgs boson made me aware again of how little I understand about the universe. Or even about the questions now being posed by cosmologists. Greene makes it all about as clear as it can possibly be to someone -- like me -- who can't follow the math. For those who can follow it, he offers many of the necessary equations in the endnotes, which also include numerous references for further reading. To substitute for the math, Greene uses metaphors, generally pretty silly ones -- Bart Simpson on a supersonic skateboard, for example -- that at least give us an idea of, for example, what Einstein meant about space-time in the general theory of relativity. And then beyond Einstein, to quantum mechanics, and why the world and the whole universe appear to us in only three space dimensions (forward and back, side to side, up and down) and one time dimension, when quantum theory, confirmed experimentally, demonstrates that there must be ten space dimensions (but still only one time dimension). Is our universe really a kind of hologram projected by forces outside it, that is, beyond the universe we are capable of perceiving directly? Could be; Greene considers that hypothesis as at least plausible. And how did it all, everything, begin? Or did it? Was the Big Bang, the initial expansion of matter and energy that set everything in motion, just a new configuration of energy that is always, and that therefore may have been dispersed in some other entropic system(s), and may again -- if our universe ever reaches the limit of its continuing expansion -- shrink to extreme density, preparatory to a new explosion (\"Big Bang\") some billions of years hence? It took me weeks to get through this book, not because it was unclear, but because the news about the universe seemed so strange, so oddly contrary to our ordinary experience, that I had to keep checking back to re-understand parts of earlier chapters necessary for following the later ones. I remain amazed, and inspired with new speculations about philosophy and existence and what we do and cannot know. Guess it's time for me to learn some math."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFVROUVTT63XM"
                },
                "Date": "on November 15, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUEY946M1L939"
                },
                "Date": "on July 31, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ENIQZX6VJYUM"
                },
                "Date": "on July 16, 2006",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A277P59FPQSCBI"
                },
                "Date": "on December 22, 2010",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "4",
                "Text": "He's great, and it a fun book to read. But too often he's so close to the material he gives you know sense at all of what it means. For instance, another universe, a 3-brane, just a millimeter from ours! Great -- why a millimeter, why not a foot? What does that kind of closeness mean? Suppose it was farther? And what does a parallel universe mean anyway? Another universe the same size, or shape, or with similar laws, or what? And how could it be that close w/o its matter somehow interacting with ours? This is just one example of him introducing something really fascinating, and talking *around* it in depth w/o every telling you what it means or how to think about it, or what it means to our conception of the universe/existence. He also has a disturbing habit of talking about the most arcane subjects an then zooming out to use a horrifically simplistic analogy which he never returns to, something like talking extensively about the most confounding aspects of gravity and gravity waves/particles and then suddenly summing it all up with \"it's as if this universe was a stretched piece of 3-dimensional fabric that stretches with gravity.\" Okay, but does that metaphor have any other implications? What does it mean that it's a fabric? In a sense, I wish Hawking had written this, because he really seems invested in explaining how these breakthroughs influence how we understand the human condition being situated in this particular reality.  That having been said, he packs a lot in, and I'm buying his other book because he's one of the better writers on this stuff out there. Beware, but enjoy!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GZTFVDANOAFW"
                },
                "Date": "on May 7, 2004",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FNX4FJQ902CH"
                },
                "Date": "on February 17, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BU8YHNRPE3DD"
                },
                "Date": "on March 6, 2004",
                "Helpfulness": 0.6875,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BOPYISHU0KUL"
                },
                "Date": "on June 10, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I've read what others have said about this book - the good and the bad. If you're not an expert in the field and want to know what is happening and the field with succinct explanations, this is the book for you."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AX7YMP2W6R7XP"
                },
                "Date": "on April 14, 2009",
                "Helpfulness": 0.75,
                "StarRating": "5",
                "Text": "I don't know what to add that hasn't already been said!I own both his books and this isn't a rehash.I break this one out every few months to reread because it's that good!Buy it now!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3T80WH5ZSTFS1"
                },
                "Date": "on September 21, 2004",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "4",
                "Text": "The content of this book is undoubtedly of the very highest value.  It gives a detailed, although totally non-mathematical, account of the great, stunning successes of modern cosmology.  It gives a clear and sensible lay introduction to string theory, and it does so in a reliably correct way.  If we read for the content, then, this book is of first importance.  I consider it compulsory reading.  On the down side, the craftsmanship of the writing itself seems less appealing.  Early in the book, the author discusses particle-wave duality in quantum mechanics at some length.  For me, at least, both Kroemer and Feynman give much better accounts of this important material.  Undoubtedly the author is entirely familiar with both, and I am not sure why his account seems more confused and, perhaps, more confusing than theirs.  Finally, it seems that the book was written very quickly.  Although extensive editing would have been required, it could have been much more concise and much clearer at the same time.  Still, if I want a book from a busy professor active in research---and I do want that---then I have to tolerate quick writing, don't I?  This is a great book to read, but it has no place on my permanent shelf.  Kroemer does."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AV15NQUDNMEKV"
                },
                "Date": "on February 12, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "A plethora of fascinating topics replete with understandable and humanizing comparisons.  The formatting was an issue with regards to graphical representations and the accompanying text."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DS2TN2TM2GRB"
                },
                "Date": "on May 22, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This is his second book. I finished this book around the same time I was watching the new Cosmos series on Fox. (It's hard to believe that Seth McFarlane, the man behind Family Guy, is one of the producers of the new Cosmos. I'm still waiting for Stewie to show up, or for a Cosmos parody on Family Guy. But I digress.) Like Carl Sagan and Neil Degrasse Tyson on Cosmos, Brian Greene is attempting to make science understandable to those of us who don't have advanced science degrees. Dr Greene uses a lot of pop culture references to illustrate his points. He seems to have a special fondness for the Simpsons. It's a little more complex, though. He's trying to explain the basics of string theory, with its theories of 10-dimensional space and quantum lengths. It can be a little slow going at times. He saves most of the mathematical equations for the footnotes. I'm not sure it's fully understandable to everyone. I had trouble with it myself. Some updates from the text. The large Hadron collider was finished, and the Higgs particle was discovered. Also, scientists recently discovered ripples from the original big bang. Dr Greene knows about pop culture. (He's appeared on the TV show The Big Bang Theory making fun of himself.) He does well in this book. It's just the subject matter that can be daunting."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30S26EMTUKQGT"
                },
                "Date": "on August 26, 2004",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A912C7977MO6O"
                },
                "Date": "on July 9, 2006",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27PFOZFLHD4RL"
                },
                "Date": "on November 23, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Outstanding, written with no philisophical bias (unlike \"A Universe from Nothing!), this covers a massive set of concepts, in a readable, compelling book"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1E64E7UKMNNC3"
                },
                "Date": "on June 23, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APH0W3CWWFMRF"
                },
                "Date": "on December 13, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I have to disagree with the reviewers who are calling this a \"dumbed down\" version of \"The Elegant Universe\".  Clearly they are referring to some of the analogies Brian Green used to describe certain theories, some including characters from \"The Simpsons\" ect, however it doesn't take away from the fact that he goes on to fully explain everything as well.  Also you can read the footnotes (which I did) for an even more in-depth read.  The whole time I read this book I had a childish grin on my face in reaction to the amazing things being uncovered by cutting edge science, and the author has a way of painting a mental picture for you that makes it that much more enjoyable.  I actually enjoyed this book a bit more than \"The Elegant Universe\" because of the colorful descriptions, and the way he would build up the descriptions to a reveal.  It doesn't read like a text book, while including all the information of one.  Very informative, and more importantly very, very enjoyable to read!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1C73DUEEM6LMH"
                },
                "Date": "on April 9, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TPWQ29QVGX8Q"
                },
                "Date": "on October 14, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HFC2UJ5PTM2R"
                },
                "Date": "on May 3, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UTRJYLFL1AQ0"
                },
                "Date": "on June 23, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YYWM6I50PASO"
                },
                "Date": "on January 2, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KOETNG6OCYLJ"
                },
                "Date": "on November 30, 2010",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36G3HCPBWGBY5"
                },
                "Date": "on February 15, 2005",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "One reviewer stated that this book should be called Elegant Universe for dummies. That may be true, but I get the feeling that it's laymen like myself that Briane Green is targeting. This book is easier to understand than the Elegant Universe. Yes it covers alot of the same material, but it is explained much better from a beginners point of view. The best way to simplify a complicated subject is through the use of analogies, and there are plenty in this book. Having read both books I now have a much more solid understanding of relativity, quantum mechanics..etc. than I did after reading The Elegant Universe alone. I may now go back and re-read Elegant Universe since I have a better foundation. If you are like me and have no background or very little formal education on the subject of Physics, then read this book first. No prior knowledge is required. Well done Briane Greene."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LPEHZ0YNKW5M"
                },
                "Date": "on October 14, 2008",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "The most enjoyable, understandable explanation of \"everything\" that I have ever \"read.\"  I listen to it over and over."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANJOHRJ1E2CDF"
                },
                "Date": "on January 25, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book explains the space-time fabric and everything related to it. The first 70-80 pages explain the history of physics, so if you're already familiar with it, you can skip along. Brian Greene uses many methods to explain very complicated topics, and at some points even admits that certain words (such as high/low entropy) still confuse him, which makes him seem more like a down-to-earth person. At some points certain explanations can get a little verbose, but it's better that he says too much than too little. This book allows anyone at a high-school to college reading level to delve into some of the most cutting edge topics in physics and quantum mechanics, without understanding all of the complicated mathematical formulas. He does however include most of the formulas in a notes section with an explanation of the formula, for the mathematically inclined."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5TFSTNHA0EFT"
                },
                "Date": "on January 4, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACDNFZFY7HTM1"
                },
                "Date": "on December 10, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Great book, good for anyone who is interested about science but does not want to go thru all mathematical jumbo mambo.."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2D0ADOYB3RBN5"
                },
                "Date": "on March 6, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2X3S7V4SC4T0W"
                },
                "Date": "on December 10, 2010",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This was a spectacular book! I've read many books on physics, chemistry and particle physics and Brian Greene is definitely top notch. He has a tremendous way of explaining complex scientific concepts to the lay man through the use of simple metaphores and analogies. He sends the Simpsons into space, has a worm crawling on a piece of floss, and has a bucket of water spinning in empty space. I've always had a hard time grasping the concept of the 11 space-time dimensions that super-string theory postulates, but after reading  this book I feel like I am finally begining to comprehend what it means. This is a very clear, well written book that will have you thinking seriously and deeply about the fabric of the cosmos.  It's a fantastic read, and I highly recommend it!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Z2JFJJZP3D7M"
                },
                "Date": "on December 23, 2010",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KFCCRRXEB5KY"
                },
                "Date": "on July 23, 2006",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "The best thing that I can tell about this book is that it makes you think. Of course, the different matters are simplified, but it is done in a smart way. The analogies to introduce concepts are very good, in the style of The Elegant Universe. This book is not conceived to explain Relativity, Quantum Physics or Superstrings; they are described just to introduce what spacetime could be according to our knowledge. Even if it is a best seller, I think it is a brilliant book. One important note is that I read this book before The Elegant Universe, and perhaps that is why I think that The Fabric of the Cosmos is even better than The Elegant Universe."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVL7UJHUEG5L7"
                },
                "Date": "on July 30, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I became interested in Mr Green's work after watching NOVA - The Elegant Universe on TV. I found this book interesting that explains many of the current science of cosmology & particle physics. Mr Greene does try to put difficult concepts into simple explanations so one can relate to them through their everyday experiences of life but often these seem quite labored metaphors. Mr Greene's enthusiasm for his subject does shine through his writing and makes you feel like you want to understand but it can get a bit tiring having to reading some paragraphs several time to understand the point, however when you get that eureka moment it feels worth it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2A6CW6R2YF636"
                },
                "Date": "on October 15, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36B8P4Z705N1S"
                },
                "Date": "on December 24, 2004",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "Considerable thought and consideration for the reader went into Mr. Greene's descriptions of classical and quantum physics.  His metaphors, analogies, and what ifs were delightful.  While reading this book, I felt as if Brian Greene were leading me by the hand through a wonderland of exploration.  I only wish there were more writers like him!  (Too bad he doesn't also write \"How To\" instruction manuals)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XDQ3CHGQEK5B"
                },
                "Date": "on April 5, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IFKSFAYE3CFD"
                },
                "Date": "on August 22, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is a deep treatise on the topics of space, time and the structure of the universe.  In light of some recent discoveries or should I say theories, it is a good primer to get up to speed on the theories and advancements of physics to the modern era.  It's either a great book to put you to sleep, or one that allows you to visit and re-visit thoughts and ideas in a thought provoking format.  Not for the faint of heart or casual observer. I was reading it on loan from a friend and was glad to find it on Amazon. The sevice in getting my own copy was nothing less than superb!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MTZINSV5US6G"
                },
                "Date": "on March 24, 2010",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAAHM522BUT55"
                },
                "Date": "on August 15, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I purchased the hardcover edition of this book in 2004 and recently also bought the Kindle ediition.  I was disappointed to find out that the index was missing.  You usually don't have an index in a work of fiction but for a nonfiction book such as one on science, health, art, etc., an index is vital if you need to look up a specific topic rather than going page by page through the book--laborious and time-consuming. Aside from that, on rereading this book I have to say that it is probably the best, most fascinating popular physics book that I have ever read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VL6NRDD0W0VF"
                },
                "Date": "on February 18, 2010",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XT7MEPM87XZG"
                },
                "Date": "on July 6, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "very good technical overview of the recent advances in particle physics and our understanding of the cosmos. i am a software engineer with an deep curiosity and interest in science. and though i didn't follow everything, i did learn a lot from this book. this is the first book by Brian Green that i've read, and i intend to read the elegant universe next. he is a great writer and uses real-world examples (often with references to simpsons characters) to help convey complex scenarios. recommended for anyone interested in science and the universe"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DBOXG3JSBGWN"
                },
                "Date": "on October 24, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Terrific review on the cutting edge issues of physics from string to multiverse theory and everything in between. The great unanswered questions are beautiful. What is \"Space?\" What is \"Time?\" If you read and understand the depth of Greene's contribution and embrace the challenge to discipline yourself you will find a completely new capacity in yourself to appreciate this amazing accident that resulted from the impossible. This is not about crystals or magic... that's for the lazy; this is a purists pursuit of reality."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EPNJ5ZFCJNUQ"
                },
                "Date": "on December 31, 2009",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38Z7AWIOASZ08"
                },
                "Date": "on March 3, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Very well written book, with a logical progression from subject to subject. It discusses complex physics and scientific reasoning in laymans terms even when the subject matter is beyond our human experience. The science behind many phenomena  only encountered in science fiction such as time travel, black holes, worm holes teleportation etc is explained in terms of our current understanding of the physical universe we live in. Altogether a great book for providing an understanding of the current frontiers of physical science."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OWLMYN5XXQ77"
                },
                "Date": "on November 11, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I couldn't put this book down! He makes a dry subject come to life. It took some time to peruse the chapters on String theory .However, his deft explanations of Post- Einstein discoveries made me look at the world in a new light for some time after finishing the book. The illustrations were not the best, but I really didn't find them to be necessary for understanding the science that he so vividly describes.I am an artist with out a strong background in physics, but after reading this book I almost felt inspired to study it!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XRV3V59MDHHS"
                },
                "Date": "on August 9, 2010",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQ6YJM2J2LNOP"
                },
                "Date": "on July 13, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Brian Greene as usual does a fantastic job of helping explain difficult topics to general readers.  He is virtually unsurpassed in his ability to draw analogies that make sense to those of us who aren't into complex mathematics and theoretical physics.  I enthusiastically recommend this book if you want a general understanding of some of the latest ideas in physics.  My only gripe is that in the end he just goes on too long and I tired of it by the time I finished."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJ9F0U3SR6J86"
                },
                "Date": "on August 16, 2008",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Not being a mathematical whiz, I found this book fairly easy to understand.  Brian Greene did a wonderful job not only explaining modern physics, but also how science got to where it is.  I really enjoyed the pop culture examples to explain concepts and he did a great job of not filling the book with technical jargon that can loose people quickly.  I highly recommend this book to anyone who wants a better understanding of physics and natural science."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AX9RMGFRIKKMZ"
                },
                "Date": "on June 27, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2O6U2CVSFYFP1"
                },
                "Date": "on December 25, 2010",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Z3IXZ17E88J4"
                },
                "Date": "on July 12, 2004",
                "Helpfulness": 0.625,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZDPQA6FLY8XM"
                },
                "Date": "on February 16, 2004",
                "Helpfulness": 0.625,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1M8GPLPJB6RCA"
                },
                "Date": "on November 13, 2010",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CBKZ1XD6S2WM"
                },
                "Date": "on November 29, 2007",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Dr. Greene really tied up some loose ends (strings?) for me with respect to this broadest stroke picture of modern physics and how experimental data continues to support working theory. The challenge will be to simplify it even further for a critical mass renaissance to escort our renewed world order into a solid reality field. Thanks Dr. Greene, I will refer to this work again and again. - Dr. Herby Bell"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25DA84TNUDC1O"
                },
                "Date": "on October 24, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The best part about this book is the easy to understand concepts that are brought out by the author.  I had to put the book down every once and awhile to ponder the wonderful understanding of the universe that Brian talked about. I believe it made me more religious in a sense that the universe and humans were made for each other.  At least that is one of the take aways I got from this wonderful book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QNJT4PJ0CBMS"
                },
                "Date": "on July 5, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Brian makes the difficult to understand so very understandable. I have been very disappointed with the new new Cosmos series on TV and have found this so much more understandable. I have no idea what I will ever do with this information, but it has been a great adventure learning it with this book. I highly recommend it to anyone who knows Einstein's famous formula but forgot what it means."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZMIYRC782KE9"
                },
                "Date": "on May 8, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "You won`t read this book in one sitting... but then it`s not intended that you should.  In fact, I put three paper bookmarks in different chapters to return to.  The amazing topics covered between the two covers are exactly that... amazing.  From Newton to Einstein and beyond we are treated to an emerging view of an entirely new dimension of reality... the subatomic world of energy."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3C1S6DQ894A83"
                },
                "Date": "on August 18, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "As a junior high teacher, sometimes I find that most of my reading is at the junior high level.  Brain Greene explains the most challenging ideas in physics in a conversational and often amusing manner.  Still, this book is not for skimming - you have to think.  There is no math involved.  If you ever watch or read about science or science fiction, you will enjoy this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VOQC2KADE64Y"
                },
                "Date": "on February 21, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Engaging, very well written exploration of some of the most mind-bending and difficult science out there. The pop culture examples are sometimes a bit goofy and dated, but they get the point across, and Brian Greene doesn't shy away from directing you towards deeper exploration if you're so inclined with copious, detailed footnotes. Well worth the read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXTSMC7AHWTHI"
                },
                "Date": "on June 25, 2007",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book is a compliment to The Elegant Universe. Although there is overlap in basic concepts, it adds many new ideas that are not in the previous book. This book is a sure-fire must-read book. Brian Greene is both knowledgeable and an outstanding writer. The insights into the big bang and the means by which concepts were developed are quite amazing."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVKP1BQIHJA9E"
                },
                "Date": "on March 6, 2004",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "...that everyone should read. You have heard that reality is stranger than fiction. Read this book to find out why. Many things you thought were obvious and clear, are actually very, very, strange, and very, very unlike what you thought. This should be the bible of the 21st century."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UGQ28FHU85T9"
                },
                "Date": "on November 23, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book is well written. The author has kept much of the mathmatics and abstracts to a minimum, using instead concrete examples that help us understand the concepts presented. There is even some humour, odd in a book such as this, but welcome. He begins with Newton and Einstein to set the scene for the concept of String/M theory. We have often heard it said that Einstein was wrong on any number of issues depending on the bent of the commentator. The classical physics of Newton, and Einstein's Special/General Relativity have not been proven wrong, they simply were not right enough. This book is thoroughly good read, informative and entertaining, something rarely found in the usual dry science book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SHJ1R4D93ZSE"
                },
                "Date": "on June 23, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Brian Greene makes theoretical physics assessable for a broad audience. He has the unique ability to make difficult topics understandable by means of cristal clear metaphors."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26I4ASZO5SZ0U"
                },
                "Date": "on February 21, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A fascinating look at the universe and it's scientific beauty. Brian Green explains the known theories with understandable metaphors and illustrations. If nothing else it will make you ponder."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22T9S1NO2GMQC"
                },
                "Date": "on November 17, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AJQT59TNX3YI"
                },
                "Date": "on December 27, 2008",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEL9IH75WYOER"
                },
                "Date": "on October 24, 2007",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3R19YKNL641X3"
                },
                "Date": "on April 7, 2005",
                "Helpfulness": 0.625,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AE51K69PDJZTU"
                },
                "Date": "on December 18, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZTGPO1XWAJH5"
                },
                "Date": "on March 15, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Brian Greene is the rare scientist who can write clearly for laypeople.  Also he has a sense of history that is lacking among most scientists.  Greene explains the progression of the discoveries and often tells something about the personalities of the discoverers.  The companion PBS TV show is also beautifully done."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25FDX17O3QKLT"
                },
                "Date": "on April 16, 2005",
                "Helpfulness": 0.6,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1E5YFRK0QXCG8"
                },
                "Date": "on November 6, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Loved this book!  More than moderately detailed because it has to be to explain everything, and may require repeated readings, but ultimately very clear and easy to understand.  I was amazed because it answered all the concerns and questions that I had from reading older books on the same subjects."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1P49YMRCG63GZ"
                },
                "Date": "on June 9, 2008",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1K86YDOCXKDM6"
                },
                "Date": "on March 27, 2015",
                "Helpfulness": "",
                "StarRating": "2",
                "Text": "I recommend this book to the insomniacs out there. He has a way of rambling on and on that could put anyone to sleep. He'll use six different examples to explain one concept. Not sure if he was being paid by the page, but as many subjects could have been adequately covered in half the space."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3P871X1CSHCZH"
                },
                "Date": "on June 9, 2008",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3A0DX3Z1SYNR5"
                },
                "Date": "on November 6, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Very well written and informative. It expands on the PBS documentary of the same name that you can watch either from Netflix or Amazon Prime video. It is the SECOND book on this subject matter and reading the first, The Elegant Universe, will be immensely helpful when tackling this one."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HK5YECUFG4IF"
                },
                "Date": "on June 15, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book is extremely informative and should be accessible to a moderately well educated reader. One of the great, surprising insights about the workings of the cosmos is that gravity can be repulsive.  Outside the physics profession that is probably not even suspected."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVOOXSPAGHHG3"
                },
                "Date": "on December 24, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "As a historian of science who taught this material, I found the parts on space and time far and away the best popular treatment available anywhere...far superior to Hawkings' Brief History ( which actually isn't very good on historical material on Einstein)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2U4O666QI3NZF"
                },
                "Date": "on May 19, 2005",
                "Helpfulness": 0.6,
                "StarRating": "5",
                "Text": "This is clearly a masterpiece. Greene is able to convey in plain language even the most fragile of subtleties in what arguably is a 'nerdy' topic. Using the easy to understand spinning bucket experiment as an intellectual lifeline Green helps us explore the deep and turbulent waters of cosmology and particle physics and brings us back safely to soild ground without resorting to a single mathematical equation. There is a disappointment, however. Green either does not know, or has overlooked striking parallels between string theory and cosmology as described in Sankhya, an ancient Indian school of philosophy. He does mention 'Purusha', which is a Sankhya term, but refers to it in a somewhat prejorative sense, and misses some of the the more refined aspects of the Sankhya school of thought. The big bang (hiranyagarbha) his M-branes describing an ever expanding and contracting universe (mahayugas), and string theory itself (paranada) have qualitative intellectual parallels in Sankhya. I would hope the author would seriously consider this matter and not be spooked by the unfamiliar Sanskrit jargon of Sankhya. Overall, great book, a must read!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15ZWA1ISGRTSD"
                },
                "Date": "on March 31, 2008",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LRMV9VKYV08D"
                },
                "Date": "on January 6, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I've read many books on cosmology and popular physics, from writers such as Kaku, Hawking and others. None as good as this. Green has a real gift on writing easy to understand, clear, descriptive and imaginative books. Most highly recommended."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GOJDQ2YTU8D8"
                },
                "Date": "on April 7, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AX1KPL6FKLQ7E"
                },
                "Date": "on May 4, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "If you're a layman and interested in the current status if theories in physics, such as the origin of the universe, the Higgs field, the tension between general relativity and quantum mechanics, etc., then this book is terrific."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UR3VK37QPFPP"
                },
                "Date": "on February 13, 2009",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "Spent weeks after reading this seeing the world very differently.  Recommend it highly to anyone interested in expanding their view of the cosmos and our place in it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29D8TZ9LLCS23"
                },
                "Date": "on July 23, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I had read bits and pieces about quantum mechanics and relativity, but Dr. Greene puts everything together in an understandable way. He uses simple, humorous examples that show his personality as well as thorough science."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AD9WKM771H4WG"
                },
                "Date": "on April 24, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Good material for physics teachears. Book presents understandable modern word view about relativity, quantum physics and cosmology, and explains how the world view is constructed in guidance of experimental physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A286UWZTL81TR2"
                },
                "Date": "on May 27, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Well read and well worth the contemplations that Brian Greene creates. Also written in a fashion that is easily understood and presents reasonable theories and accounts of many unanswered or long debated questions."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CNATMA72YPFG"
                },
                "Date": "on November 14, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I am a thoracic surgeon, watched one Pbs special on The Fabric of the Cosmos and read the book am going back to school to obtain another PH.d in theoretical physics. Life changer for any other interested in space."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1D3BO0SSUI6LB"
                },
                "Date": "on February 8, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Feel the same about this book as I do the first one I reviews.  Even when I have to go back and revisit points it doesn't get old.  Thank you Brian Greene for writing a quantum mechanics book for the rest of us."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOWV4GOJ9HNL3"
                },
                "Date": "on November 26, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This was the first book that I had read that was written by Brian Greene. He has a talent for taking complex complexs in physics and translating them in a way that makes it easy for laypeople to understand."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKOUQHZAAL5Q4"
                },
                "Date": "on December 23, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "a wonderful read, truly memorizing.  I couldn't say enough good things about this book.  it was literally a time machine for me,  i would open it b at say noon and ten minutes later it was 5 o'clock."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39MKQ6CYGRQHW"
                },
                "Date": "on October 20, 2008",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "How these scientists even conceived of the ideas about the cosmos is beyond me.  Greene does an excellent job of walking the non-physicist reader through concepts that may otherwise be inaccessible."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25IGL5CWBNHW"
                },
                "Date": "on February 23, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I386QA5UYBZY"
                },
                "Date": "on June 19, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I enjoyed reading this book. The author uses simple examples to explain very complex concepts.  I recommend this book to those who want to better understand the concepts of time and space."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZS0L9QIOTDMG"
                },
                "Date": "on November 12, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The product is amazing , the text is clear and the words are farly simple and interesting. He is able to give just the right amount of infomation at one which make it easily understandable"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RB76WQBNKHF9"
                },
                "Date": "on September 28, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Each time I read a Brian Greene book, or a Lisa. Randall book, I understand a little more about quantum mechanics and string theory.  I am in my nineties and still need a few more years"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZSJ30H265KN6"
                },
                "Date": "on November 4, 2011",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I had heard the term science is stranger then fiction.  Now I know what it means!  I loved this book. It blew my mind and I could actually understand it. Can't wait for his next book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A307X1PWTD5Q1G"
                },
                "Date": "on June 26, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ADD7GUGKPJVA"
                },
                "Date": "on April 17, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Another great work by Brian Greene. Simple to read and well written. I am no physicist and yet I am left with the feeling that I could \"talk shop\" with the best of them."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LIE2641FAKQU"
                },
                "Date": "on September 14, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Prepare to have your mind blown in a simplistic breakdown of complex theories and quantum physics. This book is truly brilliant and will expand your mind in fantastic ways."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3F9J48KQ2R4AI"
                },
                "Date": "on November 28, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "While it is becoming dated this is still a well written comprehensive book on the state of modern physics. Very understandable and as all physics goes fascinating."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQ2K4GTR938NJ"
                },
                "Date": "on August 26, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "If you do not know how to sew, if you can't thread a needle, then I suggest you learn how to darn a patch on the knee of your favorite jeans before you read this."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MVUWT453QH61"
                },
                "Date": "on August 22, 2004",
                "Helpfulness": 0.6153846153846154,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I3PYXN5XTYJK"
                },
                "Date": "on September 2, 2009",
                "Helpfulness": 0.6,
                "StarRating": "3",
                "Text": "This book is OK.  The concepts he tries to bring about are very complex, but very interesting, and definitely challenge our perception of reality.  I just think that he lays the analogies on way too thick, such that they break down, and distract more than they are worth. Quantum entanglement is simply bizarre, and notions of multiple universes are mind-boggling. I definitely like hearing about how some of these possibilities may be discovered experimentally soon, which leaves some scientific hope, and makes me want to switch studies and pursue physics---unlike the author's mother (at least in this universe)."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AR3960GWZH8AO"
                },
                "Date": "on December 25, 2012",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15LJQQSQUOY6A"
                },
                "Date": "on December 4, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Mr. Greene explains scientific material in a way that makes sense to a science novice such as myself.  I have enjoyed every book of  his that I have read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYTQKUIXUJMD1"
                },
                "Date": "on December 17, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I enjoyed the movie and enjoyed the book. His works bring difficult concepts to light. Made me go deeper into the ideas after reading and seeing his work."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1130F4HNWMJMX"
                },
                "Date": "on January 14, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Brian Greene needs no introduction and stands as one of the greatest scientists around. he is definitely a great presenter and is up there with Einstein."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15B2RFC62899O"
                },
                "Date": "on December 18, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is Brian Green's best pop-sci book. A little dated now but still contains great explanations of String Theory and Relativity. 10/10 would recommend."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KLYS5D7IV7ET"
                },
                "Date": "on February 14, 2004",
                "Helpfulness": 0.6363636363636364,
                "StarRating": "5",
                "Text": "I've read many science books for the general reader. I've read The Elegant Universe (twice, in fact). This new book, The Fabric of the Cosmos, is about the best I've ever read. I am now two-thirds through it, and loving every page. I don't want it to end! (I've never said that before about any book.)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A122KZG0PUGYZ1"
                },
                "Date": "on April 28, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHGT53AWMWCSR"
                },
                "Date": "on June 2, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Actually, Brian Green has shown his brilliant exposé of a complicated mathematical subject brought to an English translations for non-mathematicians."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1X37POCAJ3EX4"
                },
                "Date": "on December 14, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Am reading it now. Thrift books is Grrrrate! Thanks. Brian Greene is the lay persons dream for the fashion he breaks down physics for the lay person."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33568PEJIO09E"
                },
                "Date": "on March 20, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Very good description of a scientific subject. Brian Green is a magnificent writer down to earth with the reader who is not familiar with science."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KLMCGB65Z84I"
                },
                "Date": "on August 11, 2006",
                "Helpfulness": 0.6,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJCV3LQPDOUQ9"
                },
                "Date": "on April 3, 2010",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "allows the non-physics major to understand some of the most complicated and intricate principles and theories of abstract/theoretical physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KESZ7EH04CKH"
                },
                "Date": "on August 23, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALJMPJX8DDNV3"
                },
                "Date": "on February 27, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The book is an excellent examination of physics, astronomy, and quantum physics.  The book is well written.  It hold the readers' attention."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20PZSDOZVM6JU"
                },
                "Date": "on May 10, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The subject matter is amazing and, considering its complexity,  it is presented in an understandable \"Cosmology for Dummies\" manner"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AF76K8AHR7P0O"
                },
                "Date": "on November 12, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "amazing insights into workings of our universe. Tries and succeeds in explaining mind twisting ideas eloquently. Excellent read, must read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KZW8AVOYY1WV"
                },
                "Date": "on December 4, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "To understand the workings of the universe with a single word written a great book. Thanks Brian Greene share your knowledgements with us !"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14IRBGOHRHP53"
                },
                "Date": "on March 30, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The book arrived in a timely manner and in very good condition. I gave it as a gift and they enjoyed very much-so I will recommend this."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NKB2L1X66JS5"
                },
                "Date": "on March 7, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great read, I enjoy Brian's analogies and how he explains the multiple topics he does. Bravo and well done. I would recommend this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2L2PKBNF9AH0O"
                },
                "Date": "on March 31, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I had a great experience with this purchase and would recommend Amazon and this vender to anyone interested in these type of items."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CU7LAYSZPR8R"
                },
                "Date": "on July 30, 2009",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great read, some parts you'll cover twice.  Its great for those of us who are tired of discussing politics and sports.  Pick it up."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKQH3KDYGUCWG"
                },
                "Date": "on October 19, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I was very happy to read the text but only understood only about 50% of what I read. I'll give another go someday in space-time."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NGEEHA1O5XDF"
                },
                "Date": "on January 16, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is a very good series / book.  It explains difficult to envision concepts simply enough to be understood by a lay person."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AS9AT91XJZ44B"
                },
                "Date": "on December 30, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Brian Green takes some of the most complex concepts in physics and makes it easy to understand on a basic level.  Great read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASZEDJQNORJQZ"
                },
                "Date": "on December 3, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The best explanation of space-time and the nature of true reality I have ever read - really has me thinking. Mind expanding!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9M7AHUF1R73K"
                },
                "Date": "on June 27, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I purchased Greene's books to expand what I watched on de Grasse Tyson's Cosmos. learning is fun for everyone all the time."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SEZHWWVF0MZK"
                },
                "Date": "on July 12, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "It truly is remarkable how easy can such complicated thoughts be explained. Great read for those interested in the subject."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A250XU4W3L5QYM"
                },
                "Date": "on January 3, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is a good 500 page book or so but the first chapter to me was hard to follow along I got lost on the first page."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1F3LRZLI035J6"
                },
                "Date": "on December 1, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "It was readable and hugely informative. Anyone wanting a great read should check this one out. Good job Brian Greene."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SGR7LE899LGG"
                },
                "Date": "on August 2, 2004",
                "Helpfulness": 0.6,
                "StarRating": "4",
                "Text": "This book is another excellent piece of knowledge for the amateur and casual reader. It covers all the important points in today's latest theories. Concepts are well explained and fairly easy to grasp (as easy as it gets considering the complexity and alien nature of many of these concepts). This book is not the only reading you will need to fully understand the subjects, but it is an excellent start. Overall: VERY GOOD!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3A96SYC0YI5VW"
                },
                "Date": "on February 4, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Too much work filling these in for everything i purchase.  You've got to make it easier. 4 more words required"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EFY3XXO335MZ"
                },
                "Date": "on January 14, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I get more than I expected. It's very good for me. I recommend the products in 100% for all that can get it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2G90J4PELWGMN"
                },
                "Date": "on October 11, 2005",
                "Helpfulness": 0.6,
                "StarRating": "5",
                "Text": "Brian Greene has done it again.  This book does a fantastic job describing the state of modern physics, specifically as it relates to cosmology in an easy to read manner.  Greene goes on to explain the basics of string theory and how it can be used to explain cosmology.  Some topics covered in Elegant Universe are covered here, but I never felt like I was reading the same book twice."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FQCBON3NCQ3V"
                },
                "Date": "on May 15, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "It asked the questions I often thought about and then answered them!  Very interesting and entertaining"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10T0GB3PW3VAR"
                },
                "Date": "on December 28, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great read, excellent balance between concepts and experimental detail and evidence"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1D1P9JQKWW8N"
                },
                "Date": "on October 31, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent all the way around. I would buy from them again. Very satisfied overall."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A194T0BGGJZYMP"
                },
                "Date": "on February 2, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZJ9DMIJEABOK"
                },
                "Date": "on March 16, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Best book read sofar on spacetime, quantum mechanics and beginning of universe."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WN7H6ZN9A9L5"
                },
                "Date": "on April 13, 2015",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "Commercial version of introductory science -- entertaining and easy."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7SC8J5NYDEIQ"
                },
                "Date": "on April 25, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Just excellent. Clear. I really like Brian Greene as a science writer!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A126KX6FVI4T66"
                },
                "Date": "on December 11, 2008",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGEVODG44CRCH"
                },
                "Date": "on July 23, 2006",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "I never thought I'd read a physics/astronomy/cosmology book that I couldn't put down.  Brian Greene does an excellent job of making the obviously complex topics enjoyable for readers at just about any level of physics background, though advanced readers will cleary get more from it.  I loved this book and have shared with many friends."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BVHHFBUW9KDS"
                },
                "Date": "on July 19, 2005",
                "Helpfulness": 0.6,
                "StarRating": "5",
                "Text": "This is a wonderful read. Brian Greene has a gift for explaining complex subjects in a clear and concise manner using good analogies. If you are interested in cosmology, this is a great book to read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AX86XDJ4S5527"
                },
                "Date": "on April 8, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "One of the best descriptions of physics to the lay reader."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Q554QBB55Q33"
                },
                "Date": "on July 30, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Exactly what I needed.  Quick delivery!  Very pleased."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13BV1ZKMO265T"
                },
                "Date": "on January 9, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent purchase.  Would buy again.  Fast shipping."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37B6WY4GPMDWZ"
                },
                "Date": "on February 25, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Very happy with the purchase and the service, thanks"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PTYRJYJJT104"
                },
                "Date": "on June 20, 2006",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "I am awed by Brian Greene's powers of explanation.  He genuinely respects his lay audience, fully motivating and then explaining each problem area.  His ability to connect history's theoretical frameworks to each other is captivating."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2R2FTHW3Z80RE"
                },
                "Date": "on February 1, 2009",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFACO6T2RFSFU"
                },
                "Date": "on March 20, 2006",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Great read, simple to understand.  As a reader with an interest but barest of understanding of \"all things quantum,\" I found the book easy to read and enlightening.  I recommend it for all with at least a passing interest."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RLUKMCBP5TIT"
                },
                "Date": "on December 7, 2009",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2C3E35FDWR8WV"
                },
                "Date": "on November 13, 2004",
                "Helpfulness": 0.5833333333333334,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JH303VTIWURQ"
                },
                "Date": "on February 9, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWXDU4R5ZK7KC"
                },
                "Date": "on November 11, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Was as described and shipped promptly"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GXY5F09JHT8A"
                },
                "Date": "on August 14, 2004",
                "Helpfulness": 0.6086956521739131,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2V0L4MAXN1V62"
                },
                "Date": "on June 19, 2006",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Extremely well written! Not too technical, but not too basic either. I've had college physics and this book quickly brought me up to speed on the latest thinking in cosmology."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A65V8CMBWLA3J"
                },
                "Date": "on March 20, 2013",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": "A lot of the material was covered in one or more of his previous books. I guess that he's smart, but I think that he's milking this too much."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AB8SDXUCD4SYP"
                },
                "Date": "on April 24, 2015",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JCHOHRR6O626"
                },
                "Date": "on March 17, 2004",
                "Helpfulness": 0.5833333333333334,
                "StarRating": "5",
                "Text": "Brian Greene within his book will take you into the unknown and where most people would say you could never go, but a lot of those same people have very closed minds. We must open up our minds and look beyond what we know as true to day, for tomorrow will unlock doors we never knew existed. Mr. Greene has the type of mind that we all need, without it, we would all be stuck in the past without a tomorrow.The book is a must read-Larry Hobson- Author \"The Day Of The Rose\""
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1M1VVH3ULF1FB"
                },
                "Date": "on November 8, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Just read the book!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FUMDIE0XSVI5"
                },
                "Date": "on October 9, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Just what I wanted!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DTLQYDSGCWIN"
                },
                "Date": "on October 11, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Good as expections"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14IUTFYEL0LCB"
                },
                "Date": "on August 11, 2008",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "The negative reviews say that there's not much that's new in this book (over and above what was in The Elegant Universe.) As I have not read The Elegant Universe, I find this book most wonderful: in the first 100 pages alone, you learn all you wanted to know about relativity and quantum theories, written lucidly."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IHFKXY7J68TL"
                },
                "Date": "on January 27, 2010",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I am still reading the book but so far it has been excellent. The book is very in depth for the most part, and very good analogies and visual descriptions of abstract concepts help the reader understand many concepts. I very much like the way Brian presents the topic, he lets you know what other theories there are for a given topic, where he stands on it in comparison to the current consensus (if there is one). I've been reading physics alot lately and this is by far the best book i've read on the topic that goes into sufficient detail."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KKMC3XQ7B93I"
                },
                "Date": "on January 6, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "a must read!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A312HDMDQQZEDU"
                },
                "Date": "on January 22, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Thanks again"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JNBAIY6DBRAO"
                },
                "Date": "on February 8, 2010",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Not an easy subject for most people without large interests and abilities.  This is a college-level endeavor but is well worth the effort for those interested.  He writes so well and lays out very complicated ideas with ease.  A tremendous book and a must read if you wish to discuss our future on an intelligent level.  This should be a requirement for all educated humans - along with Guns Germs and Steel, and the Outliers.  READ ON"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AITIU2DG1MM4A"
                },
                "Date": "on September 1, 2004",
                "Helpfulness": 0.5454545454545454,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWQRI9QUCHS06"
                },
                "Date": "on December 3, 2012",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "I bought thhs because of his 4-part special on Nova in late 2011.  The physics is heavy going sometimes but he writes so well that this is somewhat alleviated.  Still about 80-90% was over my head; wouldn't buy it if I had a do-over.  I've ranted many a time about \"endnotes\" - 42 pages of them, but in this case justified.  As he explains, they go into even heavier matters."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5ZOALLOMSFC4"
                },
                "Date": "on July 29, 2013",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "As I have not studied physics to the extent required to understand how past present and future events can be present at the same time I looked to this book to simplify the explanations.  I still struggled but having a book in hand to which I can refer and reread at will makes the path easier."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32K7FJJ8ER22V"
                },
                "Date": "on September 13, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "good deaL"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12900APZJL9NI"
                },
                "Date": "on March 3, 2013",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AE8RQHFMSLN0D"
                },
                "Date": "on September 18, 2008",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "How awful.  I wrote a long and interesting review of Greene's book. But then I had to go to another page to fill out your Tag idea, and when I came back the review had vanished. No, I'm not going to write it again; the designers of this web page ought to write it themselves if they can write."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HLYVFKRMQVD3"
                },
                "Date": "on July 3, 2007",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24P7JJ68W19BH"
                },
                "Date": "on July 28, 2013",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "I like the book very much. Greene writes clearly about complicated conditions and is easy to read. However, the book is so badly produced it is falling apart. Large sections were not glued properly so they are coming out as I read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFPUMS6UPK0AH"
                },
                "Date": "on July 7, 2005",
                "Helpfulness": 0.5555555555555556,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GLNCKCV8OH0N"
                },
                "Date": "on December 5, 2013",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "Nice explanations, but the stuff on 11-dimensions is still hard to take after this reading. I need to read lots of authors on this topic to get deeper understanding, and I am glad I read this one. Probably deserves a re-read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VA8AGVBY7U5M"
                },
                "Date": "on November 20, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I bought this book along with another two books from this author and I must say I loved them! Great book if you're an average Joe interested in physics, Brian Greene explains it in a way that's both simple and fun to read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DT1H6X8U8CRI"
                },
                "Date": "on March 15, 2013",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "It was an interesting book. I was wondering how little we usual people know about the universe and physics. The end chapters were a bit too hard to swallow about e.g. travelling to future, past but still it is a good book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVC8ZAFPYOHZL"
                },
                "Date": "on February 1, 2006",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": "Philosophy of Physics is becomming more important than ever. Our quest for an understanding of our spiritual interests and how those might merge with our understanding of the physical universe make a philosophy of physics essential reading. Have a look at a new book: Mathias Frisch, Inconsistency, Asymmetry, and Non-Locality: A Philosophical Investigation of Classical Electrodynamics, Oxford University Press, 2005, as a comparison. There are new ideas in this book not discussed in Elegant and those are the philosophical implications of current physics. I find these rarely discussed though maybe it is because I miss them in the physics. I admit to needing them in simpler terms! Frozen River as a metaphor for time -- for example, is wonderfully simple and requires no physics speak for me to comprehend. I love the book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGH22LH74Z4OE"
                },
                "Date": "on May 24, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "great"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3P0JOT9GDM408"
                },
                "Date": "on October 3, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AY9125Q8YJ1QW"
                },
                "Date": "on July 14, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Nice"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DZ1N9ZD2M9N7"
                },
                "Date": "on September 2, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "On time. Pretty great condition. I love physics so much. I haven't read it all but so far its pretty awesome"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATGXLF6UNIF76"
                },
                "Date": "on January 29, 2008",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23BZJ9XRBRW3A"
                },
                "Date": "on January 15, 2015",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "ok"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUY7W0K2SP9DP"
                },
                "Date": "on September 8, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I want to read all of his books and I'm not even good at science"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ULJDL61S22DH"
                },
                "Date": "on July 12, 2007",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RBW6PKIFBUBX"
                },
                "Date": "on March 22, 2011",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "4",
                "Text": "I have two paperback books from the publisher \"Vintage\". Both fell apart. We all want cheaper books, but cutting corners to the point where they fall apart by just opening them MIGHT BE GOING TOO FAR!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJF4AYE14M5P0"
                },
                "Date": "on August 19, 2008",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BRAFILM7PSK9"
                },
                "Date": "on February 5, 2008",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BER5T1VGBNV1"
                },
                "Date": "on June 18, 2004",
                "Helpfulness": 0.42857142857142855,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 19, 2004",
                "Helpfulness": 0.5384615384615384,
                "StarRating": "5",
                "Text": "He takes difficult concepts and makes them understandable.I not only enjoyed this book,I learned a lot.In fact,I could not put it down and I plan to reread it. Good Job."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXH4AG4AU1SER"
                },
                "Date": "on March 10, 2011",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": "This is a very great book. I highly recommend it. It covers a great many things and explains them as clearly as possible."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALLPQG6GEX9KB"
                },
                "Date": "on August 6, 2004",
                "Helpfulness": 0.5454545454545454,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AC9S8U66SNMU"
                },
                "Date": "on February 28, 2008",
                "Helpfulness": 0.5,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QRZ06JM57LS6"
                },
                "Date": "on June 18, 2014",
                "Helpfulness": 0.25,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MERYSDHJV7TF"
                },
                "Date": "on January 10, 2007",
                "Helpfulness": 0.5,
                "StarRating": "3",
                "Text": "As a former researcher myself, I just couldn't deal with the layer upon layer of speculation - even though it is interesting speculation."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2U3LTK372V6JO"
                },
                "Date": "on June 18, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12EDSS3IG6T2W"
                },
                "Date": "on August 26, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "A great read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUZUA8H2G7ZVQ"
                },
                "Date": "on November 21, 2007",
                "Helpfulness": 0.25,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AX8RYFB24IMDR"
                },
                "Date": "on February 7, 2010",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "The book was delivered in great condition, a few minor spots on the paper cover but nothing that can take away from reading the book!  The content within the book is also very thought provoking, I would recommend it to anyone with a deep interest in space/time topics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14MUVHE34MS01"
                },
                "Date": "on August 19, 2004",
                "Helpfulness": 0.4444444444444444,
                "StarRating": "3",
                "Text": "Just finished the book. I've read the \"Elegant Universe\" and \"Black Holes and Time Warps\" and I thought this book was somewhat of a rehash of the two. Although many of the analogies he presented were very clear, I think he went overboard in some areas. It probably could have been a 300 page book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30PPBTMWNHT62"
                },
                "Date": "on June 17, 2007",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "I bought the audio and listened to it.  It was very informative but it did a bit dry from time to time but still good to listen to."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3V1EPSE6XDC0C"
                },
                "Date": "on August 10, 2006",
                "Helpfulness": 0.45454545454545453,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15X60NOGL3WDW"
                },
                "Date": "on January 23, 2009",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Enjoyed this audiobook so much I bought elegant universe.  They are a bit light on the math but I suppose that sells."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CEQ87B02CNDC"
                },
                "Date": "on May 4, 2012",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28BEC89467FC4"
                },
                "Date": "on January 21, 2006",
                "Helpfulness": 0.4666666666666667,
                "StarRating": "3",
                "Text": "Like many other readers of The Fabric of the Cosmos, who thought of this book as a \"sequel\" to The Elegant Universe, I was disappointed. Personally, I liked the first chapter, where he discusses the point of view of many physicists, like Newton, Mach and Einstein. The first half of this book is based on well-established physical theories (particularly, Quantum Mechanics and Special/General Relativity, which, by the way, have already been experimentally tested many times).  BUT, he spent (or wasted) the second part of his book on speculations on String/M theory, and, OK, we understand Grenne is a string physicist, but it seems he forgets that UNTIL TODAY, THERE IS NO EXPERIMENTAL PROOF SUPPORTING STRING THEORY (or Higgs Field, Braneworlds, wormholes, etc). So it IS senseless to speculate about a speculative theory, or even worse, to try to get conclusions about our reality from it. The author tends to sell phrases such as \"many researchers think that...\" (with no references at all), which are written just to overweigh the real content of his arguments. I agree with other reviewers: his pop-culture analogies just insult the inteligence of the readers. To the readers who were disappointed by this childish book, I would recommend to them DEL MUNDO CUÁNTICO AL UNIVERSO EN EXPANSIÓN (From the Quantum World to the Expanding Universe) from Shahen Hacyan, and HOYOS NEGROS Y LA CURVATURA DEL ESPACIO-TIEMPO (Black Holes and the Curvature of Space-Time) also from the same author (FCE, México), to read a well-written, general level book about Quantum Theory, Inflationary Theory, Black Holes and Wormholes (they are written in Spanish, though). Let's not forget Complex Systems and Chaos Theory, which (many researchers agree :-P) is thought to the third revolution on physics of the twentieth century. This is another problem for determinist theories (for long-term predictions infinite precision is needed in order to avoid chaotic behavior of physical systems)... and our fellow Brian Greene just ignored it on this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21K0KO0UBEN81"
                },
                "Date": "on July 31, 2006",
                "Helpfulness": 0.25,
                "StarRating": "4",
                "Text": "really good stuff, but if you dont have any science and physics background , you will be lost.. opt for something like einstein for begginers first :o)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BIIFXWJKAEP0"
                },
                "Date": "on February 22, 2007",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "4",
                "Text": "A great book which makes understandable that which is almost not understandable."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 4, 2004",
                "Helpfulness": 0.5471698113207547,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10QMR1FOD3ZG8"
                },
                "Date": "on December 23, 2006",
                "Helpfulness": 0.2857142857142857,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGJDJHK0E8N72"
                },
                "Date": "on August 11, 2007",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24505CR98NLLV"
                },
                "Date": "on July 21, 2004",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RWQCU67U7YZ8"
                },
                "Date": "on November 19, 2005",
                "Helpfulness": 0.4166666666666667,
                "StarRating": "3",
                "Text": "I like the information from this author's books but I felt the book was being \"dumbed down\" by using the characters from \"The Simpsons\" to make his examples.  This family does not watch the show.  Quantum mechanics does not need to be dumbed down for it's readers."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KA8VPLPQVDL8"
                },
                "Date": "on April 11, 2007",
                "Helpfulness": 0.2,
                "StarRating": "4",
                "Text": "Like his other book An Elegant Universe, Brian Green really gets you invovled in both historical physics and astronomy as well as modern bleeding edge theory.  You don't have to be a PHD to appreciate and understand most of the concepts presented in this book."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 10, 2004",
                "Helpfulness": 0.4782608695652174,
                "StarRating": "2",
                "Text": "Greene writes well, but like a number of science authors he covers much of the same ground here as his last book.  When he isn't talking about superstring theory, he is presenting a general ramble of diverse topics---kind of like a physics 101 class-- that have been covered many times in the popular literature."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XHBYXM8ONJ5M"
                },
                "Date": "on August 30, 2005",
                "Helpfulness": 0.4827586206896552,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AT2R7ZVT7QYOU"
                },
                "Date": "on December 18, 2004",
                "Helpfulness": 0.38461538461538464,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36RO7NCM6IUGB"
                },
                "Date": "on March 17, 2005",
                "Helpfulness": 0.38461538461538464,
                "StarRating": "5",
                "Text": "A very good read...if you can understand all of it you are a better man than I....but that is part of the fun!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on May 27, 2004",
                "Helpfulness": 0.3,
                "StarRating": "4",
                "Text": "I liked the Elegant Universe and I enjoyed The Fabric of the Cosmos even more. Anyway this thought provoking book cannot answer the big puzzles that heap in my e-mail delivered from space exploration e-zines. It is hard to digest the mysterious intense stars formation in the early universe, the unanticipated location of the quasars in humble homes and the discovery of huge (about 80 times heavier than the sun) stars that orbit each other in just 3.7 days. These brain twisters can find surprisingly elegant clarification in the \"firework universe\", described by Eugene Savov in his book Theory of Interaction the Simplest Explanation of Everything. This book will make your day if you take some mental effort to understand how the texture of reality is laid bare in it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KEV6VXA4TTZZ"
                },
                "Date": "on February 15, 2007",
                "Helpfulness": 0.3888888888888889,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 16, 2004",
                "Helpfulness": 0.3888888888888889,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OIMUR42XIOFQ"
                },
                "Date": "on March 25, 2005",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Z1KE5VIVMB34"
                },
                "Date": "on March 25, 2010",
                "Helpfulness": 0.3076923076923077,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2C3Z4KK6SO8MS"
                },
                "Date": "on February 3, 2010",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "the person that got this book for christmas is a fan of the author, so he was very pleased to get this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3H090XL78XF3R"
                },
                "Date": "on November 29, 2005",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "5",
                "Text": "Put the number 0736697500 in the Amazon search bar to bring up  [UNABRIDGED 19 CD SET The Fabric of the Cosmos : Space, Time, and the Texture of Reality"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQLYX5S9F7XZ1"
                },
                "Date": "on October 28, 2004",
                "Helpfulness": 0.38095238095238093,
                "StarRating": "3",
                "Text": "The Elegant Universe is unquestionably brilliant.  This book is a good reminder if you don't want to re-read the Elegant Universe but there's not all that much new here, perhaps because progress in string theory is slow."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1S6HX6G96BWM6"
                },
                "Date": "on March 24, 2005",
                "Helpfulness": 0.3125,
                "StarRating": "3",
                "Text": "This is a good review aftering reading The Elegant Universe: Superstrings, Hidden Dimensions, and the Quest for the Ultimate Theory. If you are new to Greene start with the Elegant Universe and then if you must go on to the The Fabric of the Cosmos"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MV7635LJT3N6"
                },
                "Date": "on October 17, 2013",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "bought it to replace a book I checked out for a friend(who was irresponsible,think I learned my lesson on this one)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BO7084LFJX27"
                },
                "Date": "on February 29, 2004",
                "Helpfulness": 0.18181818181818182,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CXWV8ICIVPZX"
                },
                "Date": "on October 27, 2004",
                "Helpfulness": 0.1111111111111111,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39DHDSXG8RW6Z"
                },
                "Date": "on November 30, 2005",
                "Helpfulness": 0.4189189189189189,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A250BI36M1IR26"
                },
                "Date": "on March 4, 2005",
                "Helpfulness": 0.21428571428571427,
                "StarRating": "5",
                "Text": "The Fabric of the Cosmos is a great book, i could not put it down."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19U92CJP6YTER"
                },
                "Date": "on September 7, 2004",
                "Helpfulness": 0.2,
                "StarRating": "5",
                "Text": "I love this book. I have manage to get through several paragraphs at a time without saying, \"Huh?\" which is remarkable considering the subject matter.  Sadly, that all changed when I reached p. 369 and a diagram of Calabi-Yau shapes. I happened to be at Denny's at the time, and while my fellow customers only looked me quisically when I turned the book round and round high over my head, they were a little less forgiving when I grasped it between my feet while doing a handstand on the table.  As I saw the waitress dialing 911, I decided this might be a good time to go home and play with my kitty. Continued. . ."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A429DV7VX17CI"
                },
                "Date": "on May 29, 2005",
                "Helpfulness": 0.3076923076923077,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GYCU6FL37D5T"
                },
                "Date": "on April 14, 2004",
                "Helpfulness": 0.4253731343283582,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UX73MYPU5HQW"
                },
                "Date": "on May 9, 2006",
                "Helpfulness": 0.09090909090909091,
                "StarRating": "5",
                "Text": "Professor Greene is right. String theory really is the best solution to all the problems of physics. He sees it and he allows us to see it too. But there are many good reasons to believe that physics itself will never see it. This is exactly the same situation that Godel exposed in mathematics: we can see what the system itself cannot see. But that's fine because deep down we all know that we are more than our systems."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 13, 2004",
                "Helpfulness": 0.40476190476190477,
                "StarRating": "1",
                "Text": "I am giving a low review not because of the writing, but for the fact there is nothing new here if you have read The Elegant Universe. I dont see why there was a need for this book since no new information about string theory, etc has come since his last book. What a rip!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A267XNIM9719UE"
                },
                "Date": "on January 29, 2012",
                "Helpfulness": 0.28,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2I5XCJSSQYWAC"
                },
                "Date": "on October 28, 2013",
                "Helpfulness": 0.1875,
                "StarRating": "1",
                "Text": "For someone who is fascinated by the cosmos but has little formal education in this area, this is a lovely book.  Brian Green is a clear, insightful writer.  His prose is dense in that each word is carefully selected.  There is no fluff yet his writing brings great clarity to a complex area of science.  I highly recommend this book to anyone who is wants to know more about this subject but who is not a scientist."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BER5T1VGBNV1"
                },
                "Date": "on July 7, 2004",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17RIV990H8I7Z"
                },
                "Date": "on June 26, 2009",
                "Helpfulness": 0.16666666666666666,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37CU9CG933RKO"
                },
                "Date": "on August 25, 2006",
                "Helpfulness": 0.125,
                "StarRating": "3",
                "Text": "I bought this book after watching the show on the discovery channel. I think the author did a great job of explaining something highly complex in the world of physics, how ever; the mathmatical fomulas in this book are out of my grasp, unless you have a solid college background in mathmatics the formulas will read more like gooble-de-gook..which is unfortunate becuase the concepts of the string theory are based on the formulas. If you are math savy this will be a great read. If you aren't than you may quickly become dissatisfied with the book . It refers to ther formulas through out the book.. good luck, best of reading. Mercy W."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALIMXQEPSHODI"
                },
                "Date": "on June 11, 2013",
                "Helpfulness": 0.16666666666666666,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CK0VXUDVXGMN"
                },
                "Date": "on April 15, 2008",
                "Helpfulness": 0.0625,
                "StarRating": "2",
                "Text": "Some interesting and enlightening parts were eventually deadened by monotonous and uninpiring overly-scientific exposition in my audio-version.  Yawn. Too heady and scientific for me. Give me Newtonian physics any day!  Reality was much simpler then.  Of course, alot of the time I am not sure this author, or anyone else for that matter, knows what they are talking about in attempting to describe, mathematically or otherwise, string or superstring theory.  YUK!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 19, 2004",
                "Helpfulness": 0.2967032967032967,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ERU005ES1IHT"
                },
                "Date": "on May 4, 2009",
                "Helpfulness": 0.13953488372093023,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31DASOKBKEQ9M"
                },
                "Date": "on November 24, 2009",
                "Helpfulness": 0.15,
                "StarRating": "1",
                "Text": "Greene is one of the better pop-science writers, but many of the examples he uses are extremely poor and bound to leave the reader even more confused. Any writer who doesn't know how (or when) to capitalize Earth (= the proper name of our planet) and earth (= synonym for dirt or soil) should not be printed in the United States."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on February 16, 2004",
                "Helpfulness": 0.15789473684210525,
                "StarRating": "1",
                "Text": "Here is how Knopf prints money.  They get a pseudo-physicist to rewrite his first book on philosophy, after he starred in a TV production centered about it.  Long-winded and boring, the wordiness serves to obfuscate the concepts.  Stick to Hawking's Brief History of Time or Einstein's Meaning of Relativity.  This books adds nothing new, and has begun subtracting.  If you're into entertainment and David Duchovney wanna-bes, watch the X-files."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AY2DIKCPE2DY6"
                },
                "Date": "on April 10, 2005",
                "Helpfulness": 0.012345679012345678,
                "StarRating": "2",
                "Text": "This book its not that it was bad written. I am one of those wholl side with Einstein when it comes to ' is that the way God would do it with Science.' I just didnt feel right going into the Quantum nonsense... If everything was in some sense connected or intervened how could we be individualized? I believe eveything takes a name shape of itself. Quantum physics no matter how hard it strives will nor surpass the entities of God's creation."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Fabric-Cosmos-Space-Texture-Reality/product-reviews/0375727205/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "419"
    },
    "Salesrank": "#4,797",
    "Timestamp": "2015-05-24 12:39:31.408054",
    "itemurl": "http://www.amazon.com/Fabric-Cosmos-Space-Texture-Reality/dp/0375727205"
}
