{
    "Category": "in Books (",
    "ListPrice": "$17.95",
    "Name": [
        "The First War of Physics: The Secret History of the Atom Bomb, 1939-1949"
    ],
    "OfferPrice": "$15.65",
    "Reviews": {
        "AverageStarRating": "4.3 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NXJDNTQK2YJL"
                },
                "Date": "on January 23, 2012",
                "Helpfulness": 0.9512195121951219,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOE0XMITAJWDT"
                },
                "Date": "on February 20, 2011",
                "Helpfulness": 0.95,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1G95M7TH5FXE9"
                },
                "Date": "on July 1, 2010",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": "I was born about the time that the Bulletin of the Atomic Scientists first featured the Doomsday Clock and lived my formative years under the threat of nuclear annihilation. I can remember many times looking at a contrail in the sky and wondering if this was finally it?  As a young adult I worked in Oak Ridge at the X-10 plant and got to see first-hand some of the artifacts of what Baggot calls `The First War of Physics'. I was in awe of the events that could have destroyed civilization. And I've often wondered how we managed not to destroy ourselves. Baggot's book is very well written and follows the important scientific, historical, and political events. His style flows well and at times makes the reading compelling almost like reading a novel. You see the ideas behind the science, the personalities that made the discoveries, and the truly frightening politics of the time. There are many events in this story that could easily lead to moralizing on the part of an author, but Baggot avoids the temptation and fairly expresses the concerns of the folks involved without taking a side. I strongly recommend this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CKCAVUTSSY4G"
                },
                "Date": "on August 4, 2010",
                "Helpfulness": 0.8461538461538461,
                "StarRating": "5",
                "Text": "I agree very much with the previous comments and conclusions of Joe Pardue \"Smiley's\" review.  My only addition would be to say that over the years I have read a good deal about this subject in books by Norris, Herken, Groves, Groueff and Feynman. This is the most complete, and yet concise, version of the story including the efforts in Europe as well as in the United States. Best of all is his unbiased approach and resistance to making moral conclusions about this complicated subject. If I could ever get my son-in-law to read it he might understand all of the facts which lead to the difficult decision to bomb Hiroshima and Nagasaki."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOMQZAS76F3V3"
                },
                "Date": "on September 3, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IR18OMDDTF38"
                },
                "Date": "on January 4, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALQ5DQK3PB4M1"
                },
                "Date": "on May 24, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Since so much has been written on the subject throughout the past 65 years, I wondered if this book had anything new to say. While I got it as a present when it came out, I left it in my bookshelf, until I recently decided to give it a chance. Although it may have some new material released after the fall of the Soviet Union, what I found most valuable about it is that it summarizes the development of the first nuclear weapons, giving proper weight to the effort in different countries. It also provides a useful time line of the events as an appendix. Being a war story, the author embeds it in the drama of the ongoing conflict, including the story of the Telemark heavy water plant sabotage by Norwegian  commandos. It also reviews under a new light the much discussed German programme, which may be interpreted differently by different people. Was Werner Heisenberg an incompetent theorist hindering the efforts of more able experimentalists, such as Kurt Diebner? There are also interesting anecdotes concerning the design of the early \"atomic piles,\" which explain, among other things, why the Germans gave up using graphite as a moderator, and instead gave such importance to the use of heavy water (they weren't aware that graphite was contaminated by boron during its production, which the Allies found out casually). In summary, although I do not think it replaces the series of books on the development of nuclear weapons written by Richard Rhodes, and multiple biographies on the protagonists, I found it enjoyable to read, and a recommend it as a reference source."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OTACCIZFQTM2"
                },
                "Date": "on February 23, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I'm a history fiend and especially love history on World War II. I've seen many Atom Bomb Documentaries and although great, none have been as detailed as this. I chose this for a book review from an approved list that my U.S. Government professor created. I am very satisfied with this selection because I was able to enjoy the assignment. I recommend this to all readers who love history."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4ZV2X8TAQZB3"
                },
                "Date": "on March 31, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "While not as good as the seminal \"The Making of the Atomic Bomb\" by Richard Rhodes, it does offer some unique perspectives and is valuable for anyone trying to learn more about the nascent atomic arms development programs."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EK7HJ4Z0CHJZ"
                },
                "Date": "on February 1, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "This was a vey interesting read. It some times bogged me Down with specifics about the science that are beyond me, but I get the reason for the need to include the detail.  The intense efforts required to make the needed timely progress and the description of the talents needed to make it happen are very well portrayed."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKDP25YBYH5UF"
                },
                "Date": "on January 20, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I was hesitant when reading my sample pages because it seemed too academic and dry for an interesting read. I've read a lot about nuclear physics and the people who discovered it but this was my first look at how their discoveries interacted with historical events beyond their control. This writer is both an excellent historian who presents detailed facts and personalities, and also offers a compelling narrative as a storyteller. Between the developing science and the unpredictable events of WWII, these scientists and political/military leaders found themselves in uncharted territory and it's fascinating to see how events unfolded in both planned and unplanned ways. Even though I know story in general, the details really bring it to life. Each personality has their own scientific agenda, political issues, family complications, and collisions with historical events that together portray history as a lived event, not some distant memory."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ADKGF5ARBC5Z"
                },
                "Date": "on January 15, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Fascinating account of the race to develop the A bomb and how it effected the scientists involved with it. I could not put the book down,"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LHB0ACEC186Y"
                },
                "Date": "on December 1, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Liked this book. Great information, interesting personal stories about the history of The Bomb, with lots of details about the world powers at the time and their methods and motivations. Got bogged down in details about the chemistry of the various bomb prototypes, which were probably very interesting/helpful for someone with more knowledge of nuclear physics. Still a great read if you are interested in the history of The Bomb."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HUGEKEHJ2PLF"
                },
                "Date": "on October 10, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I loved this book.  I enjoy reading about the history of science, and about WWII.  I had purchased a hardbound edition of this a few years ago, and after I read a couple of chapters, I purchased another copy to send to my Dad, a retired science teacher.  He also thoroughly enjoyed the book.  I was excited to see it available for the Kindle, and purchased it, even though I still have my original hardbound copy.  I have recommended this to just about everyone I know."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2J8XUT7L1X11M"
                },
                "Date": "on September 29, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A242FUBKNNK6C0"
                },
                "Date": "on September 27, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "DH is a physicist and I knew he would also love this book.  I enjoyed the insights into the scientists personal lives as well as the thorough research.  I loaded it on to his computer as well and he, who is not normally a reader of long books, finished it before I did.  He found it to be excellent as well.  This is not a book just for those with a scientific background but, for anyone who has an interest in the history surrounding atomic weapons!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14DUH2GX8QJ5B"
                },
                "Date": "on January 8, 2015",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "Overall, a pretty good book.  It was definitely interesting to read about all of the different players in the development of the atom bomb though at times it seems like some names were sprinkled in \"just because\" with nothing more about them than one sentence or two.  I think I would have enjoyed it more if it had more of a narrower focus.  But then again, Baggott did set out to try to write a comprehensive book which he successfully accomplishes."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Q7IDDAR2T3AM"
                },
                "Date": "on October 6, 2010",
                "Helpfulness": 0.6363636363636364,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A77E9D2TZI4BZ"
                },
                "Date": "on July 4, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent historical review of the development of the atomic bomb with moral, social, and political ramifications for those who would continue its development even after the bombings of Hiroshima and Nagasaki."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33LJRS47FTZZD"
                },
                "Date": "on April 23, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This is a very nice comprehensive compilation of the many elements that contributed to the MAD race between two superpowers, the basis for several decades of international policy. This account illustrates the complexity of the intertwining of World War II, the physics of the technical issues, the political paranoia, and huge costs of the pursuit of war preparation. Combining all these makes for a fascinating story, sometimes chilling, in the realization that minor turns of events could have taken the world down a very different path. The fact that the author's opinions surface on occasion does little to detract from this fascinating account of facts. This is a recommended read to help understand the major drivers of the last half of the 20th century."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZNJFKGLOKP7Y"
                },
                "Date": "on February 20, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Basic Book,at least 5 stars - Great subject!  Could be offered in schools  during the introduction of the formal education days."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RIPE8QOHXGJ7"
                },
                "Date": "on January 22, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Clear enough for a layperson without being dumbed down.  Fascinating portraits of the mighty ones in the world of physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIKLBADN5MNT1"
                },
                "Date": "on December 8, 2013",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "This was a very readable and informative work. Yet it was not overly technical for the layman. Good as an overview of a broad range of material."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17OVF20I04YXK"
                },
                "Date": "on December 8, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "An interesting read. The story of the A bomb project from a slightly different perspective. This was not only a project to build something that had never been built, it was also a race of discovery. The real project was to understand the nature of the processes they were trying to harness."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1303IU9RZE9MU"
                },
                "Date": "on December 3, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This covers the progress from the discovery of nuclear fusion to the atomic bomb, It covers the efforts in most of the major countries that were involved, and shows where some efforts succeeded and why, while others failed, and how much was acquired by out-and-out spying."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OEHJE4QY653M"
                },
                "Date": "on November 22, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Insights into the history of the nuclear weapons that I'd never been aware of or never saw them in a complete context. This one is is a \"must read\" for history buffs. (and there's a lot in there for the scientist as well, couched in terms that even the layman can understand)."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A129OQZEZVUGP0"
                },
                "Date": "on November 5, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Very good book. I have heard about how the physists tried to slow things down. But it is nice to know how they did it. Every body needs to read this book, to know what these people where tring to do."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVN4B0UI2MPXZ"
                },
                "Date": "on November 2, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Very interesting read!  Quite a bit more detail than \"The making of the Atomic Bomb\"  by Rhodes. Especially the early contribution re heavy water and work done by the German physicists."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SFO8QXYO6GIS"
                },
                "Date": "on October 30, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I like the book.  It covers an era I knew almost nothing about--the race to build the A-bomb, which helped to end WWII.  I wasn't ready for all the scientific lingo--it is a bit much.  BUT---the story continues on.  Get through all of that, and there was a lot of drama, well detailed by the author.  I do recommend it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACBH6ZPF4IZ14"
                },
                "Date": "on October 4, 2013",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "When he sticks with physics the book is enjoyable. The divergence to spy stories and WWII history (in precis form) lessens that ejoyment."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QCE9HKG0AQ8D"
                },
                "Date": "on October 2, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Decent read but long and tedious. Goes back and forth between what was happening in Britain, Germany, Russia, and the USA, and can be hard to follow."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EZ96CV9RMG9J"
                },
                "Date": "on September 26, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I didn't remember much of the story of the Atom bomb from my history lessons from school so when I started reading I was hooked right away. The story is well written and reads like a good fiction novel except it's all real history. I highly recommend."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AY5MG156XP8CI"
                },
                "Date": "on September 6, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "While much has been written on the Manhattan project and US-UK nuclear scientists, this is the first book that takes full advantage of the previously sealed files of Hitler's and Stalin's efforts to develop a nuclear weapon. The book describes the fascinating race to the bomb, with scientists on each side guessing where the other side was scientifically and technically. The ambiguity of information about the Nazi effort allowed US-UK scientists to push for the Manhattan project, convincing Roosevelt that the Germans were far more ahead than they were. The rivalry, mostly secret, between US and UK is another great story."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AI4WJAOFZI4AP"
                },
                "Date": "on May 2, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This account of the history of the atomic bomb is fascinating and is read like thriller. Jim Baggot succeeded to weave all the different stories that happened in tandem between the Soviets, the Germans, the British and the Americans with the physics explained in layman language as well as the spies and their contacts and also to make sense of all this information in a well written book. Understanding the chronology of events is rather tricky and Baggot made this seem like an easy task. For those who had difficulty following the events, there is a timeline at the end of the book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CDYJR0WIP720"
                },
                "Date": "on January 21, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A361Q2MU7RJSTH"
                },
                "Date": "on September 4, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The history of the technology is fascinating by itself but the story of how the history of mankind makes a quantum change with the impact of having to live with the technology provides a chilling retrospective for those who lived through its worst days of the \"cold war\""
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VZ6WMI9YMF0T"
                },
                "Date": "on January 25, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CUGOWBI5L68S"
                },
                "Date": "on March 1, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent survey of the thinking and personal struggles that went into the Manhattan Project and post WW II efforts to contain nuclear weapons."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25OZ5M3OVZJ06"
                },
                "Date": "on June 8, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Good summary of concurrent bomb progress. Not much on technical problems. Enjoyed writing stule and additional notes.  Gave to friend."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10OFN0A2BB3DM"
                },
                "Date": "on December 3, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Excellent chronology and narrative.  Offers a very good insight into the many aspects of early nuclear development."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IDJYOJVH03HD"
                },
                "Date": "on October 22, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Exciting like a good novel, while revealing the complex minds of some of our great thinkers of that era."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KMODKUA7UCCI"
                },
                "Date": "on July 17, 2012",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Jim Baggott considers both points of view in this book: is the physisist responsible for the devastating horror of the atomic bomb or is this discovery in many ways a boon to mankind? The author takes us from the inseption of the idea to the actual releasing of the atoms causing the mighty explosion.  He explores the questions: was this really necessary, would Japan have surrendered before this action,  did politics play a part in the decisions made and how will this impact our future?  The book was well written.  Jim Baggott is fast becoming one of my favorite authors."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1URJWIH9Y1OAG"
                },
                "Date": "on March 26, 2013",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": "Excellent book on the history of the atomic bomb.  Not enough about the Manhattan project but overall was great! !"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PV2ENAEYXQ0G"
                },
                "Date": "on September 9, 2010",
                "Helpfulness": 0.5901639344262295,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18SWKJYK4HTZ9"
                },
                "Date": "on March 7, 2013",
                "Helpfulness": 0.16666666666666666,
                "StarRating": "3",
                "Text": null
            }
        ],
        "ReviewUrl": "http://www.amazon.com/First-War-Physics-History-1939-1949/product-reviews/1605981974/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "45"
    },
    "Salesrank": "#905,284",
    "Timestamp": "2015-05-24 13:46:59.480718",
    "itemurl": "http://www.amazon.com/First-War-Physics-History-1939-1949/dp/1605981974"
}
