{
    "Category": "in Books (",
    "ListPrice": "$13.99",
    "Name": [
        "Exploring the World of Physics: From Simple Machines to Nuclear Energy (Exploring Series) (Exploring (New Leaf Press))"
    ],
    "OfferPrice": "$12.97",
    "Reviews": {
        "AverageStarRating": "4.4 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEBOXQHZU4Z9P"
                },
                "Date": "on August 6, 2009",
                "Helpfulness": 0.9545454545454546,
                "StarRating": "5",
                "Text": "I bought this book for my 12 (almost 13) year-old son so that he could study Physics on his own over the summer.  He really seems to enjoy the book, he carries it with him on drives, etc. and now spouts physics facts at the breakfast table.  He chooses this book over Wii and TV.  Now THAT'S kewl!  I highly recommend this book - for adults too."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IIB10X0CECYV"
                },
                "Date": "on December 8, 2010",
                "Helpfulness": 0.9411764705882353,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WWEW0XR5M2T3"
                },
                "Date": "on February 6, 2007",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": "I bought this book for my High School daughter, to prepare her for her physics class.  It's an excellent starting point for physics, covers most of the basics.  While her teacher spends most of his time lecturing against our President and the war in Iraq, my daughter has learned more from this book than in the classroom.  It's laid out much better and covers more than her school textbook.  Highest recommendation!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CBCVHIK3G76X"
                },
                "Date": "on November 27, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EQIYTD6B2GZB"
                },
                "Date": "on May 12, 2010",
                "Helpfulness": 0.9090909090909091,
                "StarRating": "5",
                "Text": "This book makes the world of physics very pleasant due to the way of the themes are shown. The correlaction between the nature with the history of the concept discovering by the reknown scientists make the physics a simpler game of watching the surrounding nature. Practical examples are great and substantial. The author was wise of type writing such as the way he did, mixing history, complex / simple concepts and gathering all of these in a structured way. It is not a sophisticated physics book with several formulas e integrals but rather a good and interesting wide introductory view of physics"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RS3THSVN2C7O"
                },
                "Date": "on November 23, 2010",
                "Helpfulness": 0.875,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1D5ODSAQ7LJ5E"
                },
                "Date": "on November 9, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I have homeschooled for 12+ years and used John Hudson Tiners' books for both my newly graduated homeschooler and now my younger homeschooler. They are wonderful!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2C7YI6TJYGZQP"
                },
                "Date": "on February 7, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXI8HA4AAVS9B"
                },
                "Date": "on March 7, 2012",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "4",
                "Text": "I purchased this book for my son for browsing at home whenever he is interested in reading more about physics. It might be somewhat difficult for a third, or fourth-grader. However, I am somewhat troubled by the lack of diagrams that show vectors for forces and really very minimum number of equations. I would expect that at sixth grade level some equations should be introduced as regular material, and more complex equations as optional material for interested dedicated students. Furthermore, I am deeply troubled by reviews that recommend this book as review or even primary text in a high school. Perhaps my opinion is distorted because I grew up in Europe and did not go through our educational system at home. If so, then I will update this review as my son will go through it, and me watching him doing so. For now, it is a great book for a dedicated fourth-grader but not much beyond that."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SD3E6FIS6CS9"
                },
                "Date": "on January 4, 2011",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GADADGKB916X"
                },
                "Date": "on April 21, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This series is wonderful.  I love the Biblical references throughout it.  My kids get to learn real facts without being indoctrinated with someone's theory."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARN8PPEZRHJDV"
                },
                "Date": "on August 17, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "My son used The History of Medicine by John Hudson Tiner in his 5th grade homeschool year and it was very interesting.  He looked forward to reading that book together every day so when I got him a physics course for 7th grade I was really interested in using this text also.  Just from quickly perusing the book, it looks a little more involved than The History of Medicine and has experiments also.  Should be a good 7th grade text."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABT5KTG6RSD73"
                },
                "Date": "on September 8, 2010",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "This book is perfect for fun-loving physics.  My children love it.  It brings the subject to life and therefore to love!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19JC1S9VCDEKI"
                },
                "Date": "on January 17, 2015",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "2",
                "Text": "Love this author but this book was over our heads. Probably more written for high schoolers."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PVMU0UJVCCML"
                },
                "Date": "on January 17, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Love the Exploring the World of....... books."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7A01Y50214JY"
                },
                "Date": "on January 31, 2013",
                "Helpfulness": 0.44,
                "StarRating": "1",
                "Text": "I ordered this book for my 13 y.o. son thinking it was a pure science book -- only to discover to my surprise that it espouses a religious perspective. I am disappointed -- and amazed -- that this was not made clear in the description. Science from the Bible? Perleeze."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Exploring-World-Physics-Machines-Nuclear/product-reviews/0890514666/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "16"
    },
    "Salesrank": "#172,496",
    "Timestamp": "2015-05-24 12:30:14.861993",
    "itemurl": "http://www.amazon.com/Exploring-World-Physics-Machines-Nuclear/dp/0890514666"
}
