{
    "Category": "in Books (",
    "ListPrice": "$16.00",
    "Name": [
        "Mysticism and the New Physics (Compass)"
    ],
    "OfferPrice": "$13.07",
    "Reviews": {
        "AverageStarRating": "4.5 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20J3ZBA78FDB4"
                },
                "Date": "on September 4, 2002",
                "Helpfulness": 0.9627329192546584,
                "StarRating": "5",
                "Text": "Talbot opens the book with an introduction that gives the reader some idea of where he's going.  The first several chapters lay down a quick ground work, introducing the reader to the old physics' universal precepts.  He then goes into what new areas of quantum research are uncovering and postulating, and ties it in with mostly eastern mystical thought: Tantra, Buddhism, and the in-betweens.  He makes references to specific cases, specific theories, and specific thinkers, past and present.  The work is overall well written and well cited, very coherent and unesoteric.  I recommend the book to anyone looking for an explaination for what they can't explain and who is not satisfied with occidental mythoi."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AS75I8PEDM1BO"
                },
                "Date": "on March 15, 2007",
                "Helpfulness": 0.9411764705882353,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DWUM6SN3N3NR"
                },
                "Date": "on April 6, 2004",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OJW07GQRNJUT"
                },
                "Date": "on June 27, 2011",
                "Helpfulness": 0.9230769230769231,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30195K1BJYGXV"
                },
                "Date": "on November 11, 2006",
                "Helpfulness": 0.8636363636363636,
                "StarRating": "5",
                "Text": "This book will really give you a new perspective on the world in which you live.  It is a great introduction to quantum physics that is written, to the extent possible, in unpretentious, layman's terms.  One caveat: If you read this book, you may start to believe that anything is possible."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21XIH30B30KAJ"
                },
                "Date": "on January 11, 2007",
                "Helpfulness": 0.8,
                "StarRating": "5",
                "Text": "First read the Holographic Universe and was entralled because I see or have worked with wierd things before and after Reiki. His examples made sense, all getting back to quantum physics. Now comes a book to refine the info in the Holographic Universe as related to the unexplained in mysticism. Well done, both are must reads for some leads to explanations of how it all works, which is not at all like we were told!  Peggy Griffin"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARI04OH11T1P8"
                },
                "Date": "on March 13, 2007",
                "Helpfulness": 0.7777777777777778,
                "StarRating": "5",
                "Text": "I love this book, and am very surprised its not a lot more popular. Talbot doesn't dance around the subject like more other authors and books do! He gets straight to the point with very informed and powerful concepts. I often find it burdensome to have to deal with an authors \"filler\" material, and if I can speak for myself, I want to get to the point, and then relate that point to different perspectives. Excellent book and probably one of the top 5 books I've read out of about 30 or so. If your at all interested in the topic, pick it up!"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on September 6, 1999",
                "Helpfulness": 0.7037037037037037,
                "StarRating": "4",
                "Text": "A truly amazing book. although i found this book a little hard to understand but once i got used to the language i found it very interesting. It says \"world is an illusion' and through different philisophical and  physical phenomenon has proven it to be correct ( atleast to me). a really  good bokk the reader has to wear the writers shoes in order to understand  it and enjoy it to its fullest"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JDRS1LDLRKRT"
                },
                "Date": "on October 31, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHID0KTMHW9HR"
                },
                "Date": "on May 2, 2014",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "I chose this book because it seemed a likely volume for a layman who is interested in quantum physics to read.  It is not exactly to my personal taste but don't let that stop you, especially if you are a New-ager.  This book could be right up your alley..."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APU1QDNJN8KDY"
                },
                "Date": "on January 31, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Excellent book on Quantum Mechanics and Mysticism. It is a simple explanation for a person who doesn't understand the complicity of such matters, but wants to know more."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AU9JQT5YWV1MT"
                },
                "Date": "on October 29, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "This is not a light read. College+. Very pleasurable. I see application across multiple fields of faith and science. Philosophy students will love it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALYI1KY4YYYVX"
                },
                "Date": "on October 13, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "My favorite book was written by this author \"The Holographic Universe\". This book did not disappoint as I found myself not able to put it down. I would not rate it better than Holographic Universe but it was definitely a great read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FTIJAYSUZ9QA"
                },
                "Date": "on January 24, 2011",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "5",
                "Text": "The author brings much into light what science and mystics seem to be meeting slowly in time, that all is dream like existence, all is mind of minds. Nothing is real, all illusions of light, energy, mind. All this in nut-shell."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34ZV1MHRP71S2"
                },
                "Date": "on July 2, 2006",
                "Helpfulness": 0.6875,
                "StarRating": "5",
                "Text": "I read this after I read Holographic Universe. Both were very good books. I recommend them highly!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AF2OLII42Z860"
                },
                "Date": "on February 13, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Michael Talbot was a great writer and deep thinker. Thoroughly enjoyed his explanations and the pairing of mysticism and physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A56WZYF7JPAVI"
                },
                "Date": "on November 8, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Another view to see."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QD1Z71UTOZCR"
                },
                "Date": "on February 9, 2013",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Whether you're adept in the field of physics, or metaphysics; or just someone wanting to gain more knowledge about either subject.  This book is an excellent read.  It is understandable for the beginner, and opens new doors to different ways of thinking about certain subjects.  At the same time, if you already have much knowledge in the fields of metaphysics and physics it will not lull you to sleep.  This book makes comparisons that will get you thinking and keep you reading more."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DGQ0QHV0UTL9"
                },
                "Date": "on December 27, 2012",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "This book is fun to read and gives a completely new perspective to many ideas that we accept as true. It is long enough to give good explanations and short enough not to be overwhelming. I read it after taking a short course in modern perspectives of reality, and along with the course it has helped me to view many things in a different light. Definitely worth checking out."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18NG3KV4QYB4N"
                },
                "Date": "on May 7, 2013",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": "This book is fine for beginners as it provides a quality overview of the discoveries of quantum physics and its effect on the beliefs of spiritually-oriented readers. Way too basic if you know anything about the subject."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFTEA2VNRIF0A"
                },
                "Date": "on March 10, 2013",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGH22LH74Z4OE"
                },
                "Date": "on September 2, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "great"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2B9EPZNDQ41GA"
                },
                "Date": "on December 5, 2014",
                "Helpfulness": 0.5,
                "StarRating": "2",
                "Text": "I was expecting this book to be just as easy to read as \"Holographic Universe\", but boy was I wrong.  I think this book is a little heavy on the science and everything is so technical."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12XS85MU6YO11"
                },
                "Date": "on June 19, 2013",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "This continues to satisfy my need for a coming together of sciene and spirituality.  This is an excellent book which is also easy to understand."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LS84B7L2REN0"
                },
                "Date": "on August 28, 2009",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "By relating Mystic teachings to the quantum physics explains how we are projecting our world from the mind of ego.  If you want to know the truth about this world, look into the Course in Miracles teachings.  I recommend Gary Renard."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11FTREGHBT1U8"
                },
                "Date": "on January 17, 2015",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "fine"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADZUIDMLOV24W"
                },
                "Date": "on January 31, 2015",
                "Helpfulness": 0.0,
                "StarRating": "1",
                "Text": "Credintials don't make truth."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QBGTMWN65TPE"
                },
                "Date": "on April 29, 2000",
                "Helpfulness": 0.2540322580645161,
                "StarRating": "5",
                "Text": "this book likes to do the same thing over and over again. tell you about some bizarre concept that mystics have had for thousands of years, and then tell you that the new physics backs up those concepts. you keep thinking, 'maybe this time physics will be completely at odds with this bizarre  concept.' but no. so as you can see it gets kind of predictable. but maybe  ive given away too much. oh well, i might as well tell you a little more  while im at it. none of this is real. so why does it seem real? what  exactly is it that seems real but in reality is not? what is real if  anything? and what is it that thinks its perceiving reality? and this  process of thinking, is it real? and this word process, is it valid? or  does its implication that time is passing destroy its validity? all these  questions are raised, answered, explained why they are not valid questions  and then dismissed. TRUTHTRUTHTRUTHTRUTHTRUTHTRUTHTRUTH. read up children.  youll either find new wonders all around you or kill yourself or turn into  pure energy."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Mysticism-Physics-Compass-Michael-Talbot/product-reviews/0140193286/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "28"
    },
    "Salesrank": "#168,508",
    "Timestamp": "2015-05-24 13:00:24.879432",
    "itemurl": "http://www.amazon.com/Mysticism-Physics-Compass-Michael-Talbot/dp/0140193286"
}
