{
    "Category": "in Books (",
    "ListPrice": "",
    "Name": [
        "Introductory Physics with Calculus (as a Second Language ) Mastering Problem-Solving"
    ],
    "OfferPrice": "$41.93",
    "Reviews": {
        "AverageStarRating": "3.9 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KMG60MNDWO5S"
                },
                "Date": "on November 16, 2007",
                "Helpfulness": 0.8888888888888888,
                "StarRating": "4",
                "Text": "Although I suspect the 5 star review is by someone with the company, this book is actually pretty good. Each chapter covers some of the more common problems you will come across along with some very good diagrams. The visual component of this book is one of its strengths. It is by no means a comprehensive book and I'm sure there are more challenging problems out there. Overall it does a nice job of focusing on what you need to know. That being said I think it was a little over priced. The book is pretty small and it doesn't cover topics like fluids or harmonic motion. If it was 15-20 I would give it 5 stars."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVMLMV2SSPY65"
                },
                "Date": "on January 29, 2011",
                "Helpfulness": 0.7777777777777778,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26D81P57UK690"
                },
                "Date": "on September 28, 2008",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "5",
                "Text": "I've had a tough time trying to make use out of the heavy textbooks and workbook problems that never seemed to help. The amazing thing with this book is that it keeps it on a simple level and breaks every concept down. It teaches you to recognize certain problems instead of trying to pull your hair out with an ugly set of data. I know there are others out there trying to solve the physics crisis but this is the tool for the job. Sure I will use the heavy text for reference but when it comes to solving actual problems this book is the one. It has equations that are not as complicated as the textbook ones and tells you which ones to use where and in what case. From the early kinematics to mixed circuits this book does it all. I would have to say that it is worth it's weight in gold, to be honest."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RZN2U1QI5LL4"
                },
                "Date": "on January 27, 2012",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "I have a terrible professor.  I found this book more helpful in explaining the basics than he is.  I do not by any means think this book is a replacement, but it helped for sure.  We are using only my professor's own material, it is all online and mostly the equations and very little explanation. This helped and I think it would be very nice to have to complement a traditional text book.  As a whole the second language books are great!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZXATX4EEI4F0"
                },
                "Date": "on April 11, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DHMZ3FCQXCSB"
                },
                "Date": "on April 18, 2015",
                "Helpfulness": "",
                "StarRating": "1",
                "Text": "If you are taking physics with calculus for the first time in a university, this book will not help you! It is a basic view of physics with no explanation of the concepts. It explains the VERY basics of physics. It does not help with anything past circular motion. This is not the book if you are struggling. If you are struggling, however a tutor is the most helpful and finding a book with multiple practice problems and solutions that are thoroughly explained."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AW7FNPH4VBICX"
                },
                "Date": "on January 13, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I bought this book just before taking a university physics course. I must say that the examples reiterate the material very well, and emphasize the important points from example to example. Although the book is limited to specific topics (i.e. it does not cover thermodynamics among other things), I felt it was thoroughly organized and concise. It helped immensely."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BA639J74D33B"
                },
                "Date": "on May 13, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "It was delivered with a REALLY big crease in it, which is a shame. The book itself is very good for people trying to learn (or teach!!) physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXYFQ6SEO5VK1"
                },
                "Date": "on June 1, 2008",
                "Helpfulness": 0.25,
                "StarRating": "4",
                "Text": "I have looked for a book on physics with calculus and found a great shortage of them.  There are alot of College Physics supplmental books but very few University Physics ones.  Having used the series for Organic Chemistry I would reccoment the series."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Introductory-Calculus-Language-Mastering-Problem-Solving/product-reviews/0471739103/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "9"
    },
    "Salesrank": "#386,130",
    "Timestamp": "2015-05-24 13:31:39.941138",
    "itemurl": "http://www.amazon.com/Introductory-Calculus-Language-Mastering-Problem-Solving/dp/0471739103"
}
