{
    "Category": "in Books (",
    "ListPrice": "",
    "Name": [
        "The Physics of Love: The Ultimate Universal Laws"
    ],
    "OfferPrice": "",
    "Reviews": {
        "AverageStarRating": "4.2 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GSVD95QPE1BV"
                },
                "Date": "on May 16, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Let me begin by saying, this book is NOT what you think it is.  At least it wasn't, for me.  I was expecting to read a book on love-relationships, and got a book proving the existence of God and how the universe was formed.  I couldn't put it down, but I had to read each chapter twice.  If I were not in the work, I am in, which is ALL about energy, vibration, waves, oscillations, etc. I would probably never have finished it.  I think the title is misleading, though I do understand why it was chosen.  In the end, I can honestly say, I don't know many people who I could give this book to who would enjoy or even complete it, but for those who do, it's worth reading, especially if you are a \"thinker\" and have a spiritual consciousness.  I understand God and the physical universe as I never did before, and I really appreciate the wisdom it imparted!  This is not a book to give as a gift, unless your recipient loves science and physics!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KQT78NCEACNR"
                },
                "Date": "on August 25, 2008",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1E6BYR3U3TOP8"
                },
                "Date": "on March 7, 2009",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I love this book, which outlines the metaphysics of John Keeley.  Although 100 years old, Keeley's ideas shed light on recent theories in quantum physics and simplify complex concepts.  Students of Oriental philosophy will find his ideas resonate with studies on meditation, also.  I recommend this book to everybody."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2A0ZAN2HONUZ4"
                },
                "Date": "on February 24, 2008",
                "Helpfulness": 1.0,
                "StarRating": "2",
                "Text": "originality that is.  What it turns out to be is a rehash of qabalistic correspondences that lack any sort of depth. Was expecting a lot more than superficial association of ideas."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on November 21, 1998",
                "Helpfulness": 0.6545454545454545,
                "StarRating": "1",
                "Text": "To be fair to this book, I must admit I have not read the entire book in detail...though the reason is that I found the book unreadable. I borrowed the book from the library, as I was reading a number of texts dealing with  the philisophical implications of quantum physics, but was dismayed to find  this book is a hodge-podge of 19th century physics and 20th century  'new-age-rhetoric'.  Perhaps an exerpt from the section dealing with  colours will give a clue to the writing style:  Red is the male force.  This color is represented by C and C#.  The male force is expansive,  energetic, doing, building, expressive.  Red is the color given Adam, the  first materialized Man.  This is the beginning point of material  manifestation.  Energy always manifests in a triangular fashion, i.e., a  single source manifesting in a dual nature or way.  Hence from this  position the next color to be manifest is Blue or the female color.  This  has been eternally symbolized as Eve taken from the twelfth rib of Adam."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MUM7CFKX80B4"
                },
                "Date": "on September 11, 2003",
                "Helpfulness": 0.6470588235294118,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RWL6MHN4OM1A"
                },
                "Date": "on December 16, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "VERY LITTLE THAT IS WRITTEN....COMPILATION OF CAYCE...TO TESLA .NOT TO BE READ....MORE LIKE A JAW BREAKER....MAY, TAKE A LIFE TIME TO UNDERSTAND,THE MAJOR THINKERS OFTHE PAST.SCIENCE,PHYSICS,INTUITION....GLAD TO HAVE IT,IN MY COLLECTION. G"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUOM3W19D0DWO"
                },
                "Date": "on April 12, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The book in excellent in its scope of the material that is covered. I am just in the first part of it and it has met more of what I expected of it. It is very well written and it is going to be of much help to me!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1H8W9B2ZEEMI1"
                },
                "Date": "on February 8, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Because it Just IS!! :-) Look into the Science of the most fascinating Universal Laws through out human history. NAMASTE."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TWI4PMQAHJ0Y"
                },
                "Date": "on October 31, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "AMAZING Book INDEED!!! ;-)"
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Physics-Love-Ultimate-Universal-Laws/product-reviews/1572820020/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "10"
    },
    "Salesrank": "#976,721",
    "Timestamp": "2015-05-24 13:35:05.611959",
    "itemurl": "http://www.amazon.com/Physics-Love-Ultimate-Universal-Laws/dp/1572820020"
}
