{
    "Category": "in Books (",
    "ListPrice": "",
    "Name": [
        "The Complete Idiot's Guide to Physics, 2nd Edition"
    ],
    "OfferPrice": "$18.95",
    "Reviews": {
        "AverageStarRating": "2.7 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IALM0HWEGCSG"
                },
                "Date": "on December 28, 2006",
                "Helpfulness": 0.8181818181818182,
                "StarRating": "2",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXNQA0DRXZIUU"
                },
                "Date": "on January 27, 2011",
                "Helpfulness": 1.0,
                "StarRating": "1",
                "Text": "I think the only reason why this book has a few good reviews must be because the authors themselves wrote them. The book was decent until about the 3rd or 4th chapter. There were many mistakes in the calculations which made it hard to learn. Was I wrong or was the book wrong? I don't know because the appendix only comes with (sometimes incorrect) answers and not explanations! This book also has a few formulas that were either a) incorrectly followed by the author or b) very complicated with steps that are not obvious THAT THE AUTHOR SHOULD HAVE EXPLAINED. Seriously, the book is called The Complete Idiot's Guide to Physics. The author should assume that the reader knows very little about the subject. Don't buy this book. Borrow it from the library and take it back when you get to the part where the authors got tired of writing (ch3-4)."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A68P9EZD00BK7"
                },
                "Date": "on April 13, 2010",
                "Helpfulness": 1.0,
                "StarRating": "1",
                "Text": "I bought this book five years ago and recently picked it up again. I remember now how frustrating it was to read because I wrote those frustrations in the margins. The writing is awful and unclear, and the writer seems to think that he is hilarious. With all due respect to a National Teacher of the Year, the guy is just not funny. Maybe his classroom was, but not this. I would recommend that no one ever buy this book again so that it can go out of print and not be seen in bookstores for some unsuspecting person to buy. Please, PLEASE, do NOT buy it!!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANEOGMW9XBE13"
                },
                "Date": "on October 5, 2010",
                "Helpfulness": 1.0,
                "StarRating": "1",
                "Text": "Having wasted money several times purchasing books in the \"Complete Idiot\" series, I will only borrow them from the library when no other books on the subject are available.  This book is a prime example.  It fails to completely explain the sample problems it uses and makes references to places in the book that don't exist.  There are errors in calculations in the sample problems that were driving me nuts till I read other reviews which revealed I was not the problem."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACZJ5VN5L0HUG"
                },
                "Date": "on April 2, 2009",
                "Helpfulness": 0.75,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10NA26XDRJYUT"
                },
                "Date": "on April 3, 2014",
                "Helpfulness": 1.0,
                "StarRating": "2",
                "Text": "If you are reading this book as a intro to physics review, it is fairly useful.  But, if you try to follow through with the exercises, you may notice that some answers given the in the back are flat-out wrong.  If you are at all shaky on math, this will undermine your confidence.  I looked for errata at the publisher's web site, but evidently 'idiots' don't need no stinking errata."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABPXOGD5GVCNS"
                },
                "Date": "on February 14, 2013",
                "Helpfulness": 1.0,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EDLI3D8MOSUA"
                },
                "Date": "on April 14, 2009",
                "Helpfulness": 0.5,
                "StarRating": "2",
                "Text": "Just to be clear, I didn't read this book because I had to or that I was trying to supplement for a college text, I read it because I am interested in the subject and had some spare time to spend on it.  I didn't have tests and deadlines to go with it so I had time to reall.y study it.  In spite of that I could only make it to page 85.  I put a lot of time into this book with pencil and paper working out the calculations and so forth and I thought it was great at first, until I noticed that the author published the book before proof-reading for mistakes.  One thing I've learned is that Physics is a fairly exact science.  This requires mathematic rigor, and to fly through a topic as if the reader is already familiar with it, or worse, to blatantly make a mistake in calculations, isn't something I have enough spare time to forgive.  I'm giving it two stars though because as of yet I'm not familiar with any book which can introduce a person to physics that is better than it.  It is good in that respect but it's not worth the headache of putting up with a teacher who routinely makes errors.  Doing physics calculations can be a major migraine within that context so it's a two-star book.  Hopefully soon I'll find something better than it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJXTEGHJ2E9VC"
                },
                "Date": "on June 8, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I never had the chance to take physics in school. Now i can learn what i missed. Easy to understand and can now construct my own irridiun Q35 space modulator. Take that Buggs Bunny"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DPQDCXELLDY8"
                },
                "Date": "on April 12, 2009",
                "Helpfulness": 0.5,
                "StarRating": "1",
                "Text": "It's hard not to make some very derisive comments about this book, because it is a horribly written and organized book.  There are very few examples given, no review of the material and/or testing of comprehension by the \"complete idiot\" who may be reading the book, and concepts are poorly introduced and clarified.  In my estimation, this book is a waste of hard-earned money.  To be honest, I've had the same experience with every \"Complete Idiot\" book I've purchased, and I have, now, purchased my last one."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANY29HQFFAKXT"
                },
                "Date": "on September 12, 2009",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Added to Library with other books to help communicate ideas and thoughts to kids.  Variety in communicating is a great way to see other angles to help kids figure out how things work."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AO28HXLDIYO0F"
                },
                "Date": "on April 16, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Very fast shipping and great price!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1H1H671I88V5H"
                },
                "Date": "on September 6, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Easy read...clear and informative!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31R2S3BOM64B8"
                },
                "Date": "on October 30, 2009",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "Book is not as easy at it promotes itself. Explanations are few, and a lot of background info in just not there. It helps, but now what I expected."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EA8VJHPHM5TA"
                },
                "Date": "on January 17, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "The book is in great condition and for the price I would buy another just to have a second copy."
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Complete-Idiots-Guide-Physics-2nd/product-reviews/1592575315/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "15"
    },
    "Salesrank": "#132,593",
    "Timestamp": "2015-05-24 13:09:36.173230",
    "itemurl": "http://www.amazon.com/Complete-Idiots-Guide-Physics-2nd/dp/1592575315"
}
