{
    "Category": "in Books (",
    "ListPrice": "$17.00",
    "Name": [
        "The Particle at the End of the Universe: How the Hunt for the Higgs Boson Leads Us to the Edge of a New World"
    ],
    "OfferPrice": "$11.73",
    "Reviews": {
        "AverageStarRating": "4.6 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36A9HWQ9U1IK4"
                },
                "Date": "on November 14, 2012",
                "Helpfulness": 0.9742765273311897,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EOXM92R5UWUY"
                },
                "Date": "on November 14, 2012",
                "Helpfulness": 0.9431818181818182,
                "StarRating": "5",
                "Text": "Sean Carroll is a great writer, with his own brand of penmanship. He elegantly introduces particle physics without the mathematical jargon that can be confusing to some scientifically illiterate readers, which is a good thing if his goal is to explicate this topic to the masses. It does contain some repetitive info though, especially if you have already browsed through a bunch theoretical physics books. However, Sean Carroll's book does have an advantage, since the discovery of the particle, that seems to be the Higgs boson, was just around the corner. If you are interested in particle physics, amazed by the standard model's newly discovered member, and eager to fill your curiosity bucket with as much information as possible, than this book is a must read for you."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YNX1N7AA76SP"
                },
                "Date": "on November 29, 2012",
                "Helpfulness": 0.9545454545454546,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2N0J8Q166NPPB"
                },
                "Date": "on December 5, 2012",
                "Helpfulness": 0.9629629629629629,
                "StarRating": "5",
                "Text": "I have read other Kindle books and singles.  I have watched Youtube videos and lectures on Particle Physics.  This book presents the information in a way as to not treat us like the reader is  in Junior High.  But unlike the books that get very technical about super symmetries, it is very easy to read.  It is rare to find a book that has both of those qualities; Easy to follow and good/deep/technical information."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VP7JOT3K7PFM"
                },
                "Date": "on March 23, 2013",
                "Helpfulness": 0.8947368421052632,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IU9VPCBKZPE8"
                },
                "Date": "on July 25, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJNF3QAVKQ26Q"
                },
                "Date": "on July 15, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKN6RCE4N29HJ"
                },
                "Date": "on January 28, 2014",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "This book was helpful to me as a non-scientist, but I found it somewhat chaotic in its presentation. Some events were presented redundantly, especially the events around the discovery announcement. The book is mostly good in using understandable terminology, with a few deficits. The term \"spin\" is used repeatedly but isn't clarified until late in the narrative. The evidence for particles such as gluons is skimpy in this book, perhaps intentionally, but the author at times assumes the reader is familiar with them."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RTSTN2JLG3GI"
                },
                "Date": "on December 5, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Very well written without heavy math yet one can get a deeper understanding of a weak force, broken symmetries, the background of the discovery. Easy reading, very knowledgable author makes all the difference. At last a new book related to latest in physics focused on the concept of Higgs field puts the \"God particle' in the proper perspective."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24505CR98NLLV"
                },
                "Date": "on November 24, 2012",
                "Helpfulness": 0.7741935483870968,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35FGIR6K51PS5"
                },
                "Date": "on December 21, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QZ3EJK0XE5UR"
                },
                "Date": "on December 19, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Sean does a fantastic job of keeping this material approachable and not-too-technical for the layperson.  However, that doesn't mean it's dumbed down or trivial.  Get a front row ticket to the history of particle physics and collider politics from an engaging and thoroughly readable author."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UJSC9IKYXGBM"
                },
                "Date": "on July 10, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXX8NU769BXKK"
                },
                "Date": "on January 18, 2014",
                "Helpfulness": 0.8571428571428571,
                "StarRating": "5",
                "Text": "This book was requested as a gift by a 16 year old high school AP student. She read it within the first 3 weeks of receiving it. Her thank you note was highly enthusiastic and complimentary. It made me very happy."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AX0RNRLQQ7C49"
                },
                "Date": "on December 31, 2012",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "I enjoyed this introduction to particle physics and the fabric of our universe. Dawkins got me off the fence and this book confirms the marvellous godless construction of which we are part. Carroll weaves history and analogy to produce a coherent tale to bring the reader up to speed with the latest big discovery in physics . Thanks LHC and all who work there. No mathematical demands are made and you are left utterly thankful that there is a world-wide cadre of brilliant humans determined to push our understanding  to further heights. In answer to my review title: Higgs!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWJ00U4OY61LQ"
                },
                "Date": "on June 14, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "The book is well-written and easy to read even for a non-scientist. I would fault it for being too Newtonian. According to Bruce Rosenblum and Fred Kuttner in their book, Quantum Enigma, \"Every interpretation of quantum physics involves consciousness.\" I think Carroll's book would be vastly improved if he brought in the consciousness/observer issue. Doing so would make his book more personally relevant for general readers like myself."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AE92VD1K4JFDL"
                },
                "Date": "on December 16, 2012",
                "Helpfulness": 0.8333333333333334,
                "StarRating": "4",
                "Text": "I , definitely no science or math geek. I am a history and languages person. I bought this for my daughter is double majoring in biomedical engineering and math and figured it would be a fascinating read for her. I started reading it and found it very interesting and was able to follow what this discovery of the boson was, why it is such a scientific achievement, and how it will eventually revolutionize our every day lives like electricity to the Internet but in ways we cannot fully comprehend yet. It is a new energy source. If you like to learn, as I do, it is something you would otherwise miss unless you are are in the scientific field."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TOUHMJCB0GDJ"
                },
                "Date": "on December 13, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OA04AJHGKW7"
                },
                "Date": "on March 22, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "When the discovery of the Higgs boson was announced last year and the Nobel Prize in Physics was given to François Englert and Peter Higgs, I got interested in the subject and wanted to learn more about it. I do not have any extensive knowledge of particle physics, I surely do not understand the math behind it, and I knew very little about particle accelerators such as the one at CERN. (Well, they smash particles together at enormous speeds and scientists somehow use the data from those collisions to find new particles. That was where my knowledge ended). With this book, Sean Carroll, the author of \"The particle at the end of the universe\", answered all my questions. He explains in a very entertaining manner how it came that the accelerator at CERN was built in the first place, giving a little bit of history of these kinds of experiments, also explaining why we actually need these giant machines. He points out which problems can be addressed with them, how incredibly sophisticated they are, how they were built, and how they work. After this more technical part, he takes the reader on a journey through the science behind particle physics: What, in general, are the particles and what, in particular, is the Higgs boson? How did we know that something like the Higgs boson must exist, long before we built the machine to detect it? Why do we care whether the Higgs boson exists or not? Carroll describes in great detail the Higgs mechanism through which the Higgs boson arises. He also puts a lot of effort into explaining how \"typical\" data from an experiment at CERN  looks like, how it is interpreted, the statistics behind it, and hence why we can be almost certain that we have really seen a Higgs boson. The author also points to where to go from here and which future discoveries might be made at CERN and related accelerators. On his way, he also addresses many \"side issues\" like the \"mini black holes\" that some were worried could be produced in accelerators and why they would not be a problem even if they appeared. And despite the fact that the matter at hand is surely complicated, the book is remarkably fun to read, as even the complexest phenomena are described and explained in such an interesting and captivating way that they are easy to understand. Sean Carroll writes so accessible and well that I almost had a hard time to believe the guy is a theoretical physicist at Caltech. The reader does not require any prior background on the subject. The author also personally knows many of the people that were involved in the discovery of the Higgs boson, which allows him to present many entertaining anecdotes along with the science. Thus, the reader gets to know not only the experiments at CERN, but also the people that conduct them. For those that want to explore the science of particle physics on a deeper level, Carroll provides a more technical, but very well written appendix and a list of suggestions for further reading. I was completely happy with this book as it fully answered all my questions and was fun to read. If you also wondered why it was such a big deal that the Higgs boson was finally found and you want to know more than the regular news will tell you about the subject, then this book is for you. I highly recommend \"The particle at the end of the universe\"."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOGEOT9OD1V9B"
                },
                "Date": "on January 12, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FQ20MGVCDLQI"
                },
                "Date": "on May 11, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A300QWOTEHGKRL"
                },
                "Date": "on March 11, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IS9FVR9WG5TY"
                },
                "Date": "on January 14, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFRZL05D54MPM"
                },
                "Date": "on July 1, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A240R99Q77SF17"
                },
                "Date": "on December 6, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is an excellent book. It explains everything clearly, simply and in an engaging way. It includes all the necessary background science that sets the scene for the higgs and why it is important, plus a lot of stories and anecdotes. I truly enjoyed this book and learnt a lot."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A242JFNEAUG8C1"
                },
                "Date": "on April 29, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADTXEJBR01MKW"
                },
                "Date": "on July 31, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "The book was an excellent read.  The physics was distilled for a popular crowd and was broken down in basic terms.  But, as a philosopher, I did have trouble envisioning action at a distance and couldn't keep track of the particle gallery/zoo easily.  However, that's my problem.  The book was informative, and I especially liked the historical/biographical aspects of it.  Highly recommend it!!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADY7WVROHO9Q2"
                },
                "Date": "on March 17, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "The Higgs boson, the particle that is supposed to give mass to matter, was predicted decades ago and has finally, it seems been found.  It is amazing when something that science predicts based on a theory is later confirmed.  This book lets you in on the feeling that engenders.  It is understandable, non-technical and yet informative, dealing with the personalities of the people involved as well as the physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EO08MO8V0187"
                },
                "Date": "on January 15, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEU5AWGXHSP6J"
                },
                "Date": "on August 11, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Well written, interesting, introduction to particle physics. Prof Carroll does a great job in writing and in a Great Courses video describing the hunt for the Higgs Boson and Dark Matter."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8RWU1SH1SXGC"
                },
                "Date": "on August 11, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "A good mixture of entertaining and informative writing that keeps you reading. The Higgs is big news but even more is the story of the people, ideas, and process  that makes the finding of the Higgs particle, so much a human achievement."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIY0EH0DNXSEW"
                },
                "Date": "on July 23, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GG4TRLBEHL2E"
                },
                "Date": "on July 14, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Down to earth explanation of science.  It is one thing to have knowledge, it is another to be able to readily communicate this knowledge to the public at large."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20JYSKGZ42ORR"
                },
                "Date": "on May 29, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YM62USNLE7GM"
                },
                "Date": "on January 9, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ENFXT1Y4K3RN"
                },
                "Date": "on December 9, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "The book is an interesting journey through the past discoveries is physics and brings the reader up to date with what is being worked out now using high energy particle colliders"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHAL5UKWCVN3O"
                },
                "Date": "on April 15, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Well written book about a topic generally not covered well in the media. Some of the explanations gloss over the really complicated stuff, like folding one field into another, but the concept is fairly advanced and difficult to visualize, so the simplification is probably needed. Really enjoyed reading this book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RFXU3P0XKKF4"
                },
                "Date": "on March 4, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARG5SW5QXVZ4X"
                },
                "Date": "on August 27, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Carroll writes well and I understood some of the physics.  He presents the search well and I recommend the book even to those trying to get at least a feel for what is going on in basic research."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2J2WF50D5NJ2U"
                },
                "Date": "on April 28, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EKBKV7I5GNNJ"
                },
                "Date": "on July 17, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Love this book. Is written in a way that even a non-physicist can understand. Gives me the history behind the particles."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22UDQYCYYLW4D"
                },
                "Date": "on April 1, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "A full understanding of particle physics is not going to be achievable from a short read such as this, but this book probably does as good a job as any could of explaining it. I kind of have a slightly less hazy understanding of it all now. But there are some revelations I got from it, particularly about visualizing the universe as a vast math problem, of particles really just being vertices in a field, with assigned values, which ultimately make up all the matter and energy that comprise the illusion that we think of as reality. It's pretty mind-blowing, actually."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KFPRQCIIPBJN"
                },
                "Date": "on September 6, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7TQ6WS3AA3CF"
                },
                "Date": "on January 21, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book goes into great detail of what the Higgs is and what it means to have found it. But it also gives you a great history of science and physics. It talks about the physicists who have worked so hard to develop the theories we have. It was very well written. I had no trouble following along. I couldn't put it down - I read it in about a week. I would recommend it to anyone interested in the topic. The best part is that it's a very recent book discussing a very recent topic, so you do actually get the most up-to-date information. Great book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YD01D0RI8OMH"
                },
                "Date": "on December 18, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is a very timely review of the one of the biggest stories in physics in the past decade, the search for the Higgs particle.  While not directly involved in the search Carroll has the background and contacts to provide an insiders view of the process and why the discovery is so important.  While telling the story of the politics and personalities behind the scene, Carroll also describes the physics in terms that a motivated layman can follow to understand why the Higgs particle matters and what the implications are for future research."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AATIM644GKPAV"
                },
                "Date": "on February 28, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Wow... I have to tell you that this is a great book; although it's kind of like a very spicy Thai or Indian dish: you have to take it in small bites. A great part of the book is a fairly easy read, but there are parts that, at least for me, required a re-read or two.  Be prepared to \"stop and ponder\" what you have just read.  Good book, makes you think about what is really going on in the sub-atomic world."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1G3KAMJ5UFE3Q"
                },
                "Date": "on July 3, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3J9AZYRP1655I"
                },
                "Date": "on May 29, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Great read - and for anyone that would like to know what Higgs Boson/Field seems to be (do we really understand it? I don't think so, but it looks like a good working model). Well written, and enjoyable if you like the subject - no need for PhD in Mathematics to follow this book, the author has got that covered for you."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Q1XZ9FAQE8D2"
                },
                "Date": "on April 30, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Particle physics is a tough subject to write about, but you can tell that Mr. Carroll has a vast and profound knowledge of the subject.  The book is both readable and informative.  Terrific work."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1J427B4E0AAK4"
                },
                "Date": "on March 26, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VXUGZ8DDX4KK"
                },
                "Date": "on February 21, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Great descriptions of the standard model and how the Higgs fits in with it as well as the large hadron collider and some of the drama and personalities that led up to this discovery."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A226JXOZLWTJH6"
                },
                "Date": "on February 16, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3393UG8EVZGWO"
                },
                "Date": "on January 14, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26IGINH493VR4"
                },
                "Date": "on January 5, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is a great book.  Particle physics combined with the personalities and people who are on the cutting edge of it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12QE6816NMY08"
                },
                "Date": "on January 1, 2014",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I guess this is the most simple explanation of sub atomic subject learning, the input of so many brilliant minds, leading to CERN and the confirmation of the existence of the Higgs Boson particle. Mind boggling complications are presented in an almost understandable fashion. Amazing that it can remain so interesting and even re-readable. A real compliment to the author."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A48JY6E3MCC88"
                },
                "Date": "on December 31, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A214QP3U85RJWQ"
                },
                "Date": "on December 28, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Sean's writing is very accessible to the lay reader.  He breaks down the ways that the various fields relate to each other in dynamic and easily accessible descriptions.  He also provides the background on the different thinkers who contributed to the pursuits to isolate and understand the fundamental particles over the past century."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DGSLFVP2MZC5"
                },
                "Date": "on December 9, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Not just the famous Higgs particle, but the clearest explanation of the entire standard model I have read. There is a tendency for scientific authors to explain the complexities of fields, particles and forces in either impossible mathematical detail or in oversimplified analogies. It is a real challenge to take the reader through the essential workings of current theories in a clear way but this book succeeds outstandingly well."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3797ISHM3SQM5"
                },
                "Date": "on December 4, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This book has a lot of anecdotes of the history of the Higgs mechanism development. And I enjoyed those stories."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RNRHAD5Y8MYD"
                },
                "Date": "on November 25, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Quite enjoyable on a very technical subject.  Builds on a firm foundation of the Standard Model and how the discovery filled a gap."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A275K8C0IWOY68"
                },
                "Date": "on November 25, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I like Sean Carroll as a presenter of scientific ideas. He does a fine job in making analogies that capture the main ideas. And he's funny, at least to my ear. I think you could do much worse than to read this book on the Higgs."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19BMTNAOIS0U7"
                },
                "Date": "on November 8, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATGAPP48VPKFQ"
                },
                "Date": "on October 27, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "This is a fascinating book that brings together the bits and pieces I have understood regarding cutting edge particle physics into a coherent whole. It contains lots of human interest and anecdotes to keep it interesting and very readable. It is one of the best books I have enjoyed this year! I plan to re-read soon to retain some of the more technical information. Probably a lot is elementary to physicists, but a lot is new to me and there were many aha moments."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2U4AV00V0U6VV"
                },
                "Date": "on September 11, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FNLT6MTO93WM"
                },
                "Date": "on June 13, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1S9S8NEY8KDHE"
                },
                "Date": "on March 18, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "The Particle at the End of the Universe is a very clear and easily understood summary of why the Higgs boson should exist and how it fits into the framework of the Standard Model of particle physics. I found it to be full of fascinating facts about the LHC and the discovery process, as well as good insights into the way that fundamental particles behave and interact. I strongly recommend this book to anyone who has even a slight passing interest in the state of particle physics in 2013."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AD8DYUBOYFF3M"
                },
                "Date": "on February 11, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "If you have a reasonable knowledge of quantum mechanics or particle physics  this is not the book for you. Carroll writes very well but his specialty is cosmology. Nothing hidden, Carroll explicitly states this toward the end of the book. If your objective is a  “cocktail party conversation” level of understanding of the LHC or the Higgs boson, which I suspect was Carroll's objective, this book deserves the five star rating I'm giving it. But if you want an understanding of the limitations and future goals of the LHC or an understanding of where the Standard Model of particle physics is lacking I would recommend spending your money and time elsewhere."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26I1ZW910O5PA"
                },
                "Date": "on January 20, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "The Particle at the End of the Universe is extremely well written in terms a layman can comprehend and assimilate.It is timely in this extraordinary moment of particle physics"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AS2CJFLUMAT6H"
                },
                "Date": "on January 7, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Well written.  Do I understand what is written? I would LIKE to say, yes.  However, I do feel better informed about up-quarks, down-quarks, their playmates and those who now play with all [?] of them. Fields: not so much.  Jon W Candy MD"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FEU3NMXFPHJU"
                },
                "Date": "on January 6, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Well written and I insightful. It takes careful reading due to the new concept and abstract ideas. Sean Carroll does a great job explaining these."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2X72K0PEP399N"
                },
                "Date": "on December 17, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Very enjoyable and the information is comprehensive and accessible to the average person.  The humor is appreciated, too.  I'll read more by this author."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1P8NQ2OJ4PTDL"
                },
                "Date": "on April 23, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I can't say enough good about this book.  It is comprehensive and so well written.  It is written so anyone with a basic interest in science and the universe can understand it.  Yet, it is also detailed enough that readers can't help but appreciate the complex foundations of our universe.  As must read as far as I am concerned."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVREF2PRLZUKM"
                },
                "Date": "on May 22, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I love this book. It is a constant learning experience which is presented in an understandable and often humorous way. I now feel like I have a basic understanding of particle physics that will stick for a long time and want to learn more. Thank you Sean Carroll for writing such an engaging book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A316YZBC8RQE16"
                },
                "Date": "on August 24, 2013",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VN1IOPJ5GRDK"
                },
                "Date": "on April 16, 2015",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Excellent description of the struggle and need to find the Higgs field. I am reading this book while watching Sean Carroll's The Higgs Boson And Beyond course (from the Great Courses). This book is a great resource while taking the course."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CTB3FKA1H9GJ"
                },
                "Date": "on January 3, 2013",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "This book is just as much about the politics and funding of the Large Hadron Collider, its construction, and operation.  Which turns out to be interesting.  Explanations of the physics behind all the relevant pieces are easy to understand."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADNGIQ5KMOFZG"
                },
                "Date": "on April 17, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "The author knows his subject well and is able to explain it to the novice. He gave you the idea that we live in an orderly universe. The Higgs boson is a particle  not seen but looked for in the collider."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NKOFSVEIVABU"
                },
                "Date": "on December 12, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "As always Sean Carroll can make any subject pretaining to physics interesting. As a mathematician, I love this book. I think anyone will be able to read and understand the information. Very well written."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1M8RE40MJLBU3"
                },
                "Date": "on March 25, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Carroll provides a visual and stimulating dialog on not just the history behind the search for the Higgs Boson, but the future it can lead to. Very enjoyable read for anyone from any background."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FSQ290OWZCDN"
                },
                "Date": "on October 21, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SY10RQA8MEEX"
                },
                "Date": "on December 10, 2012",
                "Helpfulness": 0.7142857142857143,
                "StarRating": "4",
                "Text": "It is beautifully written in easily digested language for everybody.This book describes about the endless effort of human's intellectual to probe the ultimate reality"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MG3D4L1YV707"
                },
                "Date": "on January 7, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Easy to read and the excitement came through. Very thought provoking, you'll find yourself thinking about it while doing everyday things and looking forward to reading more."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AONMTGS00YTK7"
                },
                "Date": "on September 6, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Good read for those interested in the Higgs Boson, if you don't care about particles or physics then buy something else, if you do, then this is a great book for you"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VU9CAWPI81QL"
                },
                "Date": "on January 22, 2013",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "I am not well-informed about this topic, but I bought the book for my grandson, who is talking about a career in Astrophysics, and he found it very interesting."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VO5RZ4RQWQ3E"
                },
                "Date": "on June 12, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This book tells the story of the discovery of the Higg's boson, what it is, what its relevance is and the intensely human nature of this endeavour. The book provided my best insight into the Standard Model and where the Higg's field and boson fit in. The author discusses the physics but puts it in context. The people involved and their contribution is truly amazing and the author explores the limitations of attributions and prizes  (Nobel) for such collaborative endeavours. This amazing discovery was the culmination of progressive systematic rigorous progress, the creativity and imagination of many many people. Solving the puzzle of a consistent theory that provides an explanation for mass of particles, esp bosons, affected by the weak force was fascinating. The importance of chirality in this was another example (to me) of the amazing universe (perhaps part of multiverse) we inhabit. This Higg's  field/mechanism/boson: the name that stuck and appropriately but is the product of the noble. passionate human journey and the author takes on this road with deep insights and honesty. (The appendices are well worth reading)."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SUIEKBB5Q1QD"
                },
                "Date": "on February 22, 2014",
                "Helpfulness": 0.75,
                "StarRating": "3",
                "Text": "A very hard read. Interesting but frustrating as a popular science book.You ymust have prior knowledge befor tackling this book"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A700IFMEPTAWT"
                },
                "Date": "on April 22, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "If you are fascinated by physics, as I am, this is the best book I have read so far to explain the Higgs Field, and the Higgs boson (confirmation that the field exists?). The title is, I assume, an homage to the late Douglas Adams, who wrote \"The Restaurant at the End of the Universe\". But Mr. Carroll,(unlike Mr. Adams) does not write for humor or to take flights of fancy. His writing style can be humorous, but always with the goal of elucidating the history, actors (i.e. physicists), and science behind the search for confirmation (or refutation) of the Standard Model. And all this without a single mathematical equation (except for Einstein's famous equivalency of matter and energy). He presents Feynman diagrams, but if you skip them, you don't lose track of the narrative. It has been over 45 years since I took a physics course. I am amazed (and gratified) to see how much progress has been made."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1A85A3ZPJ67Y3"
                },
                "Date": "on December 28, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A Christmas gift that turned an adult son who is normally blasé about such things into a gushing, giddy & giggling kid. I researched books on the Higgs Boson and combined with his appreciation for the author chose this book. Keep in mind if you are looking for an easy read explanation this is not the best choice. Keep in mind the author Carroll is a CalTech physicist and a basic understanding of sub atomic physics combined with a good understanding of higher maths is helpful to enjoying and understanding this book. Plus an interest in sub atomic physics! However, according to the son, this is not a dry scientific tome. The history and importance of the idea, search and discovery of the particle is covered along with the impact on science and the scientists along with the science detail."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AD5E41KLIJGG2"
                },
                "Date": "on September 12, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Had to read the book twice, since I've only read a couple beginning books on particle physics, and there was so much new to learn.  Learned what a lot of stuff that I heard tossed around like symmetry breaking, gauge  invariances and fields.  It was well worth the effort.  Learned more about the standard model.  The story about searching for the Higgs at CERN was fascinating, and the development of the Higgs particle and field into the standard model was excellent.  It was a true collaboration over many years with both theoretical and experimental physicists.  To truly understand the Higgs field, you may need the knowledge of someone that has a physics degree and understand advanced mathematics.  He did a job as best could be done to translate these foreign concepts."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7VHHBC1MRJWI"
                },
                "Date": "on May 11, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This made a great partner book to \"The God Particle\". While the former covers the history of particle physics through about 1997; this book,  is more contemporary and more technical, covering through the discovery of the Higgs Boson thought to originate in the Higgs field. The Higgs field is still part of the \"last chapter\" in of the Standard Model of the universe. But wait!!! Happily it goes on to address thinking about the theorized (as of July 2012) dark matter, dark force and strings. The number of undiscovered particles, though mentioned, seriously whets our appetite for what lies BEYOND the Standard Model! Though the Higgs boson is amazing, the Higgs field............"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GGJB5A76K9LE"
                },
                "Date": "on July 23, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Sean Carroll is on a mission to teach particle physics to anyone who will listen and he does a fantastic job. I found the book super interesting and super informative. The description of the construction of the LHC was awesome and really helped me to visualize what goes on during experiments. I never knew that the energy of the protons rotating in the 17 mile long rings was equivalent to a speeding freight train and that it needs to be safely dumped after an experiment. The book answers so many questions about the LHC and the hunt for the Higg's it was like being there. If you haven't watched Sean's Teaching Company videos yet - what are you waiting for?"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATA980NJ3OSZT"
                },
                "Date": "on December 30, 2012",
                "Helpfulness": 0.6521739130434783,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OXLOEVIOYYKO"
                },
                "Date": "on October 22, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QNOZGPO6ZVCY"
                },
                "Date": "on November 29, 2012",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "This book gives a pretty good look at why the Higgs Boson is so important. It also goes pretty in depth about the physics of the Higgs. It was a little over my head at times. It's still a great book, though."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGS64HWTQH6EA"
                },
                "Date": "on March 18, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Sean Carroll does an excellent job of weaving the history of the search for and discovery of the Higgs with the science behind the Fields and Particles associated with it. For years I have been reading popular science literature hoping for a glimmer of understanding of why the searh for the Higgs was important. Dr. Carrol has delivered this glimmer of understanding to me with this book. I would recommend this book to anyone who like me lacks the mathematical expertise of a physicist but still wants to understand the foudations of our universe."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12CIW97ZOPVCY"
                },
                "Date": "on August 13, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I purchased this book because of recommendations given in Science.  The recommendations were right on track, and the book was a really excellent description of activities leading to the discovery of the Higgs boson.  I had not really realized the complexity of the nucleus that has been revealed in the past forty rears, but this book provides an interesting and readable summary of these discoveries.  I thought the author also provided a well-balanced account of why the U.S. dropped its project to build the Super Collider."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Y4UFBTIBME57"
                },
                "Date": "on September 11, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADZMZESN9MIZ7"
                },
                "Date": "on March 2, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Prof. Carroll appears to know all the questions an informed non-professional particle physicist would ask. In fact, these are the questions he would ask.  His answers are very satisfying yet tantalyzing; they leave one wishing to be even better informed and more able to follow the tough mathematical arguments which are only for the pros. I dusted off my old field theory texts in hopes of getting just a bit closer to understanding the role of symmetry: It's a work in progress."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28I3E059257NO"
                },
                "Date": "on September 29, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "One of the better & more intelligible explanations of a \"somewhat nonintuitive\" subject.  It takes guts just to attempt to explain these quanutm concepts in a nonmathematical manner.  The history is interesting & the insights into the workings of Big Science are enlightening.  Starts you thinking about what's ahead in physics research - & whether there really is a future for particle physics, at all, if the LHC fails to produce \"earthshaking\" results.  Soon."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXYEQQ22ZYQMJ"
                },
                "Date": "on June 11, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IUNVYLXZEW88"
                },
                "Date": "on December 6, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AR6YS16924S2C"
                },
                "Date": "on December 23, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I was a graduate student working on my PhD in elementary particle theory back in the 1960s. Having earned the PhD, I have been out of that field for 40 years+. I found the book to be very readable for non-experts in this very technical area of science. If you have an interest in the subject, I think you will find this a good read. The appendices are helpful, but I would personally have liked to see a bit more more of the math in the appendices."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JBJFQKLOJPX8"
                },
                "Date": "on January 15, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I'm a glutton for punishment and have read/attempted to read any number of books on modern physics.  This book is well written, but I have to admit, I get a bit lost on some concepts such as super symmetry.  A deducted a star because it couldn't penetrate fully my brain, although probably not the author's fault.  Many chapters, however, are quite comprehensible, even though the concepts are difficult to relate to every day reality/perception."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QLNO51CSBWJU"
                },
                "Date": "on July 18, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Wow! I was not aware of the work that had taken place in particle physics.  I have read this book and am rereading it.  The first read was for familiarity and now for understanding.  Why?  I don't know.  I an 76 years old but still enjoy learning about science and our universe.  This book has been wonderfully helpful.  I found it from an article in \"Scientific American.\"  Well written and clear to one not trained in this area."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A223CI3O1GEJE1"
                },
                "Date": "on December 2, 2012",
                "Helpfulness": 0.6666666666666666,
                "StarRating": "5",
                "Text": "The science in this book is clearly explained. It is a book to make one think and stimulates further thoughts."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39ZK4HSVKP7I6"
                },
                "Date": "on January 28, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "An excellent book: heavily focused on concepts but little math.  The book is ultimately about the Higgs Boson, but to understand why it is important you need to understand the background leading up to the search for it.  The lack of math certainly makes it not a rigorous treatment of the subject, but you will come away with a conceptual understanding of progress made in particle physics over the last 30 years."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3T1GQA0YCSM3Q"
                },
                "Date": "on May 15, 2015",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "Good explanation of the state of physics today.  If you are not a physicist, but are still a fan, this book details the story of who and how, the world of physics came to the current structure of the standard model.  Careful explanations of how physicists perceive particles, there interactions and there place in the structure of atomic particle structure are given.  Many illustrations are helpful."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A234HDCV5GBCFR"
                },
                "Date": "on June 30, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KHBYFI1GD6MF"
                },
                "Date": "on June 18, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Sean Carroll's talent for explaining complex notions is unmatched by anyone writing in today's popular science press.  This book goes deeper than the typical elevator explanation of the Higgs Boson, and why it matters (no pun intended), yet is not cluttered with equations that often do more to obscure than explain.  The explanation of the relationship between fields and particles alone is worth the price of the book - even for students studying QFT at the University level."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TURYETR9YFM2"
                },
                "Date": "on June 17, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LI77U7CDGY3Q"
                },
                "Date": "on June 2, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Professor Sean Carroll is a physicist at the California Institute of Technology; he is also a superb writer with a rare facility for explaining his subject to the nonphysicist.  In this book, he is at the top of his form.  He gives us the history of particle physics, including the theoretical predictions of the Higgs boson.  He explains the significance of the Higgs, or more importantly, of the Higgs field of which the boson is a manifestation.  He describes the origins, design, and development of the Large Hadron Collider (LHC) in which experimental proof of the existence of the Higgs boson was generated.  Through Carroll, we meet the theorists, experimentalists, and the engineers who made its discovery possible.  Carroll leads us through the logic of why it is thought that the Higgs has been confirmed and how it fits into the Standard Model of particle physics.  He explains the extraordinary care that was taken by the large teams of physicists involved before an announcement was made.  He then discusses what the discovery means for the future of particle physics and for our knowledge of our universe and its origin.  Perhaps most important of all, Professor Carroll conveys the dedication, excitement, and joy of the scientists.  Underlying all of this is his dry, quirky sense of humor."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AO9ZETQFAZP99"
                },
                "Date": "on May 10, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JDOP7ASUNSER"
                },
                "Date": "on April 19, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A315ZBL6FW5BL6"
                },
                "Date": "on April 13, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Very well written and an excellent piece of organization on a very difficult topic.  I found one typo in the entire book."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MM3PIQE438PY"
                },
                "Date": "on April 7, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQ3J662UOKZ2M"
                },
                "Date": "on March 19, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "This is an important new development in particle physics.  It is well described, but leaves the real answer for the future."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LD9WEWWH4WCP"
                },
                "Date": "on February 18, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "One of the many books out about recent discoveries of the Higgs, dark matter, dark energy, quantum theory, the accelerating expansion, etc.  Much new information in this book.  I was looking for books that discussed all of these items.  This was more on the Higgs, but the Lawrence Krauss book \"A Universe from Nothing\" did the best job on all of it including parallel universes and it was the most readable of all of them."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KILBXH2PJOTH"
                },
                "Date": "on January 22, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1N2F02FM8PIMP"
                },
                "Date": "on January 22, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "The book has a lot of great content but it is difficult to keep in mind all the particle interactions and relationships. Diagrams of these would be very helpful that could be easily pulled up on a Kindle or other reader to review and then go back to the text you were reading."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NWW4F0G589GT"
                },
                "Date": "on December 23, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I am not proud to admit it, but by the time I graduated with my degree in physics I really disliked the subject quite intensely. As a result, I largely cut myself off from the astonishing developments in physics, and particularly in particle physics, that took place in the decades after I graduated in 1958. When, after a career in advertising and public relations, I revived an interest in physics, I could no longer follow the Scientific American articles on physics intended for non-specialist. This astonishing book has redressed the balance, reawakened my enthusiasm for physics, and brought me up to date. It is a masterly book that well deserves the prestigious award it recently received. I cannot recommend it too highly."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AU1CFO7A0SFLY"
                },
                "Date": "on December 19, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A lot of the material was over my head (I have no science background), but the book is written with enough clarity that I could get the gist. A fascinating read. Learned a lot."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GWSI6294JWIR"
                },
                "Date": "on December 11, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Best book on the Higgs and particle physics that I've read.  Love it because of Sean's clear and humorous writing style plus his wonderful explanations of quantum fields.  But his description of symmetry could be clearer.  However, I have read the book 3 times since I received it by mail and I still love it.  I met Sean last year at Cal Berkeley where he gave a wonderful lecture on \"the arrow of time\" and consider him one of the best theoretical physicists I know. Check out any of his numerous videos on UTube and you will see why."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEUWL2J510PZG"
                },
                "Date": "on November 30, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YSRQDV0KUTB6"
                },
                "Date": "on November 14, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Very good reading, easily understandable, excellent presented, I recommend this book must read. I rated this book on a scale of 1. To ten----- easily a 10"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30QH6G2FP10KN"
                },
                "Date": "on November 6, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This was a well written book that covered a lot of territory. it had many photos and Feynmann diagrams that helped in understanding concepts"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MK3HK40WOLFK"
                },
                "Date": "on October 15, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Everyone should understand some of the the implications of this discovery, (Higgs bosun) and this is written with everyone in mind."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOYWY42MG21PR"
                },
                "Date": "on October 4, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Well written, well paced.  Dr. Carroll explains very esoteric material in very clear and simple ways - a sign of real understanding.  Good on the science, the history, the personalities involved and most of all the significance."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BKUD9T9VSUEM"
                },
                "Date": "on September 21, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AK8NEFATXVHPU"
                },
                "Date": "on June 9, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I really liked this book. It contains a timely and comprehensive review of the Higgs mechanism. My favorite part was a telling of the experimental discovery of antimatter. I also liked the account of the building of the LHC, the sad cancellation of the SSC, and a nice expose on he great Lyn Evans."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3G7YZ2DZT16UD"
                },
                "Date": "on March 18, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book contains lots of information on all if the particles we are affected by everyday. Although it doesn't contain information on the recent discovery of the higgs on March 13 2013 it still gives a thrill on every paragraph. I would highly recommend this book for anyone interested in science."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASYD9WETJA6G2"
                },
                "Date": "on March 10, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGVSIUYQ82LTI"
                },
                "Date": "on March 8, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Learnd a lot about particle phisics and finaly understood what is the Higgs, some parts of the book are too speculative for my taste."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ESHDKC0O0I22"
                },
                "Date": "on March 1, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I'm complex, you're complex, we are complex. Higgs it's simple. Difficult was to explain it. Carroll did it. Great reading"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEMCBT8DS899S"
                },
                "Date": "on February 24, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Mr. Carroll is a great science writer.  I thought he made a presentation that was accessible to the avid non-particle physicist reader."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33RQ9HL46S639"
                },
                "Date": "on February 6, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11JT1OSUUW35G"
                },
                "Date": "on January 29, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Sean Carroll has the ability to explain complicated science in understandable ways! This book doesn't rely on complicated mathematical formulas but instead uses analogies to everyday things that we can actually see. While these analogies are likely not as precise an explanation as math, they are understandable."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21HYKG0WUN0HH"
                },
                "Date": "on January 26, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I am not an author, writer or a physicist. Therefore I am not going to review like such. I found this book very informal, interesting and a very good angle on certain areas of particle physics, in particular the Higgs. I enjoy we'll written and well rounded books like this and if your are a wanna be egg head like me you will love it. Ronny"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A164G93YALD7HI"
                },
                "Date": "on December 27, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANGW7MLX7QRFU"
                },
                "Date": "on December 25, 2012",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Without the author's ability to analogize key points, this subject would be almost totally obscure to the lay reader. However, Carroll's writing prowess makes this inscrutable subject sufficiently understandable that we can begin to appreciate the magnitude of the accomplishment that occurred in July at CERN's Large Hadron Collider. Toward the end of the book, his analogy of tiny robots with sails inside a vacuum chamber makes plausible the fact that everything is immersed in a special kind of field that gives each particle its unique character. I would have given it five stars except for the fact that much of the explanations still eluded me. Author did best he could but I'm just not intellectually robust enough to follow along. Even so, I'd recommend this book for anyone who would like to get a sense of why basic scientific research is important. And to gain respect for the wondrous complexity of the physical universe."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQ8U18WUXL5QI"
                },
                "Date": "on December 28, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The topic matter is complex but the writer's clarity and skill make the subject seems less so.  It is not a quick read for most people but it is understandable if you take the time.  The book gives a good review of the functioning of the collider.  The book is well written and I highly recommend to those interested in the subject."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A157S7Z79YZP0O"
                },
                "Date": "on January 18, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "It would be good to read this now that the Large Hadron Collider is coming back on line after being updated the last 2 years.  NOVA had a terrific episode about it recently too which explained the same stuff but with pictures.  Sean Carroll was interviewed extensively by NOVA.  Loved this book and I'm no physicist."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NMKGRZAPHS5C"
                },
                "Date": "on January 26, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATGH2ZS0UCBCG"
                },
                "Date": "on March 19, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Until Sean Carroll explained, unravelled and described the search for the Higgs Boson I couldn't understand what the subject was or what the fuss was all about. Here we have a clear, lucid explanation in plain English, of one of the most important, mind bending and difficult scientific searches in history."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RIYAHJ6MXDQL"
                },
                "Date": "on May 10, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADTRPBYXKK8BE"
                },
                "Date": "on November 5, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35KIHTCIZLPFL"
                },
                "Date": "on December 8, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Easy reading for lay people. This well-written book documents the search for the Higgs. It maintained my interest by keeping the drama up throughout. I'd recommend it to anyone with an interest in quantum or particle physics, and current science in general"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QMY19SW6RHJP"
                },
                "Date": "on December 26, 2013",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMNML7MM0641A"
                },
                "Date": "on November 8, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Sean Carroll makes a very complicated subject quite exciting.  Although many of the concepts of quantum mechanics are not intuitive, they are important, and can be understood, and believed after reading about the Higgs Boson."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARVOB0CD3OP10"
                },
                "Date": "on May 4, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Sean Carroll is an excellent science writer who does an excellent job explaining that the particles we perceive arise from fields.  Rather cutting edge stuff summarized in a way ordinary people can grasp."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PKZXPBWOEUY0"
                },
                "Date": "on December 24, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Thanks to Sean Carroll I am better able to understand the science behind the hunt for the Higgs. Easy to read and a real pleasure to get to know all of those scientists involved in this awesome project."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17RIPV81D73HZ"
                },
                "Date": "on May 4, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22DVRK7Q233X5"
                },
                "Date": "on January 28, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "The book is well written, with lots of historical information, as well as information about the LHC.  The meaning of the Higgs is clarified, and ideas of future discoveries that may occur."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AN8BVKNIX37HY"
                },
                "Date": "on April 21, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "SC is a philosopher and a scientist and just a great author. Next stop, his missus. Hearing a,it of her on podcasts of late but this book makes me want to get more for him."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12900APZJL9NI"
                },
                "Date": "on April 8, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I enjoyed this book very much. Sean has a wonderful writing style and doesn't try to impress with his genius. Easy for a lay person to understand. I learned a great deal."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NW9J6G11PID4"
                },
                "Date": "on May 14, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great book about a fascinating topic. Carrol is a working scientist who also happens to be a great writer. The story was good enough for them to do a Nove based on it."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LKWYXV5P84MF"
                },
                "Date": "on March 10, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Author is very good about introducing topics without being overly complicated... which is no small task when describing quantum physics.  A very enjoyable read."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A347BI7BGI0MS9"
                },
                "Date": "on January 27, 2013",
                "Helpfulness": 0.5,
                "StarRating": "4",
                "Text": "I took a lower division physics class in College and have been interested in physics for the last couple years, but you had better have at least a layman's passing knowledge of particle physics or you will be instantly lost and bored with this book.  Carroll does an excellent job of staying away from the math of physics and does a beautiful job of reviewing the history and building an understanding of the concepts of quantum physics in this book.  I'm still not absolutely sure what the Higgs boson or Higgs mechanism really is or does, but I can now spout names and concepts about it to anyone interested.  When the search for the \"Higgs\" was called the search for the God particle, I thought it was funny that Carroll mentioned that only the people who believe in God  and the people who didn't believe in God were offended by the sobriquet."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VIOUO2M6AZ1E"
                },
                "Date": "on October 24, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "I didn't finish reading yet, but I like very much the clarity of the text. Probably I will come back with a complete review (very possible with 5 stars)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A119OINBI7FPAO"
                },
                "Date": "on February 18, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "it's tough reading for a non physicist, but loaded with information particularly about how they determine that it exists and the LHC"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DIWPPO52S64R"
                },
                "Date": "on December 25, 2012",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Finally a description of particles/ QED fields that gives the layman some insight into the real world. 3 more words"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11BSOYFIF3VAV"
                },
                "Date": "on October 25, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Great book.  I read it through twice.  If you wnat to know what is happening NOW in physics this is a good start."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6CFOIQD07AN9"
                },
                "Date": "on January 26, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Very detailed easy to read explanation of what's happening around us all from the macro cosim to the micro cosim"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2G4ENYBF8JEG3"
                },
                "Date": "on July 26, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book does a excellent job of explaining the Higgs Boson and how it fits into the scheme of Quantum Theory"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQKIU5A37GK2G"
                },
                "Date": "on October 23, 2014",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Ordered for my husband, and he was amazed at how cheap a technical book was as most of his cost about $400.00"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CVONX9ZRLEP1"
                },
                "Date": "on December 16, 2013",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "The book fulfill my expectations. It is writed in a simple manner using a clear way to explain the topics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFEGY059O8YPJ"
                },
                "Date": "on February 22, 2013",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Once again Sean Carrol has done it!!  I love physics and if you do..you will like this book as well!!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13OK489QY24PL"
                },
                "Date": "on November 19, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "This book is a real eye opener to anyone seeking knowledge of how we are and exist"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38O33TH09DRW7"
                },
                "Date": "on January 21, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I like it. I bought this for my class. I bought used one, but It looks new one."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3F7A4FK16GHE1"
                },
                "Date": "on December 27, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "I enjoyed this read and will read it again.  I am upping my rating to 5 stars."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EO8RKH8NCWRA"
                },
                "Date": "on April 6, 2015",
                "Helpfulness": "",
                "StarRating": "4",
                "Text": "Excellent, informative, added chapter to \"Engines of Discovery\"."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KHS90UO8FHWP"
                },
                "Date": "on February 15, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "I heard this author on PBS and was very impresses. A nephew is a Physics major and i got this for him because of that. He loved it, along with \"The Dancing Wu Lu Masters\" (which is now dated, but still interesting.)"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DO5KBR0CQT47"
                },
                "Date": "on March 26, 2013",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "Let's be realistic, particle physics is never going to be an easy topic. However this book gives a great overview to the topic and the (successful?) search for the Higgs boson. For the first time I came out of reading a book on the topic feeling I had a reasonable understanding of what particle physics is about and could have an intelligent discussion on the topic. It also does a reasonable job on showing why the huge amounts of money have been spent in the field without coming across too arrogantly, a regular failing of those writing in this field (\"it is important but to difficult for you understand, just believe us\").  Will you come out of this read at the other end a particle physicist, of course not. It is however a worthwhile (if occasional heavy) effort for those with any interest in the topic."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AX4XGDWFBQBE2"
                },
                "Date": "on February 6, 2013",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "What I love about Sean Carroll is that he can deliver very complicated theory and partical physics in understandable lay terms while at the same time being laugh out loud funny.  He is a treasure!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWJV0FBEASG4P"
                },
                "Date": "on February 3, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Purchased as gift.  The receiver loved it!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HVL5Y96M50ZO"
                },
                "Date": "on April 29, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Best book in a long time.  A must read!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1X8CAL12DRF6F"
                },
                "Date": "on January 6, 2013",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "I have not tried to read this, figuring I would not be able to understand it, but it is for my husband who is reading everything he can find on these subjects. He loves it!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LD9WEWWH4WCP"
                },
                "Date": "on February 15, 2014",
                "Helpfulness": 0.5,
                "StarRating": "5",
                "Text": "This gets into physics and answers some of the questions about physics and cosmology.  There are several books available that answer even more."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SEOZTH23CRR3"
                },
                "Date": "on September 22, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "awesome read"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACNN6UNUSNA01"
                },
                "Date": "on March 31, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "Very good!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23HYBZ50T78TY"
                },
                "Date": "on February 7, 2013",
                "Helpfulness": 0.0,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DUV9PEKUAJDY"
                },
                "Date": "on April 25, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "very good"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADIPZ6BQQM79D"
                },
                "Date": "on February 1, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "I purchased this book for my husband---he's finished reading and has raved about it throughout!  He said that it was \"readable\" even for a novice!  He's done quite a bit of reading in this area and this one WAS A HIT!!!  He's eager to read MORE of Sean Carroll!  :-))"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALAEAEJWAV4L5"
                },
                "Date": "on February 14, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "The author, Sean Carroll, has a gift for using analogies to give the non-physicist an idea of what and why billions of dollars are being spent on the search for subatomic particles.  The answers are stranger and more exciting than science fiction."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IIL6QMG09RMS"
                },
                "Date": "on February 2, 2013",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "Sean Carroll writes an excellent book for non-physicists. My basic physics dates to 1950 yet I was able to gain an understanding  of particle physics. I found the book exciting."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UGAPNK0JLHH4"
                },
                "Date": "on June 6, 2014",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "It is interesting even for a non scientist as myself. It can be a Little bit tough to follow all the time when you are not within that field."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AODZ7Z6C1ZE7Q"
                },
                "Date": "on February 5, 2015",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "A"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DFW8C3EKGQAD"
                },
                "Date": "on November 13, 2013",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "3",
                "Text": "It spends too much time at the beginning retelling stuff that most readers might already know.  Really did not warm up until 15% of the way through the book"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15ZJXY4K8TWFC"
                },
                "Date": "on December 2, 2012",
                "Helpfulness": 0.2,
                "StarRating": "5",
                "Text": "I was intrigued when I read a reviewer who reported the book states there are: \"twelve elementary particles that make up the universe\". I have also read: \"There are but multiples of three in all My universe\" in a book called The Secret of Light. So it would follow...a need to find a 12th particle. I am anxiously awaiting the delivery of this book. Please note the capital \"M\" in My. Science meet religion."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALNFJ6XAHP4G3"
                },
                "Date": "on January 27, 2013",
                "Helpfulness": 0.36363636363636365,
                "StarRating": "3",
                "Text": "I'm not too dumb, but still failed to follow the author, especially after chapter 8 when he introduced some of the more complicated theories."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JZ66LUDXTANI"
                },
                "Date": "on November 30, 2012",
                "Helpfulness": 0.36363636363636365,
                "StarRating": "5",
                "Text": "Brilliant book, explains how the world really works. I love this book. The author is a bit arrogant, but rightfully so."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CH0BBNT0MVKP"
                },
                "Date": "on March 6, 2013",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "3",
                "Text": "The topic of sub-atomic particles is fascinating, especially the mysterious Higgs Boson, of which we have heard so much about in past years. Coming across this book, especially in light of recent verification of the Higgs' existence, seemed like an opportunity not to be missed. Sean Carroll has performed a great service to laymen such as myself, in helping to grasp some of what is going on under our very noses. Even though he does his best to put things in laymen terms, I still found myself becoming lost in particle soup, and had to put it aside about halfway through because it just became too much like cramming for an exam. I will pick it up later and resume, but a switch to some lighter fare is needed right now. Anyway, aside from helping the lay reader to grasp some of the more difficult concepts, Mr. Carroll provides a very interesting description of what goes on in the world of particle accelerators and colliders. For instance, who would have thought that it would require several tons of concrete and steel to arrest the travel of a few miniscule particles whizzing around in the HADRON accelerator? There's lots of good information waiting for those who can wade through the \"ups,\" the \"downs,\" the \"strange\" and the \"Higgs\". I can definitely recommend this book to the layman seeking to know what is going on at the sub-atomic level of our universe. My only other criticism is to wonder why so many physicists seem unable to acknowledge a greater intelligence at work in putting together the universe around us; some of which we can see, but most of it that we can not - or even envision. After all, there's so much that even these clever \"reverse engineers\" do not know, so why the arrogance in denying the existence of a Creator. After all, eternity is a fact, whether a Greater Intelligence exists or not."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CATKKZTPG6EC"
                },
                "Date": "on March 12, 2013",
                "Helpfulness": 0.2727272727272727,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJM6YYAPXC2IR"
                },
                "Date": "on August 3, 2014",
                "Helpfulness": 0.0,
                "StarRating": "3",
                "Text": "It's well done but the subject is very esoteric."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10111TZWX5YLH"
                },
                "Date": "on November 28, 2012",
                "Helpfulness": 0.37383177570093457,
                "StarRating": "3",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJSNTBCOB7VS2"
                },
                "Date": "on August 2, 2013",
                "Helpfulness": 0.28,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IKKHI79SR86G"
                },
                "Date": "on December 9, 2013",
                "Helpfulness": 0.18421052631578946,
                "StarRating": "1",
                "Text": "I could not get past the first 5 or so pages...This subject matter is very interesting but I hated this guys writing style.  I know real helpful review...Im not a literary critic just saying that I have found a million different places ont he web to read about this \"god particle\" that are so much more entertaining."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27DR2NC2RYL4L"
                },
                "Date": "on January 5, 2015",
                "Helpfulness": 0.02564102564102564,
                "StarRating": "3",
                "Text": "I don't think my wife ever opened it, but it looked very interesting. Guess she's more of a Neill DeGrasse Tyson fan"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARX7WAVF3QR9K"
                },
                "Date": "on November 14, 2012",
                "Helpfulness": "",
                "StarRating": "1",
                "Text": null
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Particle-End-Universe-Higgs-Boson/product-reviews/0142180300/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "198"
    },
    "Salesrank": "#21,272",
    "Timestamp": "2015-05-24 12:49:05.401688",
    "itemurl": "http://www.amazon.com/Particle-End-Universe-Higgs-Boson/dp/0142180300"
}
