{
    "Category": "in Books (",
    "ListPrice": "",
    "Name": [
        "LSC  : Six Ideas That Shaped Physics Unit E(General Use)"
    ],
    "OfferPrice": "$33.09",
    "Reviews": {
        "AverageStarRating": "2.0 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OMCQWI4IT54A"
                },
                "Date": "on January 11, 2009",
                "Helpfulness": 0.8888888888888888,
                "StarRating": "1",
                "Text": "This book is tough if you are learning it for the first time. It assumes you know much more than you do. The homework problems require you to take big leaps from what is covered in the text. If you need references for certain materials and their properties they are often not in the book, requiring you to search outside material. I spent hours on 1-2 homework problems because the information I needed to answer it simply wasn't in the book. I bought the Knight textbook a bit into the semester, and it literally cut my study time to about a quarter of what I was spending. If your professor wants to use this book, buy the Knight physics book to supplement your studying. It will fill in the gaps in an understandable way."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TQE5FC0RRZK5"
                },
                "Date": "on March 9, 2009",
                "Helpfulness": 0.7777777777777778,
                "StarRating": "1",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGFHC9EFLTT8B"
                },
                "Date": "on February 21, 2013",
                "Helpfulness": 0.75,
                "StarRating": "1",
                "Text": "I am writing this review halfway through the semester because I have absolutely no faith left in this book. I was required to buy it through my school and I would have rather spent my money on anything else besides this. The book is just not clear at all, it gets way too wordy and takes several pages to explain even the simplest of concepts. Even when these concepts are explained they are poorly done, leaving the reader terribly confused. I urge anyone that is going to buy this book not too. If your class is requiring you to buy this book, try and find another class that uses a different book. I am midway through the semester and don't even remotely understand one concept in this book (I am a 3.0 student in college so I am not stupid), take my advice now so you don't have to suffer through a whole semester like I do!"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OXKMBA8ZIBK1"
                },
                "Date": "on September 12, 2009",
                "Helpfulness": 0.7272727272727273,
                "StarRating": "1",
                "Text": "This book was required for my class, so I had to buy it. It is very confusing to understand with very few examples. The book leaves out alot and assumes you already know the important details. You will spend hours trying to understand the chapter and the homework takes even longer with completly uncertain results. If you buy this book get ready to enter the fog."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33DWT2APDBNX6"
                },
                "Date": "on August 5, 2013",
                "Helpfulness": 1.0,
                "StarRating": "1",
                "Text": "The author's good intentions not withstanding, this is a lousy book with which to review physics due to the nearly lack of examples, extreme verbose style and no answers to the problems... I am giving up and putting it up for sale, instead using the text: Electricity, Magnetism, and Light by Wayne M. Saslow, which is a very well written textbook, with lots of examples and explanations. I took E and M years ago and want a good review, which requires a good textbook. I hope the author reads these reviews and realizes he failed in writing a top-down approach to teaching physics."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1STQPNFQ3W66B"
                },
                "Date": "on July 24, 2013",
                "Helpfulness": 1.0,
                "StarRating": "3",
                "Text": "eh...good i guess but hate physics. book was wordy and din't really explain much. got tired of trying to understand it. sucks that it was for class"
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVTBYO1TVROU2"
                },
                "Date": "on March 2, 2015",
                "Helpfulness": "",
                "StarRating": "1",
                "Text": "A rambling, incoherent travesty of a physics book. Having taken physics in high school and retaking the equivalent class in college, I can testify that this book not only explains the crucial concepts of each chapter in a way that takes hours to even attempt to comprehend, but certain essential equations and theories are conspicuously missing. I recommend that if your class requires you to buy this book, to drop the class, drop out of whatever university would approve this book, and then leave the country."
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NILHXXN5A9EL"
                },
                "Date": "on September 23, 2013",
                "Helpfulness": 0.3333333333333333,
                "StarRating": "4",
                "Text": null
            },
            {
                "Author": {
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZ9YUH6ESLKTX"
                },
                "Date": "on November 19, 2014",
                "Helpfulness": 0.0,
                "StarRating": "5",
                "Text": "good product for the money"
            }
        ],
        "ReviewUrl": "http://www.amazon.com/LSC-Ideas-Shaped-Physics-General/product-reviews/0073540994/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "9"
    },
    "Salesrank": "#179,413",
    "Timestamp": "2015-05-24 13:35:02.408863",
    "itemurl": "http://www.amazon.com/LSC-Ideas-Shaped-Physics-General/dp/0073540994"
}
