{"Category": "in Books (", "Name": ["Time's Pendulum: From Sundials to Atomic Clocks, the Fascinating History of Timekeeping and How Our Discoveries Changed the World"], "Timestamp": "2015-05-24 23:20:56.785361", "itemurl": "http://www.amazon.com/Times-Pendulum-Fascinating-Timekeeping-Discoveries/dp/0156006499", "Reviews": {"TotalReviewCount": "12", "ReviewList": [{"Date": "on May 8, 1999", "Text": "This is really two books--the first is a chronological history of time measurement devices, and the second is a history of humankind's perception of the age of humanity, the earth, and the universe.  The first book is  fascinating and well written.  Writing for a general readership, Barnett  explores the development of clockmaking and how the existence of ever more  accurate clocks has irrevocably changed everyday life for us all.  Her  detailed explanation of the verge-and-foliot escapement was especially  fascinating, as was her discussion of \"the equation of time\" and  how it gives rise to the Mean in Greenwich Mean Time.  Overall, the first  half of her book is a wonderful introduction to an underappreciated portion  of humanity's history.  The second half of Barnett's book, however, is a  rehash of material that Isaac Asimov explored fully in his nonfiction  writings in the 1960s and 1970s.  It may hold the interest of readers  unfamiliar with Asimov, but for me it was a real disappointment, especially  after such a compelling introduction to the history of clocks and  clockmaking.", "Helpfulness": 0.9545454545454546, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BZG4QEFF1S80"}}, {"Date": "on March 10, 2004", "Text": null, "Helpfulness": 0.9333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2B9Q710R2ATBT"}}, {"Date": "on October 27, 2002", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2L12L13HKKC91"}}, {"Date": "on June 14, 2001", "Text": "Time's Pendulum is a book not only about time and how time is measured, but also about our perception of time -- from the moment we as a species started worrying about it right up to today. Barnett does not only discuss clocks and how clocks work but the importance of time in daily life. Also excellent is her discussion of 'deep time' -- thinking about time on astronomical scales. I was also pleased by the more subtle connections. For example, the influence of the railroads on not only synchronizing watches over extending longitutes (i.e., time zones), but also their contribution to geologic time through uncovering the fossiliferous rocks during their construction.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DWG10K1FHL37"}}, {"Date": "on January 9, 2014", "Text": "The subject matter IS fascinating; the writing style is acceptable; but the illustrations leave something to be desired; they are often too small to be of any value and or poor reproduction. If I had been able to thumb through this book in person, I would not have bought it. As it is, I read it and then donated it to the library sale. In other words ... worth reading but not worth keeping.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFVPCYFKID97"}}, {"Date": "on January 7, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8OFFIAL6XTOH"}}, {"Date": "on July 3, 2014", "Text": "Accurately titled - a fascinating read.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XAAFEQVALN1T"}}, {"Date": "on August 3, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AANNJ0DHS56ZQ"}}, {"Date": "on October 25, 2010", "Text": "Fantastically researched and written.  Highly, highly recommended, but be warned - you will want to read it twice!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NJLIPZHMEIP7"}}, {"Date": "on December 29, 2011", "Text": "It is not the kind of book that traps you until you finish it, but so far I have enjoyed it.", "Helpfulness": 0.5, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADN3VK1FV7XKM"}}, {"Date": "on June 15, 2007", "Text": "I've already had some interest in the topic, but wanted to pickup another book and see what else I could learn, so got this one based on the reviews.  A very good book, would highly recommend for someone who wants to learn about the history of keeping time.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3INN916E4VION"}}, {"Date": "on February 4, 2013", "Text": "The author is a politically correct atheist who feels compelled, on nearly every page, to tell you how advanced the Chinese and Islamic civilizations were in the Middle Ages despite the fact that mechanical clocks were invented in Europe.  Her anti-Christian and anti-Western asides got so disgusting I had to toss the book in the garbage.", "Helpfulness": 0.29411764705882354, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BAVKFUESS8Q7"}}], "ReviewUrl": "http://www.amazon.com/Times-Pendulum-Fascinating-Timekeeping-Discoveries/product-reviews/0156006499/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.1 out of 5 stars"}, "OfferPrice": "$15.34", "Salesrank": "#706,044", "ListPrice": "$19.95"}