{"Category": "in Books (", "Name": ["Bell That Rings Light, The: A Primer In Quantum Mechanics And Chemical Bonding (Mathematics Across the Curriculum)"], "Timestamp": "2015-05-24 23:28:33.691259", "itemurl": "http://www.amazon.com/Bell-That-Rings-Light-Mathematics/dp/9812567062", "Reviews": {"TotalReviewCount": "3", "ReviewList": [{"Date": "on January 9, 2009", "Text": "Dorothy Wallace has written a wonderful primer of quantum mechanics and the mathematics underlying the Schrodinger equation which allows one to grasp the basic structure of the hydrogen atom. Dr. Wallace pulls no punches in the mathematics involved so the reader will need a basic knowledge of calculus and at least know what a differential equation is to follow her well reasoned book. Before one tackles this text, I would recommend reading Thirty Years that Shook Physics by George Gamow and Quantum Mechanics for Chemists by David O. Hayward. Armed with historical knowledge from Gamow's book and a basic understanding of quantum mechanics (Chapters 1-6) from Hayward's book, the reader will easily follow most of the concepts in this superb book by Wallace. Wallace initially sketches concepts of Rutherford, Bohr, and Balmer and follows this with short chapters on some early experiments and early quantum mechanics of the hydrogen atom. She then introduces the Schrodinger equation, classical waves, and particles in a box. Next, the reader is introduced in several chapters to Fourier coefficients, the Laplace operator, quantum numbers, the group SO(3,R), spherical harmonics, and Laguerre polynomials. After two short chapters on bonding and valence shell electron repulsion; she presents two beautifully written chapters, replete with vibrant, color computer graphics, on the shape of an orbital and molecular orbital theory. These two chapters are the very nexus of the book and were very enlightening to me. The book concludes with chapters on valence bond theory, other kinds of bonding, and a case study: Dye Molecules. In my opinion, these last three chapters will be of great interest to chemistry students. I attempted to read Griffiths' Introduction to Quantum Mechanics prior to reading this book but the mathematical formalism was a little too difficult for me. After reading Gamow, Hayward, and this volume; I would suggest that the reader delve into the philosphical battles about quantum mechanics picture of reality which raged during the 1920s. Einstein and Bohr were at the heart of this intellectual conflict.  The struggle for the soul of science involving the dispute over quantum mechanics is beautifully portrayed in Einstein Defiant by Bolles and Uncertainty by Lindley. Dr. Wallace has written a lucid explanation of how Schrodinger's equation allows us to grasp the structure of the hydrogen atom. Her primer presents the material in a mathematically sophisticated manner but not at a level which will leave the reader hopelessly lost in the abstract mathematical formalism of quantum mechanics. THE BELL THAT RINGS LIGHT will reveal the beauty of the hydrogen atom as portrayed by the Schrodinger equation to any reader who is willing to take pen and paper in hand and work through the mathematics. I do wish that she would post a few simple problems on her website with worked out solutions.  In conclusion; a primer which will, in time, become a classic for beginners.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27V0S2I3M9ZOJ"}}, {"Date": "on October 17, 2010", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKV9F8HZ7XX0B"}}, {"Date": "on January 7, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AV3CZBGT4TG2I"}}], "ReviewUrl": "http://www.amazon.com/Bell-That-Rings-Light-Mathematics/product-reviews/9812567062/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.3 out of 5 stars"}, "OfferPrice": "$26.53", "Salesrank": "#1,686,208", "ListPrice": "$29.00"}