{"Category": "in Books (", "Name": ["Scientific Literacy and the Myth of the Scientific Method (Illini Books)"], "Timestamp": "2015-05-24 23:10:48.701758", "itemurl": "http://www.amazon.com/Scientific-Literacy-Method-Illini-Books/dp/0252064364", "Reviews": {"TotalReviewCount": "7", "ReviewList": [{"Date": "on November 2, 2000", "Text": null, "Helpfulness": 0.9137931034482759, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TPJOEN2CVO36"}}, {"Date": "on July 22, 2000", "Text": "I took a class from Professor Bauer at Virginia Tech (the title eludes me) about pseudoscience - Loch Ness monster hunts, cryptozoology, UFO's, Cold Fusion, Kirlian Photography, Psychic/Palm Readings,  etc. - and this was a  supplemental text for the class. The book really explores how the  Scientific Establishment/Hierarchy operates and how it isn't all that  \"objective\" after all. Scientists are people, after all, and with  that comes all the animosities, territoriality, envy, back-stabbing, and  greed that all people exhibit. Radical discoveries by groups of people may  get ignored, dismissed offhand, or viciously attacked by the establishment  so as to preserve the integrity and perceived authority that the  establishment weilds. Science is not an immaculate, dust and static free  process - there are struggles and paradigm shifts all the time - and the  general public tends to think it is just the opposite. I recommend this  book for anyone who likes to challenge conventional modes of thinking and  re-examine some of the longest-standing illusions about science ever  created.", "Helpfulness": 0.8611111111111112, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZSQX4UOGT2H6"}}, {"Date": "on October 19, 2014", "Text": null, "Helpfulness": "", "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1660EJ86U5L6"}}, {"Date": "on July 21, 2008", "Text": "Should be required reading by anyone involved in science and most of all...students.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEIYQSPOHQK1Y"}}, {"Date": "on August 1, 2010", "Text": null, "Helpfulness": 0.4230769230769231, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEDXCJX7JDTA7"}}, {"Date": "on August 20, 2006", "Text": null, "Helpfulness": 0.15384615384615385, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NSUJYBA5A4FC"}}, {"Date": "on November 21, 2011", "Text": "Anti-creationism dressed up in a mountain of fancy talk. You don't need a mountian of fancy talk to learn \"science\" isn't something to base your life on. The author seems very confused, in which he doesn't want people engaging in \"scientism\" and not to base your life on it, and that there's different types of science, and it shouldn't be closed off to new ideas, yet this guy sneaks in some asburd comments about creationism being pseudo science without ANY evidence. Yet clearly, his book is supposed to be against that type of discrimination. What a whopper of a mistake. This is just an anti-religionist trying to come across as reasonable, but fails, because he is against the very thing he's teaching: being open to what is reasonable.", "Helpfulness": 0.05555555555555555, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TY97ZGQT5FGF"}}], "ReviewUrl": "http://www.amazon.com/Scientific-Literacy-Method-Illini-Books/product-reviews/0252064364/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "3.7 out of 5 stars"}, "OfferPrice": "$20.70", "Salesrank": "#1,149,984", "ListPrice": "$23.00"}