{"Category": "in Books (", "Name": ["Quantum Theory (Dover Books on Physics)"], "Timestamp": "2015-05-24 21:27:19.981378", "itemurl": "http://www.amazon.com/Quantum-Theory-Dover-Books-Physics/dp/0486659690", "Reviews": {"TotalReviewCount": "31", "ReviewList": [{"Date": "on December 13, 2002", "Text": null, "Helpfulness": 0.9865771812080537, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2N3N439PRGV3I"}}, {"Date": "on February 13, 2001", "Text": "This is perhaps still the best way to enter quantum mechanics. This book was not written in haste: there is depth in almost every page. Yet, very little is assumed of the reader, but that he has a genuine interest in learning the subject, and patience to read it sequentially, calmly,  and ponder about it. There is, then, no better guide.Do not think you will miss the computation techniques: they are all there. This is a complete book. It will teach you the orthodox view. Then, if you care, read the other books by Bohm, to learn of possible alternatives.", "Helpfulness": 0.974025974025974, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D7XC7USJ9X7J"}}, {"Date": "on December 16, 1999", "Text": "The title page of this book lists Bohm as a professor emeritus at the University of London but this is actually a text developed at Princeton in the late 1940's.  Not long after the book was written, Bohm had got himself  in trouble for not revealing what left-wing activities he had got himself  involved in with his mentor J.R. Oppenheimer.  Princeton couldn't stand the  political heat of having a suspected communist on its physics faculty and  Bohm got booted out.  He wandered off to Brazil and Israel before finally  ending up in London.  Ironically, Princeton had fired someone who had just  written one of the greatest classics of the quantum mechanics literature.  The book is outstanding for its extensive discussion of the philosophical  foundations of quantum theory.  Bohm at that time believed in the  Copenhagen Interpretation of Niels Bohr.  Only traditional mathematics,  rather than the murky abstraction of the Dirac bracket, is used.  Carefully  selected problems are inserted into the text whenever important new  material has been introduced.  Although the book is a little dated, today's  reader should still find the chapters on the WKB approximation, Heisenberg  matrix mechanics, and perturbation theory edifying.  In short, this is a  book to be enjoyed.", "Helpfulness": 0.9203539823008849, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26BKV6R6XFJT6"}}, {"Date": "on August 11, 2003", "Text": "The age of the book is what gives it a huge advantage to today's typical QT and QM textbook. Instead of presenting the concepts in the \"status quo\" of physics (usually just a ridiculously brief intro to why QT started, and then presenting Operators as things almost perfectly synonymous to classical concepts and continuing from there), this book really goes through the history of where all the math came from. Bohm is very careful about teaching you what parts of the math are just convenience tricks (like Operators) versus real necessities to QM. And also what parts are just based on just experiments. Unlike today, in the 1950's, QT and QM were still suspect theories, so students were taught of the known and possible holes (no pun intended :) in the theory. Bohm points these out throughout the whole book.", "Helpfulness": 0.9459459459459459, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on October 11, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RFXU3P0XKKF4"}}, {"Date": "on October 16, 2001", "Text": "This is a book for you to read again and again through your whole life. When you are an undergraduate, lots of good technical information are found in this volume regarding, for instance, wave packets or the hydrogen atom. As you get more experienced and, of course, if you have some interest in the philosophical issues raised by the subject, the book turns to be a reference again.", "Helpfulness": 0.8888888888888888, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3K588DIIFBE66"}}, {"Date": "on February 7, 2000", "Text": "Bohm explains quantum mechanics at a level that gives great physical insight and understanding. It not only provides theory, but also gives detailed historical accounts of the development of the theory. A great text  for undergraduates.", "Helpfulness": 0.8695652173913043, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5FXYYI6VSD7E"}}, {"Date": "on December 3, 2009", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39JVO696N0NJH"}}, {"Date": "on September 16, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SELHGTVV0Y8D"}}, {"Date": "on August 13, 2011", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16GAIJJE39T1S"}}, {"Date": "on May 8, 2014", "Text": "Although first published in 1951, this book is still relevant today.  Bohm was one of the first physicists to believe that the reason subatomic particles are able to remain in contact with one another (called quantum entanglement) regardless of the distance separating them, is not because they are sending some sort of mysterious signals back and forth, but because their separateness is really just an illusion.  At a deeper level of reality these particles are extensions of a fundamental 'something'.  Bohm was an early proponent of the idea that objective reality did not exist.  He believed that the world was really an enfolded state: like quantum waves that are stored on a holographic plate and projected--which creates the world we see.  While the topics are carefully explained, the mathematics are quite challenging.  Written by a man whom Feynman described as probably the smartest person he knew, this remains the best book on quantum mechanics ever written.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11FNDXYXNC9SC"}}, {"Date": "on July 6, 2012", "Text": "There are many books on quantum mechanics for both beginners and advanced readers. All filled tremendous abstract mathematics, and few explanations what it means. Bohm, one of the influential figures in the 20th century and has massive contribution to quantum mechanics. This books is written elegantly for basic understanding of quantum mechanic, from what it means, simple equations, to advanced mathematics. It's bring the reader on a ride. Excellent book and a must have for those wants to learn quantum mechanics.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOU9YTIPKVW9N"}}, {"Date": "on April 2, 2013", "Text": "I've only started reading Bohm's book on quantum theory by flipping to parts of immediate interest to me, but already I'm very impressed.  I've always been confused by treatments of Heisenberg's matrix mechanics, but Bohm's discussion is very clear and I finally feel like I'm getting somewhere.  He also has a great section on how half-integer spin comes about.  I think the book contains a good mix of abstract fundamentals and particular examples, and the problems also seem interesting.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIV0Z6IZAEG4O"}}, {"Date": "on February 7, 2000", "Text": "Bohm explains quantum mechanics at a level that gives great physical insight and understanding. It not only provides theory, but also gives detailed historical accounts of the development of the theory. A great text  for undergraduates.", "Helpfulness": 0.7142857142857143, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on January 16, 2014", "Text": "If you really want to a supplement to your Physical Chemistry Book, this is a good one. It covers different concepts that might not be addressed in much detail in your regular text. I was required to get it for class and I kept it.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AD302K5ZETGI2"}}, {"Date": "on February 7, 2011", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36JDVO40B66RB"}}, {"Date": "on December 28, 2013", "Text": "This book is a very, very good book on quantum mechanics.  I am a junior EE major and this book is at just the level that I wanted.  It is mildly challenging, but if you went through the freshman and sophmore level physics and math classes you should be able to read the book without too much difficulty.  I especially liked how Bohm wanted to try to develop some intuition rather than just teach how to solve problems (I don't Griffiths for this reason).  I also enjoyed the chapters on measurements in quantum mechanics.  If you're considering buying this don't hesitate and just do it.  At less than 20 dollars you can't go wrong.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22HMM1G4LCOV3"}}, {"Date": "on February 4, 2013", "Text": "This book has an excellent discussion of the experiments that led to the theoretical development of quantum ideas.  The math is on par for an early to mid level undergraduate class class in physics.  I appreciate having the mathematics developed in the text, so that there is also a rigorous development of the ideas.  There are problems scattered through the text that are reasonable to do after having read the relevant sections.  But the prose is excellent, the author really takes time to explain the intuition behind the math.  Even if you skip over some or most of the math, one still learns much from the text alone.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JCMMWGGO1XAG"}}, {"Date": "on March 9, 2014", "Text": "The copyright date for this text is 1951, but a significant amount of QM theory had already been worked out by then.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZTZRE7HLUY2C"}}, {"Date": "on November 5, 2014", "Text": "The book is a much harder then an introduction to the subject. That's why I sent it back.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35ZXZPWBV10BE"}}, {"Date": "on April 8, 2015", "Text": "This is a good book to put on your shelf to show passers-by how smart you are.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGHH41D5BN63F"}}, {"Date": "on December 9, 2014", "Text": "I love all the Dover books!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2T756X5QRL81N"}}, {"Date": "on September 16, 2014", "Text": "very good book and service", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AT6AQJKPRW1P"}}, {"Date": "on July 18, 2012", "Text": null, "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFVROUVTT63XM"}}, {"Date": "on August 5, 1998", "Text": "Bohm has written a well balanced, introductory book on quantum mechanics. An advanced sophomore could understand the needed math.  There is also a fair amount of qualitative interpretation of quantum mechanics.", "Helpfulness": 0.6, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on September 9, 2014", "Text": "I will recommend this product to any one interested.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22J26RPRXM187"}}, {"Date": "on February 25, 2013", "Text": null, "Helpfulness": 0.4, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RMMDO7X5342A"}}, {"Date": "on March 22, 1998", "Text": "A very interesting discussion of standard QM (not Bohm's own theory). Physical insight and motivation are nicely emphasized...", "Helpfulness": 0.38461538461538464, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17I3RN51P5FYI"}}, {"Date": "on September 25, 2004", "Text": null, "Helpfulness": 0.4810810810810811, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZDPQA6FLY8XM"}}, {"Date": "on May 10, 2013", "Text": "The math was very overwhelming.  Sadly, I couldn't finish it.  I managed to get a bit more detail on quantum theory though, which was my goal.  I hope to brave through it again but it's been too long since I understood mathematics at this level.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17VM5SPOLOCIT"}}, {"Date": "on June 14, 2003", "Text": "I bought the book because of the good reviews below and the low price. I was a little disappointed with Bohm's explanations and wordings of concepts that I already know. I think that it'd be difficult for someone to learn anything from this book unless (s)he is already familiar with quantum mechanics. Anyhow, the book is still a good buy considering it is at least 5 times cheaper than textbooks on quantum mech.", "Helpfulness": 0.2727272727272727, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVTOR9BO47B58"}}], "ReviewUrl": "http://www.amazon.com/Quantum-Theory-Dover-Books-Physics/product-reviews/0486659690/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.5 out of 5 stars"}, "OfferPrice": "$16.94", "Salesrank": "#69,715", "ListPrice": "$22.95"}