{"Category": "in Books (", "Name": ["Cosmos"], "Timestamp": "2015-05-24 23:23:24.969686", "itemurl": "http://www.amazon.com/Cosmos-Carl-Sagan/dp/0345539435", "Reviews": {"TotalReviewCount": "502", "ReviewList": [{"Date": "on March 19, 2003", "Text": null, "Helpfulness": 0.9416058394160584, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHXAPVSHPJ6OJ"}}, {"Date": "on September 8, 1999", "Text": null, "Helpfulness": 0.9357142857142857, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on January 7, 2001", "Text": null, "Helpfulness": 0.9117647058823529, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A134FLH2KNA0JU"}}, {"Date": "on June 15, 2012", "Text": "The content of this book makes it a classic. But the quality of the mass market edition fails to do it justice: the print is the tiniest I have ever seen (or not seen--who knew so many words could be crowded onto a page?). The covers are the event horizon beyond which legibility disappears. The layout is perfunctory and the paper cheap. Yes, mass markets are not printed for elegance, but this one sets a new low. For a few dollars more, the paperback edition, also available from Amazon, provides everything you were hoping for, including a large number of high-quality illustrations and photos, that, like the much more expensive hard cover edition, creates in the reader the sense of surprise and awe that Sagan intended.", "Helpfulness": 0.8823529411764706, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3A5O8R4F4PATP"}}, {"Date": "on November 6, 2000", "Text": null, "Helpfulness": 0.9473684210526315, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACISL24B4TAQG"}}, {"Date": "on June 29, 2001", "Text": null, "Helpfulness": 0.9411764705882353, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2T0D77UQWFOV5"}}, {"Date": "on March 23, 2001", "Text": "Cosmos is more than just a book about space. The word Cosmos itself, derived from ancient Greek, implies the deep interconnectedness of all things, in which we all play a part. Although it was written over two decades ago, and therefore you may think that it may not be so relevant in its facts today, its underlying dual-purposes, to educate and to inspire, remain just as relevant as ever. It serves as an introduction to science, and the late Carl Sagan, one of the great humanists of our time, does an excellent job in bringing us into that world by not presenting simply hard facts and technobabble. Instead, he tries to make the book accessible to the scientific novice, and shows how it is relevant to every aspect of our daily lives. And we learn about the development of human understanding, not only in terms of 'Where did we come from?' and 'How did the universe get created?', but the development of ourselves, as people who began our existence from the most humble of beginnings, and were intelligent enough to ask ourselves 'Who are we?' and of course 'Why are we here?'. He shows why science is not only relevant to us here and now, but how it can help us to understand the future, and in the final chapter, he makes it clear that through the rampant destruction of our environment, that future may not be so long-reaching as we might dream it. Sagan manages to gently educate us in a stylish and entertaining way, and his book Cosmos leaves us feeling richer for the experience. I certainly recommend this to anyone. After all, it does concern everyone!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NGH3DOKQFCWD"}}, {"Date": "on June 6, 2003", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VE83MZF98ITY"}}, {"Date": "on November 10, 1999", "Text": "This book changed my life. I studied science for over 10 years, and now I teach science (to High school kids) because of this book.  My parents bought me Cosmos when I was an 11-year old (the same year the book was  originally published) and I have been reading it ever since. I like to  think I'm a decent teacher, but Dr. Sagan was a master. Students of all  disciplines can learn from this remarkable text; Carl Sagan's passion for  understanding and his various commitments to human welfare shine out like a  beacon. If you have teenage kids, but them this book.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on June 28, 2001", "Text": "I have never been much of a scientist, but Carl Sagan makes me wish I was. In Cosmos, Sagan takes the readers through the history, present (as of 1980), and future of astronomy. In under 300 pages, he summarized all that I learned in a semester long astronomy class and much more, all in clear, concise, and interesting prose. He asks and answers many questions I have had about the universe beyond Earth, and proposes many theories and scenarios that he wishes he knew more about. He writes in a way that every reader can understand, even when the subject is a terribly complex problem that only the greatest astronomers have dared to tackle. This trait as well as his own curiosity, make the reader feel comfortable and assured even if they will never be more than hopelessly amatuer astronomers. Aside from the broad exploration of the Cosmos, Sagan makes interesting cases for the advancement of knoledge and peace on Earth and takes fascinating tangents  that are very thought provoking. This is the best science book I have ever read and while I will never be much of a scientist, it makes me jealous of those who are.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1A58DW45TQZMX"}}, {"Date": "on October 4, 2005", "Text": null, "Helpfulness": 0.8823529411764706, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28WJUJF6D2ULA"}}, {"Date": "on August 27, 2003", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25DTRT68CLHES"}}, {"Date": "on January 24, 2002", "Text": null, "Helpfulness": 0.9090909090909091, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31GT8U32CIKW0"}}, {"Date": "on February 16, 2000", "Text": "The late Carl Sagen had a wonderful way of relating his apparent knowledge of everything into a form that comparative idiots can understand. His genius appears to be, not just his ability to formulate the evalution of  the cosmos into something understandable to himself, but into a book  understandable to those of us with IQs less than was his 150-plus. I've  read this book a couple of times, as well as \"A Brief History Of  Time\" by Stephen Hawking. Both books are wonderful in the authors'  attempts to share their enthusiasm of science and physics, but the  difference is Sagen's ability to simplify the topic for the common  intellect. Hawking either seems unable to to so, or is tackling subject  matter much too difficult for the general public. Not so for Sagen... AND  Perhaps even now a life-form on another planet across a hundred billion  stars from Earth is observing our planet as it appeared in the past, in a  better time when the great Carl Sagen lived among us.", "Helpfulness": 0.8260869565217391, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3H2TYDHMSJHAF"}}, {"Date": "on February 8, 2003", "Text": "Carl Sagan was, if this book is any example, an extremely intelligent and caring man. His voice intertwines the stories of history, philosophy, and science, and every sentence is both brilliant and fascinating. But the best thing about Cosmos is that it makes ME feel really smart. I can follow everything Sagan says, even though it's some pretty deep stuff, because he's so good at telling it on the level of the intelligent, interested layman. The last few chapters of the book may seem dated, but they really aren't; the \"enemy\" has changed but the issues are still the same. I heartily recommend this book for anyone who is the least bit interested in science. It is wonderful!", "Helpfulness": 0.8666666666666667, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JM25YVLEE318"}}, {"Date": "on September 16, 1998", "Text": "Beautiful, clear, understandable, and shimmering science.  Cosmos is a  must read for everyone with deep intellect and love for learning.  It is by  no means explained in high level terms, but Sagan doesn't need those!  I  felt 50 percent more wise after reading this book.  I've read all his works  and this is the best by far. The book is a magnificent master piece full of  wonder and enchantment, more exiting than a thiller, explosivley more  informative and interesting than any science book! - Mitchell Frost Age 12,  high level achiever with Sagan as a role model. I AM NO ATHEIST!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on December 6, 2006", "Text": "There are \"great\" books, and then there are books that are truly essential; this is a rare book that educates you and delights you at the same time. (I wish every college textbook contained the same mix of facts and fascination as this book does.) COSMOS was the first book I have ever read that left me feeling that I had gained ESSENTIAL information that had never been provided to me during a high school or college course.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AW6W67NYN5PR1"}}, {"Date": "on March 24, 2000", "Text": "Having now read both Cosmos & Pale Blue Dot I can't help thinking on the drive home how precious life is, and how amazing our cities, our countries and our planet would look from above to another civilization.  Carl Sagan has left me with the lingering thought, \"Could we be the  first civilisation that has actually evolved into a form of intelligent  life since the Big Bang, and if so, why are we so stupid?\"", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Y9T759102040"}}, {"Date": "on July 1, 2006", "Text": "I've read this book couple of years ago but it was translated into Arabic & I knew nothing about Dr. Carl Sagan, but I felt like am standing in front of a giant in science & from that day I loved this book so much & I took it everywhere, I think my passion for space science & then to all sciences really began after I read this book. Indescribable book.", "Helpfulness": 0.9090909090909091, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AY1NFYMVE79N8"}}, {"Date": "on June 16, 2010", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11JMMUU3WH034"}}, {"Date": "on June 3, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35YWTGEAE2PGG"}}, {"Date": "on April 17, 2010", "Text": "It's been years since I last watched repeats of Carl Sagan's \"Cosmos\" series on PBS, but I still have fond memories of it from my adolescence.  I recently read the book based on the series, which covers the same basic material but without (as Sagan points out in the introduction) being a transcript.  Still, the book captures the distinctive voice and language that Sagan used while narrating the TV series.  Although some of the science is now dated- for instance, the Big Bang is now believed to have happened about 13.7 billion years ago, rather than the \"fifteen to twenty billion years ago\" that Sagan cites- the book essentially focuses on the history of science and stays general enough to stay relevant and interesting.  Sagan is also careful enough as a scientist and writer to add qualifications to his statements and point out scientific uncertainties.  On the whole, the book is still a readable classic of popular science, especially if you're nostalgic for the TV show (without wanting to pay for the boxed set of DVDs).  One can, of course, argue with some of Sagan's optimistic view of science: he see science as essentially a force for good that has only been corrupted by superstition and mysticism, rather than seeing it as a morally neutral technique that can inherently be used for either good or evil.  But his outlook motivates his enthusiasm for the subjects he covers and adds to the spirit of the book (and yes, Sagan is fascinated by vast quantities and refers frequently to things like \"billions upon billions\" of stars and galaxies).", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKI8VJIO9GF4M"}}, {"Date": "on January 27, 2007", "Text": "What more can be said about this book which hasn't already been said? This is the kind of book which sparks an interest in science which can't be extinguished. When you read this book, you'll be fascinated by all fields of science, from the most elementary electrons, lost in quantum physics, to the most elegant inner workings of biology, and finally, to the farthest expanses of the universe itself. Of all the books, in all the countries, written by all the authors in the present and past, this is surely the book which must be read by everyone. It would be impossible to quantify how many people's lives have been influenced by this masterful book. No other book in my library comes as highly recommended as does this one.", "Helpfulness": 0.8888888888888888, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASKLO1MLD8PMH"}}, {"Date": "on February 13, 2000", "Text": "This is the first book that I've ever read by Carl, and I'd have to say that I'm hooked! I have already purchased many other books written by him such as Contact, Cosmic Connection, Pale Blue Dot, and Billions and  Billions. As I was reading this book, I couldn't put it down. I actually  looked forward to reading a science book! He does a marvelous job of  explaining the history of the cosmos to the general public-- you don't have  to be a Harvard graduate to be able to understand it. His mild amusement  throughout the book keeps you hooked, and the charm he has even more so.  I'd give this book a BILLION stars! I reccomend it to anyone that would  like to learn more about the history of the cosmos, and its future.", "Helpfulness": 0.8888888888888888, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANTS31C9C623V"}}, {"Date": "on June 16, 2000", "Text": "Everyone should read this excellent book, written by the late Carl Sagan; it should be read in high schools and everyplace where science is taught, because it is one of the most mind-opening books I have ever read. Although  it mainly deals with astronomy in an excellent and easy to understand  manner, one aspect that it is worth mentioning is the fact that Dr. Sagan  was a science loving person that loved and respected all nature, and that  is something that can be read between the lines, because he inserts in some  parts of the book captivating pieces of his philosophy and his love for the  universe and our fragile place in it; he transmits the reader his love for  all this things and his optimism that, although we are heading towards out  own ruin, it is also in our own hands to avoid self-destruction. The final  chapter, \"Who speaks for Earth\", is well worth reading two or  three times, to \"acquire\" at least a small piece of Dr. Sagan's  conscience in the dangers of nuclear war, but also some of his optimistic  ideas about our future. I think the Earth lost one of its main scientists  and defenders when Dr. Sagan passed away.", "Helpfulness": 0.875, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A187K5P4JYT18Y"}}, {"Date": "on September 29, 1999", "Text": null, "Helpfulness": 0.875, "StarRating": "4", "Author": {"ProfileUrl": ""}}, {"Date": "on July 19, 2005", "Text": "An INcredible eye opener. I was worried about all the technical lingo, but it was easy to understand. I am a new person with a broader horizon after reading this book. You look at the earth and the sky in a whole different way. The world would be a much better place if EVERYONE would read this book.", "Helpfulness": 0.875, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OKVUPD6OPM2L"}}, {"Date": "on January 18, 2007", "Text": "If any twentieth-century work of popular scientific literature deserves to stand the test of time, it is \"Cosmos\". As most of its readers will quickly point out, there are few books that have managed to so adeptly pull off the dual feat of entertaining and education an audience. Yet there is more to this book than those aspects alone; I would argue that the most noteworthy aspect of this text is its ability to fully convey to us, in all of its splendor, the vastness of our universe, and the sheer joy that comes with attempting to understand even a small part of it. One gets the sense that, deep down (before his tragic passing), Carl Sagan was a giddy schoolboy with a telescope, whose great love in life was sharing the beauty, wonder, and glorious potential he saw in the stars with as many different people as he could. Passionate people like that are often mocked, sometimes even despised, by a society which disdains eccentric orbits, be they of a human or planetary nature; yet the world is a far richer place because intellectuals like Carl Sagan exist. You owe it to yourself to read this book.", "Helpfulness": 0.8571428571428571, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A71KAEZY8LQTC"}}, {"Date": "on November 9, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2E9KSBVRNE70R"}}, {"Date": "on November 24, 1999", "Text": "Simply incredible, this book will take you on a journey that travels back and forth through the history and the future of science.  With poetic grace, it explains the cosmos in a way i would not have though possible,  and revealed things, not just things but Truth!  The actuality of the  universe, cleverly placed within the pages of a masterpiece.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2THUAWGRN9ARH"}}, {"Date": "on March 17, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4572SG2RV5DB"}}, {"Date": "on December 31, 2010", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MHDZXWWF0VIN"}}, {"Date": "on November 5, 2008", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SLVQKERJUS16"}}, {"Date": "on November 3, 2006", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LPI71PCQNKVF"}}, {"Date": "on June 25, 2001", "Text": "Cosmos takes a sweeping look at, well, the Cosmos. Carl Sagan brings perspective to our view of the starry night sky, as well as the living creatures here and all around us. We visit the planets of the Solar system and learn, from a practical layman's viewpoint, what they are like. Remember, as one of the best populist authors of science, ever, he knows how to keep you interested, laughing, and turning pages. It is all terribly interesting, especially if you don't know that Venus is almost as hot as a kiln -- but at first scientists thought it was nothing but jungle! And the Milky Way galaxy, if we could watch it spin in super high speed, looks a little like a spinning popcorn popper. But you'll understand that more if you read the book. If you were to read just 3 books by Carl Sagan, I'd first of all say get these Four: The Demon-Haunted World, Cosmos, Dragons of Eden, and Billions & Billions. In that order. But you won't know without conducting your own experiments, right? Read 'em all!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1E73AZK752T60"}}, {"Date": "on March 16, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CGK4R5RRF4RF"}}, {"Date": "on March 10, 2005", "Text": null, "Helpfulness": 0.8333333333333334, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1N8KJPJR2BYIU"}}, {"Date": "on May 28, 2000", "Text": "I first saw the PBS series \"COSMOS\" when I was about 16 years old.  It was a revelation.  Carl Sagan was an intelligent and skilled purveyor of the whole story of the universe as seen from the perspective of  we curious human beings.  This book is really a transcription of the series  with each episode corresponding to a chapter.  Ultimately, the success of  this series for me was the integration of so much information into such a  brilliantly unified thread.  Quite simply, Carl Sagan shows us why the  universe is so fascinating, and why it would be worthwhile to try and  preserve the human race so that we may continue to probe further into the  fantastic possibilities that may await us...", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1F6OPXM5LDZ4M"}}, {"Date": "on December 13, 2000", "Text": "I read this book about the time the PBS TV series \"Cosmos\" by Carl Sagan was on the air.  Both the book and the TV series was fascinating and I consider this book one of the best in my Library. Numerous other reviews will give you a good insight into the detail of the subject matter, for me I can say that this is truly a great book and for scientific content is my favorite. Carl has since died but his thought provoking style and clear and understandable discussion of some very complex scientific and cosmological topics is outstanding. A great book to read with hundreds of excellent photographs and diagrams.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A198UIB7WRHA3F"}}, {"Date": "on August 21, 2001", "Text": "Carl Sagan is a wonderful writer in the sense that he takes very complex subjects such as einstein's theory of relativity and makes it very easiily understandable to the layman.  He has such a passion for his work, that he is able to draw people into his world with his wonderful examples and descriptions.  I highly recommend this book to anyone who is interested even in the least bit about the universe.  If i could, i would rate this book a 6!  It is just that good.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3O6MTCHKCGU3Z"}}, {"Date": "on November 5, 2010", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BTSFYSD059A8"}}, {"Date": "on August 28, 2003", "Text": "The pictures Carl Sagan paints are unforgettable.  The descriptions of Jupiter, Venus, and Mars, the imaginative portrayals of extra-terrestial life, and the vast wealth of knowledge (explained at a level for the lamen) is just the icing on the cake.  His insightful statements about the way our own world is progressing is serious cause for reflection.  I was so  inspired by this book that I actually wrote a review for it (I have never written one before).  I would highly recommend this to anyone of my friends.  It's as much of a book about astronomy and science in general as it is a anylasis of our global social, religious, and political culture.", "Helpfulness": 0.8333333333333334, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on August 16, 2006", "Text": "This book is not about the scientific accuracy of Sagan's predictions and musings. If Sagan wanted to be purely scientific, this book wouldn't have been written. The fact is that we don't KNOW enough about what's out there to make scientific predictions. What we do have is our imagination, and our knowledge of how the universe works. Sagan does an excellent job of using his imagination to come up with different possibilities for us to ponder. He speculates about which might be more likely, but he doesn't claim scientific accuracy. This book will expand your mind and give you a mature outlook on the world and our place in the universe.", "Helpfulness": 0.8333333333333334, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LLIRWDEWC34V"}}, {"Date": "on April 8, 2001", "Text": null, "Helpfulness": 0.7777777777777778, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZJALA5LEQUPZ"}}, {"Date": "on June 18, 2005", "Text": "Cosmos changed my outlook on the world \"out there\".  When it comes time to relax and read a really interesting book that is full of very intelligent data, pick this up.  How about a great book to read the next time you take a transatlantic trip on the airplane or simply relaxing by the pool this Summer.  What an enjoyment, I have probably read this over 100 times and each time I take something new from it.  Cosmos is a genuine masterpiece BUY IT! Read it forever. I love Mr. Sagan. Plus it looks so impressive on your bookshelf.", "Helpfulness": 0.8333333333333334, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CMFEK742F0W3"}}, {"Date": "on November 18, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35YWA2V4QHOJ3"}}, {"Date": "on November 29, 2011", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1H7Y5XKPGT0OS"}}, {"Date": "on October 21, 2008", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BVPXYP9XE0XN"}}, {"Date": "on July 20, 2004", "Text": "Carl Sagan uses a boyish excitement that comes through the pages to explain Astronomies greatest hits since man was in a cave.  Some of the concepts explained are fairly heavy but he does an excellent job of breaking them down into a digestable format for anyone with a high school education.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGCYKX5110FXR"}}, {"Date": "on October 7, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PSFWWUSI3N82"}}, {"Date": "on August 22, 1997", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ERX0BPXQ47OQ"}}, {"Date": "on November 3, 1998", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on March 21, 2005", "Text": null, "Helpfulness": 0.8, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQFYUO5LU5AYK"}}, {"Date": "on April 19, 2007", "Text": "Before Cosmos, I used to live on earth. After Cosmos, I live on earth, in the milky way galaxy, in this vast and ever-expanding (and maybe contarcting) universe!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATBXNEJTSIUQ2"}}, {"Date": "on March 20, 1999", "Text": "I read Cosmos at age 48, after having studied mathmatics, physics, and astronomy for much of my early life. Although loving the strict rigor of mathematical proofs and scientific reasoning immensely, I believe that  there is something important to be said about the poetic, almost terrifying  beauty inherent in the most significant areas and principles in these  related field. I believe that Carl Sagan has sought (and accomplished) to  go beyond the purely technical (which has an admittedly limited  readership), and invited the uninitiate to venture into the realms of the  heavens as well, and there is alot to be said about this approach too.  For  one thing, the more enlightened the general public, the more chance for  mutual survival. Furthermore, science does not function solely in an ivory  tower; it coexists in a wider world with many people who could be made to  appreciate the genuine wonders.  It is to the author's credit that he  realizes this, which many other \"pure\" scientists of the same ilk  (Sagan certainly knew his \"hard science\" too) would be well to  observe.  Many scientists of my own acquaintance suffer from a debilitating  technical myopia.  So here's to a major achievement and major book.  Detractors should search their souls and motivations carefully. The world  would be a far more enlightened and better place if only more people read  it today.", "Helpfulness": 0.8, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on September 19, 2002", "Text": "Carl Sagan, with this remarkable book and its like-named television series, introduced millions of people to the wonders of science. The 13-part series, which has now been seen by over half a billion people, aside from introducing many people to science, was also enormously influential - can one imagine the success of the modern Discovery Channel and its ilk (actual 24-hour science networks) without Sagan? Hardly. Undoubtedly, many of the leading figures in science today would credit Sagan with introducing them to the field in the first place. Perhaps even more importantly, however, Sagan did that incredible, seemingly almost impossible thing: he interested the average layman in science. Whether he was a \"real\" (whatever that means) scientist or not, as some refuse to concede, is totally beside the point: what he accomplished was monumental, and he should be given the credit he deserves. Many supposedly open-minded individuals would keep science esoteric and its knowledge among the hands of an elite few; Sagan not only pointed out why this is wrong, but also devoted his life to vigorously seeing that it never became so. This book is remarkable in that it explain many difficult and far-reaching concepts in relatively simple terms that most people will be able to understand - and even enjoy. Unlike many college textbook authors, Sagan, for the most part, keeps his personal biases out of the writing, and he rarely gets overly technical. This is truly a book that all can enjoy. There are many photographs and quotes strewn throughout the book as well, to pep up interest in the text. This is a great general, all-around book on science for the layman: truly a \"Science For Dummies.\" And, unfortunately, this book is often pigeonholed as a book solely on astronomy (the section in which you're likely to find it at bookstores), but don't let the title fool you: this book at least touches on all the major aspects of science, as well as quite a bit of history. Evolution is given a clear and concise overview, genetics is more than touched upon - and Sagan even induldges in a bit of the social sciences. However, the book, unfortunately, does grow less interesting towards the end, where Sagan uses the text to push his own agendas (radio astronomy, later the basis of his excellent science fiction novel, Contact; and a dated plea for peace in the nuclear arms race, which, though commendable and worthy, now smacks a little too highly of Cold War paranoia.) All in all, though, this is an excellent, highly interesting, and immensely readable book that works very well as introduction to the science (in particular, astronomy) for the common man, as well as guiding him towards that all-important virtue: open-mindedness. Along with Stephen Hawking's A Brief History of Time and some (unfortunately) long-out-of-print books from Arthur C. Clarke and Isaac Asimov, this is perhaps the best type book of its kind. Highly reccommended.", "Helpfulness": 0.75, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EKTLUL24HDG8"}}, {"Date": "on April 16, 2007", "Text": "The late great astronomer put his all into this effort, and nearly three decades later, Cosmos is still an engaging read. From his relating of Eratosthenes' method for correctly calculating the earth's circumference 2300 years ago to speculation on the possibilities of resurrecting three abandoned spacecraft designs, Sagan presents a grand, optimistic, and powerful view of the universe and our innumerable connections to all of it at every scale. Whether one reads the book on its own or in concert with the video series, this is an indispensible journey for all who have curiosity about science and nature.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DVPGMT4IU827"}}, {"Date": "on November 26, 2005", "Text": "To this day, the most influential book I have ever read.  A launching pad to a life of discovery.  I would recommend it be read by every human as part of a high school curriculum.", "Helpfulness": 0.7777777777777778, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1P5WT6HSNQUW1"}}, {"Date": "on February 9, 2004", "Text": "Though this point has been time and time again, perhaps the greatest legacy that Carl Sagan left to us is how he was able to popularize science for the masses. While presenting a picture of a vast universe, one in which humanity is neither noteworthy nor the end result of the universe's creation, Sagan does not make the reader feel insignificant or forlorn. Rather, the reader is filled with a sense of awe and is inspired by the possibilities the cosmos holds for our species. It really isn't hyperbole when I claim that, for many, \"Cosmos\" is a spiritual, as well as an intellectual, journey of the imagination.", "Helpfulness": 0.8, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HUWZEVJ62UJT"}}, {"Date": "on December 8, 2000", "Text": null, "Helpfulness": 0.7272727272727273, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PBG9UDZSB443"}}, {"Date": "on October 10, 2012", "Text": null, "Helpfulness": 0.6949152542372882, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IRVSX3HNTKVT"}}, {"Date": "on March 13, 2013", "Text": "Some of its content is dated however over 90% of the book is still relevant. Gives a complete overview if astronomy with its history, theories and some ethical questions. None of this has changed since this masterful book", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12C6T4MHNKRQP"}}, {"Date": "on January 12, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13NM1PES9OXVN"}}, {"Date": "on June 26, 2000", "Text": "Carl takes you on an astounding voyage of exploration and discovery. You'd have to be completely dead to not feel the love for the universe that we all should feel after reading this book.  My mind was certainly broadened  greatly and my view on all around me has changed forever. This is a book  that all human beings should read.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KRN87SHXD0V7"}}, {"Date": "on October 1, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A782XK9PZXA2F"}}, {"Date": "on August 30, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RDZCA7V30AT6"}}, {"Date": "on June 1, 2008", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SCD2NYTIAQTY"}}, {"Date": "on May 24, 2007", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJ3VSER0WV3TK"}}, {"Date": "on May 7, 2004", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2X6GEC6LCDN4S"}}, {"Date": "on November 2, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CMXLLWBD78UE"}}, {"Date": "on November 14, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A173R9AKPFHAXH"}}, {"Date": "on October 25, 1999", "Text": "In this book Sagan does a masterful job of explaining the universe. He makes a very complicated subject both understandable and interesting. I  definitely recommend this book to anyone that's ever looked up into the sky  and wondered what's out there or likewise pondered the question of how  humanlife began.", "Helpfulness": 0.8, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on November 11, 2011", "Text": "I think this book should be mandatory reading, maybe for 9th graders, before they take any serious science classes.  I remember hating science in school.  I didn't \"get\" it and it was taught so dry and matter-of-fact that I was bored to tears.  (And I must admit that I got in trouble more than once for sleeping in class.)  I learned enough to squeak by and earn my diploma.  Never did get my college degree, although I did waste a lot of my parents money trying.  ;)  The only science class I ever enjoyed in school was astronomy, but they still managed to make it as boring as possible.  I came across Cosmos at some point in my early twenties.  I had always been interested and awed by the universe, but was never given the spark of curiosity before.  I must have finished this book in two days, and then went to the library and read every other book by Carl Sagan I could get my hands on.  And I have learned more about science from Carl Sagan than I did in 15 or 16 years of formal education.  The beauty of this book, and his others, is that he makes it interesting, almost as if the universe was a character in a book and he was just describing it's traits.  I know that if I had read this book as a teen, I would have been a lot more open to learning about the natural world than I was.  Say what you want about Carl Sagan, he is still my hero.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UKWX15S9SY1U"}}, {"Date": "on December 21, 2010", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1O2HGHQGBMFQ3"}}, {"Date": "on February 8, 1999", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on May 14, 2013", "Text": null, "Helpfulness": 0.6904761904761905, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2D6JPT0GHJ6C4"}}, {"Date": "on October 4, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32OUWIDOTPHGL"}}, {"Date": "on March 19, 2006", "Text": null, "Helpfulness": 0.7142857142857143, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1S3C5OFU508P3"}}, {"Date": "on September 20, 2000", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DYCCTUONW16Q"}}, {"Date": "on August 3, 2011", "Text": "at a time when the american public was being driven away from taking a personal interest in science, carl sagan stepped in and filled the void with his television series \"cosmos\" that remains in the imagination of everyone who lived back then to see it. Along with its well chosen soundtrack, the series is chronicled here, in paperback. the reading is actually more rewarding than the series as the book goes into greater detail and into more directions without the distraction of the marginal production techniques of the times. the book stands today as a clarion call for nations to disarm, for the status quo to graduate to a farther reaching level, for the individual to take a personal interest in current events and life in general through the rewarding lens of science. the meticulous detail and accessibility of the writing, that reads like a separate episode, are introduced with well chosen quotes, specific details and numbers, and a directed focus that moves at a fast enough pace to hold reader interest make cosmos an outstanding value at under 10 dollars. highly recommended.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NGLC7XJFKWF"}}, {"Date": "on January 13, 1997", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on September 12, 2008", "Text": "This is an incredible book, even if it is dated. I am a words person, not numbers, so when Sagan got into a lot of equations and chemistry, I had to kind of skim over those parts. I never could have understood them, and if I'd tried to force myself to, I probably would have gotten frustrated and gave up on the book. So I stuck with the parts (happily, that was most of it) I could absorb and easily understand. There were so many fascinating aspects to it that I would have missed had I given up over the math. This book is capable of starting you on a journey. It has made me find a book on Alexandria, which I am just starting. There is a fascinating history there, and I will continue on with books on da Vinci and Einstein. They are men I've heard about, of course, but never has my curiosity about them been so piqued. Being a book lover, the Library of Alexandria is something I want to learn more about. This book will make you want to learn more about a lot of things.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19YOPP52C17CZ"}}, {"Date": "on June 11, 2008", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIKVLU1HAV0ZQ"}}, {"Date": "on June 22, 2000", "Text": null, "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MMDU0KYV0OOP"}}, {"Date": "on August 27, 1998", "Text": "Cosmos is a not a science book, it is about everthing that relates to our  universe. Through  its thirteen chapters, it tells the tales of human  origin, scientific discoveries and space explorations of human. Many  passages reflect strongly the beliefs and opinions of Carl Sagan (his faith  on science as the true pathway to understanding the cosmos, his distaste of  our own self-destructive instincts and mostly his sence of the  insignificance of the human race against the universe), which I personally  think is the most interesting and thought-provoking part of the book. All  in all a GREAT book to read and treasure. Its one of those books which you  borrowed it first from library, and then bought your own copy just because  it's simply a book to own!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AWBMX2PSUAPQ"}}, {"Date": "on September 8, 2000", "Text": "i cant describe how much i enjoyed this book.  it describes the evolution  of the solar system, of life, of civilization, and of science.  it explains  what humanity knew and didnt know at different points in our history, and  the astounding contribution of different men and women to that knowledge.  i have been fascinated by astronomy since the age of 5, but i have never  had such a clear mental picture of the ridiculous scope and breadth of our  universe.  i dont believe i have ever been more satisfied after reading a  book.  the best damn 5 or 6 dollars i have ever spent.  there isnt a person  alive i dont recommend this to.  i encourage you to purchase this book, it  may show you how futile and feeble our everyday desires are.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EM11SICVRH03"}}, {"Date": "on March 19, 2009", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GX8AYX6RROM9"}}, {"Date": "on April 12, 2015", "Text": "A really great introduction to physics, astronomy, philosophy and the world. Knowledgable and wonderfully written. Every second sentence by Carl Sagan is worth citing - he's basically a poet among the scientists. I especially liked the chapters on the origin of life in the universe and on Earth, as well as those about the stars and the Big Bang. They are full of examples and quotes from ancient scrolls, which is a powerful addition to what modern science has to say on all the discussed issues and the best proof of our nearly 1000-year stagnation in scientific discovery.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23U2IN40MYG8G"}}, {"Date": "on May 16, 2007", "Text": "Cosmos has profoundly influenced me on a real, tangible, continual, daily basis. Sagan convinced me of the precious nature of our existence. Sagan effectively explains the vastness of our solar system, our star cluster, our galaxy, the entire universe via using brilliant, easy to understand analogies. After completing the book, I felt profoundly connected to every human-being on the planet. The beauty of our existence becomes truly apparent, however the tragedy and foolishness behind conflict, crime, war, hatred, bigotry and zealotry also becomes unbearably clear.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6P121DB4TV3T"}}, {"Date": "on March 14, 2004", "Text": "In his book, Dr. Sagan takes the reader on a tour of the universe and a ride through time that belittles our existence but at the same time reveres it.  But Dr. Sagan does not forget who he is writing for.  One of the ideas behind the unbelievably popular companion tv show of Cosmos was that the general public is more interested in and capable of understanding science than it is given credit for.  As such, Cosmos is a book anyone can pick up and enjoy, yet it remains intelligent throughout.  If someone would want to find a place to begin understanding the history and life of our universe and our place in it, then this book is that place.", "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2B1Y6889B4ZSW"}}, {"Date": "on July 4, 2000", "Text": "Sagan will open your eyes to the world around you in this fascinating analysis of Earth, the planets, the sun and stars in \"Cosmos\". Not only does he unlock the mysteries of the universe in an understandable  way, but he also ties in human evolutionary biology and science history  quite skillfully. What I found to be most interesting about this book is  that Sagan interjects his own opinions, interpretations, and theories as he  writes, rather than just listing facts. As you read, you experience the  thinking process of a great mind in action.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3869CQLA4D5FP"}}, {"Date": "on April 7, 2012", "Text": "This book is really a great book for anyone interested in cosmology and astronomy. It gives you a great history of the Earth, highlighting various important people and events in the world of astronomy. It gives you a better understanding of the universe and is put in a very readable fashion. Although, I must admit, sometimes you must read the previous paragraph multiple times in order to fully understand what you just read. But all in all, this book was fantastic to me and I look forward to my future endeavors of cosmolgy readings.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3F34HDISA3YNC"}}, {"Date": "on November 24, 2000", "Text": "Sagan gave us a great gift with this work! A diverse collection of fact and belief, Cosmos explains in laymen's terms, very complex theories, astronomical information, and scientific history, as it relates to Earth and space. Well written, and well organized, it provides thought-provoking ideas and concepts in a manner that holds the reader's interest. As entertaining as a classic novel, and informative as a great textbook. Those who enjoyed the PBS series 'Connections' will greatly enjoy it's literary predecessor.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MW2BTZ9BGJ4H"}}, {"Date": "on December 9, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GIDD8OOY8PH1"}}, {"Date": "on June 5, 2009", "Text": "Seriously. I was born shortly before this was made. Good grief. I think like so many reviewers, they grew up with Sagan books and tapes, thus always in the back of my mind there was something from him around the table. Watching and reading Sagan is very peaceful and it feels like growing up again. The star stuff is cool, but there are lots of programs far better than this out there. Sagan though is Sagan. Can't think of another Astronomer I like better. That Zeth Showstack (SETI) guy is cool though.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4BT7F2CLGSFF"}}, {"Date": "on July 20, 2011", "Text": "This was my first look at Sagan's works, and I came away very impressed.  He writes for the layman, so those not currently employed by NASA can grasp the point Carl puts on paper.  His comparisons and the manner in which he scales all things cosmic was an eye-opener.  Most of us have a hard time wrapping our minds around the size of objects in space, or space itself.  Sagan clarifies it.  A superb read, certain to stir the interests of the budding astronomer or sci-fi adorer.  Wonderful book.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10I95TL6ZQKQC"}}, {"Date": "on April 2, 2002", "Text": "Cosmos first burst onto the scene in 1980, two years before this college sophomore was even born.  Even now, 20 years later, it remains THE book for everybody interested in what's out there.  Some of the material may be slightly out of date, yes, but this book is brilliantly written in a way that I can't even describe with words.  Sagan had a passion for his work second to none, one which clearly comes out in his writing.  A definite must-have, add this to your cart right now.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AP7IW8QR4782P"}}, {"Date": "on January 12, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFMGCCBZ5IJJ"}}, {"Date": "on April 1, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A380H0RPMMOG3E"}}, {"Date": "on March 12, 2013", "Text": "This book is amazing, I've learned so much more than the show offered.  This book is a near masterpiece and I am amazed by its breadth, vocabulary, and writing style.  This book seems to cover evolution / the history of the universe in the most condensed and clearest way I've ever read and it covers that in barely a chapter.  Superb writing.  Amazing that this was written in the 80s.  Much of the science is still very relevant.  Recommend to anyone.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RHMGI9E98509"}}, {"Date": "on October 23, 2009", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RRU7QK4OAW48"}}, {"Date": "on September 1, 2014", "Text": "This is possibly my favorite book of all-time! It has all the stuff that captures my interests: a search for knowledge, exploration, science, history, biography, adventure and imagination.  To top that off, it was all done with a flowing narrative that took me to  other worlds and distant times.  It has furthered my belief that scientists should be our society's heroes, not sports stars, celebrities or politicians.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ECUZILSIVJA9"}}, {"Date": "on February 26, 2009", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABE9L35PP46KU"}}, {"Date": "on April 10, 2012", "Text": "Carl Sagan's timeless Cosmos tells the story of billions of years of cosmic history in a manner that no one else can. It is timeless. Written primarily about how science has developed in our society, the book touches on subjects such as history, philosophy, religion, cultures and so fourth. The book is written in simple terms and is understandable to those without a background in science.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30Y8GRM3ZMP19"}}, {"Date": "on February 21, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IKAUS6MABF14"}}, {"Date": "on September 19, 2012", "Text": "An absolute smashing read that I find myself rereading from time to time. Fifteen billion years of history presented in such a fashion that any novice unfamiliar with the scientific study of the cosmos can understand. This book is filled with an awe and optimism that is infectious. A great book from a great human being. Carl Sagan will always be missed!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A220F0C9TPXFIZ"}}, {"Date": "on February 17, 2014", "Text": "I'm only about 3 chapters into the book so far, but Sagan makes is easy to understand some very difficult concepts. Sometimes it goes over my head and I have to look up some words, but that's what reading is for, learning. Overall this seems like a very well written and timeless book for understanding the world around you.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3K71GTS5G3CL7"}}, {"Date": "on February 10, 2014", "Text": "It took me a while to get around to this book, but it was definitely worth it. Carl Sagan has a way with words that allows him to explain the sciences and natural world with elegance.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1M3CFRPVLLHH6"}}, {"Date": "on January 11, 2014", "Text": "This is one of the best and most inspiring non-fiction books I have ever read. If you have even a passing interest in astronomy you must read it.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AR0AEE3IH22X0"}}, {"Date": "on January 7, 2014", "Text": "This is the greatest TV series of all time. Any science/cosmology fan needs to see this, but READ THE BOOK FIRST!!! It is my bible.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1H0KRBIVM1DU5"}}, {"Date": "on December 23, 2013", "Text": "An amazing work of philosophy first, followed by science and literature.  It explores our history, our deepest questions, and the relationship between the two.  No one, especially those interested in science and technology, should pass up the opportunity to read this book.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3N8PVPG4FU3X9"}}, {"Date": "on December 7, 2013", "Text": "Although a bit dated, this timeless classic is a wonderful read. The musings of a brilliant mind on a variety of subjects and how everything fits together....even today, after decades of reading and rereading....something new always falls into place.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35GG893WTGSZX"}}, {"Date": "on November 25, 2013", "Text": "A very accessible book for an intelligent lay reader. You feel more enlightened, more humbled, more human - after reading this book.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FTCD371EW19J"}}, {"Date": "on October 31, 2013", "Text": "Sagan just sees things differently... a welcome escape from the everyday shallow view of the world and our often self-centered purpose in it. This book is not simply about space, stars and planets - but rather a thoughtful examination of how small we really are in comparison to a universe filled with mystery.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A259PGH2FK12"}}, {"Date": "on October 28, 2013", "Text": "The only criticism I have of this book is that some of the information is a bit dated now. But it is still very much worth reading for its science, insights and ability to provoke thought.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A189BPUDLRCQEQ"}}, {"Date": "on April 18, 2013", "Text": "I had a copy of this book years ago and lost track of it in multiple moves.  So very pleased to find a first edition for sale.  This is the book and TV series that fed my curiosity about the nature of.....'life, the universe and everything'.  Sagan puts flesh on the great thinkers, ideas and mysteries of the earth, and should be required reading for all humans.  Sagan is one of the great minds of the 20th century and one of the great educators of all time.  He makes science not just interesting but compelling.  When I read his book, as I shall over and over, I hear his voice and catch his enthusiasm.  Do yourself a favour and buy a copy.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HIXP07OTF4EP"}}, {"Date": "on April 18, 2013", "Text": "5 chapters in. Love it so far. Very descriptive and interesting. A fair amount of historical background and then-current research.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1G1VUFNZEH8JR"}}, {"Date": "on March 18, 2013", "Text": "I've lost count of the number of persons influential in scientific progress that credit Cosmos with inspiring them to pursue their careers.  I am a science teacher primarily because of Carl Sagan's writings.  If you have even a spark of interest in your relationship with the universe and how the historical development of science played a part in our understanding of the universe, this book is s must read.  Though dated in some areas, it is still relevant to gaining an understanding of our place in the cosmos.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A267XNIM9719UE"}}, {"Date": "on March 12, 2013", "Text": "I gave this book a 5 star rating because NO one can teach science, physics, evolution, and cosmology like Dr. Sagan could. I was immersed in the book constantly and felt that I could actually understand scientific concept. I will be reading Dr. Sagan' s other books as well!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19XXFHM2JXUTO"}}, {"Date": "on March 12, 2013", "Text": "Sagan tells the story of humans discovering the universe, and he does an amazing job with it.  It's interesting and beautifully written.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19MKI0BDG8KC9"}}, {"Date": "on February 26, 2013", "Text": "If everyone in the world had any understanding of the information provided by Carl Sagan, they would realize world peace is actually possible", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFBXW7MZDKUP8"}}, {"Date": "on November 3, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKQM58BHRSXC7"}}, {"Date": "on October 27, 2012", "Text": "Cosmos is a wonderful starting point for anyone interested in the history of astronomy or science. It is easy to read despite the complexity of the subject matter and offers wonderful insights into human nature.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DQR68DZY7JKY"}}, {"Date": "on February 23, 2012", "Text": "Sagan breaks down sci-fi unlike anyone else...simple, and easy to read, but still very informative. Would recommend to anyone looking for a crash course in space science.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9MGJ7ZS7U3DT"}}, {"Date": "on April 21, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AKILNSHIR04H"}}, {"Date": "on January 15, 2013", "Text": "This is one great book, filled with alot of beatiful pictures and it gives you SOOO much information. Even though alot of scientific discoveries have happened since this was written, and we know so much MORE about our universe now, this is still a very relevant book. If you teach this to your children you will be doing them such a favor.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1INUATAQG85TJ"}}, {"Date": "on July 2, 1999", "Text": "Carl Sagan's genius has illuminated a whole new universe to me.  Cosmos is the most informative and accomplished science book I have ever read.  Cosmos made me feel as if I were being revealed secrets about the universe  that were unrevealed to the rest of human society.  Truly we need more  scientific pioneers like Dr. Sagan.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on March 31, 2008", "Text": "Carl Sagan's \"Cosmos\" was my first book on astrophysics and was very instrumental in my growing love of Cosmology and all things Space. He is a great writer, a bit out there sometimes but like any great science writer, he makes the material accessable to the general public in a way that is thought-provoking and educational.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15ZWA1ISGRTSD"}}, {"Date": "on January 7, 2015", "Text": "Cosmos is terribly the best book ever written and the best I have read.  The author uses simple words to describe big ideas.  The opening sentence is \"the cosmos is all that is or ever WaS or ever will be\" all I have to say is when reading that first sentence then you know you're about to read a good book.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A250XU4W3L5QYM"}}, {"Date": "on July 21, 2014", "Text": "After reading this book I not only feel like I learned a lot about our history, but also enlightened about the modern state and view of the world. If you liked the new show and wanted more I'd recommend this book. It will fill in the details not discussed in the show and add much more context.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJ5SBKGAKPVIN"}}, {"Date": "on May 20, 2009", "Text": "Carl Sagan's works inspired me as a child and in many ways and lead me down a path to become a teacher. There are other books that are more up-to-date than this, however,  there is a bit of Sagan magic in this one that still shines. I love sharing this book with my young students.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A331N6S3S2CL0K"}}, {"Date": "on June 25, 1999", "Text": "Definately the best science book I've ever read.  Sagan manages to convey his opinions without forcing them upon you.  His knowledge is mindboggling; his words, poetic.  Anyone who wonders what the significance of the human being in this universe is should read this book.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on November 2, 2014", "Text": "I love this book. I end up reading it over and over, many times a year, despite its age. Sagan's love for man, the universe, and everything is so apparent and infectious. I wish he was still around today to give us more books and encourage us in the pursuit of knowledge.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17P5GF31MGDFG"}}, {"Date": "on February 21, 2015", "Text": "Enlightening and a must read for everyone, especially youth. if any group of humans is to save humanity from self destruction is the younger generation. Let's spend less time and money on weapons of mass destruction and more on exploration of cosmos.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33EVUU4VMJ40H"}}, {"Date": "on May 28, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OJW07GQRNJUT"}}, {"Date": "on April 9, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Q434SYE6K31Q"}}, {"Date": "on April 10, 2011", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASW77A8J0I068"}}, {"Date": "on February 2, 2011", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3R8PXSFGY9MC2"}}, {"Date": "on August 10, 2010", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2P77WD19XWXHE"}}, {"Date": "on November 24, 2003", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EQQP0LD4Z375"}}, {"Date": "on March 12, 2013", "Text": "Carl Sagan was one of the best at bringing science into our homes and in a way that most of us could understand it. His book is a classic and should be in the library of anyone who wonders what else is out there.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKYL3L3S98GXN"}}, {"Date": "on July 29, 1997", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on August 9, 1999", "Text": "I am just 15 years old and i've read this book almost five times filnding a different meaning to it each time. This book has given me the bases to study astronomy and I recomend you should really read it.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AY6UT31OQH4X"}}, {"Date": "on February 13, 2013", "Text": "What more can be said?  A legendary book from a legendary astronomer and physicist.  If you have even the slightest interest in the universe beyond our own planet, this should be in your collection.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3T6O0R39L3ZEY"}}, {"Date": "on May 18, 2014", "Text": "I first read Cosmos in the 80's and thoroughly enjoyed it. I wanted this addition to read as I watched the TV miniseries hosted by  astrophysist Neil DeGrasse Tyson.  It is remarkable how Carl Sagan has influenced his life. He tells about it in the forward of this edition. There is also an introduction by Ann Druyan, Carl's wife up until his death. She was the co-writer for the original TV series Cosmos and executive producer of this new miniseries hosted by DeGrasse.  Druyan was also the co-creator of one of my favorite movies Contact! The book, like the miniseries, is a space odyssey. It is much more. It is a history of man's trying to understand the cosmos. Sagan delves into the philosophy of the human condition.  He offers no theological cosmological viewpoint, but that is not his task. Sagan is an astronomer and scientist not a theologian. He is not a religious person. I am a religious person but I found Sagan's book thought provoking and educational. I enjoyed the odyssey he takes you on, fueling the mind with scientific facts and the imagination of what we could look forward to in the future!  His famous statement \"The Cosmos is all that is or ever was or ever will be\" may well be an understatement! If we read Sagan correctly, we may only be touching the very surface! A great read!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Y6WBFKYZK2CP"}}, {"Date": "on December 26, 2010", "Text": "This is a beautiful book, visually and content-wise.  Carl Sagan artfully delivers his personal fascination with life and the cosmos so the reader shares it.  Not to be missed.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AWYMEDJXGBGU"}}, {"Date": "on May 8, 2008", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UFTCH4ITP03H"}}, {"Date": "on March 14, 2011", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A303U1MOXG5R1F"}}, {"Date": "on March 12, 2010", "Text": "What a book cosmos is! Based on the hit 13 part series \"Cosmos\", shown on PBS, Cosmos allows the reader to venture into the distant cosmos through profound writing and concise points. Carl Sagan, writes on various subjects regading the cosmos, covering the history of it in a simple manner. The books containts inherent images that enables a visual representation of what is being said. A helpful medium indeed. In one sense, the book is virtually identical to the series in text, but due to limitations on television, Sagan is able to cover much more information by which he was unable to cover on the Television series. Sagan not only speaks soley of the cosmos as the title suggests, but much more including genetics,evolution and neuroscience. Sagan is able to write on these subjects distinct from his prime field of study in an ingenious manner still. Cosmos generates a basic understanding of the vast ambiguious universe by which we inhibit. Due to this book being written during the cold war, Sagan devotes a whole chapter to the threat of nuclear war, and the hazardous implications to our Earth. A plausible point that many neglect. A great read!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20CSWBGI3IB72"}}, {"Date": "on August 14, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15ZNDKC6SS2WV"}}, {"Date": "on March 17, 2013", "Text": "Great book by an amazing author, I would recommend this book to anyone! Carl Sagan was a great man and his book Cosmos puts life into perspective.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANV5W9IFF4ZOZ"}}, {"Date": "on January 21, 2014", "Text": "The last chapter of \"Cosmos\" asks \"Who speaks for Earth?\" That speaker is surely Carl Sagan himself. He had everything- high intelligence, charisma, and an elegant and beautiful writing style. His delight in Planet Earth shines like a beacon on every page, but he talks about Earth's fragility, too, and that our species may self-destruct. He speaks with admiration for the great scientists of the past like Isaac Newton, of Jean Francois Champollion who deciphered the Rosetta Stone, enabling modern persons to read the ancient Egyptian hieroglyphics, of the astronomer Edwin Hubble and many more great minds. \"Cosmos\" is much more than a book with pretty pictures, it is a paean for not only our planet but the men who helped us on our journey to understanding the immensity, the gloriousness of the Universe. His enthusiasm is very infectious and you will come away from reading \"Cosmos\" with awe in your heart  and you will have learned a lot, too. Don't miss this feast Sagan spreads before you!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22F3BWM7RAHDA"}}, {"Date": "on March 14, 2015", "Text": "Sagan is an incarnation of science at its best: inquisitive, rational, imaginative, honest, humble, and, most of all, full of awe at the vast splendor of the cosmos. Sagan moves back and forth through time to show the evolution of the cosmos as well as the human journey of evolving consciousness and a scientific method to understand the beauty of the natural world. One might think scientific poetry is a contradiction, but Sagan (among a few others, like Loren Eiseley) proves otherwise. Every page presents a grand tour of the cosmos almost as if we are striding through a grand version of St. Peter's Cathedral--one cannot help but emerge with an appreciation of the scale and beauty of the universe. Sagan ultimately stresses the nobility and significance of the human story within the vastness of the universe. We are the torch-bearers of consciousness, he observes, and it is our duty to the planet and all-that-is to overcome our petty conflicts and work in concert to advance into the stars. A beautiful sentiment.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33ODMFD95OZOE"}}, {"Date": "on February 8, 2008", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IWJ5QVBQFEBM"}}, {"Date": "on June 17, 1998", "Text": "323 pages with 16 pages of color photographs. Sagan presents a good  introduction to science for non-scientists. Sagan is at his best when  describing the destiny of planetary exploration and the wonders of the  universe, but the entire book is well presented. Sagan's life-long  passion for seeking out extraterrestrial life is evident throughougt, as  are his fears of possible nuclear annihilation. He also shows how  human's have shown great ignorance and great achievement, while  advancement in technology has aided both human good and evil. With  examples (including himself), he shows that scientists care about the  world and attempt to do good, while ignorance, distrust, and  superstition are to be avoided. Although some of the conceptions of the  universe are becoming somewhat out of date, that only gives due reason  for reading this book now. Most of my understanding of the universe I  aquired by watching Cosmos, and this book provides a suitable  alternative to purchasing the expensive video set.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": ""}}, {"Date": "on October 15, 2014", "Text": "Everyone should read this book.  It is a quick and easy read.  You will definitely benefit from reading the book.  Please pass this along.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28RN146D4UP4U"}}, {"Date": "on December 26, 2013", "Text": "The hardcover book is long out of print and I really didn't think I would find it -- but I did.  And it was a very much appreciated gift.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34VJJ30PV090P"}}, {"Date": "on November 18, 2013", "Text": "A great book on Astronomy, for everybody, from Astronomy beginners to Astronomy experts, a classic from the great Carl Sagan!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZYH2G76HEXMS"}}, {"Date": "on May 16, 2000", "Text": "I am honored to say I began my career as a physicist when, as a young child, I watched with utter awe the television series \"Cosmos\".  With that series Carl Sagan opened my mind to what can be knowable, given  the right tools - and I have not looked back since.  He has been called a  great communicator and not a great scientist.  This I question - because he  was more popular than other scientists, that makes him inferior?  Regardless of his credentials as a scientist, he undoubtedly began many  other scientific careers in addition to my own.  Certainly one of these  \"academic progeny\" will change the world for the better, and for  this we all must salute him.  Cosmos the series, and Cosmos the book, are  brilliant for expanding our minds to both what is knowable, and making the  knowable knowledge.", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZTOAD13FDS58"}}, {"Date": "on August 19, 1998", "Text": "I have read a number of very, very good popularisations of science  including some by Dawkins, Hawking, Gould, Diamond, Asimov etc.  But none  are as accessible as Sagan's works.  Cosmos is the book that has most  influenced my life as it gave me the \"love of learning\".  This  love is the most precious gift I have ever received and it inspires me to  try to give it to others.  I am amazed that I still own my original copy as  I have given it away to so many people encouraging them to read.  Cosmos  should be compulsory reading for all 15 year olds. If it had been there  would have been no need for Mr Sagan's last book about the shocking rise of  ignorance and pseudoscience in our society.  If you read only one book in  your life, this is the one.  If you read frequently, you have no excuse for  missing this book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZTNESKDTL54Y"}}, {"Date": "on August 29, 2007", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DZBTU9BY5WKH"}}, {"Date": "on January 3, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACE1SF9DMINYA"}}, {"Date": "on December 22, 2008", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3II1ACACC5MTX"}}, {"Date": "on January 30, 1998", "Text": "THE UNIVERSE IS ALL THAT EVER WAS OR EVER WILL BE.  These eight words are the opening of Cosmos. The book that was the companion to the thirteen- part 1980s television miniseries that made science and astronomy knowable to the average American.  Cosmos takes our understanding of the universe from the Stone Age to the Space Age.Written and shown at the time when the Voyagers were making their surveys of Jupiter and Saturn, it explained our place in the universe and made think about what would happen if we had a nuclear war. He took us from harsh Venus to Mars and beyond. All the while being the patient, tolerant professor that he was. Whether he was talking about Leonardo da Vinci or Albert Einstein, he held us in rapt attention. Blair Colquhoun @cybertours.com", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on May 26, 2014", "Text": "Yes, it s out of print. Yes, the series is being updated by Neil Degrasse Tyson and no doubt there will be a new book. But this series was and is a classic. AND most of its observations still match today's. I don't think it discusses string theory but look at the 2013-14 season of Big Bang Theory to see an interesting discussion about string theory. Of course in in anything like this you have people like my wife who as they get older, the universe gets younger and so geologic eras and fossils become fakes. These people uses to say 'a billion years to us may be as a minute to God.\" Now they want to say, \" a femto-second to us is as a billion years to God.\" or ultimately, \"a #$%@#-second to us is as a  #$%@# x10^21-second to God..\"", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MM38N1F8QKVT"}}, {"Date": "on June 26, 2008", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PGV1YOLW2WU7"}}, {"Date": "on December 28, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GIGI750FKFLD"}}, {"Date": "on February 5, 2008", "Text": "You are doing yourself a disservice if you have never exposed yourself to the work of Carl Sagan. After reading this book I immediately checked out and fell in love with the television show as well. Even though Cosmos is nearly 30 years old now, Sagan's remarkable sense of awe speaks just as clearly now as I'm sure it did then. A quote on the back of the book says \"Cosmos is like the college course in science you always wanted to take but never knew a professor teach\" and I couldn't agree more. It's a great crime that no science class I ever took in school, college included, ever took the liberty of exploring the Cosmos in the way Sagan does effortlessly. If you have ever looked at the stars and wondered, this book is for you.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BAOTI47Q0KOR"}}, {"Date": "on July 1, 2013", "Text": "I love the DVD set, but the book goes beyond what could be covered in the DVDs.  The book contains a lot of well organized and well written additional detail. I ordered this as a used book and the condition exceeded the description; I have consistently had good  experience with used books from Amazon--one small way to help protect the planet for future generations.  Back to the book and DVDs.  It is amazing how relevant that both the book and DVDs still are; very little of the material is dated. Carl Sagan and his staff did an incredible job; I highly recommend both the book and DVDs, and look forward to sharing them with my grandchildren.  The book I received was the 1980 edition.  Five stars in every way.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OPN1NLECSKIO"}}, {"Date": "on March 2, 2003", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YZTFJ04M8ELD"}}, {"Date": "on October 4, 2011", "Text": "Carl Sagan's book is permeated with love for knowledge and reason and those who cultivate them, and fascination for the Cosmos. It is really charming to see a man who writes just like someone who genuinely enjoys knowledge and wants to you to join in. I don't know how was Mr Sagan in person, but his persona in this book is someone benign, cheerful, enchanted by the magnificence of the Universe, always ready to express admiration for scientists and reasonable men of any confession, and saddened by ignorance and oscurantism. It is such a positive book, I would have loved to read this in my teens, I would surely have taken up a career in Physics :). This book makes me want to know so much more.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10RYYY60FOB3J"}}, {"Date": "on August 22, 2012", "Text": "To say this book is about the Cosmos is an understatement... it is a book of us... a book of everything. Covering Biology, History, Astronomy, Chemistry, Genetics, Evolution, Classics, Astrophysics and so much more, Sagan has given humanity a window into the soul of the universe and has been sure not to obfuscate the view with any fancy window dressing. Never underestimating the intelligence of his reader, but making sure to put complicated topics into layman's terms, Sagan has captured the brilliant wonder that shows our true grit in continuing to endeavor toward the stars. If you want to have your faith in humanity reinforced or restored, look no further than Cosmos.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25TGCM4C3SBTE"}}, {"Date": "on January 7, 2015", "Text": "There will never be another Carl Sagan. Makes the most important things so clear. Wonderful!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1K3D2ZKK25OAB"}}, {"Date": "on April 21, 2014", "Text": "If this brilliant work by astrophysicist Carl Sagan doesn't broaden your mind, nothing will! What boggles the mind is that so much still remains beyond our comprehension. I'm thrilled that Dr. Tyson has taken up the reins and I pray he is mentoring someone to keep this going after him. Presented in layman's terms, it opens our small human minds to the awesome wonder of the limitless universe in which we are so small a part. It does tend to give one perspective in one's life! This book is actually a replacement for the original that was lost. I couldn't stand to be without it - not with my son and grandson so interested in the Cosmos as well!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7E09M0ZZJNW1"}}, {"Date": "on July 16, 2012", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12XJE52SKOUW5"}}, {"Date": "on December 28, 2011", "Text": "Carl Sagan is an astounding person.He has written many books and is famous for the TV series \"Cosmos\" from which this book was written. This book is wonderfully written, leaving the reader with an understanding of concepts which are only woefully explained in schools and other books.There are times when a not unjustified anti-religious bias is detected but this does not detract and is often wonderfully explained by the late Sagan.This book is worth buying not just for the learning experience it provides but also for the sensation that the universe has grown larger than one may have previously thought possible.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3C68ZL09YEO4G"}}, {"Date": "on February 28, 1999", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on September 21, 2014", "Text": "If you want a good overview of how science affects our lives, and the history of science, and what science means for humanity's understanding of the world and the universe, you can't do better than Cosmos.  Sagan is as eloquent as ever, and this book is a tour-de-force.  Along with Sagan's \"The Demon-Haunted World,\" this is a must-have book for any thinking person's personal library.  I still have the original first-edition hardcover, but I wanted this book to save wear and tear on the original.  I have also bought this book several times as gifts.  Sagan is the master of science communication!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NFHEV1AVX5OG"}}, {"Date": "on May 12, 2012", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7XUM8VT5N9J0"}}, {"Date": "on May 24, 1998", "Text": "Es un libro excelente, donde se discute sobre la posibilidad de la vida en otros mundos, no solo en nuestro sistema solar. Da un punto de vista muy interesante acerca de como buscar la vida fuera de la tierra.  Expone acertadamente que estamos buscando una forma de vida organica basada en el Carbono, pero la vida se puede desarrollar de otra forma indecifrable para nosotros, ya que esta forma de vida ha evolucionado en un mundo diferente.  Lo recomiendo para los que les gusta estos tópicos, pero esta vez visto desde el punto de vista de un cientifico no de los desaciertos de la seudociencia.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on March 7, 1997", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on January 10, 1997", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on January 23, 1998", "Text": "This is the classic book that got me interested and excited about science in general and astronomy in particular when I was 12 or 13 years old. I haven't read it in a while, but remember it being an exciting read not just becuase it introduces you to some fundamentals about science, but because Sagan personalizes and humanizes everything in his book, from the ancient astronomers to the possibility of life outside of our solar system. It's a book full of wonderment and hope and optimism for the future, but with cautionary warnings and thoughtful musings.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XX37HBK45UG8"}}, {"Date": "on September 8, 2007", "Text": "'Cosmos' is surely one of the best books EVER.  The wondrous cosmological mysteries and large questions of mankind are covered and expounded upon with humility and great inquisitiveness.  The origins and vastness of our universe, time and space, and our own place in the galaxy and universe will really drive home the folly of war and other forms of violence we perpetrate against each other irrationally (in many cases in the name of religion or race such as 9/11).  This great book should be a 'must read' in every high school science classroom.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7EJERNB7IK3Z"}}, {"Date": "on October 13, 2011", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJTJBLZZ0VY5C"}}, {"Date": "on June 27, 2000", "Text": "\"Cosmos\" is so much more than a science book.  It's a history book and a book that teaches so much about life and where we are headed.  This book taught me so much about what is out there and how we are all  related.  \"Cosmos\" is exceptionally readable and you will keep  the pages turning.  Sagan seems to sum up the heavens and the earth all in  one fantastic book.  Read it not just to learn about evolution or  astronomy, but to get a clear view of how the universe really works and how  we relate to it.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3R32BV28Q0LOQ"}}, {"Date": "on February 9, 2009", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZNHMAVSY8SK5"}}, {"Date": "on April 21, 2015", "Text": "This is our rich heritage, which we are proud of and which will certainly save! I collect scientific papers of the great scientist Carl Sagan. Thanks to him, I began to better understand the Cosmos. Brilliant Sagan explained about the beauty of the Universe and I will thank him to end his life. This book should be in every man interested in the space. Believe me, with Sagan you will discover beautiful and unique worlds of the Universe. And this will be the beginning of a great and exciting journey! Thank you very much!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A333TKE5KYTW0Z"}}, {"Date": "on September 11, 2010", "Text": "Very few people have ever been able to write in such a way that can render nothing of the imagination or fantasy more compelling than the realities of what actually is. Incredibly, 30 years later, very few things in this book are truly outdated, and there is still no book out there which can so accessibly and comprehensively serve as a \"You Are Here\" starting guide to all that is. It remains an essential and irresistible read for anyone with a natural intellectual curiosity and desire to understand.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HN4WHAEUV1NJ"}}, {"Date": "on September 25, 1998", "Text": "Well-written and fun to read, this book is a great exploration of the  questions man has about his world, past, present, and future.  Each chapter  can stand alone, though I was never willing to put the book down at the end  of one.  He did an incredible job of making advanced science available to  the layman; his ideas have shaped our learning for so long, and it is easy  to see why.  The book is creative, provocative, and it makes you think more  about your world than you ever thought you could.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on July 24, 2011", "Text": "If you are looking for an excellent astronomy book, this is the one to go to.  Carl Sagan is a master of words and explaining some very complex topics.  This is the first book I have read by Sagan, and I was amazed.  This book is an excellent read, but I would suggest not getting the Kindle version.  It was not put together with much thought.  I ended up purchasing a paperback format afterwards to finish reading.  Other than that EXCELLENT book (like I haven't said that enough).", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TCXQRQ96LUER"}}, {"Date": "on January 5, 2015", "Text": "Great read. Simple explination of the nature of starts and beyond.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Y4IXWLYMXBD2"}}, {"Date": "on August 6, 2012", "Text": "Over 250 color photographs highlight this book based on Carl Sagan's TV series by the same name.  Sagan has the distinctive ability to make science understandable, exciting, and fun, and this talent is displayed all through this book.  The photographs alone are astounding.  But, when Sagan intertwines the growth of science with civilization, we get a new understanding of our past.  And maybe even some hope for the future.  This is definitely a coffee table book of the first order.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATTLUK81FJVJ3"}}, {"Date": "on November 19, 2011", "Text": "If you are under the impression that science is for geeks or takes place in ivory towers, I urge you to read this book. If you are one of those who takes a passing interest in science but doesn't understnd it because of all the nasty mathematics, I urge you to read this book. Cark Sagan was the best science communicator who ever lived. This book will change the way you look at astronomy forever. Too much? Too over the top? If you think that, you obviously haven't read \"Cosmos\"!!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4KESK391Q6J2"}}, {"Date": "on April 9, 2013", "Text": "My Parents bought this book just after the TV show aired and I was always looking through it at the pictures and as I got older I enjoyed reading it as well. Over the years the book got handled extremely often and eventually the dust Jacket was destroyed and the book ended up disappearing. I purchased a hardcover copy for myself to get back that small part of my youth that is tied to my love of science and to share with my own child something from my past.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MBEV7K6CJ6H6"}}, {"Date": "on July 11, 1998", "Text": "The best science book I have ever had the pleasure of reading.  Sagan describes the Cosmos in such a wonderful way I actually regret never having pursued astronomy at a younger age.  Cosmos should be made required reading, if not for the insight it provides about the universe, then for its ability to make one imagine limitless possibilities.  From Thales math to Keplers physics to Hubbles astronomy, Sagan is coherent yet entertaining.  Cosmos is excellent.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADBJI91TC4HAB"}}, {"Date": "on January 13, 2014", "Text": "I found the book to be truly a pivoting novel that truly light the my passion of science, astronomy and physics in particular. He find the way to show how we are all connect to the universe in the deepest way possible and is recommend to all ages from 8 to 80, who want to understand a simple guide to the universe. This would spark a lifetime of curiosity and wonder to all children and would be a companion to the 1980 show and the upcoming 2014 show.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3U3K4XEWAIQ5V"}}, {"Date": "on April 1, 2014", "Text": "The book makes the program more complete.  TV programs have a limited amount of time to cover the material.  This Book gave more and precise details of the Cosmos.  I would recommend anyone that watch the Cosmos Series by Sagan should purchase this book and get a more detail of this program.  I hope Dr. Neil Tyson will write his own book on his New Cosmos programs.  It would be very interesting and would make his Cosmos program more complete.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A142H6XK0OLTYL"}}, {"Date": "on June 3, 1999", "Text": "I would definitely reccomend this book to any reader who feels compelled to understand the universe in which they live. Never before have I absorbed so much knowledge from a book. Unlike reading a boring textbook, Carl Sagan  has taken all things we automatically think of as \"nerdy\" and  \"intellectual\" and made them accessible to readers, without  regards to their background in science. I strongly recomend this book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on October 12, 1998", "Text": "When I first read Cosmos I was just 15 years old and from that day on a  new thing developed inside me: the pleasure of discovery and knowledge.The  book is written in a very accessible way and anyone can and should read it.  Cosmos can be called as the \"bible\" of the astronomers.It's with  books like these that mankind gets the passion to look ahead and follow the  right way...the way of knowledge. Carl Sagan will never die.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on July 5, 1998", "Text": "A very good book, written for the layman. I read this book when i was 10 and read it again now. I did find it a little boring now that i have gone much deeper into astronomy, but nevertheless this is an excellent book. I liked the TV series as well. The late Carl Sagan along with Stephen Hawking, Asimov and Kaku is one of my favorite authors. I also recommend you read his books \"Broca's Brain\" and \"Dragons of Eden\".", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXH9FJZFH9GLH"}}, {"Date": "on June 13, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38I6XEY95D7BW"}}, {"Date": "on March 25, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23CHK4W39VNPD"}}, {"Date": "on December 1, 2013", "Text": "Should be required reading in every educational system to give people a critical understanding of the history of science, and that pseudo science they used to credit religion for.", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GS2L6SBZQB7G"}}, {"Date": "on October 5, 2013", "Text": "I enjoyed the book but sometimes the author got into much more detail then I wanted. Most of the examples of former scientist were interesting.", "Helpfulness": 0.6666666666666666, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15V2I67T8DX9K"}}, {"Date": "on September 14, 2001", "Text": "Only recently have I had the pleasure of reading COSMOS.  Carl Sagan's wisdom and openness drips off every page.  Like many others I give him credit for opening my eyes and ears to the world (and universe around me).  This book especially becomes important During a world disaster.  Showing how we must be open to other's ways of living, thinking, and right to life.  this book should be required reading for all humans.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on June 13, 1998", "Text": "This is the best astronomy book of all time , it not only speaks about astronomy , but many other interesting stuff , the brain , life , DNA , etc. I really enjoy the analysis about extraterrestrial life. I knew that comets are made in most of the sense with water ice , but I didn't know that they are also made by methane ice and amonia ice. A greate master piece of science. I really miss Carl Sagan.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on October 6, 1997", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on May 5, 2008", "Text": "The best advice I can give, regarding this book, is to GIVE it to a young person interested in science or space.  You will plant a seed that will grow forever.  Sagan's masterpiece takes the mind on a wonderful journey through the stars as well as through other space centered events.  Highest recommendation as a text for learning as well as a fine read for anyone interested in the subject.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A185QFJRTB5W93"}}, {"Date": "on April 11, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A48UV9BZFAX5V"}}, {"Date": "on December 4, 2014", "Text": "This is the best popular science book I have ever read.  If you haven't read this book, you need to put down whatever book you happen  to be reading right now and read Cosmos.  I would recommend getting the older editions, with the pictures.  The photographs in this edition, along with the footnotes accompanying the photos, are wonderful and really enhance the experience of the book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YVLVFZW880Z8"}}, {"Date": "on August 30, 2008", "Text": "This is undoubtedly the most beautiful work of science ever written for the general public.  It spans across multiple disciplines, from evolution, to genetics, to chemistry, to physics, to astronomy, and astrophysics.  Whether you're a scientist or just a child interesting in the world around us, Dr. Sagan does not disappoint and conveys science with nothing less than elegance.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17F30VN6Q9WQ7"}}, {"Date": "on August 26, 1999", "Text": "For me, Sagan brought EVERYTHING together in an incredible and inspirational vision in Cosmos. I think he was the ultimate bigger picture person. If I had not read this book I think I would be forever lost in the  details. While I find the parts to be interesting, the WHOLE is where I  find MEANING. I have found a reality based understanding of my existance  and it is profound.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AN1MWOWTWAVVG"}}, {"Date": "on August 11, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TC6MPGJ1ZA3A"}}, {"Date": "on December 25, 2012", "Text": "I read this book in 1989 after watching a public TV rerun of the Cosmos series.  The original book I bought fell apart at the binding after a few years for some reason.  Re-reading books sometimes is a wrong move on my part as the 1st memory is often better then after the 2nd look.  Not in this case. The book offers as much food for thought as it did over 2 decades ago.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17BDHOS35SAWH"}}, {"Date": "on March 30, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AADVPSRGXT3BY"}}, {"Date": "on July 11, 2014", "Text": "A brilliant exploration into the science of everything, including science itself. This, in my opinion, is a text to define the human experience and the deep connection we share with everything in the Cosmos.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GF361355PW77"}}, {"Date": "on July 10, 2014", "Text": "Carl Sagan gives us an excellent history of astronomy and how the earthcentric view of the cosmos held by the Catholic church punished the truth seekers.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFBDQUHGRRR77"}}, {"Date": "on July 9, 2014", "Text": "The classic is still amazing, deep, though provoking.  Besides conveying wonder of the Cosmos, Sagan also calls us to notice how humankind is at a critical adolescent juncture.  We have so much technology and can either evolve to a peaceable future-looking species or destroy ourselves.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32XKEG7BBYYSN"}}, {"Date": "on July 6, 2014", "Text": "This was an incredible man that had a fantastic gift for simplifying some of the most complex concepts man has ever face, to bring the curiosity and wonder to everyone.  I remember being fascinated by his television show as a kid and this book fills me with the same thirst for knowledge.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IFN6JJ6MMEAC"}}, {"Date": "on July 3, 2014", "Text": "Brilliant and with updates still fresh after 30 plus years. But mostly for an unscientific mind Sagan instills a marvelous sense of wonder. Makes me want to read more about science. Neil DeGrass Tyson's Cosmos is excellent too with all the bells and whistles of special effects, but Carl Sagan's has special flair.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XCZ0142RBIQ8"}}, {"Date": "on June 28, 2014", "Text": "What an amazing book with so much knowledge of our history amd place in this universe and beyond to explore.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A185RYL14GFRVA"}}, {"Date": "on June 25, 2014", "Text": "For anyone who is even a little curious about our world, our universe, this is the book to read! You shouldn't miss it for anything", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AG0JFLVYVR8ID"}}, {"Date": "on June 21, 2014", "Text": "At an earlier point in my life I would have given Cosmos 5 stars without hesitation, but I'm an old jaded fuddle duddle with a couple of degrees in related fields so a lot of things were old news for me. Still the presentation was excellent and the subject matter was accessible but not dumbed down. A little bit too much focus on other intelligent life forms for my liking but not too bad.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKF3QI8QAILT7"}}, {"Date": "on June 18, 2014", "Text": "In light of the recent remake of Cosmos with Neil DeGrass Tyson, I decided to go back and read the original book from the groundbreaking series. It is a superb book that should be required reading in public schools. Sagan was not only a brilliant scientist, but also a sublime communicator. His passion for science seeps into your consciousness and ignites a fire (unless your are bigoted against science because of superstitious beliefs). I wish I would have discovered Carl Sagan as a young man rather than Billy Graham and his ilk. Perhaps, had I been inspired by a man of science, I might have taken a different path. It's too late for me now but, when I see children being force fed religious doctrine and being taught to distrust science, I pity not only the children, but also the world. Now much better would the world be of we had more men like Carl Sagan, Stephen Hawking and Neil DeGrass Tyson, and fewer Jerry Falwell's, Pat Robertson's and Osama Bin Laden's? I think it would be awesome. I hope more people read this book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AFSSQNSH1FV7"}}, {"Date": "on June 17, 2014", "Text": "I have never highlighted so many phrases and parragrafs in a single book. Poetry and science combined, melted together by the author's supernova-grade intelligence and sensibility", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15T1DHKXEC7WK"}}, {"Date": "on June 3, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AB84IAXZAUDRC"}}, {"Date": "on May 31, 2014", "Text": "This book is terrific to read. I just have one regret. That is not having my original Cosmos any more.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQ6L6YHAMHWUM"}}, {"Date": "on May 30, 2014", "Text": "While I am aware of some newer research, I believe Cosmos is a great read if not to inspire or develop a love of science.  Some reviewers have complained that the final chapters are boring.  This is because they deal with a scientist's impression of Cold War-era hostility.  Though the Cold War is over, there are still many lessons to be learned from Cosmos about the uniqueness of our human existence and the possibilities of the universe.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SA8AW9NR5348"}}, {"Date": "on May 24, 2014", "Text": "It's a classic. No question about it. I read it once in the 80's and now with the new TV show I read it again. It is great.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NZZWQOSUAO0V"}}, {"Date": "on May 17, 2014", "Text": "Lots of information, some of it not easiily understood. But it is interesting to see how several of the predictions and surmises made in the early 80' have become real in the presentl. It's an easy book to 'Pick-and-choose' the subject matter in which on may be interested and to discount the rest. But, the last chapter should be required reading fo anyone who cares about who we might be in the larger scheme of existence from the COSMOS perspective.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LM94KC8VLDO6"}}, {"Date": "on May 16, 2014", "Text": "This book was very informative and fun to read. I would recommend it to anyone even slightly interested in the cosmos.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1P5BBA6KP7WZE"}}, {"Date": "on May 15, 2014", "Text": "Great read! Especially if you pair it with the TV series. Absolutely loved reading this book. The info is a little dated, but still relevant.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NUGILLU73ZYS"}}, {"Date": "on May 14, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24ISDBKJQZJV7"}}, {"Date": "on May 12, 2014", "Text": "I would recommend this book to anyone. It is written so brilliantly, with side stories to hook you, and facts to back it up.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HMVET7RM5U9C"}}, {"Date": "on May 11, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A197F9C99ABSJQ"}}, {"Date": "on May 10, 2014", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XI51TGZOGT1C"}}, {"Date": "on May 2, 2014", "Text": "I was 13 when this programme was shown on television the first time and it changed my life.  I immediately begged my parents for the book which they bought me and I still have all these years later.  I bought it again for my Kindle so I could have it in a more portable way (the other book is coffee table size) and although the illustrations are lacking, the information is still there.  Carl explains science in an easy and human way.  It made me want to learn and expand my knowledge.  This book is simply a must read.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACU22OOTCPJDF"}}, {"Date": "on April 30, 2014", "Text": "This was a very interesting book and different from my usual choices. I found a majority of the information easy to understand, and the stuff that was over my head was easy to ignore (i.e. it didn't keep me from moving on in the book). I look at the skies in a whole new way now. Thanks Carl.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20ROZXVYSD2SR"}}, {"Date": "on April 23, 2014", "Text": "Read the book years ago and sparked my career as a science teacher which was passed to two sons who are engineers.  Needed to revisit because of the Cosmos series on TV  It is a bit disappointing to see how much agenda has crept into the science of Cosmos", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4MPDQF63WAEO"}}, {"Date": "on April 21, 2014", "Text": "Not just from the standpoint of the cosmos but also from the standing of learning more about science and its history.  Feel this should be required reading in schools around the country but with the stupidity that seems to be taking over the country can't hold out much hope for that happening.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARMWU6BLQZLYF"}}, {"Date": "on April 21, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TQ0LTPVLVJ0Q"}}, {"Date": "on April 19, 2014", "Text": "My sister recommended this book for me and let me borrow it. I can not thank her enough. Never have I read a book that more eloquently explains our universe in such a broad subject matter. Sagan poetically writes about science, making the book not only incredibly interesting, but beautiful.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ER6ZICHGFTXA"}}, {"Date": "on April 4, 2014", "Text": "A wonderfully written book.  Very  informative and packed with  insight.  Gives facts and leeway to imagine our universe. Cosmos created a desire for me to know and understand more about our world. I read it because of the remaking of Cosmos, the TV series.  I think I will get invoked with our local Observatory.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYZH1LMU2KUPD"}}, {"Date": "on April 1, 2014", "Text": "Excellent read for the layman in understanding the development of our solar system and the human species place in the process.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACRJJL0YDANJ4"}}, {"Date": "on March 21, 2014", "Text": "Decades after it was written, Sagan's Cosmos still holds up to the test of time. Of course, there were a few stuff that needs updating, and there were some historical parts that did not quite match up when i looked it up on the internet. (Yeah, i know, wikipedia could be wrong but I'm not THAT interested in history to do further research)", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4BML3IUW2HXQ"}}, {"Date": "on March 19, 2014", "Text": "every aspect of human experience is explained to the best of our knowledge  , following, I think. in the tradition of Isaac Aasimov.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JW25IYE0G48Z"}}, {"Date": "on March 10, 2014", "Text": "I have always had a fascination with the starts and space a  a whole. This book brought up many of my questions, as well as bringing up some new ones. This book made me think made me feel small but at the same time immensely important. This book has made me love respect and most importantly made me understand this rock hurtling through space that we call home.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQWK7OSSDP63A"}}, {"Date": "on February 21, 2014", "Text": "Cosmos is a comprehensive and yet elegant tour of the Universe and mankind. Carl Sagan is absolutely moving in how much importance he places on science in the betterment of mankind. The world is a better place having hosted such a brilliant man.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10IT4Y3JQMP1G"}}, {"Date": "on January 28, 2014", "Text": "Cosmos: a very good explanation of evolution, & the universe, carl had a gift to explain to the average  person subjects  the  average person could relate to & understand, especially  evolution versus  creation, that is if  you have  a open mind,  Carl painted a picture of a tiny planet, in a big universe , that makes us  all alone , & very unique >>> morat.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TQ4LDJ3F5WRJ"}}, {"Date": "on December 16, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YZ56JNBPNS6V"}}, {"Date": "on December 7, 2013", "Text": "I'll definitely read this again. fascinating book that is rich in information about us and the cosmos.  very thought provoking", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20QOMMTHFVSO7"}}, {"Date": "on September 18, 2013", "Text": "Carl Sagan is the primo person when it comes to the universe and associated astronomical information.  This book was priced right and in excellent condition.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IGQTO0WAO02R"}}, {"Date": "on September 12, 2013", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28G48WHPO18B2"}}, {"Date": "on September 10, 2013", "Text": "if your passion is space, and would like to know what is beyond earth, this book is for you. jw", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32UH0WFKVI31C"}}, {"Date": "on August 14, 2013", "Text": "THIS IS THE GREATEST STORY TELLER OF ALL TIME. HE CAN MAKE THE ENTIRE UNIVERSE FIT IN THE ROOM YOU ARE READING IN. THE MAN HAD THE SIMPLEST WAY OF EXPLAINING ANYTHING TO ANYBODY!!!!!!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2THOHRVTLVA4J"}}, {"Date": "on August 1, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FNLT6MTO93WM"}}, {"Date": "on July 18, 2013", "Text": "Had a hardcopy of the book years ago, but loaned it to someone who never returned it.  Finally found it here and downloaded it to my Kindle.  Great!!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15J9ICFTDR9BJ"}}, {"Date": "on June 16, 2013", "Text": "Really opens your mind a gives you a comic perspective on out planet. It also teaches you about the history of astronomy and the greats thinkers behind it.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A187NSW5TBA4KB"}}, {"Date": "on June 11, 2013", "Text": "What is there to say about the people's scientist? I don't tend to get emotional about people I don't know but when he passed away it broke my heart. This opus was just one of a dozen of masterpieces. I still miss him!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AH2O0YCYO7VVO"}}, {"Date": "on August 8, 2012", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AF5DE7E49647T"}}, {"Date": "on April 19, 2012", "Text": "I had a great pleasure watching the TV series, and also had a joy with the kindle edition. Although I bought the kindle edition to check out the book itself I think for a person who loves books it would be better to get the hardcover copy which includes high quality, full-colored drawings of the explanations given in the book. Nevertheless, I found the images comprehensive and the whole book worth a try to introduce yourself into humans knowledge about the Cosmos.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADAA99SQW9M93"}}, {"Date": "on August 29, 1998", "Text": "Carl Sagan is the answer for the people who is able of watching farer. He  always tried to explain the knowledge with simple words. Sagan became the  knowledge a funny play. Really he was a wise person!!!. I'm sure Sagan will  be always remembered in the future like one of the men that opened the path  for the route of the man to the stairs.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on January 9, 1999", "Text": "Carl Sagan's Cosmos is compelling for anyone who reads it. It's driving me wild with facts that many in real life care little to understand.I've read 3 times and still I can't find it boring. Sagan's \"Cosmos\" and  Stephen Hawking's \"A Brief History of time\" are the modern day  bible that everyone should refer to.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on May 28, 2011", "Text": "Not only is this a brilliant written and scientifically valid piece of literature, but it is an arguably landmark volume in the the annuls of popular expression, tying  in human perspective of the universe to the wonders of astronomy through the ages. If you haven't yet read it, I envy you. A life-changing adventure awaits you!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22MF73IJ5F72P"}}, {"Date": "on September 8, 2011", "Text": "i love cosmos both the dvd and the book, it is truly some mindblowing stuff, great for the thinking mind.  being a graduate history major, i wish i could find more stuff like this.  I tried Brian Cox wonders of the universe episodes who studied carl sagan... but i dunno he is just not as good as carl sagan was. but still good.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2O6HZ2B9YSRXR"}}, {"Date": "on April 10, 2006", "Text": null, "Helpfulness": 0.625, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMBKE3M63UCRV"}}, {"Date": "on July 18, 2014", "Text": "Dr. Sagan's classic work is classic for a reason. This book nicely melds history and science allowing the reader to feel a deeper understanding of nature without being lost in scientific or mathematical complexity. I strongly recommend this fantastic book to anyone with even a passing interest in how the universe works.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HZYBTPK81H2B"}}, {"Date": "on March 9, 2005", "Text": "This was one of the first books I ever read, and still one of the best. The late Sagan does a good job explaining the history of astronomy and space flight. He even defines Cosmos: it means everything that does exist, has existed, and ever will exist.", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16YCLRKOU0EV3"}}, {"Date": "on December 15, 1999", "Text": "Sagan targets a general audience with this magnificent work! He presents the topics in a very clear and entertaining readable manner and makes them easy to understand. Isaac Asimov couldn't do a better job! This great work  will stimulate many people to pursue a further quest for knowledge in  science and cosmology.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJHPZ48YOZK4H"}}, {"Date": "on May 3, 1999", "Text": "My first exposure to Sagan was on TV.  I was watching his TV series which this book has been adapted from.  It is the BEST book I've ever read. It has been on my bookshelf virtually all my life. I consider myself lucky  that I have an original print copy of the book in hardcover.  I'm truly  saddened that he died.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KEI2CKB1QQ8J"}}, {"Date": "on May 6, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32QGFP9FPLOSM"}}, {"Date": "on March 6, 1999", "Text": "Leo Cosmos desde hace 11 años y siempre encuentro cosas interesantes y actuales. Cambió la forma en que percibía el Universo. Carl Sagan lo escribió con una secuencia muy bien estructurada principalmente para los  principiantes en el mundo de la ciencia. Es un excelente regalo para todas  las edades. Read it!!!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on July 14, 2012", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MEC0T7Q65C7S"}}, {"Date": "on June 4, 1999", "Text": "I read this book about 2 years ago, I was 13.  Though he may not be the greatest scientist, Sagan truly opened up a world for me which has continually been an escape from  sometimes vacuous society.  I was saddened  by his death, but plan to continue reading about astrophysics because of  his books.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on March 31, 2015", "Text": "I was never much into Cosmology until a friend of my recommended this book. I cannot stress how great of read this is and very informational. Frankly, anything by Carl Sagan is probably amazing to most people. If you're not into science at all or informative reading you should still try this book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27GSD8NVCCOK4"}}, {"Date": "on June 4, 2013", "Text": "Cosmos the series was and still is my most favourite science documentary and now I have the equally brilliant companion book. The description does not do the book justice. It is breathtaking (I kid you not), beautifully bound and illustrated. I recommend Cosmos fans get it ASAP. Don't miss out", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9VZI9A4JNELC"}}, {"Date": "on May 12, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARZNB8QXFL935"}}, {"Date": "on October 5, 1999", "Text": "If every human on Earth read this book. It might make them think about how important life is, causing violence and hate to stop. We are all equal on this planet. I now have a new outlook on life and how small we really are.", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on March 4, 1999", "Text": "Cosmos has astronomy, history, biographies...  ...everything so well explained.  The book is far better than the series, you let your imagination fly.  This book made me read 10 times more than I did before  it, it is something you would like to keep for your sons when they grow up.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on March 8, 2015", "Text": "It is a general book about Science at all. I think the high peak of this book is showing science concepts without diving in deep in formulas and calculations that put the general public far from it. Also it tells its concepts like a story, in the same manner all great books do.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3R04FKEYE19T6"}}, {"Date": "on May 9, 2014", "Text": "This book was a gift for a young science-loving friend who hadn't read Sagan.  I own and have read all of Sagan's books - he was a personal \"hero\" of mine, for his science, his command of English, and his beautiful soul.  I hope my friend likes the book as much as I do.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BVAA959GOA5H"}}, {"Date": "on July 20, 1998", "Text": "After reading Cosmos you'll feel like a new \"informed\" man.  By far the best book on the subject.  Everything is explained in such a way that even the layman can understand.  Ever wounderd about black holes, relitvity or extraterrestrials, then this the book for you.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11ALL8YWS8BBR"}}, {"Date": "on September 3, 2007", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1X8VZWTOG8IS6"}}, {"Date": "on January 14, 2015", "Text": "Totally mind-blowing take on our place in the Universe written before it's time.  It is readable for the layman (non-scientist) without dumbing down the concepts too far.  First time I read a book by Carl Sagan but definitely worth the read if you want to think and learn!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1P677STIUVI27"}}, {"Date": "on September 1, 1999", "Text": "The other five star reviews have probably said all I would want to say in a complete review.  So, bluntly, I recomend this book to anyone who has any interst, any interest at all, in the Universe and the past & future of  the human race in relation to this Universe.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on September 20, 2008", "Text": "Carl Sagan's COSMOS is simply one of the best popular science books ever written. What sets this book apart from others on the subject is Sagan's poetic style and enthusiasm for the topic. By the way, the pictures in the hard-cover version are beautiful.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JBBR4MNGQ70G"}}, {"Date": "on July 8, 2014", "Text": "This is the second time I have read this book. This book was the first of its kind as it explained complex science in a way that most science minded people can understand.  I must say Carl has been right on the mark with his predictions for the future.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3I99TJNQC80RA"}}, {"Date": "on February 3, 2006", "Text": "Another one of my habitual re-reads, Cosmos dazzles with scientific speculation. I'm easily put-off by authors who lecture pedantically, enthralled by their grasp of a subject and interested in little else than hearing the drone of their own voice. Carl Sagan is NOT that lecturer. One senses intuitively a deep deep passion for our universe and a desire to communicate that passion and to enjoin in questioning and debating and prodding and discovering. Carl Sagan was one of the few modern scientists who managed to garner rock-star fame in an era where universal idiocy is heralded and embraced and celebrated, and his insistence on eradicating ignorance and superstition and pseudo-science was vital in the national debate, and his loss all the more painfully felt in an era when 'Creationism' stands to devour us whole and place one more nail in the coffin of reason. We could sorely use some more Carls... with Cosmos, Carl has left us a magnificent legacy to the dedication to pure scientific inquiry. Thank you for inspiring Carl. You are owed a debt of gratitude for all you have done.", "Helpfulness": 0.6, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3H08UKJU74C4U"}}, {"Date": "on September 27, 2008", "Text": "... as there is nothing else to add except that this book is THE BEST book I've ever read in my entire life. Carl Sagan is a GENIUS. His memory will live on forever through his books. He made me love astronomy so much I bought a telescope! :o)", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2T9ZW8DJJVSXN"}}, {"Date": "on March 10, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A82IDKEXRD7QD"}}, {"Date": "on June 11, 2014", "Text": "I did not expect a new book for free! I just wanted what I paid for the first time.I would always use Amazon when I need books.I tell all my friends how easy Amazon makes buying books,and your never disappointed with their service.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AYA25V701YH7"}}, {"Date": "on April 14, 2014", "Text": "Some of this material is dated, but I can't remeber reading anythig quite as thorough.  Unlike 'A Brief History of Time,\" the material is asscessable to most readers.  This should be required reading for all serious students.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AI900FGODR478"}}, {"Date": "on May 24, 2014", "Text": "I gave my book a five star rating because I'm 95% satisfied.  The other 5% ..alittle sad because my book did not have the beautiful jacket cover.  I would recommend this book to anyone interested in  the worlds outside our own..", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YYEFVPFLFP7Q"}}, {"Date": "on January 2, 2012", "Text": "I'm starting to read the book now, after the holidays, and I like it. Aside from Carl Sagan being a great popularizer (had to make sure that was a word) of science; the shipping and the book itself got here without a hitch.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2M9LQLU8Y370X"}}, {"Date": "on April 24, 2014", "Text": "Enthralling again years later.. The concepts told in stunning detail with accurate and explanatory  historical background. Will probably watch again (the DVD as well) in a few years if we are still in the universe then!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3K1Z5SKL5ZU98"}}, {"Date": "on March 30, 2001", "Text": "I read the book after wtaching Sagan's TV series, as many  people of my generation. And it had a great influence in my  scientific career. Few other books can compete with such  a lively vision of science. Thanks, Carl.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NJBWNXDW7TEC"}}, {"Date": "on September 15, 2014", "Text": "Great book, basically the companion to the tv series that he did, however I did not see the tv series. In the introduction Sagans explains that this is the companion. The seller was great, very friendly and timely.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21QESHN2CWHI2"}}, {"Date": "on May 17, 2014", "Text": "I gave this to my husband for Father's Day.  Like him, a Carl Sagan / Cosmos fanatic will truly love this.  It is beautiful and sturdy, and the contents are all a fan would want or could hope for.  He was thrilled.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1A2M1MSLO3ODH"}}, {"Date": "on March 28, 2014", "Text": "I bought this as a gift for my boyfriend, he has been obsessed with this stuff since he was a kid.  He was very excited about the quality of the book, it was in great condition considering it is over 30 years old.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMDT2DP105F2Q"}}, {"Date": "on June 15, 2001", "Text": "COSMOS IS SIMPLY THE BEST BOOK I HAVE EVER READ . IT IS CLEAR AND THOUGHT PROVOKING , I HAVE READ IT THROUGH TWICE AND READ BITS AND PIECES FROM TIME TO TIME . IF YOU LOVE SCIENCE I  GUARENTEE YOU LOVE THIS BOOK", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SMRDN80A01JJ"}}, {"Date": "on May 1, 1999", "Text": "Very thought provoking.  Though lesser material  than the full edition, its worth the read for the price.  If you like an abundance of images, you will be disappointed.  One of the best books I have read so far.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on October 11, 2013", "Text": "Cosmos by Carl Saga. I 've seen a lot of episodes of Cosmos on Netflix, and I couldn't get enough so I decided to buy the book, it's really good, Carl Saga's vision was ahead of his time. I recommend this book.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VOGNBUMXSW13"}}, {"Date": "on July 4, 2013", "Text": "This book is an excellent read and extremely well written. It manages to explain some complicated concepts in such a way that I feel most people could gain something from reading it. One of my favourite reads.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1M2LE4KXKZ589"}}, {"Date": "on August 31, 2014", "Text": "What can you really say about Carl Sagan? The man was a genius and a visionary, but he was able to communicate to people who are not scientists in an enjoyable way. I love anything that Carl Sagan produced.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32KSCY6GQMP73"}}, {"Date": "on February 14, 2015", "Text": "very eloquently written, writes in a way that conveys the message and can be understood by a person with no formal training in science while also retaining and portraying the complexity of the subject.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJEZNMIBM9G57"}}, {"Date": "on June 8, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJEV6I5MYRHGN"}}, {"Date": "on April 5, 2013", "Text": "i suggest everyone who doesnt want to take the time to read to go and look up Carl Sagan videos on Youtube, take a few moments out of your day to better yourself and understand where we all come from!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18MNJBNNAW71W"}}, {"Date": "on February 21, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19O0GFREM48WA"}}, {"Date": "on September 11, 2010", "Text": "I purchased this for my son who loves science!! He loves to watch the series that was on television, so I was thrilled when i found the book for him. The book came very quickly, and he loves it!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IO9MSYO8N3L5"}}, {"Date": "on December 9, 2014", "Text": "An excellent introduction to cosmology, astrophysics, & the history of science for the lay person.  Sagan's passion for science & reason, and his hope for humanity's future are inspirational.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZF50OD3D7UCJ"}}, {"Date": "on September 15, 2013", "Text": "if you are at all at least a little bit curious about this rock we live on and its place in the universe, then that is the scientist in you. this book is extremely readable and fascinating.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1T6K1ESK6THH4"}}, {"Date": "on June 22, 2014", "Text": "Dr. Sagan's COSMOS is truly a great scientific work, that will stand the test of time. So sad with his early demise, but glad his work is being continued by Dr. Neil deGrasse Tyson, et al.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQ6GAWJKPMX0Z"}}, {"Date": "on April 23, 2014", "Text": "This is a great book and so is the documentary series, they both have something unique, so I recommend both. Carl Sagan is inspiring with his use of poetic language to describe the cosmos.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PUMTOEYOL2XI"}}, {"Date": "on April 8, 2014", "Text": "\"The series is GREAT, but reading this is AWESOME because you can put your self right there. I will be reading this again and gain\". This was bought for my son and I've quoted him.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVD1R6B47423T"}}, {"Date": "on November 15, 1997", "Text": "Simply put, this is one of the books that makes you both extremely proud and extremely amazed to be alive here and now. Nobody should go without reading this wonderful work of nonfiction.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AK2N6VWTIX2XP"}}, {"Date": "on October 21, 1999", "Text": "Admiro la destreza con que Carl Sagan transmitía sus conocimientos y teorías. Cosmos es uno de mis libros favoritos, exalta la ciencia racional sin subestimar las creencias religiosas.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on March 18, 2015", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EFMSUWY6L9LY"}}, {"Date": "on September 8, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AN1HVXMC1MZBA"}}, {"Date": "on September 6, 2012", "Text": "i love books about physics and stars. This is one of the best popular science titles. Carl Sagan makes complex topics understandable and I will certainly read more of his books.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WP4Z0891Z7I8"}}, {"Date": "on May 7, 2014", "Text": "We bought this as we started watching the Cosmos reboot with Neil deGrasse Tyson and it's been fun to look through it and talk about things outside of our planet with the kids.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17IQYQ2TD5FNZ"}}, {"Date": "on April 6, 1999", "Text": "COSMOS was simply the finest science book I've ever read. A book any reader, regardless of his background, can enjoy and appreciate. I'd recommend this to anybody who can read!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on January 19, 2012", "Text": "Carl Sagan had a gift for making science interesting and fun to learn and it shows in this book. Very enjoyable book to read, will definitely be reading his other books.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALW739ZDOWYLW"}}, {"Date": "on August 23, 2014", "Text": "A truly amazing and inspiring book! A must-read for anyone remotely interested in science, which really should be everyone on Earth. What are you waiting for? Read it!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OB8KNN4MA1UN"}}, {"Date": "on May 8, 2012", "Text": "Easily one of the best books I have ever read. Do not hesitate to read this book. Covers so much subject matter it is hard to describe in a simple review. Just read it", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A318EUY1KECR6F"}}, {"Date": "on June 30, 2013", "Text": "Bought for my 8th grade science classroom. It's used but will fit the use I bought it for wonderfully. Now when we talk about Carl Sagan I can show them his book!", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CNJ2QKI3BBBW"}}, {"Date": "on September 15, 2013", "Text": "A seminal work bringing science and history together to inform and inspire the reader. Carl Sagan was one of the great science communicators of the 20th century.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35MCFQLW0531H"}}, {"Date": "on August 19, 2014", "Text": "I still did not finish the book, but so far it's an amazing book, I would recommend it to anyone who is interested to know about life on earth and the universe.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3G8NWRLD3RM5F"}}, {"Date": "on December 25, 2013", "Text": "Highly recommended great science book, it explains from scratch, though it's an old book and science has came a long way since then yet it's still a great read", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AP20WZHGQBBJH"}}, {"Date": "on August 3, 2014", "Text": "Anyone interested in where we are and where we may be going should read this book.  Not just facts, but readable literature.  A must for every library shelf.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BKTPZJMZH1I2"}}, {"Date": "on December 13, 2013", "Text": "Phenomenal book by one of the most gifted scientific teachers we've ever known! Well thought out and articulated for both novices and experts on the subject.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RAI2YMCH5H73"}}, {"Date": "on December 12, 2010", "Text": "Ellaborations on other items not in the series in entirety can be found here. I love Dr. Sagan's lyrical styling of the wonders of the universe. Stunning.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IW9YT5VZAQ52"}}, {"Date": "on January 29, 2014", "Text": "Carl Sagan writes beautifully and descriptively. I would suggest this book for anyone interested in learning more about astronomy, physics, or evolution.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SFYBT8WLCD8U"}}, {"Date": "on July 24, 2013", "Text": "My girlfriend loves space and loves books with the pictures of everything that's out there very clear and high resolution photos and she loves Carl Sagan", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2771A41BGQ6YZ"}}, {"Date": "on September 20, 2011", "Text": "Carl Sagan was clear and thoughtful. It's obvious that his knowledge of human nature and science was incredible. He will be missed but his work lives on.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOSJJXGV6R6JZ"}}, {"Date": "on January 14, 2003", "Text": "Although this book is well over 20 years old now, it's still timeless in many ways. The photographs and drawings of various objects in the universe alone makes this book worth buying. But the real power of this book comes from the writings of Sagan himself. He has a rare talent among scientists: the ability to both synthesize various scientific fields together as a philosophical entity, and then to effectively communicate the meaning of what the fields are to the lay public. Most scientists at his level are so deeply immersed in the specialized literature that they can't even remotely explain what they are trying to do. Sagan understands that all of science is related, that evolution has a basis grounded in physics, and most importantly, that religion has tried to suppress the most important discoveries in science, and is still doing so today!", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NAZ112A3P35E"}}, {"Date": "on December 30, 1996", "Text": null, "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on January 5, 2014", "Text": "I bought this book after seeing the special documentary. Really good book. Carl Sagan's book is great for people who wants to learn about the Cosmos", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LYWVCCGWJDXE"}}, {"Date": "on June 10, 2013", "Text": "This is a great book regardless of your level of knowledge about the universe. I am now on a mission to read every book that Carl Sagan wrote.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1W3CLNA79OGVM"}}, {"Date": "on March 26, 2013", "Text": "this is a completely gorgeous book and i will never regret buying it. finished reading it just a few days ago and i've learned a lot from it.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QT69PJA3JD28"}}, {"Date": "on September 23, 1998", "Text": "This books is very informative and braoden the perspective and mind of the  reader. Very well written in simple language. Worth reading book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on October 17, 2013", "Text": "As another reviewer has stated, these editions have very small print with not much space at all between lines. The pages are also very small and make it hard to hold open. The book itself seems great but I would NOT buy one of these editions again. I have ordered the new paperback edition releasing on December 10th, 2013 with a foreword by Neil deGrasse Tyson to replace the one I got published by Random House that will likely be given away to goodwill. The font size and book size only possibly seem applicable for young kids but even then it might be a stretch. I have at least average eyesight and am only 27 years old and I find it difficult to focus on the sentence that I am on as the other sentences are almost right on top or below the one that I am currently reading.", "Helpfulness": 0.5, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ERN2LR7Y7QH"}}, {"Date": "on March 31, 2015", "Text": "Truly amazing. Sagan is one of my heroes. What fabulous knowledge and insights he offers. Truly incredible, and absolutely worth reading.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11GKKS61C5IPV"}}, {"Date": "on September 30, 2011", "Text": "I love Carl Sagan and I like the Cosmos series. This book is awesome because it comes with a lot of pictures and information. Loved it!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZM409UCBLWF2"}}, {"Date": "on December 2, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1W95BWPFURJHH"}}, {"Date": "on April 19, 2014", "Text": "I used to have this book and it was lost to time.  Fortunately I was able to find it again used, in great shape and for a good price.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OY5OP6KNWK7O"}}, {"Date": "on September 10, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2E0PXR63FR3EH"}}, {"Date": "on February 1, 2015", "Text": "He explains the phenomena of the cosmos with an elementary vocabulary. Worth every penny and minute in your day to explore with him.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1O7YASO1CD3PE"}}, {"Date": "on April 12, 2015", "Text": "Came in in pristine condition. And I can tell its brand new by that lovely new book smell. This is my newborns first bed time book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WOBTDFVX3HTM"}}, {"Date": "on June 20, 2014", "Text": "I bought this book for my son who seemed to really like it. He was ion 7th grade at the time and the read seemed relatively easy.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DTJ7DYNZNYX"}}, {"Date": "on September 22, 2014", "Text": "In one way it does wonderfully sum-up the science and science politics of the 80-ties, it is engaging and fascinating. As a biologist the section about the \"Samurai Crab\" was off-putting, as it seemed intuitively wrong (and probably is - when reading more literature).  As all popular science writing but it molds the science and history of philosophy to fit the story. But I find that the narrative is to authoritative (perhaps as a product of it's time) and does not allow the reader to evaluate or see controversies, which in themselves can be exciting. A current version, edited by a worthy successor would in my view be much better way to honour this classic and the spirit of the author!", "Helpfulness": 0.5, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25SR81HODV8GK"}}, {"Date": "on February 14, 2015", "Text": "This book is awesome!  Its for people who want to know everything that scientists know about life, the earth, and the universe.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1K47NIA1LWRHF"}}, {"Date": "on October 20, 1998", "Text": "Amazing.....every person in the world with the slightest tug of interest  in science or their environment MUST read this book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on October 21, 2014", "Text": "\"We are starstuff pondering the stars\" a great read that will change the way you think about the universe around you.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OISF647JR5ZH"}}, {"Date": "on October 3, 1997", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on November 4, 2014", "Text": "One of my favorites. Everyone should read this book.  Carl Sagan is a master at capturing the beauty and awe of discovery.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21PD1KRF5I09U"}}, {"Date": "on July 18, 2014", "Text": "Fantastic, informative, and brilliant work of a master! A wonderful plea for sanity in world with so many nuclear weapons.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GBUFLIW1AUFF"}}, {"Date": "on March 26, 2014", "Text": "great book for inquisitive minds. easy read for everyone no phd needed. explains more things than you knew were out there.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XA1DVKQNZ0TK"}}, {"Date": "on March 16, 2015", "Text": "All time favorite book. Insanely inspirational and the science in phenomenal. I keep a copy in my bookshelf at all times.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3USQ3AJ30B98P"}}, {"Date": "on May 8, 2015", "Text": "Written in Carl's style of speech.  A remaining example of his description of our future since he is no longer with us.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VGDTFVF8J07Y"}}, {"Date": "on July 2, 2014", "Text": "One of the most outstanding books of all time to explain \"how it all fits together in the universe.\" Timeless!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQQ9UHATUUYSR"}}, {"Date": "on May 23, 2015", "Text": "Easy to understand science behind the story. I just wish Sagan had more time to rite a lot of these types of books.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CPZGSP16MP9A"}}, {"Date": "on January 13, 2015", "Text": "Can't decide?  Well, maybe you should stop reading reviews and read this book dummy! Hip hip hooray hip hip hooray.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VM2KL3ZHDMXT"}}, {"Date": "on August 13, 2014", "Text": "Sagan's excitement for astronomy and physics is palpable in his writing. You can't help but share his enthusiasm.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3I31AZKG6YDBM"}}, {"Date": "on June 15, 1997", "Text": "This book is \"Brilliant\" and wondeful a must read! Carl Sagan is one of the Best scientists of our Time", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on April 10, 2015", "Text": "As far as the condition of the book and the arrival time excellent , the book was a gift ( brand new thank you", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WT8QNDU8ECOJ"}}, {"Date": "on June 17, 2013", "Text": "I always wanted this great book.  I can't put it down.  Condition is wonderful.  I will order again and again.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AA5WKIBMOQ2R"}}, {"Date": "on October 25, 2004", "Text": "This book has helped me see the world in a new light. I enjoyed very much.", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on July 18, 2014", "Text": "Excellent writing and content clarity make this both readable and wonderful.  It's a durable contribution.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PMD5UKDX22CV"}}, {"Date": "on December 26, 2013", "Text": "Amazing book with very cool pictures in it. If you  appreciate the work of Carl Sagan, you should buy one.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GWE2U5KVETR"}}, {"Date": "on September 18, 2014", "Text": "It was an immense pleasure to read this book all these years later. I'll recommend it to everyone I know.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A185XF9YLMIES2"}}, {"Date": "on August 21, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WC3PI8XQWNDN"}}, {"Date": "on February 11, 2014", "Text": "A stocking stuffer for a thoughtful kid - I am happy it is still available. Came in plenty of time.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2B5WIIVKNYPC1"}}, {"Date": "on May 5, 2014", "Text": "An amazing book  just as good as the tv show I would  recomend buying it its a must read very good", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3522Z8PNJULOQ"}}, {"Date": "on August 12, 2014", "Text": "Read this years ago and didn't have a copy any more.  I am looking forward to enjoying it again.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2W0P2TIP2WEXS"}}, {"Date": "on January 27, 2015", "Text": "what the hell can be said...typeface is quite small, there are many beautiful plates~", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A299X7SO4KW6T5"}}, {"Date": "on August 18, 2014", "Text": "If you want to know about space... this is the first book you should read hands down.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APS0NGNGYRORR"}}, {"Date": "on July 18, 2014", "Text": "Great book.  Well written.  Timeless science with a little philosophy at the end.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39PM304S87MYH"}}, {"Date": "on March 3, 2015", "Text": "thoroughly enjoyed it... always wanted to read this one.. finally got the chance", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21YGV185F0TZM"}}, {"Date": "on December 5, 2014", "Text": "No matter how many times you read it, it is thought provoking and enlightening.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SKBGIF82KCHL"}}, {"Date": "on September 21, 2014", "Text": "The original and (despite Neil de Grasse Tyson's recent effort) still the best.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RAGBF2O4RLYV"}}, {"Date": "on September 14, 2014", "Text": "Took a while too deliever, because of a delay, but overall it is a great book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AY9AH63PB5EAR"}}, {"Date": "on August 4, 2014", "Text": "Fascinating work, i am new to this kind of work and i could not stop reading.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21XVPJHMYIHNK"}}, {"Date": "on March 1, 2015", "Text": "Found my own hard copy so this is only an away-from-the-house reading copy.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DMO3NQHQ2ZG9"}}, {"Date": "on July 29, 2014", "Text": "One of the greatest books of the history. A must have. Love science.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LX3BQKR1ZCT8"}}, {"Date": "on January 28, 2014", "Text": "I enjoyed the book and it served my purpose of reading a good book explaining the science behind a lot of modern physics and astronomy for a non-scientist.  There is lots of political commentary by the author related to nuclear weapons and environmental issues that is clearly dated to the book's early 1980s publication, but those issues are still out there so I have to say still relevant.  The last couple chapters are mostly such commentary and can be just skimmed.", "Helpfulness": 0.5, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GTX16C65YOK0"}}, {"Date": "on October 10, 2014", "Text": "Very well done.  Opened many ideas that I hadn't thought of before.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QJR56ICNHDQX"}}, {"Date": "on September 6, 2003", "Text": "A comprehensive introduction to the subject of Humanity, ranging from Science to religion, from history to art.  Every chapter brims with humanity's soaring passion to know the world as it is, not how we wish it to be. And with it comes a lesson of humility. His writing is graced with unsurpassing clarity and beauty.  A must read for all ages.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on December 11, 2014", "Text": "Carl Sagan is one of the great phlosophers scientists of our time.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FQC2SIVG5IZB"}}, {"Date": "on March 15, 2015", "Text": "Amazing book. Learned a lot about different areas of science.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18FPLELF8XSNM"}}, {"Date": "on July 20, 2014", "Text": "A cosmological tour de force - even after 30 years !", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1L8UT1XFTHGRO"}}, {"Date": "on November 12, 2014", "Text": "This book is a love letter to science. Its awesome.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35R53BAPSTH8M"}}, {"Date": "on December 17, 1999", "Text": "I grew up with this book and it's a kind of scientific Bible for me. A must-have for anybody interesting in science, understanding our universe or just simply enjoying the beauty of our world. I would turn the book into a  textbook for our sons at school.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20NLM8AZZ4UJO"}}, {"Date": "on February 6, 2015", "Text": "Great and informative!  No one does it like Sagan.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3C2Z4X7EYLMA2"}}, {"Date": "on December 7, 2014", "Text": "This is the gold standard for a science series.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SZ6E6BX3Q1G7"}}, {"Date": "on November 10, 2014", "Text": "Amazing description of the unexplored universe.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANNC5POLMBJMW"}}, {"Date": "on January 22, 2015", "Text": "Gave as a gift and they read it and liked it.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARIKBABLQBGNC"}}, {"Date": "on August 3, 2014", "Text": "Great companion to the new Cosmos series.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VCJYWVO1AP2D"}}, {"Date": "on February 7, 2015", "Text": "what can I say, it's Carl Sagan...great", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3555HL2GWBI1"}}, {"Date": "on January 12, 2015", "Text": "Beautiful book!  Above my expectations!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27N2V8GQ7CAF2"}}, {"Date": "on December 30, 2014", "Text": "Beautiful, lyrical, thought provoking.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HWNFJKSGK6Y5"}}, {"Date": "on December 18, 2014", "Text": "Sagan is great even after many years!", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AU3R7TFQNRU6"}}, {"Date": "on December 21, 2014", "Text": "Great product, just as described =)", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CNAZBKWHA6S"}}, {"Date": "on December 13, 2014", "Text": "Great book, very well illustrated.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LTSX2577QFOP"}}, {"Date": "on November 19, 2014", "Text": "A must read Science be praised lol", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AO1TFX9F3WV02"}}, {"Date": "on October 21, 2014", "Text": "The voice of the cosmic fugue.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2S7R1EVI3K02X"}}, {"Date": "on July 30, 2014", "Text": "A most read book for everyone.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2S7QXBFHVNOO9"}}, {"Date": "on August 28, 2014", "Text": "Great Book. Love Neil DeGrass", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9CIDKR3FESF8"}}, {"Date": "on December 21, 2014", "Text": "Awesome video, awesome book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LO2X9V1SIDOU"}}, {"Date": "on December 14, 2014", "Text": "Fantastic! Highly recommend.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AO48SOMOA4AY"}}, {"Date": "on November 30, 2014", "Text": "I can't wait to read it :P", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25F7QNP1KDWHR"}}, {"Date": "on October 24, 2014", "Text": "Carl Sagan is my homeboy.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ANBXYELKC3OW"}}, {"Date": "on August 24, 2014", "Text": "Great read and came quick", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TRAB8X3TXGYD"}}, {"Date": "on November 17, 2014", "Text": "The articulate Mr Sagan.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AARFU920DMQRU"}}, {"Date": "on December 29, 2012", "Text": "Haven't read the whole thing yet, but it was recommended by my pastor at my Unitarian church.  A must read.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15HLJRMEUM3LR"}}, {"Date": "on December 13, 2014", "Text": "An absolute must read.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GXMVC2GL1ZXN"}}, {"Date": "on October 28, 2014", "Text": "love it, a great gift.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXND7F74KHQV8"}}, {"Date": "on April 18, 2013", "Text": "At first Cosmos is a bit of an ambiguous title. Along with the glowing reviews that adorn the covers of the book, one cannot be blamed for thinking that it is going to deal with Astronomy for a majority of the book. While it does just that, Sagan also takes the liberty of delving into multiple tangents that explore the greater depths of the world we live in from Biology to Physics with sprinklings of History and biography.  The book came after the documentary so if you are familiar with it then you will notice the text is straight from the documentary. If you have access to a streaming service that offers Cosmos as an option, I suggest watching the various episodes that correspond to the various titles of the chapters to enjoy the stunning(Although dated) visuals and music that it offers. A very ambitious and successful undertaking from the mind of a brilliant scientist.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AB8H0897Q2UM"}}, {"Date": "on November 30, 1997", "Text": null, "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on December 2, 2014", "Text": "A really great book", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22RANI30LQGJY"}}, {"Date": "on July 9, 2014", "Text": "Outstanding classic", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALYJB7GV9JPI0"}}, {"Date": "on July 2, 2014", "Text": "The kindle version don't include images. Can you believe the Cosmos without images?", "Helpfulness": 0.5, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1D1A4PQ0MCRW2"}}, {"Date": "on November 14, 2014", "Text": "Sagan is fantastic", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29DQJ34J7GU3A"}}, {"Date": "on January 11, 2013", "Text": "As I said nice science explained in laymen's terms but due to the 80's issue time frame it is somewhat dated. Still a very nice read for someone interested in the universe around us.", "Helpfulness": 0.5, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZXPE0DG3T1HC"}}, {"Date": "on March 28, 2015", "Text": null, "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2P0C4HXATNBBS"}}, {"Date": "on December 6, 2014", "Text": "Excellent book!!!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MQWII4HGOPX7"}}, {"Date": "on July 5, 2014", "Text": "Loved this book!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3F4X1NNK36IR7"}}, {"Date": "on March 3, 2015", "Text": "Very Good Book!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DYH3442EMRXV"}}, {"Date": "on January 10, 2015", "Text": "Excelent writer", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11WISKPT746Q1"}}, {"Date": "on September 18, 2014", "Text": "mind blowing!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8BTNXS74DFDG"}}, {"Date": "on February 20, 2001", "Text": "This is the first book by Sagan that I read.  It was for my high school's summer reading list.  At that time, I wasn't really into science, so I read half of it and set it down for almost a year...only to eventually finish it and was amazed by it all!  This book lead me into the realm of science (something my public school could not have done alone, or at least it would have been less likely to do so).  Though I am not going into astronomy, I am entering a scientific field and I owe it to Carl Sagan!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2W48C6KDOUWYX"}}, {"Date": "on January 9, 2000", "Text": null, "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on May 18, 2015", "Text": "As expected.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APFQY8I9FSZF9"}}, {"Date": "on November 23, 2014", "Text": "Amazing book", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3329EK7YEF60H"}}, {"Date": "on April 24, 2015", "Text": "good enough", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A230SP6PG7ZI8P"}}, {"Date": "on March 4, 2015", "Text": "A classic!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3T4SJABSI9OZI"}}, {"Date": "on January 20, 2015", "Text": "A Classic!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25CFMP5HCDNMW"}}, {"Date": "on January 5, 2002", "Text": "This book will open your eyes to a new way of viewing the entire world and it will blow your mind. Whether you understand the the science of astronomy or not, it doesn't matter with this book. It takes you from the beginnings of astronomical studies to the present(of his time anyways). It has take me to a new understanding of how everything plays together in the Universe.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on May 3, 2014", "Text": "This is an interesting book.  However, since it was written there have been so many advances in science the book has a \"looking over your shoulder\" quality.  The exploration of Mars being a good example.  We simply know more today about Mars than when Cosmos was written.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OKH3UL433JRH"}}, {"Date": "on October 1, 2014", "Text": "Wonderful", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9LYUM3UIQHI3"}}, {"Date": "on September 21, 2014", "Text": "Thank you", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BAOWFMTRSBCX"}}, {"Date": "on August 23, 2014", "Text": "Good book", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39G8W9ZONM00S"}}, {"Date": "on August 21, 2014", "Text": "Loved it!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2V4KVFNAXJ2IY"}}, {"Date": "on November 20, 2014", "Text": "Teriffic", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AOXSYOE2LQ3P"}}, {"Date": "on December 6, 2014", "Text": "Amazing", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QX58MUMPB5XL"}}, {"Date": "on July 8, 2014", "Text": "Great!!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2B0T6TCBWS01O"}}, {"Date": "on July 20, 2000", "Text": "Cosmos was the foundation of my life and dreams, Dr. Sagan made me dream that I could reach the stars and travel far in space and time. His 13 episodes TV series is of the best that has been aired in all the history of  the TV and this book allows you to relive those magical moments. After  reading this book you will feel that your mind and understanding of the  universe has been enhanced and you'll be one with the Cosmos. We are  stardust and we are the conscience of the Universe.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMTWN5EVLJYNL"}}, {"Date": "on December 22, 2014", "Text": "great!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4I8EKMN4W5I0"}}, {"Date": "on July 7, 2014", "Text": "Thanks", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DQ2DFHJ35ZUK"}}, {"Date": "on November 13, 2014", "Text": "A pleasure to read, even if some passages sound slughtly preachy. However, it is moving to see how far-dichtes the author was, especially as we witness the first landing of an unmanbed spacecraft on a meteriote (Rosetta).", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SIBMM9RMKE66"}}, {"Date": "on February 21, 2006", "Text": "This book has been used by universities as a media course, and is an excelent resourse for anyone interested in a general review of the cosmos (astronomy combined with general overview of the world).  If you wish to enjoy the entire aspect of this book, it would be nice if you could locate the video series that goes with it as well as the student workbook as well.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13DLH1EJP09FY"}}, {"Date": "on October 11, 2014", "Text": "Great", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AB7Q333Z213RR"}}, {"Date": "on September 8, 2000", "Text": "i cant describe how much i enjoyed this book.  it describes the evolution  of the solar system, of life, of civilization, and of science.  it explains  what humanity knew and didnt know at different points in our history, and  the astounding contribution of different men and women to that knowledge.  i have been fascinated by astronomy since the age of 5, but i have never  had such a clear mental picture of the ridiculous scope and breadth of our  universe.  i dont believe i have ever been more satisfied after reading a  book.  the best damn 5 or 6 dollars i have ever spent.  there isnt a person  alive i dont recommend this to.  i encourage you to purchase this book, it  may show you how futile and feeble our everyday desires are.", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EM11SICVRH03"}}, {"Date": "on January 25, 2014", "Text": "this is an amazing book. It may be dated a bit. But if you have an interest in the Cosmos (see what I did there?). This is a great starting point.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A264NF10VUAFZG"}}, {"Date": "on March 5, 1999", "Text": null, "Helpfulness": 0.5384615384615384, "StarRating": "4", "Author": {"ProfileUrl": ""}}, {"Date": "on May 23, 2001", "Text": null, "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A233RIC1Q23QQK"}}, {"Date": "on July 4, 2014", "Text": null, "Helpfulness": 0.4, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12O2LR29MDJUN"}}, {"Date": "on June 7, 1999", "Text": "\"Cosmos\" and  \"The Bible According to Einstein\"  are my two favorite books about the universe.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on October 4, 2013", "Text": "the book was in perfect condition when I got it. it could have been new even thought it was printed 20 years ago", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AL2H29J8PNCI9"}}, {"Date": "on April 23, 2015", "Text": null, "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARYDH3D2GGPTD"}}, {"Date": "on November 26, 2001", "Text": "For anyone who doesn't have a clue about space or the planets, this book will definitely help you.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HFKEGAI5PUCK"}}, {"Date": "on July 28, 2014", "Text": "Do yourself a favor and buy the hard copy. Something is lost in an electronic version.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJZ7BVQKI1Y5G"}}, {"Date": "on September 16, 2006", "Text": "This was the 20th century's greatest story-book on us,the citizens of the planet Earth.I first read this in grade school and was spellbound, by Sagan's magickal review of the human race and the universe.No other book equalled it's eloquence,expressing to all readers,the need to save our species ,the planet and all her creatures. -(Reader Beware!)-One thing that is largely left out is ,Realpolitik.Sagan was an \"ivory tower scientist\" and also an \"arm-chair atheist\".Political Reality and Spirituality,can not be removed from our human society and our human pysche. Yet,by writing this momentous book,he remains a \"true literary emissary for positive social change\". It would't hurt the masses of readers,by continuing to explore this book,now into the 21 century .", "Helpfulness": 0.4, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3B6JWWBJKDPSS"}}, {"Date": "on July 31, 2014", "Text": "Not better because is paperback, and not hardcover!!", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Z6PZS0JSPJSF"}}, {"Date": "on July 17, 2014", "Text": "Well-structured.  Definitely a recommend.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SKUXD0W1OWQC"}}, {"Date": "on April 1, 2015", "Text": "GLAD TO HAVE IT BACK IN MY COLLECTION", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MAKGIC50RZ0B"}}, {"Date": "on April 17, 2015", "Text": "a must read for every human being!!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2O4O23AK2R65D"}}, {"Date": "on December 22, 2014", "Text": "Another good book by Carl Sagan.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UUW8TDBG41O2"}}, {"Date": "on March 26, 2015", "Text": "It is a classic", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZVJRUTYN5BY5"}}, {"Date": "on October 15, 2014", "Text": "there are no images in the kindle edition", "Helpfulness": 0.5, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BYFINI8N56YC"}}, {"Date": "on March 30, 2015", "Text": "as advertised", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KUZNHWXCQU2V"}}, {"Date": "on June 27, 2002", "Text": null, "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VJC08QJSWV9F"}}, {"Date": "on January 3, 2015", "Text": "A classic", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1M5PBPF5SB34T"}}, {"Date": "on March 27, 2015", "Text": "loved it", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QZ3U2N3OEJL1"}}, {"Date": "on January 4, 2015", "Text": "great !", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A69JVFCH22PB0"}}, {"Date": "on April 11, 2012", "Text": null, "Helpfulness": 0.5636363636363636, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16RPX3J2VMQMY"}}, {"Date": "on March 20, 2014", "Text": "Possibly the best introduction to the world around the science that explains it. Perhaps a little outdated, but this book lives on as one of my favorite books I've ever read.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KIC7FG09Y4T"}}, {"Date": "on December 29, 2012", "Text": "I bought this book for grandfather for Christmas this year.  Carl Sagan is one of his favorite authors.  He enjoys the book very much.  However, the binding of the book is too tight.  It makes reading the pages on the left hard.  We both agree that it's better to look at the books in a store rather than ordering them online.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DN4QZBQU3XQ8"}}, {"Date": "on December 8, 2003", "Text": "Like the Holy Bible, Cosmos is epic work. Cosmos takes the reader from the dawn of Human creation to the twighlight of our future. Carl Sagan is the master at tranfering his passions to the reader.  Not only did I gain and appreciation of the world around me but I gained a new perspective on man's place in the Universe.", "Helpfulness": 0.2857142857142857, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A300COXFUDOQ92"}}, {"Date": "on January 7, 2013", "Text": "I havent finished reading it yet but im pleased so far so i will have to update at a later time", "Helpfulness": 0.2, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ISJO6VSWKVQY"}}, {"Date": "on April 24, 1997", "Text": "This book helped to strengthen my faith in the power and glory of the Almighty. It's terrifically written by the late Carl Sagan. I've never owned a book such as this that has brought me closer to God and Jesus Christ. Amen", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on October 19, 2004", "Text": null, "Helpfulness": 0.125, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JU2YK0BOE7E8"}}, {"Date": "on July 21, 2013", "Text": null, "Helpfulness": 0.25, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31SVCG8CJWNO6"}}, {"Date": "on November 7, 2004", "Text": null, "Helpfulness": 0.26666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHD101501WCN1"}}, {"Date": "on January 28, 2014", "Text": "I only gave this issue 3 stars as in my opinion, approximately 3/5 was factual while the balance was conjecture and opinion. I read to be informed primarily, not to be entertained.", "Helpfulness": 0.18181818181818182, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2K9TD9JWUAFA0"}}, {"Date": "on February 10, 2007", "Text": "Sagan mixes a little fantasy in with some good science. He has an interesting style that makes for a good read.", "Helpfulness": 0.1111111111111111, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GRADH8KWUQQQ"}}, {"Date": "on July 12, 2006", "Text": null, "Helpfulness": 0.41025641025641024, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2D9IEFJGB483Q"}}, {"Date": "on September 20, 2014", "Text": null, "Helpfulness": 0.09090909090909091, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WHDROMAJZUIY"}}, {"Date": "on August 10, 2014", "Text": null, "Helpfulness": 0.13333333333333333, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZYIFQAU5CSJE"}}, {"Date": "on January 5, 2015", "Text": "This was never sent to me.", "Helpfulness": 0.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1P9ZJ0NHRYQYO"}}, {"Date": "on July 18, 1999", "Text": null, "Helpfulness": 0.24324324324324326, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6QZDCUOIR6Q2"}}, {"Date": "on August 16, 2011", "Text": "I am sure the content is great but the font used is so small that I will have a hard time reading the pages", "Helpfulness": 0.05263157894736842, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36YU8FX2976W4"}}, {"Date": "on March 20, 2006", "Text": null, "Helpfulness": 0.1702127659574468, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3A5G15FQO0F8H"}}, {"Date": "on July 3, 2002", "Text": "Sagan is a magnificent thinker with a closed mind.  His first sentence is \"The Cosmos is all that is or ever was or ever will be.\"  That efficiently snuffs out God or any Chorographer behind the cosmic dance he admires so much and describes so well.  \"One day, quite by accident, a molecule arose that was able to make crude copies of itself.\"  That was one bloody clever molecule!  With no brain, to \"discover\" such a power?  See AMERICA, Feb 7, 1981, \"Carl Sagan's Gospel of Scientism.\"", "Helpfulness": 0.14634146341463414, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31S31KEXDP3TD"}}, {"Date": "on January 17, 2013", "Text": null, "Helpfulness": 0.07142857142857142, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AS13HHH6807AC"}}, {"Date": "on August 24, 2014", "Text": "This book came up in  the children's section.  It will be five or more years before she's ready to read this.", "Helpfulness": 0.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EAUHZUDGT1E9"}}, {"Date": "on March 6, 2013", "Text": "I Paid new price for this book as I wanted a good copy but I got a water damaged book with library marks on it.  Thanks :(", "Helpfulness": 0.044444444444444446, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XW4QWHPVALQ6"}}, {"Date": "on January 4, 1999", "Text": "Carl Sagan, I believe wrote this book more out to be an essay of what he believes. That sometimes can be a little over-the-top. Usually a long essay will not put out the message fully. The ending of this book didn't truly  fulfill what I wanted to read. The book does have some good points about  the cosmos but it perhaps put too much emphasis where the book should not  have went by doing too much info on the scientists of the cosmo. The truth  is, this science book didn't fulfill what I expected of it. And thats all I  have to say about this book.", "Helpfulness": 0.07142857142857142, "StarRating": "2", "Author": {"ProfileUrl": ""}}, {"Date": "on February 21, 2013", "Text": "Maybe in the 70s there was something interesting that one could get from this book but in 2010s its just pure boredom.Especially going through the ending is very painful.", "Helpfulness": 0.029850746268656716, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2877GKB8T3L1Y"}}, {"Date": "on November 27, 2010", "Text": null, "Helpfulness": 0.09420289855072464, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4TVX5141Y2TG"}}, {"Date": "on February 4, 2003", "Text": null, "Helpfulness": 0.10069444444444445, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADLAMNQQV7TLC"}}, {"Date": "on August 31, 2012", "Text": "This is a very elementary work with phoney designs and pictures that are unrealistic. No one should waste his time on such books.", "Helpfulness": 0.04504504504504504, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJ29DZVTISJ85"}}], "ReviewUrl": "http://www.amazon.com/Cosmos-Carl-Sagan/product-reviews/0345539435/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.7 out of 5 stars"}, "OfferPrice": "$12.79", "Salesrank": "#2,312", "ListPrice": "$15.00"}