{"Category": "in Books (", "Name": ["Theory of Relativity (Dover Books on Physics)"], "Timestamp": "2015-05-24 21:20:22.756480", "itemurl": "http://www.amazon.com/Theory-Relativity-Dover-Books-Physics/dp/048664152X", "Reviews": {"TotalReviewCount": "11", "ReviewList": [{"Date": "on July 25, 1998", "Text": "This is a great classic, still the best reference for historical matters and conceptual questions on special relativity. As for General Relativity it is good but dated. The astonishing thing is that it was written by Wolfgang Pauli when he was nineteen, in 1921, that is 6 years after the publication of the great Einstein paper Foundations of General Relativity. In the fifties a translation into English appeared, together with many comments by the author. The book is a joy to read, if you already had a good introduction to the subject. Otherwise, it is too \"adult\", as Pauli wrote it with his colleagues in mind, not students. I use to consult it when some conceptual problem is the matter. There is, then, no better place. However, as a text, you have now better ones. The mathematical chapters, in particular, became difficult reading, as differential geometry followed different ways from those predicted by the author.", "Helpfulness": 0.9714285714285714, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on July 1, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7GUWBYV3579X"}}, {"Date": "on April 4, 2000", "Text": "This book was intended as a review of the emerging early scientific papers on special and  general relativity. This book is not only listing these extremely usefull references, but is also  giving a broad historical  perspective. The theory, presented in a mathematical way, is somewhat  obscured by the lack of any diagrams. You need  some background in order to  fully appreciate this book.", "Helpfulness": 0.8125, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I51DCQK8GAOP"}}, {"Date": "on January 21, 2014", "Text": "I mistakenly bought this book as a Kindle version.  This means that the equations are \"pasted\" onto the text; IOW, you can't enlarge them.  This makes the text and equations seem out of balance, and means some equations are very hard to read.  It's ridiculous that Amazon thinks this is acceptable.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A236OJSJTMSZE"}}, {"Date": "on February 14, 2001", "Text": "I have to correct the review below (which I wrote myself!): Pauli was 22 when he ended his text. I just learned it. I also learned that Einstein was in awe at the excellence of the lad's review of his theory!  Read attentively his exposition of Weyl's theory. A few years later Pauli anticipated Yang and Mills in inventing non-abelian gauge theories, a reformulation, in a different context, of Weyl's. He didn't publish a single line, but, when Yang presented his theory in a semminar at Princeton, before Pauli and Einstein, he (Pauli) demonstrated a surprising familiarity with the idea. Perhaps you can find some evidence of it in the notes Pauli added to the second edition. After all, this is one of the greatest pleasures of reading classics!", "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D7XC7USJ9X7J"}}, {"Date": "on August 3, 2001", "Text": "Today we think of this text as \"dated\", but it has become a book that I go back to to find important equations and their explanations. The book by the author of the Pauli group has very little group theory, but the mathematics is \"Solid\". This one is cheap and worth having!", "Helpfulness": 0.75, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A126KX6FVI4T66"}}, {"Date": "on December 29, 2014", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27A1N1BD7UUSJ"}}, {"Date": "on January 18, 2002", "Text": "This is a pretty doggone good book!  The last chapter, especially the last two pages of the text, provides an excellent synopsis of the long standing problem on the structure of matter. It seems that what is left to be done involves the invention or creation of a different mathematical source which is capable of generating a symmetric tensor of rank two that  will successfully displace the singularity thru the proper incorporation of the energy tensor, Tuv.  This would most certainly shed a new light on the generation of mass and the inherent formation of matter: Form defines Function, Function generates Form.  You Betcha!!!", "Helpfulness": 0.6363636363636364, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3A16PCKSJJY06"}}, {"Date": "on February 6, 2015", "Text": "It is very nice", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AA9XS0MKZPUST"}}, {"Date": "on June 1, 1999", "Text": "To the publisher I would appreciate it if the publisher could produce an audio adaptation of this book. I would love to listen to this while I drive to work and to let my 16 month old son listen to it as a bedtime story.  Arnold D Veness", "Helpfulness": 0.1388888888888889, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CDB11A78ROO8"}}, {"Date": "on June 21, 2009", "Text": null, "Helpfulness": 0.0273972602739726, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARU2H2PYTNCAX"}}], "ReviewUrl": "http://www.amazon.com/Theory-Relativity-Dover-Books-Physics/product-reviews/048664152X/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.3 out of 5 stars"}, "OfferPrice": "$14.20", "Salesrank": "#211,399", "ListPrice": "$14.95"}