{"Category": "in Books (", "Name": ["Mathematics: The New Golden Age"], "Timestamp": "2015-05-24 21:26:34.715544", "itemurl": "http://www.amazon.com/Mathematics-New-Golden-Keith-Devlin/dp/023111639X", "Reviews": {"TotalReviewCount": "6", "ReviewList": [{"Date": "on September 20, 2000", "Text": "This is the best popular math book I've ever read.  The first edition of this book was responsible for rekindling my interest in pure mathematics after a long layoff (which has persisted to this day).  The author covers some topics that are typically covered in popular math books (such as chaos theory and the difficulty of factoring large prime numbers).  Fortunately, most of the book is devoted to topics that are rarely dealt with in such books, such as the classification of finite simple groups, the class number problem, and the Riemann hypothesis.  The new edition also contains an expanded section on Fermat's last theorem (which has been proved since the first edition came out).  What I like about Devlin's style is that he goes into the  math to a much more significant extent than most popular science writers and yet still keeps everything easy to understand for anyone with (say) an understanding of basic calculus. The only (minor) criticism I have of the book is that Devlin often gets tantalizingly close to a major result and then begs off with the statement \"the full result can only be understood by specialists\".  Most of the time, this makes little difference, but with the class number problem (which, among other things, explains why exp(sqrt(163)*Pi) is almost an integer), he leads you along a fascinating journey and then doesn't explain the original motivating problem (why exp(sqrt(163)*Pi) is almost an integer).  However, this is a minor nit and doesn't significantly detract from a fascinating book.", "Helpfulness": 0.95, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANE9K04P84B6V"}}, {"Date": "on February 12, 2001", "Text": null, "Helpfulness": 0.9629629629629629, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1S3C5OFU508P3"}}, {"Date": "on March 3, 2000", "Text": "From the length of the British coast to the feedback process between order and chaos, Keith Devlin's Mathematics provides a surprisingly non-technical tour of new developments in the field of math since 1960, revising a  classic to encompass new theories of the 1980s and 1990s.  Mathematician/author Devlin claims we are in a 'new golden age' of math  advancements: this links math achievements to new science findings as a  whole.", "Helpfulness": 0.8695652173913043, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14OJS0VWMOSWO"}}, {"Date": "on February 9, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARKL8PLBDB4T5"}}, {"Date": "on June 18, 2002", "Text": "This book is a comprehensive in-detail overview of a wide rage of mathematical subjects, from Fermat's Last Theorem to topology. If you are considering a mathematical career, this book is a great buy.", "Helpfulness": 0.5833333333333334, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11ZOI7FR2X2Q2"}}, {"Date": "on May 15, 2009", "Text": null, "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJFKY9Y5W9VXG"}}], "ReviewUrl": "http://www.amazon.com/Mathematics-New-Golden-Keith-Devlin/product-reviews/023111639X/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "5.0 out of 5 stars"}, "OfferPrice": "$20.90", "Salesrank": "#849,617", "ListPrice": "$27.95"}