{"Category": "in Books (", "Name": ["How Apollo Flew to the Moon (Springer Praxis Books / Space Exploration)"], "Timestamp": "2015-05-24 23:28:44.429829", "itemurl": "http://www.amazon.com/Apollo-Springer-Praxis-Books-Exploration/dp/0387716750", "Reviews": {"TotalReviewCount": "45", "ReviewList": [{"Date": "on January 19, 2008", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3K6OT6XDN64NK"}}, {"Date": "on July 6, 2008", "Text": null, "Helpfulness": 0.9130434782608695, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6OW2JNG44AWN"}}, {"Date": "on February 11, 2008", "Text": null, "Helpfulness": 0.8846153846153846, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1S0OF3SKQ5JCH"}}, {"Date": "on March 16, 2009", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29REXHV4SHVZH"}}, {"Date": "on July 25, 2008", "Text": "I have over 200 books on the early space program and the race to the moon but this book is by far the best and most detailed I have ever read on just how it was done. I couldn't put it down. If you ever wanted to know, for example, what every abort mode meant during launch or why and how the crew made certain burns during the flight, get this book! It takes the reader from liftoff through splashdown explaining in fantastic detail every step of these wonderful voyages. This book is not a techno-geek's only book. It explains to the common man in the street everything from transfer orbits to gimbal lock. Get this book! I guarentee, even if you thought you knew a lot about it, you'll be amazed at what it took to fly to the moon.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVCANJXG2Z8WF"}}, {"Date": "on November 10, 2009", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A111BJ087TFVWX"}}, {"Date": "on June 28, 2008", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABQARDSU134CY"}}, {"Date": "on September 21, 2008", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Q73U6OUDCCNN"}}, {"Date": "on November 3, 2009", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28UGKMX7GBQIM"}}, {"Date": "on May 21, 2010", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VKMUJG8DBODG"}}, {"Date": "on March 26, 2008", "Text": "This is a wonderful book! As an aviation Journalist I write about these topics myself - but David Woods helped me a lot with filling the gaps in my knowledge about Apollo. Of all the (about 50) books I have about the Lunar Landings, this is among the best four! (The other two are \"Last Man on the Moon by Gene Cernan\", Scott Sullivan's two books \"Virtual LM\" and \"Virtual Apollo\" and \"Stages to Saturn\". Many of the other books really only copy the official historical documents - but David Woods explains the stuff nobody else bothered to explain. Best example: the trajectories of Apollo took to the Moon. This is the book that explains the physics in a way a non-rocket scientist will understand it intuitively!", "Helpfulness": 0.8571428571428571, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A294CFD2J9BCYB"}}, {"Date": "on December 31, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DLQ64TCES0P8"}}, {"Date": "on March 3, 2011", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NMW51418AO9M"}}, {"Date": "on March 7, 2010", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACYHINPAXGMG2"}}, {"Date": "on June 27, 2009", "Text": "I have read many books on the Apollo program but I have never read a more informative book as this one.I actually like to know what a PC+2 burn is,how to circularise orbits,how and when the spacecraft was captured into Lunar orbit,the Lunar module starting P63 to start its descent to the moon,doing a TEI burn to return to Earth,this book has it all covered,very detailed and massively informative if you like to know the technical details how Apollo flew to the moon and returned.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KEOBW4DZBSGF"}}, {"Date": "on March 29, 2008", "Text": "I think this is a great book. I'm an Engineer and am therefore quite interested in the technical aspects of the Apollo program. I found this book covered enough of the technical aspects to satisfy my curiosity, but not too much to bore me with details. It is very well written and an easy read. I'd recommend it for anyone who is interested in descriptions of the hardware as well as how and why the missions were run in the way that they were.", "Helpfulness": 0.8, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SII401H01Q7T"}}, {"Date": "on February 4, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QT0DMEPC3MN8"}}, {"Date": "on February 12, 2012", "Text": "This was the best book I've ever read on the subject and one of the most enjoyable overall on any subject. It was so good in fact that as soon as I was done I read it again! I've only done this one other time in my 44 years. There is a ton of info, so much that I couldn't absorb it all in one reading. There are so many neat things that my wife made me promise I could only tell her one cool thing about Apollo per day! I learned alot and love the book. The only bad thing is now when I watch documentaries on the Apollo program I notice mistakes and/or incomplete explanations. At least I get to be smug about it. Thank you Mr. Woods. Note I do have some college-level science background. Some of it may be too technical for the average reader.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWJVZ5Y42N7KJ"}}, {"Date": "on April 20, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AT7RF5R12TUBI"}}, {"Date": "on March 23, 2015", "Text": "Like any good space geek, I have a LOT of books on the Apollo program, and this is one of the best. There are plenty of good books on the political history of Apollo and on the men and the missions, but not enough on the technical details, at least for those of us who are fascinated by such details. Even though I've got a shelf of books on the US space program I still learned a lot that was completely new to me reading thus book. For instance, I didn't know that the S-1 booster had its own independent guidance system, or that the LM contained two guidance computers- the standard APC (Apollo Guidence Computer)  that was a duplicate of the AGC in the CM, plus the AGS- the Abort Guidance system, a smaller, simpler machine that could take over in case of a failure of the AGC. Did you know that in addition to its rewriteable magnetic core memory, the AGC relied on rope core memory for its nonvolatile read only memory (ROM)? I spent 30 years in the computer industry, and had 40 hours of computer classes in my undergrad years in the 70s, and I'd never even heard of rope core memory! If this sort of detail is the kind of thing that fires up your interest, this is a book that belongs on your bookshelf.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RPTVW5VEOSI"}}, {"Date": "on March 31, 2011", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1H44YI5MS0H4V"}}, {"Date": "on February 13, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JT064A2ZUTUF"}}, {"Date": "on February 1, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38VDO8889VHWU"}}, {"Date": "on October 1, 2012", "Text": "11 years old at the time Apollo 11 landed on the moon. This book explains in detail all the terminology that went over my head back in the day. How many times did I hear \"Ignition sequence start\" only to discover now that the F1 engines were so powerful thet needed to be started one at a time to avoid destroying the booster. This is just one example of the level of detail in this this extraordinary book. Thank you! Great Job!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IS2CAOVK8OM2"}}, {"Date": "on May 7, 2014", "Text": "I'm a bit of an Apollo fanatic and have read most of the books worth reading on the subject, but in my opinion this is the best one ever written.  It explains clearly and in detail everything about the flight itself - how the orbital mechics were worked out and why it was done the way it was.  How the navigation systems were decided upon etc.  I would also recommend 'Digital Aollo' but this one is the tops.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXRKGIQALDM07"}}, {"Date": "on March 5, 2011", "Text": "amazing recap and review of our first wobbles and leaps into space.  Author takes great care to explain what is pretty complicated into terms a space buff or fan of history can digest and retain.  Nice blend of science and technology backed by some unusual facts and concepts makes for a wonderful synopsis of the big picture of how we pulled it off.  Thanks", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KH7NVKQLIBM"}}, {"Date": "on November 5, 2014", "Text": "Fantastic read! I relived Apollo and I appreciate more through this work. Highly recommended to anyone who remembered these missions, and is a must for those techies who weren't born yet. The feat of accomplishing this mission, in terms of the technology is a testament to the genius of man, and the combined efforts of thousands of these geniuses.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A74AILA59RZFL"}}, {"Date": "on January 9, 2014", "Text": "If you are absolutely new to Apollo science, as I was, this book will introduce you to the magic of Apollo flight as well as give you the brief insight on orbital flight and subsystems etc etc. However, people with some aeronautical knowledge will find the book easier to read and more interesting.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JF6PA46EGZGP"}}, {"Date": "on February 16, 2010", "Text": "Answered every question I ever had about the Apollo programme and many interesting issues that had never occurred to me. Download to your Kindle, sit under the LM at the Saturn V center at Canaveral - then read. Wonderful stuff.", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARPKVF7YU7Z1H"}}, {"Date": "on August 26, 2009", "Text": null, "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IRVUQP2ZCII9"}}, {"Date": "on March 20, 2012", "Text": "I agree with the other reviewers. In addition was amazed at the precision in guidance and navigation although I felt that this subject got over done by times. Was happy to see the progress bar climb so slowley as I read myself crosseyed. PBM Athlone.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FWAB6324ZQVI"}}, {"Date": "on February 12, 2013", "Text": "An absorbing read. Technical details of the program clearly explained and illustrated, insights into the challenges, tensions, and courage of all involved in one of mankind's greatest adventure.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABNT8KF6ZPDO8"}}, {"Date": "on May 18, 2010", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HOM6YLH4BCWU"}}, {"Date": "on July 19, 2010", "Text": "A fantastic book for the layman and enthusiast alike. Covers all aspects of the lunar mission in a brilliant level of detail. A must have for anyone interested in Apollo history.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WOT1Y1LC1IDG"}}, {"Date": "on July 26, 2011", "Text": null, "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OPBCF28QTARX"}}, {"Date": "on April 5, 2008", "Text": "How was the pyramids built? Humanity tends to easily forget how great achievements are made, at least close to their actually performance. However, over time the question \"how\" is often subject to more debate and interest than the question \"why\" and \"who\". This book really fills the gap and explains in great detail the different technical aspects of Apollo's fligths to the moon. It's also written in such way that you really don't have to be a nobel prize winner to understand it or appreciate it. If you haven't read any books on this subject before, I strongly recommend you to begin with this!", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30ERGYUFL3ERK"}}, {"Date": "on October 1, 2009", "Text": "This is the first review that I have ever taken the time to write. I'm not going to write a very \"technical\" review, but I felt compelled to compliment the author on an extremely well done job. This is one of my very favorite, and probably THE favorite, book that I have ever read on the Apollo program. It is a must read for any true Apollo fan. Thank you Mr. Woods for making your very interesting book available to us all!", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZOT87JVE027B"}}, {"Date": "on October 14, 2009", "Text": "This book answered many of my questions about the process many of us took for granted, at the time. It probably answers questions from many who were paying attention, as well. Fascinating answers from those who were there, and those who helped get them there.", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Y3OU38193QYT"}}, {"Date": "on March 11, 2010", "Text": "An engrossing read. The depth of technical detail is astonishing but far from being a dry tome, the excerpts of astronauts' banter with mission control make it a human story of adventure & daring.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJ04KLMQND58B"}}, {"Date": "on March 24, 2009", "Text": "This book is absolutely incredible! If you are a lazy space enthusiast, this book will transform you into a bona fide space loon.  The technical details of the Apollo program are fascinating.  You will learn, and you will be amazed!", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGMVM9S13PHWQ"}}, {"Date": "on March 26, 2009", "Text": "I have read a lot of the apollo history books out there. This book is about the technology how things worked, why things were done the way they were. I definitely recommend it. My first kindle book.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QMMP7BI2AAAA"}}, {"Date": "on June 11, 2008", "Text": "Very informative book on the mechanics of getting to the moon in the 1960s; also,contains some very good photos.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATOWPP4LJRQOQ"}}, {"Date": "on March 22, 2010", "Text": "As an Apollo researcher,  I have to say, this is the best non-professional book on Apollo operations.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BI7HNY224GN5"}}, {"Date": "on February 9, 2008", "Text": "This is an outstanding work and a great compliment to the Apollo Lunar Surface Journal.  I received it today and didn't put it down till I scanned the whole thing.  I can't wait to give it a detailed read.  It explains how the whole project was possible and should answer any 'naysayers' with scientific explanations of the successes and the problems that had to be dealt with.", "Helpfulness": 0.16666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2R8CHEMGSVOKD"}}, {"Date": "on November 24, 2012", "Text": "Sorry, but I'm not going to buy or read this book. It has to be a book of Fiction because man did not go to or walk on the moon, thank you very much,", "Helpfulness": 0.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JLP11D3RI8BN"}}], "ReviewUrl": "http://www.amazon.com/Apollo-Springer-Praxis-Books-Exploration/product-reviews/0387716750/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.9 out of 5 stars"}, "OfferPrice": "", "Salesrank": "#1,266,299", "ListPrice": ""}