{"Category": "in Books (", "Name": ["The Book Nobody Read: Chasing the Revolutions of Nicolaus Copernicus"], "Timestamp": "2015-05-24 21:27:14.486426", "itemurl": "http://www.amazon.com/Book-Nobody-Read-Revolutions-Copernicus/dp/0143034766", "Reviews": {"TotalReviewCount": "43", "ReviewList": [{"Date": "on March 16, 2004", "Text": "The story of Copernicus and his description of the heliocentric universe forms the background of this fascinating book. The scientific revolution began with Copernicus. Owen Gingerich is an astrophysicist and historian of science who began his whimsical quest in 1970 as part of the preparation for the 500th anniversary of Copernicus birth in 1973. International scholarly celebrations were planned and Gingerich was on the committee to prepare them. The question arose whether many owners of the book had actually read all the way through this massive and rather tedious tome. Gingerich happened to be visiting Scotland at the time and decided to look at a copy of \"De revolutionibus,\" known to be in the Royal Observatory in Edinburgh. To his surprise, the copy was heavily annotated all the way through. It had been very carefully read by someone. The reader had even corrected a number of errors in the text. Gingerich searched for evidence of the reader's name. Finally, he discovered the initials ER stamped on the cover. With a shock, he realized that these might be the initials of Erasmus Reinhold, the leading mathematical astronomer of the generation after Copernicus. Gingerich eventually found samples of Reinhold's writing and confirmed his hypothesis. For the next 30 years, he searched for other copies of the great work and recorded the annotations placed in the margins by owners during the Renaissance. He became an expert on Copernicus and the sociology of science in the 15th and following centuries. He also became an expert on paper-making, printing and binding. This resulted in several detective stories as book thieves and forgers were uncovered and prosecuted. I found the details of the book-making science nearly as interesting as the main story and have ordered books on early printing and paper making. This is a book for those interested in history and in astronomy. Occasionally the details get to be slow going but these spots are few and the story moves along well. If you are interested in the history of the Renaissance, this will fill in places missing in most political histories. It is excellent writing and excellent history.", "Helpfulness": 0.9857142857142858, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CVM427QH52BL"}}, {"Date": "on February 15, 2004", "Text": null, "Helpfulness": 0.975609756097561, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on December 17, 2006", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PM7CTXMNLMBC"}}, {"Date": "on June 23, 2004", "Text": "In the year of my birth, Arthur Koestler threw down a gauntlet when he labeled Nicolaus Copernicus' De revolutionibus [arguably the greatest science book of the last few thousand years] \"the book nobody read.\"  Owen Gingerich, astronomer and bibliophile, picked up that gauntlet and did battle with Koestler in the way a scientist must do battle - find empirical evidence that the book had been read.  The Book Nobody Read is Gingerich's popular account of his decades long effort to track down every extant copy of the first and second edition of De revolutionibus to look for evidence of use [mainly using the marginalia left by the readers/owners].  The book flap blurb nails the book when it calls The Book Nobody Read \"part biography of a book, part scientific exploration, [and] part bibliographic detective story.\"  The blurb writer could have tossed in adventure story, too.  I enjoyed the book immensely, especially the excellent way in which The Book Nobody Read illustrates the use of the scientific [empirical] method for what many folks would perceive as a non-traditional use.  As a bibliophile and science teacher, I'm probably a member of the perfect audience for this book.  I include the previous statement as a caution, because at least one of the reviewers seems to have misjudged what the book was about.  If you are interested in traditional biography and want a book on Nicolaus Copernicus, The Book Nobody Read may disappoint.  If you like books on books and have an interest in history [especially the history of science], I think you'd rate this book a classic.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KKXV0HG92CJ8"}}, {"Date": "on September 1, 2008", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PM7CTXMNLMBC"}}, {"Date": "on August 25, 2004", "Text": "I am neither a scientist nor a bibliophile, so I warily picked up this book.  It was fascinating!  Chapter 1 begins, literally, with a federal case, and then the hunt begins.  Over the course of years, what began simply as a case of curiosity, has led Owen Gingerich to become one of the foremost authorities on De Revolutionibus by Copernicus - on the actual physical first and second editions that is.  Although as an astronomer, I'm sure he is quite familiar with the science contained therein.  I am amazed by the strokes of luck that seemed to befall him in his pursuit - almost to the point of it being his destiny.  The breadth of knowledge he had to acquire: Latin, Renaissance history, graphology (maybe even cryptography), the history and technique of printing, and oft-needed diplomacy is quite amazing.  Throughout the entire book, I was able to understand and enjoy every aspect.  There is no doubt in my mind that Gingerich loved doing his census.  (Kudos to his wife for letting him.)  My reward was discovering in Appendix 2 that there are 2 editions within 5 miles of my home.  If you enjoy mystery books and if you like learning how history interlinks DON'T BE AFRAID to read this book.  It is an enriching experience.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YMYL7VLM60PP"}}, {"Date": "on June 9, 2005", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AITIU2DG1MM4A"}}, {"Date": "on September 1, 2008", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PM7CTXMNLMBC"}}, {"Date": "on September 1, 2008", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PM7CTXMNLMBC"}}, {"Date": "on May 9, 2005", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1A4BSZBZ5HUZI"}}, {"Date": "on November 9, 2005", "Text": "For over a quarter century, astrophysicist and historian Owen Gingerich tracked down nearly every existing copy of the first and second editions of Nicolaus Copernicus's book \"On the Revolutions of the Heavenly Spheres,\" the first book to seriously propose a heliocentric cosmos. Gingerich published his scholarly results in a 2002 annotated census. The present book is a memoir of his search for Copernican editions, during which he was seriously bitten by the book-collecting bug. Gingerich takes his readers from the Scottish lowlands to behind the Iron Curtain, from the ethereal light of Yale's Beinecke Library to the National Library of China (which has Copernican editions brought to China by Jesuit missionaries). His cast of characters include scholars both helpful and competitive, suspicious librarians, cagey rare book dealers, FBI agents, and book thieves--the first edition of Copernicus's book has sold at auction for half a million dollars. Readers will learn about the history of printing, the rare book trade, the social organization of Renaissance science--and about Copernicus himself, the elusive figure who dared to place the sun, not the earth, in the center of the heavens. (Those who read this book and want to know more about the technical aspects of Copernicus's innovation can consult Thomas Kuhn's \"The Copernican Revolution.\")", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2F4LMH8TSXZ5P"}}, {"Date": "on August 28, 2006", "Text": "A wonderful voyage in search of copies of first and second editions of Copernicus and the revolutions. Mysteries revealed through the tenacious searching for these volumes by Dr.Gingerich. Style is easy to read and maintains ones interest though to the end by the use of comic relief.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KB7CH97W109P"}}, {"Date": "on February 5, 2005", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QT3Y8KXDR1K"}}, {"Date": "on September 19, 2006", "Text": "This book is rather different. Although it's about Copernicus' book \"De Revolutionibus\", very little astronomy is discussed. There is also very little about Copernicus himself. The main theme of the book is finding as many still-existing copies of Copernicus' book as possible, and describing each one in detail - the ultimate purpose being the publication of a so-called \"census\" of that ancient book, i.e., a snapshot in time that identifies and describes each individual copy and where it is located in the world. Since I know nothing about antique book collecting, I learned a lot on this field by reading this book. I was not aware of all the work and travel required in finding a given copy of a book, especially identifying the authors of any hand-written notes on its pages. I did find certain lengthy descriptions rather monotonous, but some of the author's adventures are quite intriguing, particularly where he makes use of his notes to identify possibly stolen copies that eventually surface at auctions or elsewhere. Some aspects of life and technology in the sixteenth century that are important for the theme of this book, as well as discussions of some of Copernicus' contemporaries, are touched upon. But as the author states, this book is really a memoir of his census project. I think that this book would be of most interest to those with a passion for ancient books and ancient book collecting.", "Helpfulness": 0.9166666666666666, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VX6A9UZBLEPI"}}, {"Date": "on November 13, 2004", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UORGGRUE5Z52"}}, {"Date": "on May 18, 2007", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DYMH30TSRONY"}}, {"Date": "on September 1, 2008", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PM7CTXMNLMBC"}}, {"Date": "on May 2, 2005", "Text": "Owen Gingerich spent 30 years compiling a worldwide census of all known surviving copies of the Copernicus magnum opus \"De Revolutionibus,\" the first non-geocentric theory of the cosmos from the 16th century. Gingerich's travels around the world while tracking down and investigating copies of the valuable book - in libraries, observatories, private collections, and auction houses - are the focus of this story. Here we have a detective story that will be of practical value to historians of science and collectors of rare antique books, but non-specialists may have trouble drumming up more than a polite interest. Gingerich's quest has a few interesting episodes, such as gumshoeing behind the Iron Curtain or helping international agents locate stolen copies. But much of this book consists of repetitive tales of Gingerich's great excitement at figuring out very esoteric intellectual details, such as who owned a certain copy of the Copernicus masterpiece through handwriting analysis or mixing and matching pages from different editions. The inspiration for Gingerich's quest (at least as described here) isn't even that intriguing, as he merely wishes to debunk a previous scientific historian who declared that Copernicus' masterpiece was \"the book nobody read.\" Obviously that's wrong, since the book kicked off a revolutionary change in scientific thought, even though Gingerich finds useful proof that it was definitely read by later influential astronomers such as Kepler and Tycho. Gingerich's census of the Copernicus book, and his lifetime of building expert knowledge on the subject, are certainly outstanding academic and historical achievements. But his quest wasn't really dramatic or adventurous enough to keep this particular book from seeming quite esoteric and repetitive. [~doomsdayer520~]", "Helpfulness": 0.875, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2B9Y0WXNSN17U"}}, {"Date": "on June 28, 2004", "Text": null, "Helpfulness": 0.875, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FKGKUCI3DG9U"}}, {"Date": "on April 22, 2005", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IC683USUWHJR"}}, {"Date": "on March 30, 2005", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFCHEPZE3M7NA"}}, {"Date": "on April 4, 2004", "Text": "At his death in 1543 Nicholas Copernicus published De Revolutionibus, arguing that the sun, not the earth, was at the center of the known universe. There were over 600 copies of two editions that began to interest astronomical historian Gingerich who set out to scrutinize each copy in libraries and personal collections around the world, partly out of curiosity and partly to judge how widely the book had been read. The author engages in intriguing detective work, extending the known provenance of each book to include other owners while tracing its impact on scientific thinking in 16th and 17th century Europe. Since many of the copies contained marginal comments and were owned by astronomers, it became apparent from studies of handwriting who the students and who the professors were, giving us an insight about the readership. We learn about the formation of watermarks, types of glue, and how papermaking, printing and binding were accomplished. The author's expertise has been called upon to trace prior ownership of stolen copies offered at auction, and we learn that parts of one copy were sometimes used to round out the contents of another copy. Eight pages of bibliographic notes; good 16-page index; 8-pages of color; two appendices, one of which gives the location of extant copies. Highly recommended for history enthusiasts of astronomy and the Renaissance.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3N8OL00H6OTCM"}}, {"Date": "on September 1, 2008", "Text": null, "Helpfulness": 0.8571428571428571, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PM7CTXMNLMBC"}}, {"Date": "on November 7, 2005", "Text": "I loved this book.  Read the whole thing in about a day.  I couldn't put it down!!", "Helpfulness": 0.875, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D4RC1SW9SXEW"}}, {"Date": "on May 27, 2005", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QQEFV51EMD7E"}}, {"Date": "on November 9, 2004", "Text": "Historian and scientist Owen Gingerich here gathers all extant copies of Nicolaus Copernicus' famous book De Revolutionibus and uses them to tell the story of the 1543 astronomer who didn't see his lifetime work in print until he was on his deathbed. Perhaps his demise was a blessing, for not only did he not live to hear of its impact but his book is only now being recognized as one of the most important scientific works of all time - four and a half centuries later. Gingerich's quest to see all existing copies of its first and second editions began through his observation of a seeming contradiction about the book: his journey involved three decades of investigation and The Book Nobody Read evolves into an exciting travelogue and survey of both science and publishing.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14OJS0VWMOSWO"}}, {"Date": "on February 12, 2010", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FKGKUCI3DG9U"}}, {"Date": "on January 4, 2009", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PQRSBOZPYPQR"}}, {"Date": "on April 12, 2004", "Text": "A respected historian of science, Owen Gingerich provides not only a fascinating introduction into the reception of Copernicus's De Revolutionibus but also a terrific narrative about the production of scholarship.  The end result is both an engaging chapter in the history of science and an amazing foray into the history of reading more generally.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": ""}}, {"Date": "on March 5, 2015", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VF4BV5ONRSL6"}}, {"Date": "on September 1, 2009", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1P0ZB4YAA312R"}}, {"Date": "on July 31, 2009", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WZL974W8U863"}}, {"Date": "on August 25, 2012", "Text": "Most of us have done this: we start with a well defined goal, and somehow we get distracted and we end up doing something different. For insance you start planting roses in your yard and you end up with a mixed border, or you go to the store to buy paint for your front door and you come back with a new mailbox. It is what happened to the author of this book. He started wondering who read the first manuscripts of Copernicus, and he ended up chasing the manuscrips all around the world. It is not the same thing. He could have had a policy of studying the first commentators and seeing how they influenced or copied each other (he does that on occasion). He could have ended up as a data mining specialist, or the finest exegesist. Bibliophilia was not necessary to his goal. But that is what he did, because humans do that: they go astray. It makes a delightful book, even more so because the author never questions if he could have tackled the problem any other way. The book is as convoluted as are the thoughts of the author. I took great pleasure in it, traveling with Gingerich's mind rather than with Copernicus early and rare readers.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A132O2LX94WY9P"}}, {"Date": "on April 4, 2015", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2R0P3CBKMDBIV"}}, {"Date": "on May 30, 2011", "Text": "This book is perfect for history lovers who commute -- it includes great writing, terrific detail, and a \"mystery\" worth exploring from beginning to end.  I enjoyed how the author used deductive reasoning to get to his conclusions and the backstory he explained throughout.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AYSFGUP5VTY3"}}, {"Date": "on June 8, 2005", "Text": null, "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AA2K8CPXDJP96"}}, {"Date": "on January 8, 2015", "Text": "great my daughter loved it", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YSG9TMGNEYPD"}}, {"Date": "on July 8, 2009", "Text": "Of course, Copernicus' book On Revolutions is really the book no one admitted to reading, if your country was Roman Catholic. Gingrich performs a task that seems impossible: track down every surviving copy of Copernicus' great opus. We also get a quick look at the printing and bookbinding business, and the university system of the day. And we discover that astronomy was not even Copernicus' day job that he had a lot of other social and business responsibilities, something that I did not know. We find how it was incumbent upon other astronomers and scholars who read this work, discussed, and expanded it, which championed and smuggled it around, that increased it popularity. It interesting how some modern institutions is not exactly sure how many and where their copies are. A fun journey into what the Renaissance since was all about. And of course, Copernicus not aware of this trouble he caused because he died after the \"galley proofs,\" but before publication.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AO4B8R40OBJHC"}}, {"Date": "on August 13, 2004", "Text": "Much meatier than \"Longitude,\" but in the same vein of scientific storytelling. Would that we all had such intellectual obsessions and the means to pursue them across the decades. Great fun reading for anyone interested in science, books, astrology, Renaissance universities, Poland, etc. etc.", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4HOGDSJZDRR0"}}, {"Date": "on June 2, 2005", "Text": null, "Helpfulness": 0.3333333333333333, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21YECTOLRO8VE"}}, {"Date": "on May 21, 2006", "Text": "I read this book on the advice of a review in the science journal, Nature.  But I must say that it is, at best, a monotonous, plot-free read. There is virtually no history of science here, no gripping detective story or expose, and it is certainly far from engrossing.  There are no personalities involved, little sensitivity to history, and so nothing to grab one's interest.  Except for the first chapter (concerning a law suit over a stolen copy), the rest of the book pretty much consists of a dry, bare-boned littany of the author's survey of extant copies of Copernicus' great treatise, De Revolutionibus.  There are a few entertaining comments about Edward Rosen (another historian of science fascinated with Copernican minutiae )that smack of professional rivalry (or perhaps a generational shift in science history studies?).  The rest of the chapters consist of lifeless prose on boring topics, with an rambling commentary on the then-current Cold War.  The book is tedious because it fails to breathe life into its topic.  But then, how could it? For it is little more than a glorified list of copies.  It took nearly all my gumption (not to mention a looong layover in Chicago O'Hare Airport) to even finish the book.  Stick to the highlights (Chapters 1-3, Plate 1a, and the photo on p. 198 of Galileo's horoscope for Cosmo d'Medici) and you'll have about all there is worth having here.", "Helpfulness": 0.36363636363636365, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QO8UZUVL2Z4E"}}, {"Date": "on January 22, 2009", "Text": "This book consists of a collection of anecdotes rather than a comprehensive view and of the very interesting question: How revolutionary ideas propagate in the scientific community, and through the history. The author managed to track almost all copies of the book, as if this was his main goal, but did not manage to organize the data into a nice or clear picture.", "Helpfulness": 0.18181818181818182, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16M9U1UFW1XGS"}}, {"Date": "on March 27, 2004", "Text": null, "Helpfulness": 0.1111111111111111, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A273J4D78IYN6X"}}], "ReviewUrl": "http://www.amazon.com/Book-Nobody-Read-Revolutions-Copernicus/product-reviews/0143034766/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.4 out of 5 stars"}, "OfferPrice": "", "Salesrank": "#634,356", "ListPrice": ""}