{"Category": "in Books (", "Name": ["Emergence: From Chaos To Order (Helix Books)"], "Timestamp": "2015-05-24 23:16:03.198209", "itemurl": "http://www.amazon.com/Emergence-Chaos-Order-Helix-Books/dp/0738201421", "Reviews": {"TotalReviewCount": "13", "ReviewList": [{"Date": "on May 19, 1999", "Text": null, "Helpfulness": 0.9230769230769231, "StarRating": "2", "Author": {"ProfileUrl": ""}}, {"Date": "on November 21, 1998", "Text": "Having just read Holland's other book \"Hidden Order\", I was psyched to hear that he had written another book on the science of complex adaptive systems.  This book, however, was quite disappointing.  While the  first few chapters were interesting, the second half of the book was a loss  to me.  There seemed to be too many divergent themes upon which he was  trying to comment.  I feel like he ran out of ideas and started just  writing down anything that came to mind.  The last chapter provided a good  summary of the ideas he tried to express concerning emergence, but the book  on the whole left more questions than it answered.  If you really want to  learn something about emergence and related science of complexity, check  out his other book \"Hidden Order\".  It's much better and a bit  easier to understand in my opinion.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BB5TMQTYNVMG"}}, {"Date": "on November 10, 2001", "Text": "Parts of this book were interesting, but overall it was much ado about not much, and what was done was often overdone (I agree with another reviewer on this point). I see that Amazon has coupled this book with Hidden Order. I can't see why. It would be like buying the same book twice. Anyway, so much of this has been warmed over so many times now that it's frankly a bit dry. I'd like to see a book that really breaks new ground in complexity without overusing buzz words or talking down to me, holding my hand through simple things. Here, the topic is more attractive than the content I'm afraid. Anyone really interested in complexity and emergence will need to go into technical details well beyond this book. Others, like me, will likely find the details that are here to be a bit tedious.", "Helpfulness": 0.9180327868852459, "StarRating": "2", "Author": {"ProfileUrl": ""}}, {"Date": "on June 22, 2006", "Text": null, "Helpfulness": 0.8928571428571429, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33OTTVQWU5CW7"}}, {"Date": "on January 20, 2010", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KEKR4J8IQZIR"}}, {"Date": "on April 27, 1998", "Text": null, "Helpfulness": 0.6153846153846154, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PR70XCP996LG"}}, {"Date": "on August 4, 2014", "Text": "I WANT TO SEE THE TABLE CONTENTS OF AMAZON BOOKS!!!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3S141RQQRK89I"}}, {"Date": "on April 11, 2007", "Text": "Expands on Holland's previous book Hidden Order. It presents an interesting method for understanding complexity and emergence. Highly recommended for those attempting to understand complex adaptive systems.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Q7OZ11B4IQWA"}}, {"Date": "on January 8, 1999", "Text": "A good book, giving a nice introduction to the subject.  Gets a little mathematical in places, but the ideas seem to be spot on if you can look beyond the maths.", "Helpfulness": 0.5714285714285714, "StarRating": "4", "Author": {"ProfileUrl": ""}}, {"Date": "on September 16, 2005", "Text": "After 7 years from its publication it still gives a valid and fundamental approach to the concepts  of emergence and its meaning", "Helpfulness": 0.2857142857142857, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AT12H6CGQMBLV"}}, {"Date": "on May 17, 1999", "Text": "This book clearly and concisely states ideas that are fundamental to the whole of scientific endevour. It puts into perspective the debate on thermodynamic chaotic phenomena as in Prigogine and shows where we should  be looking for the arrow of time.", "Helpfulness": 0.375, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on April 4, 2001", "Text": null, "Helpfulness": 0.42857142857142855, "StarRating": "1", "Author": {"ProfileUrl": ""}}, {"Date": "on February 8, 2001", "Text": "It is very important to the universal thinking the unsderstanding about complexity and its cognitive perception by humans. I read Dr. Holland's first book in London at 1993 and that time I follow his steps in order to reach a meaningfull knowledge to our lives and our existence in the universe. The title of the book is very difficult to develop but Dr. Holland has a special skill to clarify and transmmit the ideas breaking down our paradigm about the universe and the world and life complexity.", "Helpfulness": 0.2222222222222222, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33APJBUIKCWBR"}}], "ReviewUrl": "http://www.amazon.com/Emergence-Chaos-Order-Helix-Books/product-reviews/0738201421/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "3.7 out of 5 stars"}, "OfferPrice": "$13.68", "Salesrank": "#628,534", "ListPrice": "$18.00"}