{"Category": "in Books (", "Name": ["Physics of Shock Waves and High-Temperature Hydrodynamic Phenomena (Dover Books on Physics)"], "Timestamp": "2015-05-24 21:24:41.290413", "itemurl": "http://www.amazon.com/Physics-Shock-High-Temperature-Hydrodynamic-Phenomena/dp/0486420027", "Reviews": {"TotalReviewCount": "11", "ReviewList": [{"Date": "on April 18, 2002", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EPOFZZVBHEFJ"}}, {"Date": "on October 8, 2006", "Text": "This majisterial work by the famous Russian physicist/astrophysicist Yakov B. Zeldovich is the first and last book to refer to when studying the hydrodynamics of compressible fluids at high temperatures.  The author's primary goal is to describe (as well as possible in a roughly 1000 page text) the physics, chemistry, and radiation diagnostics (i.e. radiative transfer) of a 20 kt thermonuclear explosion in the atmosphere.  This book will be of use to a wide range of physicists and astrophysicists in other areas of research as well, though.  The book begins with a (brief) discussion of the basics of the physics of shocks (and the hydrodynamics/thermodynamics of supersonic flow in general).  More detailed topics include a detailed discussion of the ionization of the air (i.e. a change of adiabatic index from 7/5 to 5/3), the broad band spectrum of the explosion, and many others.  Any absolute must have for any scientist studying compressible/supersonic flows.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AW8XP45YVIIZ"}}, {"Date": "on October 31, 2009", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3S1SZVK8JWJZX"}}, {"Date": "on November 29, 2011", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30ARBD5K6MQK4"}}, {"Date": "on June 23, 2008", "Text": "This book is a classic.  I have used it for years.  It originally came in two volumes.  Someone borrowed my old Volume I and failed to return it.  I now have both volumes in one convenient package.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11TA8Q8Y37GWX"}}, {"Date": "on October 26, 2009", "Text": "The fields of shock waves and high temperature hydrodynamics have been exhaustively examined in the literature and, while more recent treatments exist, there is still no better introduction than this enduring classic.  The mathematically correct presentation of most of the relevant physics quickly enables applied mathematicians and engineers working in these disciplines to achieve the level of understanding necessary to start producing useful results.  It can be read in its entirety as a solid introduction to more specialised topics or simply serve as an excellent reference.  And the price of this beautifully reprinted volume from Dover is irresistible.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SFTMZMKZ4IT"}}, {"Date": "on August 17, 2014", "Text": "The author is the \"father\" of high temperature, high pressure physics.  While not discussed directly, clearly this book is a data dump of the knowledge in the USSR developed during their nuclear weapons programs..... many of the physicist that developed the Soviet nuclear capabilities were Jewish and this book should be a tribute to their contribution (in particular in light of Stalin's purge of the Jews from all high positions).", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BFSPKYNN8Y9R"}}, {"Date": "on February 25, 2006", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QCVR7W7RAKKA"}}, {"Date": "on October 3, 2014", "Text": "Happy with purchase.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29W2U9TWXDKUX"}}, {"Date": "on July 4, 2002", "Text": "This rare gem presents theory, experiments, and applications in a comprehensive and accessible manner. This is a must-have for theorists and experimentalists: it brings theorists back to earth, and gives experimentalists scientific rigor.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UON1Y1T8XJS1"}}, {"Date": "on May 2, 2002", "Text": "I am happy to see this outstanding text in print once again.  This book is a must have for all who are interested in the subject of radiation-hydrodynamics.", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": ""}}], "ReviewUrl": "http://www.amazon.com/Physics-Shock-High-Temperature-Hydrodynamic-Phenomena/product-reviews/0486420027/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.8 out of 5 stars"}, "OfferPrice": "$32.55", "Salesrank": "#635,769", "ListPrice": "$42.95"}