{"Category": "in Books (", "Name": ["Primer of Quantum Mechanics (Dover Books on Physics)"], "Timestamp": "2015-05-24 23:10:43.144205", "itemurl": "http://www.amazon.com/Primer-Quantum-Mechanics-Dover-Physics/dp/0486428788", "Reviews": {"TotalReviewCount": "12", "ReviewList": [{"Date": "on December 24, 2003", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on December 31, 2002", "Text": "A good and relatively easy introduction to Dirac notation for quantum mechanics. Very suitable for self study--I have worked through all of it, including all the problems. Most of the problems are an integral part of the text, but there are solutions to many and hints for many of the others. Should be suitable also for an undergraduate text in quantum mechanics. As an example of his method, Chester treats EPR in a general and apparently original manner, i.e. he uses neither the formulation in the EPR paper nor Bohm's--in most treatments the latter is most common (and certainly easiest to apply to experimental tests). I found the chapter on indistinguishable particles particularly helpful.  Using simple examples, the author provides a clear introduction to the topic. Somewhat weak in the area of matrix mechanics; using Dirac notation in that section seems forced. There is a number of typographical errors, which are not serious however.", "Helpfulness": 0.9375, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10DUJH25EJ88W"}}, {"Date": "on September 1, 2006", "Text": null, "Helpfulness": 0.8666666666666667, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FE3BVVRS61N8"}}, {"Date": "on November 1, 2008", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2A7HO31Y0B3DW"}}, {"Date": "on January 1, 2011", "Text": null, "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XVT3NJQONXGO"}}, {"Date": "on March 5, 2001", "Text": "The author relates the Dirac notation to the concepts very well. Explanations are also very clear and concise. Conventions for the Dirac notation is also explained very well. I'd say its an excellent self study book too, as long as the reader has sufficient math and physics background.  At this size and weight, its extremely portable and easy to carry around for anytime reading =) Font and size of chracters makes this book easy to read, while not making it look like a nursery rhyme book. Diagrams are very helpful and quite abundant.", "Helpfulness": 0.7, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OKYSWS0PF060"}}, {"Date": "on March 9, 1998", "Text": "This book approaches Quantum Mechanics in a non-standard and refreshing way. It starts with <bra|ket> notation immediately! It builds the subject in a conceptual fashion, and so is an excellent complement to a standard course text, which will develop the topic in a historical progression.", "Helpfulness": 0.7142857142857143, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on August 1, 2000", "Text": "I am now very happy to discover that this book is now again in print! This is a book I would have liked very much if it was available some 14 years ago when I was an undergraduate student. We  should be in a time when old  presentations of the subject were abandoned. The book,in an intelligent  spirit of a primer,  introduces Dirac's notation which, in my opinion, is  the only chance that a non-genius has to really understand some Quantum  Physics. We must remember that Dirac's notation may be some 70 years old,  and that Feynman, himself, wrote his third volume of the  \"Lectures\" some fourty years ago, trying to put the bras and kets  in an introductory approach.", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3K588DIIFBE66"}}, {"Date": "on March 12, 2007", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5FRNDI7PMBSM"}}, {"Date": "on October 10, 2007", "Text": "This book takes you step by step into quantum mechanics concepts.  You might need to buy another book to flesh out the details but this one really helps to get the basic concepts across.", "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A60OH0VVTDVDX"}}, {"Date": "on March 30, 2010", "Text": null, "Helpfulness": 0.3333333333333333, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29SAQV356DDQ4"}}, {"Date": "on January 8, 2009", "Text": null, "Helpfulness": 0.02857142857142857, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FGF758RP88CE"}}], "ReviewUrl": "http://www.amazon.com/Primer-Quantum-Mechanics-Dover-Physics/product-reviews/0486428788/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.2 out of 5 stars"}, "OfferPrice": "$16.66", "Salesrank": "#973,176", "ListPrice": "$19.95"}