{"Category": "in Books (", "Name": ["One Two Three . . . Infinity: Facts and Speculations of Science (Dover Books on Mathematics)"], "Timestamp": "2015-05-24 21:18:53.231681", "itemurl": "http://www.amazon.com/One-Two-Three-Infinity-Speculations/dp/0486256642", "Reviews": {"TotalReviewCount": "73", "ReviewList": [{"Date": "on August 1, 2000", "Text": null, "Helpfulness": 0.9814814814814815, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RTKL9KB8KLID"}}, {"Date": "on March 6, 2000", "Text": null, "Helpfulness": 0.9868421052631579, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RPTVW5VEOSI"}}, {"Date": "on May 28, 2002", "Text": null, "Helpfulness": 0.9811320754716981, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4BW129KS5JAD"}}, {"Date": "on September 21, 1999", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATV330VZ7CH2Q"}}, {"Date": "on April 16, 1998", "Text": "I read this book long long ago (30 years) in a place far far away (in Chenappady, India where I was born and raised).  I was in high school and Prof. Gamow  introduced me to the wonders of science - everything from Fermat's last theorem to the theory of relativity to the stars and galaxies and atoms and electrons. This book influenced my career choices; it taught me to look up and wonder, to sit down and think, and to appreciate the wonders of science and the greatness of the minds of the scientists who explored and invented and dreamed up science and math. I read the book from cover to cover again recently, and I still loved it! Thank you Prof. Gamow.", "Helpfulness": 0.96, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BKRESEAR8O5U"}}, {"Date": "on March 29, 2004", "Text": "This book is brillant in many different ways.  Not only does Gamow explain the mysteries of the universe in a way that is easy to understand, but his book covers more ground that even he realized when he wrote it.  Much of the book, (the sections on extremely large numbers, the drunkard's walk, the law of entropy, etc) is now being studied from a computer science point of view.  I studied much of this material in my computer science classes, only not in an atomic point of view, like Gamow, but in a binary point of view.  The theories and proofs are the same, just the application is slightly different.  I cannot recomend this book highly enough.  It is extremely readable and you don't need a doctorate in physics or math to understand what is being taught.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on January 15, 2000", "Text": "I read the Chinese version of this book in China when I was 15. It gave me so much inspiration and courage for science and this changed my life dramatically. Just a few days ago, Time Magazine chose Eienstein as the  person of the century. This reminded me of my fascination about modern  physics when I was young. It is like rediscovering a gem for finding the  English version of the book here.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AR0NHVK6S1P8X"}}, {"Date": "on March 1, 2003", "Text": "Intellectual treats, whimsy, but deep. Illustrated with lovely drawings by Gamow himself. Much of it can be understood by a child, and other parts might require a little concentration. All of it is great fun. The author Gamow started in nuclear physics, during the Golden Age of Physics, worked with Niels Bohr, then later in the US, on the Manhattan Project during WWII, and after the war, he was professor in Boulder Colorado. The books he wrote are pearls, and they have been equally popular with my parent's generation as with mine. Luckely some have been reprinted! Other Gamow titles: Biography of Physics, Atomic Energy [dedicated to the hope of lasting peace], Physics of the Strapless Evning Gown,...We are lucky that Dover has reprinted some of them. Do more Dover!", "Helpfulness": 0.9444444444444444, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1N2477VRD8OIZ"}}, {"Date": "on November 22, 1999", "Text": "This book was written, thank god, before physics got so esoteric that it started sounding like metaphysics+philosophy, and the only thing that kept it physics was that math was still involved a bit. It clearly explains a  lot of concepts clearly, but its not a baby book either. The book is fun to  read, never boring and wide-ranging. Gamow has written other good books  eplaining elementary relativity and quantum mechanics to the mostly layman,  such as his 'Mr. Thompkins' series, which I loved. I hope that other athors  can try to explain concepts so clearly and lucidly, in a friendly manner  without sounding overbearing.", "Helpfulness": 0.9333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZIXUQYLMKEWI"}}, {"Date": "on June 20, 2005", "Text": null, "Helpfulness": 0.8, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BT7PRPVH8HBI"}}, {"Date": "on April 23, 2010", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A92VTE6G2XYYN"}}, {"Date": "on September 18, 2002", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TBH7Z4RK7PRK"}}, {"Date": "on November 27, 2000", "Text": "This book was introduced to me by my brother who studies maths. Thanks to him. The book was written in a simple language and in so interesting manner that I just kept on reading and reading this book. This was the first book when I read about \"time\" as the fourth dimension and how it is similar to the rest of the three space dimensions. I also liked the idea of visualzing universe as a definite but endless entity (something like a mobius bottle or mobius surface). This book in all is a wonderful book to explain science from the 20th Century.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OPM5J5YO3KN0"}}, {"Date": "on January 18, 2007", "Text": null, "Helpfulness": 0.8888888888888888, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18NJFZQBFH8RP"}}, {"Date": "on July 27, 2010", "Text": "A short note (trying not to be mawkish) - I read and re-read this book in seventh grade, in 1957.  This book changed me.  It opened my eyes to worlds suspected but not yet discovered; it became a guide for me.  Of course I went into the sciences (physics and engineering), and while that would probably have happened anyway, I must at least partly credit this book.  Years later I had the great pleasure of hearing Dr. Gamow (GAM-off) speak at UC Santa Barbara.  He was old (at least to me) and his accent was heavy, but that lecture sparkled and effervesced as his books.  As others noted, when Dr. Gamow led his explorations into the wonders of physics, he did not hesitate to develop the elegant mathematical concepts along the way, clearly and understandably.  He assumed his audience was intelligent enough to apprehend the concepts.  There may be more modern writings, more up-to-date coverage of physics for initiates; but I know of none that alternately glows and scintillates as this one does. This book is a jewel, a gift.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AI42WG1WN9K7Z"}}, {"Date": "on August 11, 2007", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TLRDEEPRZXN9"}}, {"Date": "on July 1, 2008", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A55MRYPUAX4QU"}}, {"Date": "on October 23, 2008", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1S3C5OFU508P3"}}, {"Date": "on March 22, 2008", "Text": "I first read 1, 2, 3, Infinity when I was about 13, and it whetted my appetite to know more.  Gamow's explanations of how the universe works are lucid and entertaining. I'm giving a copy to my grandson, who'll be 10 in June, in the hope that he'll find the same kind of fascination with the universe that so excited me those many years ago I think it's amazing that most of the concepts he discusses have remained pretty stable during the nearly fifty years since the last revision. In addition to the one for my grandson, I bought an extra copy for me.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8TQB1IA19PDR"}}, {"Date": "on September 4, 2007", "Text": "I somehow came across this book when I was about 12, started reading it, and couldn't put it down.  Now at the age of 52, I happened upon it once again, started reading it, and once again couldn't put it down.  The delightful style of writing of Mr. Gamov, along with his tremendous knowledge, make this book a real gem.  Highly recommended for children or adults with an inquisitive mind.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AL634QORT3D0"}}, {"Date": "on November 19, 1998", "Text": "This book changed my life! I wore out one copy and the second copy is showing wear also. This book led me to a life in mathematics and computer science and a 30 year teaching career. Hofstadter's \"Godel, Escher,  Bach\" has become my more recent fount of wisdom and speculation, but I  still reread \"1,2,3 ...\" from time to time.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2X1LQSWVX5B15"}}, {"Date": "on April 15, 1999", "Text": "I first read this book when I was thirteen and recently rediscovered it.  Written in a conversational tone with many anecdotal illustrations, it is a fun introduction to math concepts, spatial math, relativity and similar  matters.  Not simple, but not hard either - it would be enjoyed by  mathematically inclined teens or adults who have forgotten a lot of what we  learned in high school and college.", "Helpfulness": 0.8333333333333334, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on August 10, 1999", "Text": "I read this book some four years back. That was the first time when I could visualize time as a fourth dimension. It made it very easy. From there on I have been reading several other books on similar topics. Truly  an inspiring book.", "Helpfulness": 0.8333333333333334, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on December 18, 2007", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AV7CVWKQX84U7"}}, {"Date": "on May 26, 2010", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A95GV9P0XQBCL"}}, {"Date": "on July 20, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22C6LLLFXKXLG"}}, {"Date": "on November 11, 2011", "Text": "The material is just a bit dated in places but overall it is a very stimulating read.  Prepare to stretch your mind.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3P462A4EDWW2N"}}, {"Date": "on November 15, 2005", "Text": null, "Helpfulness": 0.8, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PUIJKUTQC5MF"}}, {"Date": "on April 2, 2015", "Text": "There are many other reviews here, with stellar ratings, so I will just say, this is the book that made me fall in love with mathematics when I was 12, and led to a life-long passion for prime numbers. My copy is inscribed with the words \"I loved this book more than any other I read in my childhood.\"", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABQ51I6VBI72J"}}, {"Date": "on September 8, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5X7MTNYUA29O"}}, {"Date": "on August 7, 2003", "Text": null, "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22AHBRTT2MM71"}}, {"Date": "on September 14, 2013", "Text": "I first read this in the early 60's. It left a lasting impression on me. I am about 30 pages into it now, and it's just as absorbing, fresh and thought provoking as it was when I was 15.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A98CIVVNUBNLT"}}, {"Date": "on December 24, 2009", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RPSKF8R67HWO"}}, {"Date": "on August 8, 2011", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHFRFFHR3ETZC"}}, {"Date": "on September 20, 2012", "Text": "I originally got this book because it was listed as one of the greatest science books of all time and I believe that it is.  It's a wonderful read, with vivid explanations and helpful illustrations.  My favorite part of the book is his explanation of imaginary numbers.  I remember in high school never understanding the reason for them and I even asked my teacher what they were for.  As I recall my math teacher couldn't explain anything beyond allowing us the ability to take the square root of negative numbers.  It was very satisfying to finally have a complete answer!  I love this book and highly recommend it.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VQ03R1Z2XA1K"}}, {"Date": "on May 20, 2011", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVBPLKGMWWX86"}}, {"Date": "on August 10, 2012", "Text": "Great, great, great, great book.  I read it in high school, I read it again in college, I couldn't put it down either time.  If you are at all interested in science or math, then do yourself a favor and read this book.  Heck, even if you are a professional scientist or mathematician, read this book.  It is a delight to read -- like eating chocolate ice cream with your mind.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28K6G5GYUOLDI"}}, {"Date": "on September 22, 2007", "Text": "This book takes very complex theories and theorems and puts them into simple, everyday words that most of us \"regular\" people can understand. By finally understanding them, you yourself will start to boggle your own mind thinking about other theories and maybe, if fortunate enough, will even form your own.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2J16IVZ69A1U6"}}, {"Date": "on April 17, 2013", "Text": "This book is awesome at explaining abstract and theoretical concepts for those that don't have a strong background in mathematics or physics.  If you're interested in any of that, but get lost when they start using numbers and equations, this is the book for you.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2N2G2G1CGLIR3"}}, {"Date": "on February 20, 2011", "Text": "Whether you are in college or just have an inquisitive mind, this book is a great ongoing mental exercise. Very good read for people who enjoy the subjects of math and science,  but also have a life outside of that.", "Helpfulness": 0.75, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21N7EU39QXCNS"}}, {"Date": "on October 1, 2011", "Text": "This is a great book for those who enjoy questioning the universe, math, science, or practically anything.  Despite being forced to read this book by my parents I found the book interesting and enticing. It had me hooked on page one.  George Gamow has crafted a masterpiece of complex principles made of simplified literature of things meant for college students, high school students, and teachers and adults and has changed it so that even an elementary school student can understand and enjoy. I could read this book over and over and still be fascinated.  I read this book cover to cover and found every sentence just as interesting as the last.  It can keep you interested for hours on an otherwise boring subject.  I would much rather read this book than have to take a course o  the same subject.  Instead of being bored five days a week by pointless lectures and tests and quizzes I could read this exciting book at my own pace and speed yet learning the exact same things. It doesn't bore you with pages upon pages of boring, emotionless writing, but instead adds visual depictions and a bit of emotions that makes it much more interesting than your typical textbook or any other educationally directed piece of literature. This book takes complex principles and changes them for the \"average\" person to read comprehend.  If you are a kid and your parents want you to read this take my word for it. It is much more interesting than it seems.", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ADL4XVI27G41"}}, {"Date": "on June 24, 2013", "Text": "A friend gave me this book saying it had a major effect on him as he entered college. While it is ostensibly about math, it is really about creative thinking (outside the box). It is timeless.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1P36D7RMK18E7"}}, {"Date": "on October 11, 2013", "Text": "Good to read for Jr or Sr in high school.  Inspirational descriptions of math and science.  Most of the material will never be out of date.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SASRTKBXMMX2"}}, {"Date": "on December 4, 2014", "Text": "No one writes like Gamow!  You will fall in love with Science all over again.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AR2LIWOT317"}}, {"Date": "on April 1, 2015", "Text": "This is a very interesting read, but I've been attempting to read this while on my lunch break at work. It is NOT a \"pick up a book and read for a second\" type of book. This book, while in the preface explaining that it was originally meant for children, has very mind boggling concepts regarding infinity and a mindset has to be adopted to read with ease. Fantastic concepts, not finished with the book at this point as I've struggled to find the time to dig into it.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NXL4S4EAGQJ6"}}, {"Date": "on September 30, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WXDNKN2BKJP"}}, {"Date": "on June 11, 2013", "Text": "A delightful romp through the early developments of modern physics with a sparkling dash of mathematics added to stimulate the mind.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HDSD83R0TCBR"}}, {"Date": "on February 26, 2013", "Text": "That phrase by Einstein totally describes this wonderful book... despite being a book deeply grounded on mathematics, it explains most of the concepts in such a simple way", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VQ5XGEFZM7EZ"}}, {"Date": "on January 21, 2013", "Text": "I am definitely not a math-oriented person, but from the very beginning this book grips you.  It breaks down complex concepts into easy to understand ideas that I wish I was introduced to at a much earlier age.  If I had picked this book up in gradeschool, it may have very well shifted my ideas toward the field of mathematics.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IUNUV8YDSMHU"}}, {"Date": "on October 30, 2012", "Text": "I first read this book when I was about 12 years old and it also encouraged my love of science, math and especially cosmology. My copy is an original paperback, now falling apart and I bought it thinking it was science fiction. I have since reread it a few times and it never gets old. And I wouldn't sell my copy for the world!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3O9TVQWWVJHUH"}}, {"Date": "on July 13, 2007", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAMPGLZWIHJX3"}}, {"Date": "on February 28, 2015", "Text": "This book inspired me to become a scientist at age 13, and 15 years later I got my Ph.D. in physics. It is still fascinating 36 years after that. However, I wonder why the updated 1961 edition fails to mention Gamow's 1948 prediction of the cosmic background radiation.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARL7SW85MQ2DS"}}, {"Date": "on April 19, 2013", "Text": "I was awarded this book in high school by a science teacher but misplaced it.  I still wanted to have it on my shelf, so I reordered it from Amazon.  I read it a long time after I graduated high school and found the volume unbelievably interesting.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AJIK25NEUR5T"}}, {"Date": "on September 21, 2013", "Text": "This is a classic that is still interesting even though much time has passed since it's publication. It could well serve serve to interest more young people in mathematics and science.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15237K8RL37T5"}}, {"Date": "on December 13, 2007", "Text": "Covers a lot of topic and even though I have not completed the entire book, I would recommend this book to anyone who is interested in popular science literature.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOQ2KDTTXU8V1"}}, {"Date": "on May 17, 2013", "Text": "I first bought this book when it was first published.  I thought it was great then, and I think it is great now.  It is truly a unique look at science topics.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1N0MQO381Z5B6"}}, {"Date": "on February 4, 2015", "Text": null, "Helpfulness": 0.5, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HQ1C3D6KCUR8"}}, {"Date": "on March 9, 2015", "Text": "This is for those who love narratives and are trying to learn more mathematics through narratives.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A370OUUPONNY20"}}, {"Date": "on October 22, 2014", "Text": "great book but no an easy read", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9X92JN6E8B5C"}}, {"Date": "on September 16, 2014", "Text": "very good book and service", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AT6AQJKPRW1P"}}, {"Date": "on August 11, 2014", "Text": "Book in great condition!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3625OSSVEUVI0"}}, {"Date": "on March 30, 2015", "Text": "as advertised", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KUZNHWXCQU2V"}}, {"Date": "on November 14, 2013", "Text": "If you have any interest at all in mathematics, or science, or both, you won't be able to stop reading this classic book. And no matter how much you know about these subjects, you can always learn more -- and be very entertained at the same time, for Gamow is never dull; he has the knack of being as interesting as he is knowledgable.  Like many people, I discovered this book in high school.  I still have my battered paperback edition, and I'll never part with it.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OGM9XBNYAEZS"}}, {"Date": "on June 4, 2014", "Text": "A friend recommended this book for my 12-year-old son who loves science (he is gifted in math, so I cannot give an accurate idea on age appropriateness). It didn't disappoint and my son even begged for me to buy the same book for his friend.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D4MFMTZRNXJ4"}}, {"Date": "on April 1, 2014", "Text": "No doubt few books can lead you to the fundamentals as this one.It kindles your imagination to look far beyond what is given in the book.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37NZABOP58E2S"}}, {"Date": "on January 2, 2011", "Text": null, "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HN4PXJB3FAA"}}, {"Date": "on July 7, 2011", "Text": null, "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQPGT5QBZXB0Y"}}, {"Date": "on June 26, 2013", "Text": "I bought the used book, and the book is in good condition. I just start to read it and I'm looking to read it thoroughly.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AR09XRELBI4QV"}}, {"Date": "on November 30, 2010", "Text": "The book is very interesting and My son is completed abosored when he started it. Wish to have more books like this.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FD6JOQSVQ52G"}}, {"Date": "on December 27, 2014", "Text": "Fun, but don't waste your money.  Gamow is to be well respected, but this book is far too old.  He's got some good chapters on math and probability and biology and chemistry - subjects that were well in hand by the late 60's.  But, when it comes to cosmology, astronomy and astrophysics, you may as well throw the book away.  This book is so dated that Gamow doesn't (couldn't) know that we actually launched a rocket into space.  His timeline for the universe is off by about 5 billion years.  He couldn't have known about observations of supernovaes in the late 1990's that proved the accelerated expansion of space.  And his theories on nucleosynthesis in the the Big Bang as well as nuclear fusion in the Sun are WAY off.  WAY off!", "Helpfulness": 0.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31KUJYNTPZNPK"}}, {"Date": "on May 4, 2014", "Text": "Some of the text is illegible on the Kindle.  The figures are \"light\" and hard to see, but if you put your finger on them and then \"magnify\" them, you can see them.  So too, with some of the text.  HOWEVER, Gamov has picture data in the text that cannot be \"magnified\".  For example, I deciphered a fraction, 1/3, say, which is actually picture data on a text line, but I could not \"magnify\" the picture data so that I could read it.  There were other things like fractions and math details that I  couldn't decipher and couldn't \"magnify\".  This problem takes away some of the enjoyment of the book and a lot of the information.  In parts, the book reads like, \"... consider the mathematical formula ??????? which you can see is equal to ?????\".  I put in the ???? in the quote to represent the undecipherable content.  Needless to say, I returned the book.  I wish Kindle could and would fix this problem.  --LJM", "Helpfulness": 0.14285714285714285, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DD178AQBSVSO"}}, {"Date": "on February 13, 2013", "Text": null, "Helpfulness": 0.3333333333333333, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ENZLNV3KS0NW"}}, {"Date": "on August 8, 2008", "Text": "i bought this book purely because some people had stated how much of an impact it was when they read it when they were young.  i guess i am too old to enjoy it.  i'll give this book to my nephew when he turns 12 and see what he thinks", "Helpfulness": 0.21739130434782608, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MFXWSKC3EB0B"}}], "ReviewUrl": "http://www.amazon.com/One-Two-Three-Infinity-Speculations/product-reviews/0486256642/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.7 out of 5 stars"}, "OfferPrice": "$10.95", "Salesrank": "#15,314", "ListPrice": "$12.95"}