{"Category": "in Books (", "Name": ["Virtual LM: A Pictorial Essay of the Engineering and Construction of the Apollo Lunar Module: Apogee Books Space Series 47"], "Timestamp": "2015-05-24 23:20:11.105728", "itemurl": "http://www.amazon.com/Virtual-LM-Pictorial-Engineering-Construction/dp/1894959140", "Reviews": {"TotalReviewCount": "24", "ReviewList": [{"Date": "on November 28, 2004", "Text": null, "Helpfulness": 0.9777777777777777, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NOZB6VZCTOI4"}}, {"Date": "on December 27, 2004", "Text": null, "Helpfulness": 0.9375, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2E05533IX4549"}}, {"Date": "on August 26, 2005", "Text": "I have heard on very good authority that this book and it's amazing twin \"Virtual Apollo\" are being bought up everywhere by large aerospace contractor engineers who are probably building America's new moon ship. The pictures and illustrations are so good in 3D high res, I can understand why. Does Burt Rutan have a copy of this? If he does we will probably be on the moon again very quickly.", "Helpfulness": 0.9285714285714286, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21MF4W9HW4YVV"}}, {"Date": "on December 30, 2005", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I0422Z9IK7OX"}}, {"Date": "on February 20, 2006", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AO08WOIFUU7RR"}}, {"Date": "on December 3, 2004", "Text": "If you enjoyed Scott Sullivan's Virtual Apollo you'll savor this book just as much.  Whether you have an engineering mind and/or a passion for spacecraft you will enjoy being taken into the nuts and bolts of the Lunar Module.  Sullivan's precise and meticulous renderings of the LM peel the spacecraft away like layers of an onion allowing you to grasp the brilliant ingenuity of its design.  A must have addition to the library of any space enthusiast.", "Helpfulness": 0.8823529411764706, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26AZ371EZ8KEF"}}, {"Date": "on June 16, 2006", "Text": "As we move farther and farther away in time from the actual events, the Apogee series of Mission Reports and detailed analysis of the Apollo hardware becomes more and more essential to the preservation of the National memory of the great space program events of the 60's and early 70's. The Virtual LM book records, for posterity, the details of the vehicle which landed 12 Americans on the moon.  Many Americans alive today weren't even born, or old enough to remember those days.  May this book rekindle memories for those of us who remember, and inspire a new generation to go to the moon once again. I hope there will be a follow-up volume on the Saturn launch vehicles.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DFS6U5ESHYDD"}}, {"Date": "on February 12, 2006", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DKOYDX95BDJ9"}}, {"Date": "on June 15, 2006", "Text": "This book nicely complements Virtual Apollo (also highly recommened).  The detail of the Apollo LM, Rover, and PLSS presented here by Sullivan is great!  It's a great design reference for anyone in the business of designing lunar spacecraft, but because it's a pictoral reference anyone can enjoy it!  Internal details of the LM design are hard to come by since these articles were left on the moon so this book provides an opportunity to see the intricate details of the only human operated vehicle to land on the moon.  I highly recommend this book.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SERLCV3EPEGS"}}, {"Date": "on June 15, 2006", "Text": "This is a great book for those of us who want more details about what the inside of the LM was really like. The CAD drawings are wonderful and given a three dimensional view inside the lander. Highly reccomended.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SR09IO2CS3LE"}}, {"Date": "on November 4, 2006", "Text": "A picture really does speak a thousand words.  A definite must for anyone who wants to know more about the Apollo spaceships and the LM in particular.  A truly amazing piece of literature to be sure. Odds-on there will be more than one space industry designer working on the current moon projects that will have this on their home bookshelf.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VIQYCNQWE7T1"}}, {"Date": "on June 15, 2006", "Text": "The Virtual LM essay is even better than the Command Module Series.  Easy to understand, in depth, review of the Lunar Module shows how the first \"deep space\" ship was put together.  Looking forward to a \"Saturn V\" follow up!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2R8CHEMGSVOKD"}}, {"Date": "on April 7, 2007", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATLBHYR0UMD58"}}, {"Date": "on June 14, 2006", "Text": "If you're into space stuff you must have this book. The detail is incredible. You'll spend hours pouring through it, and thinking to yourself \"So that's what that's for. And that's how they did that.\" My only minor complaint is that I wish the graphic design could have been a bit nicer. The book looks as if it were done in PowerPoint. But that's a minor quibble. The book is fantastic!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IW4023CW1M10"}}, {"Date": "on June 22, 2007", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A320PCI3730YOQ"}}, {"Date": "on March 8, 2007", "Text": "If you are fascinated with all the pieces and parts of the Lunar Excursion Module or LEM, then Virtual LEM is the book for you.  I use this as a visual reference when I read books on the Apollo program.  It makes for a great guide for my wood carving.  The book provides all of the angles and detail I need to do my space carvings.  In short, if you love the Apollo program, then Virtual LEM is the book for you.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZ2GHX5C0FF2"}}, {"Date": "on April 1, 2007", "Text": "This book is great! The renderings are very thorough. My one regret is that I wish there were more photographs of the items that were rendered. But this being the internet age, you can find most of those on the web!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RSYVJU8YGZYA"}}, {"Date": "on March 13, 2007", "Text": "An excellent book about an absolutely incredible machine. After reading and studying this book, you are left in awe of the immense engineering effort that took to build this craft. It's hard to believe that this was designed with pencil, paper, and slide rule!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4JP7DZQF4UGJ"}}, {"Date": "on June 29, 2008", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIKVLU1HAV0ZQ"}}, {"Date": "on May 17, 2015", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35FZYLD9P5BIF"}}, {"Date": "on May 1, 2013", "Text": "If you are a modeller or have a strong technical interest in the LM, this is the finest and most complete reference available. Highly recommended.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23G5Q93P3FHA5"}}, {"Date": "on April 16, 2007", "Text": "\"Virtual LM\" provides a detailed pictorial explanation of the Apollo Lunar Module and its \"baggage\" - the ALSEP packages and Lunar Rover.  Carefully drawn color-coded diagrams explain the structure and systems of the Lunar Module, showing detail from several different angles.  If you have an engineering bent, and love (or need) to know how things work, this is the book for you.  If you want an overview of the Lunar Module - this book gives you more detail than you will ever need to know.", "Helpfulness": 0.6, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AA0CCE9O5XU1C"}}, {"Date": "on March 7, 2015", "Text": "Delivered on time and as advertised. The best, definitive book on the LM if you are an Apollo fan or modeler..", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A164KRGZXVBFUZ"}}, {"Date": "on July 22, 2014", "Text": "Most Facinating", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36GWF7UNRW1RQ"}}], "ReviewUrl": "http://www.amazon.com/Virtual-LM-Pictorial-Engineering-Construction/product-reviews/1894959140/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.9 out of 5 stars"}, "OfferPrice": "", "Salesrank": "#1,202,792", "ListPrice": ""}