{"Category": "in Books (", "Name": ["Statistical Mechanics: Volume 4 of Pauli Lectures on Physics (Dover Books on Physics)"], "Timestamp": "2015-05-24 21:27:25.967451", "itemurl": "http://www.amazon.com/Statistical-Mechanics-Pauli-Lectures-Physics/dp/0486414604", "Reviews": {"TotalReviewCount": "2", "ReviewList": [{"Date": "on January 19, 2002", "Text": "Wolfgang Pauli really is an expert in explaining the not-so-simple subject of physics to not-so-bright students of the subject. This book is another proof of that. His unique style of using not too clumsy notation and of getting directly to the point (a feat that is hard to achieve in statistical mechanics that must be studied with lots of mathematical prerequisites) could magnetize even the ordinary physics student to read further the text. Studying statistical mechanics, like other fields in physics and mathematics, bears fruit only when reading is accompanied with papers and pen for tracing the computations in the text. But with Pauli's statmech book, calculations with papers and pen can be minimal. In fact, mental calculations can simultaneously go with reading. The reader is properly introduced to the subject because of the simplistic arguments found in the introductory parts, especially the specific topics of billiard ball problems and central forces. The whole chapter under Brownian Motion makes the book independent and the subject very well understood. Historically, ideas in statistical physics was formed due to the inability of classical mechanics to explain the irregularity of motion of dust particles suspended in air or water. The only, but only slightly, \"dirty\" character of the book is the too early introduction of the subject of quantum statistics due to inadequate presentation of various experimental indications leading to the subject. The book would be a perfect one had Pauli discussed first experiments around the topic. But as an introductory book that inadequacy could be ignored. Generally, the book is good.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CV0GP0G41EL5"}}, {"Date": "on September 23, 2014", "Text": "This is a short and light book that addresses the main subject clearly and concisely and, at various points, brings some different foci than those often dealt with by reference books. It worth have all six books of the serie. In addition, the book arrived within de estimated delivery time and in excellent condition. I recommend!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FTWZRVCBAGBU"}}], "ReviewUrl": "http://www.amazon.com/Statistical-Mechanics-Pauli-Lectures-Physics/product-reviews/0486414604/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.5 out of 5 stars"}, "OfferPrice": "$8.95", "Salesrank": "#376,438", "ListPrice": ""}