{"Category": "in Books (", "Name": ["Recreational Gold Prospecting for Fun & Profit"], "Timestamp": "2015-05-24 23:17:28.237860", "itemurl": "http://www.amazon.com/Recreational-Gold-Prospecting-Fun-Profit/dp/0935182985", "Reviews": {"TotalReviewCount": "35", "ReviewList": [{"Date": "on January 30, 2006", "Text": "In preparation for an upcoming fulfillment of my dad's lifelong desire to do \"real\" gold prospecting, I researched many articles on Gold Prospecting, visited Sutters' Gold Discovery State Park on a recent vacation to Northern California, and purchased various books on the subject.  This book, Recreational Gold Prospecting for Fun & Profit, seemed to encompass the most information and give good, solid advice that resonated through other sources.  I've always wondered why anyone would shared their prospecting secrets - but the author comes across as a true advocate.  Having been involved in other pursuits (elected public office, karate, guest speaker at PSU, etc.), I have found that the best advice is given by those who truely appreciate the activity and feel that they owe others the benefit of their experiences.  Gail appears to be such a mentor to all of us want-to-bes.  I would recommend this book be one of your initial sources on gold prospecting.", "Helpfulness": 0.9577464788732394, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2H4ENLB1ML2Z2"}}, {"Date": "on September 17, 2003", "Text": "I've never broken even over many years of prospecting and searching for the Lost Adams Diggings.  But I wouldn't trade a moment of it.  This book will help the reader by giving an excuse to go into the wilderness.  The first time you look into the bottom of a pan and see glitter will be a moment you'll remember the remainder of your life.  Buy it and do it!", "Helpfulness": 0.9047619047619048, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AYGXMH34R18Y"}}, {"Date": "on January 4, 2003", "Text": "I thoroughly enjoyed Gail Butler's book. Sometimes I felt as if I was there with here. Its an easy read and very instructional. It makes me want to go to California or Arizona and start digging, panning and nugget detecting. If you have only been coin shooting and want to know what it is like to prospect and detect for gold this book is a great one. Read it.", "Helpfulness": 0.8837209302325582, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GF83JJQAYEWR"}}, {"Date": "on February 11, 2008", "Text": "I was thoroughly impressed with this book. It went into great detail concerning all of the basic aspects of prospecting. It is also a great book  for an intermediate level prospector that just wants to have a good resource book. This book was one of the first that I had purchased and is still one of the better books (information wise) out there for this level. It is very well written, in that it is a fun book to read, while at the same time educating yourself about the great hobby!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DWVQAD9MH5XK"}}, {"Date": "on September 25, 2008", "Text": "Although I have only been just recently interested in prospecting for gold and made two trips to gold producing areas (California & Geogia) I found this book to be very helpful. It brought up many areas I had not thought of before and made the experience so much more enjoyable. The author really puts emotion into her lessons through her personal knowledge. It's as if she is talking to you one on one. If you are just getting into this exciting field for the first time, this is a must read and the information will save you lots of time and money if you put the author's advise to use. We are so used to this type of book being written by a man since we think of prospectors being men but this author has had more experience in the field then most of the other male authors books I have read previously. A great read for all.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2W01M42KIH4IH"}}, {"Date": "on June 10, 2009", "Text": "This is one of the most informative books out there on this subject.  It is comprehensive. I have gone back and read parts of it several times. You need to go out and do this and come back and read the book again. Besides giving lots of tips about finding gold she has a great chapter that deals with how modern prospecting actually aids the environment and keeps our streams cleaner and healthy for fish.  She covers all the bases and gives valuable insight about what works best.  She also makes it clear the adventure itself is very rewarding whether you find a speck or an ounce.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HZKUM3QB30BH"}}, {"Date": "on April 28, 2009", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NUFWQ9SPGVJO"}}, {"Date": "on May 14, 2010", "Text": null, "Helpfulness": 0.7608695652173914, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A771BHQGXJ2D3"}}, {"Date": "on May 8, 2007", "Text": "Gail Butler has written a great book for anyone that likes prospecting or want to give it a try. She goes into good detail on all aspects of the hobby. But can ramble a bit in a couple of chapters. Other than that its a must have, for your collection.", "Helpfulness": 0.8888888888888888, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZR5AN5EO7710"}}, {"Date": "on July 5, 2007", "Text": "Being new to this hobby , this book was very informative and covered many questions that I had. I would recommend this book to anyone who wants to cover all the aspects of prospecting for gold.", "Helpfulness": 0.8888888888888888, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UBYJ4UHNSI64"}}, {"Date": "on August 19, 2006", "Text": "The book is well written, easy to read, contains very useful information, good references and is conveyed pleasantly.  I found reading it informative and enjoyable.  It encouraged me to consider Gail Butler's other works.", "Helpfulness": 0.8181818181818182, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3B30M6AKDIUOX"}}, {"Date": "on February 1, 2009", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2T39FXX5OSBLS"}}, {"Date": "on March 11, 2013", "Text": "This book is an easy read and full of good information.  Unlike a previous review, I did not find the author Gail Butler as making feminist comments.  Mrs. Butler did make an attempt to encourage women to prospect and putting into perspective that women may not move as much material as quickly as a man, but with endurance a woman will eventually be able to move the same amount of material, though it may take more time to do so.  This book was well written and I think it contains good information for any new prospector, male or female.  I have read several books on the subject and this book is one that I enjoyed reading.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24ZEPXK0DBE6D"}}, {"Date": "on August 25, 2008", "Text": "Contains a lot of good information on different methods and locations. Easy to read and helpful.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZC2TLVXD1O58"}}, {"Date": "on March 18, 2015", "Text": "She has some odd views, less opinion and more usable facts would have been nice", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABZP1B77XFXUA"}}, {"Date": "on March 22, 2010", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21CAK5W0S0HP4"}}, {"Date": "on September 28, 2010", "Text": "Hey anyone just getting into the prospecting fun should try this book first.  First!!!  I read it last and I really got a lot of correct information from this one. I really - really like it.  Thanks.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXZ8K1ZYCCG8Z"}}, {"Date": "on February 18, 2014", "Text": "It's great that it is written by a woman especially in a mostly male dominated hobby.  It's very basic and has a lot of pictures so it is great for the very beginner.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A215FQN6BGJACO"}}, {"Date": "on June 21, 2011", "Text": "This book is very well written and provides an all-inclusive review of every aspect of prospecting. The lady KNOWS her subject inside and out.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FDGN41NASM10"}}, {"Date": "on March 17, 2013", "Text": "decent book that seems to cover anything from weekend warrior to full time gold digger, easy explainations and where to find gold", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PEK8LFWHKVNU"}}, {"Date": "on April 2, 2013", "Text": "Nice book for the beginning prospector they cover all the basics needed for most any type of gold prospecting in great detail.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PJOPT2WI6IP7"}}, {"Date": "on March 2, 2013", "Text": "Great book for the beginner. A lot of good information for the novice or beginner gold miner in all of us.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VI5D6TU2VDV3"}}, {"Date": "on December 21, 2014", "Text": "I really love my nugget bucket.  i have everything I need to go prospecting. The Nugget Bucket classifies your material twice 1/2 & 1/4\" with one scoop.  And with the catch cup at the bottom, all your left with is fine, rich gold bearing pay dirt or dirt, depending on where you're prospecting.  The Nugget Bucket saves you alot of time.  It's light and very efficient.  Please buy one.  It would be one of the best decisions you've ever made.  I highly recommend this produce to every prospector whether you're highly skilled or a rookie like me.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZ6UHXG8S4H2H"}}, {"Date": "on May 24, 2014", "Text": "If your into prospecting this is the book to have. Gives really good tips for being successful. Would recommend to all!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHU8F3HAY4Q26"}}, {"Date": "on February 9, 2015", "Text": "quality  product .on time delivery", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15ZJMRDGLDLXG"}}, {"Date": "on April 11, 2015", "Text": "A well written book, Thank's", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1S34L1Y60770J"}}, {"Date": "on January 21, 2015", "Text": "Great Read!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HMMPCL59WOG7"}}, {"Date": "on December 19, 2014", "Text": "Great book!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ESFXKFBRNMEU"}}, {"Date": "on August 13, 2014", "Text": "functional for what I was looking into", "Helpfulness": 0.5, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RV3XAJVEFDD2"}}, {"Date": "on September 1, 2014", "Text": "Good book", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYC43Q9JUHHC5"}}, {"Date": "on February 25, 2015", "Text": "fun book", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6UJSIYKO7SKV"}}, {"Date": "on March 29, 2014", "Text": "Great book!  Lots of useful information about prospecting in general.  Lots of good pictures!  No issues with delivery and the price is reasonable.  I recommend this book especially to women prospectors.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34W33OPMAVZK5"}}, {"Date": "on July 7, 2013", "Text": "Good book to read with some good details on the title subject, would recommend this book, priced right for the material in this book.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NXDGQD9CY9QR"}}, {"Date": "on January 30, 2013", "Text": "All the info in this book is easily found online and very basic in nature. If you are a beginner it's ok I guess.", "Helpfulness": 0.3333333333333333, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PW4HTPOGVRX0"}}, {"Date": "on May 9, 2007", "Text": "This book has lots of good information for the novice golder. It has inspired us to try different methods of prospecting. Has lots of new ideas for the uninformed re prospecting. Good for beginner.", "Helpfulness": 0.14285714285714285, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30YP1B6XWP3S4"}}], "ReviewUrl": "http://www.amazon.com/Recreational-Gold-Prospecting-Fun-Profit/product-reviews/0935182985/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.3 out of 5 stars"}, "OfferPrice": "$11.93", "Salesrank": "#245,232", "ListPrice": "$12.95"}