{"Category": "in Books (", "Name": ["Fractals, Chaos, Power Laws: Minutes from an Infinite Paradise (Dover Books on Physics)"], "Timestamp": "2015-05-24 21:20:33.770598", "itemurl": "http://www.amazon.com/Fractals-Chaos-Power-Laws-Infinite/dp/0486472043", "Reviews": {"TotalReviewCount": "18", "ReviewList": [{"Date": "on June 19, 2000", "Text": null, "Helpfulness": 0.9661016949152542, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RPTVW5VEOSI"}}, {"Date": "on March 16, 2002", "Text": null, "Helpfulness": 0.9736842105263158, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1S1YJT4DN3TEC"}}, {"Date": "on December 31, 2000", "Text": null, "Helpfulness": 0.9523809523809523, "StarRating": "4", "Author": {"ProfileUrl": ""}}, {"Date": "on February 16, 2010", "Text": null, "Helpfulness": 0.8333333333333334, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RO5NF0U4QJ38"}}, {"Date": "on February 28, 2003", "Text": "For the uninitiated! --The author combines insight with story telling. He has a story to tell, and does it well! Not only does he know the theory inside out, he has the ability to get accross the central points so it (almost) seems easy, in any case entertaining, using pictures (including cartoons), humor, and equations when they are needed. He further make clear the many fascinating links between chaos theory, algorithms, technology, and areas of pure math, such as number theory. Highly recommended!", "Helpfulness": 0.9, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1N2477VRD8OIZ"}}, {"Date": "on January 27, 2001", "Text": null, "Helpfulness": 0.8888888888888888, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANIHM0BW3ZWR3"}}, {"Date": "on May 29, 2007", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHJT9K7BMCGFY"}}, {"Date": "on July 22, 1999", "Text": "The best introductory book on fractals and chaos. It has a breath-taking wealth of topics, complete with the intuition behind them, the formulas, the drawings and pictures. A 'must read' for anyone who wants a serious  introduction to these fascinating topics.", "Helpfulness": 0.7777777777777778, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AA3NMG0L6GBIZ"}}, {"Date": "on February 10, 2008", "Text": null, "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HVL7MRK1OWIE"}}, {"Date": "on June 22, 2000", "Text": "One of the best introductory books I've ever read about the subject. A good example of multidisciplinarity and a bridge between theoretical and practical studies. The author does not avoid mathematics, allowing accuracy  and complete explanations, and does not exceed, making the book readable to  beginners.", "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11YOT86X3M4GU"}}, {"Date": "on December 17, 2014", "Text": "This book is kind of a tease.  You get just enough mathematics to get you interested, but never all you need to get a real understanding.  This is essentially an executive level whirlwind tour of self-similarity and related topics.  The writing style adds a bit of \"sweetening\" to each section, which might be acceptable in the first chapter, but it pervades the book and gets really annoying.  If you like to tickle yourself with interesting ideas without getting too deep, this might be just the book for you.", "Helpfulness": "", "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AI9G197C4ZLXL"}}, {"Date": "on January 30, 2013", "Text": "Book was too mathematically challenging for me (a mere college graduate).  One needs to have a PhD in physics and/or math to understand it!  But I'm sure it is wonderful, based on the other reviews from people who understand those things!!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARYUXU4WYY2H9"}}, {"Date": "on October 14, 2014", "Text": "This is a fine review of the subject with a nice balance between qualitative and quantitative aspects of fractals. The math is clear and if you have some calculus in your background, not hard to follow.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39BWOJ3ORLPEU"}}, {"Date": "on August 23, 2010", "Text": "This book is an extraordinarily well written and presented introduction to fractals and power laws. It has a far deeper mathematical level and requires more time and effort to understand than the typical popularizations. I find it specifically well suited for the the mathematically inclined layman and scientists outside mathematics who want to delve deeper into this subject. Note, however, that if you are a hard core mathematician (of the \"lemma - proof - corollary\" type), you might probably find this book too superficial and light for your taste, so this book is not for you. If you are an Earth, Life or medical scientist, or just a mathematically curious guy, you will find this book interesting and rewarding. I wholeheartedly recommend it.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2W2AL1H893QNQ"}}, {"Date": "on July 28, 2014", "Text": "Tough math read on fractals and chaos.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1N68GPI5ASJZG"}}, {"Date": "on March 16, 2013", "Text": "I did glean a few interesting bits from this, so for that it gets two stars, but my comments are mostly negative. First, while not serious enough by itself for me to deduct even one star, the title is misleading. The author intended to write a book about self-similarity. The topics of fractals, chaos, and power laws are byproducts of his focus on self-similarity. So the coverage of those topics is haphazard. I guess the publisher chose the title to pick up on current buzzwords. Second, even considering what the book is really intended to be about, the exposition is disjointed. Each chapter is a collection of a few loosely related examples. Third, while a popularization necessarily must be handwavy, many passages were the kind of over- and misstatements you see in newspaper writing. Also, he tends to insert equations in the text where a good turn of phrase would have been more effective.", "Helpfulness": 0.3333333333333333, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18GR7BZAJWPC9"}}, {"Date": "on May 12, 2013", "Text": "I got what I'd wanted, but it isn't written the way that I expected.  I don't mind the math, but it's the general organization that's problematic.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AT95KRFR5UARS"}}, {"Date": "on March 19, 1998", "Text": "The book opens up ideas of wonderful depth, but isn't easy reading for those who hate equations. I would put this book in the top ten must read area for fractal people! Your unique Associates ID is:  thefractaltransl", "Helpfulness": 0.2, "StarRating": "4", "Author": {"ProfileUrl": ""}}], "ReviewUrl": "http://www.amazon.com/Fractals-Chaos-Power-Laws-Infinite/product-reviews/0486472043/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.3 out of 5 stars"}, "OfferPrice": "$18.95", "Salesrank": "#109,887", "ListPrice": "$24.95"}