{"Category": "in Books (", "Name": ["Level Set Methods and Fast Marching Methods: Evolving Interfaces in Computational Geometry, Fluid Mechanics, Computer Vision, and Materials Science ... on Applied and Computational Mathematics)"], "Timestamp": "2015-05-24 23:10:25.953746", "itemurl": "http://www.amazon.com/Level-Methods-Fast-Marching-Computational/dp/0521645573", "Reviews": {"TotalReviewCount": "7", "ReviewList": [{"Date": "on October 11, 2003", "Text": null, "Helpfulness": 0.8846153846153846, "StarRating": "2", "Author": {"ProfileUrl": ""}}, {"Date": "on June 7, 2001", "Text": "I use these methods in the context of image analysis, for image segmentation essentially. The book is an inescapable introduction by one of the main inventors of these methods. It is easy to read and relatively complete. Be sure to get the second edition. The only slight problems are the remaining typos. There are quite a few, for a second edition, and they might throw off a beginner. You will need to read some introduction text on finite differences methods at least. The chapter in Numerical Recipes is enough.", "Helpfulness": 0.8461538461538461, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KV3NY4I4HE7J"}}, {"Date": "on April 27, 2000", "Text": "This is a very good introduction to the  very exciting technique, level-set method. The method is basically for front-tracking or interface motion. But its application turned out to be so wide that it is now applied  to problems which does not  seem relevant to front-tracking, such as  computaional grid generation. This book explaines the basics of this  powerful tool very clearly, and it is  in fact easy to read. Although it  was written by a mathematician, it is not very  mathematical like some  texts on finite-element method written by mathematicians (which are often  formidable to engineers). I recommend this book to anyone in engineering.  You might find a new application of this technique.", "Helpfulness": 0.8125, "StarRating": "4", "Author": {"ProfileUrl": ""}}, {"Date": "on December 24, 2007", "Text": "This is a good book to get started with level sets. However, I do not consider it a self-contained book. I feel more like having read \"about\" level sets rather than having learnt level set method in sufficient detail. It would be great if the book provided sufficient details so that one can program level sets with sufficient ease after reading it . I must say that the book provides a good overview. In particular, first four chapters are insightful. From chapter 5, with non-linear wave equation, I felt a steady need for more details. Chapter 21 on etcihng and deposition is sketchy and I did not find the discussion satisfactory. In particular, more effort from author in \"putting everything together\" is warranted for chapters on applicaitons such as chapter 21. One major aspect that needs further discussion is construction of the front from level set function and computing local normals for problems such as etching and deposition where explicit calculations involving fornt geometry are needed e.g. viewfactors.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3T3NA6K9GA8MV"}}, {"Date": "on November 22, 2007", "Text": "I think this book is a good reference book for people who do a lot of work in related topics.  This book is good to get the concepts down but by no means a good book to learn from from the ground up.  It is formula packed so if you are familiar with implementing such things this book is all you ever need for work in level set and volume graphics in general.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30RN0S9N4ZCHL"}}, {"Date": "on April 23, 2003", "Text": "I am afraid that this book is not for beginners who want to have a clear mind of the level set method. You will have to go to the library quite often to dig out all the references the author mentioned. I would say this book is for experienced researchers only.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": ""}}, {"Date": "on March 14, 2006", "Text": "Neither an introduction nor a recipe book for level sets. Contains dense information and requires supplemental material.", "Helpfulness": 0.6, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1O40IA8RJREQH"}}], "ReviewUrl": "http://www.amazon.com/Level-Methods-Fast-Marching-Computational/product-reviews/0521645573/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "3.4 out of 5 stars"}, "OfferPrice": "$55.53", "Salesrank": "#790,790", "ListPrice": "$69.99"}