{"Category": "in Books (", "Name": ["Fundamentals of Physics: Mechanics, Relativity, and Thermodynamics (The Open Yale Courses Series)"], "Timestamp": "2015-05-24 21:22:05.915850", "itemurl": "http://www.amazon.com/Fundamentals-Physics-Mechanics-Relativity-Thermodynamics/dp/0300192207", "Reviews": {"TotalReviewCount": "35", "ReviewList": [{"Date": "on February 17, 2014", "Text": null, "Helpfulness": 0.9848484848484849, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A236KWNBHRO1CG"}}, {"Date": "on February 12, 2014", "Text": null, "Helpfulness": 0.9459459459459459, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6CL0GZ0Y7GON"}}, {"Date": "on June 17, 2014", "Text": "This book is  a good way to refresh your memory of concepts from the first year of college physics. Shankar is well known to many quantum mechanics students book from his  textbook. He is a highly respected teacher with an online series on basic physics. I particularly enjoyed Chapter 16 on mathematical methods which is a quick summary of Taylor Series and complex variables. If you are familiar with this material, it is a nice relaxing read of old mathematical friends. The derivations for  the series for e, sin, and cos are straightforward if you remember beginning calculus. Shankar quickly mentions Leonard Euler. If you do not know who Leonard Euler is or the significance of the formula attributed him please read Maor's e:the Story of the Number and then Nahin's An Imaginary Tale. The chapters in this book are approximately 20 pages long and usually can be read with about an hour of time. The chapters on rotational dynamics, simple harmonic motion, and waves are an excellent review of concepts that will be required for future study of basic quantum mechanics. There are three nice chapters on special relativity. The reader may also want to check out Collier's A Most Incomprehensible Thing.  As stated elsewhere electromagnetism and quantum mechanics are planned in the second volume of this book. Be warned that the author inserts many jokes that are not that funny.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38AKHUK96FH9F"}}, {"Date": "on February 25, 2014", "Text": null, "Helpfulness": 0.875, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SWHLDWFFIF6R"}}, {"Date": "on March 17, 2014", "Text": "If you saw the movie (video lectures of PHYS 200) like I did, you must read this book. It covers key concepts of mechanics and thermodynamics in the same lively spirit as Prof.Shankar's classroom lectures. I particularly like the way he handles Special Relativity and Entropy. It's hard to find books that explain otherwise hard to grasp concepts this lucidly. Also, you can't beat the price!", "Helpfulness": 0.8333333333333334, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22RT1EEY4M0P2"}}, {"Date": "on November 22, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOP0GKC160FW3"}}, {"Date": "on July 16, 2014", "Text": null, "Helpfulness": 0.8, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30E7E9TU6S583"}}, {"Date": "on June 2, 2014", "Text": "I am interested in learning more about Physics and \"Fundamentals of Physics: Mechanics, Relativity, and Thermodynamics (The Open Yale Courses Series) [Kindle Edition]  gives me a way to have the option to utilize my Kindle reader and the Kindle app on my PC for working with the problems.  This book offers a good sound start to learning the physics you would get in a college course and can be studied at my own pace.  Looks very thorough and up to date.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3L1VJMHFWONCB"}}, {"Date": "on May 17, 2014", "Text": "at least the presentation of certain parts of physics very  original ,  in a simple  and understandable  way.thank you  R.Shankar", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YQFMN4SPCCIA"}}, {"Date": "on May 6, 2015", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17SOKF4JF7JHF"}}, {"Date": "on May 13, 2014", "Text": "This book contains very enlightening discussions on the the standard topics of a typical elementary physics course, especially for non-physics majors.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XUYMNKJVAB5O"}}, {"Date": "on June 27, 2014", "Text": "This is an excellent introduction to physics! For a physics major, I think that this book would be a great supplemental text. The book doesn't contain many practice problems, but this book could be used as a primary textbook if you use a book like \"Schaum's 3,000 Solved Problems in Physics\". Before reading this book,you should be familiar with the basics of differential and integral calculus. If you haven't taken calculus yet, I would recommend checking out MIT's Single Variable Calculus lecture videos and notes [...] . The textbook that MIT uses for single variable calculus, \"Calculus with Analytic Geometry\" by George Simmons is an excellent introduction to calculus, but if you are looking to save some money,Calculus: An Intuitive and Physical Approach\" by Morris Kline is an excellent book and it only costs about $20.", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KYRD5VUNR211"}}, {"Date": "on February 17, 2015", "Text": "A great book on the topic of Physics, although I didn't find the intended humor insertions all that humorous. But I didn't let it distract me from the ease of reading. It's very well written, concise and doesn't get too heavy-handed when discussing topics of rotational dynamics, simple harmonic motion, theory of relativity, etc.. The information can be absorbed well and won't feel intimidating to the most pedestrian of physics enthusiasts.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SQJ5YT7T7SE9"}}, {"Date": "on May 1, 2015", "Text": "After watching some of his FREE videos from the open Yale course on Physics, I thought this would be a good book to help me along.  It turns out, it is simply the FREE Yale videos in print form, almost word for word (even the jokes he tells).  I can't believe he is charging this amount when you can go online and download the videos free.  Save your money.", "Helpfulness": "", "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I5YMPTOKPAAJ"}}, {"Date": "on July 12, 2014", "Text": "At least every physics undergraduate should go through it!!!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VCDB40OP52NV"}}, {"Date": "on June 11, 2014", "Text": "I bought this to go along with his free video courses from the Open Yale Courses.  He has presented  Physics 200 and 201.  The book has instructions to get to those courses. The videos are classroom sessions that follow the book, mostly.  The material that comes with the videos include problems sets (and solutions), exams (and solutions) along with extra material.  Having the book adds to the richness of the some fifty videos for both Physics 200 and 201.  It has been long time since physics classes, so this book and the accompanying videos, are a way to get back into the subject, the math and the new concepts.  Not that I have been that successful, but the book does help.  I think that it is not that I have forgotten that much (OK, maybe a little), but that there is so much more physics now.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AU6XU66444S2F"}}, {"Date": "on February 23, 2015", "Text": "Unlike regular physics textbooks, this book is perfect as a refresher. It takes on the basic underlying concepts without beating about the bush, deriving formulas from scratch in a way you will never forget them. Works even better when you go through the Professor's videos on youtube first. That way, the physics never leaves your head.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYZXOHBK4RDH2"}}, {"Date": "on February 18, 2015", "Text": "Good place to start for readers with an interest in the subject. Basic knowledge of trigonometry and calculus required. Written in comic language with an air of intelligence that gives the impression that the author doesn't take himself too seriously.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ILLUCF6PDGL8"}}, {"Date": "on December 16, 2014", "Text": "Awesome, awesome book - easy to read, humorous and well done.  But also very complete.  Be sure to check out the open source lectures by the author on Yales online course site.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3M45OKUTL64A7"}}, {"Date": "on January 10, 2015", "Text": "Dr Shankar is one of the best Physics teachers I have ever attended lectures from. His book is a perfect summary of his course. I am awaiting his second part.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMEH2PTIR6AT1"}}, {"Date": "on May 7, 2015", "Text": "Very clear explanations. Even with the video's, it is nice to have this in printed form.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PNIATAFYN345"}}, {"Date": "on May 15, 2015", "Text": "The book is a special one !", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UZ3VZS16H639"}}, {"Date": "on July 7, 2014", "Text": "Deep reading", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25Q1J0O7YMM38"}}, {"Date": "on November 19, 2014", "Text": "Extremely well written, concise and understandable", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VI8QAMJ2RXEQ"}}, {"Date": "on July 18, 2014", "Text": "Great book, but you better kow your math!!", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WTDZ672TY1IO"}}, {"Date": "on April 15, 2015", "Text": "very good", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Y0OXOCUJ5AWN"}}, {"Date": "on September 9, 2014", "Text": "simple and as advertised. arrived in time", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HF1X66TRJ85M"}}, {"Date": "on September 16, 2014", "Text": "9245893150872810497266", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AT6AQJKPRW1P"}}, {"Date": "on November 9, 2014", "Text": "Prof. Shankar is one of the greatest teacher of science.  His professional yet human presentation captures the interest of his students.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7FJE09ZF08D3"}}, {"Date": "on January 24, 2015", "Text": "Redefining proper Physics study. Less is more kinda thing., rid yourself of the 2000 page text book..", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30L2GANM61NGQ"}}, {"Date": "on October 17, 2014", "Text": "Lucid, clear and beautifully written.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SRM0WAOG4GTI"}}, {"Date": "on August 2, 2014", "Text": "A fantastic exposition!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2F97CUJDQAAZD"}}, {"Date": "on September 4, 2014", "Text": "This is a great reference book to have in your library.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A283AQCDBGDBKZ"}}, {"Date": "on June 6, 2014", "Text": "Based on the reviews here, I had high expectations. I have to say I was kind of disappointed. The treatment is not any new or different from those appealing to non-mathematical readers, plus some equations sprinkled in. The Feynman's lectures are better.", "Helpfulness": 0.44, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A156N3AXWHLJD2"}}, {"Date": "on July 8, 2014", "Text": "I enjoyed parts of this book but the math concepts precluded my understanding the book.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A211X7KZKUKS1R"}}], "ReviewUrl": "http://www.amazon.com/Fundamentals-Physics-Mechanics-Relativity-Thermodynamics/product-reviews/0300192207/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.7 out of 5 stars"}, "OfferPrice": "$23.46", "Salesrank": "#17,110", "ListPrice": "$25.00"}