{"Category": "in Books (", "Name": ["507 Mechanical Movements: Mechanisms and Devices (Dover Science Books)"], "Timestamp": "2015-05-24 21:23:22.096755", "itemurl": "http://www.amazon.com/507-Mechanical-Movements-Mechanisms-Devices/dp/0486443604", "Reviews": {"TotalReviewCount": "231", "ReviewList": [{"Date": "on November 21, 2001", "Text": null, "Helpfulness": 0.9777777777777777, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on November 25, 2004", "Text": null, "Helpfulness": 0.9404761904761905, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADHAI4DX9IM4R"}}, {"Date": "on November 24, 2003", "Text": null, "Helpfulness": 0.8990384615384616, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37XGUQ1VH0XM6"}}, {"Date": "on June 2, 2006", "Text": "This book is primarily for experienced mechanical engineers or those with an innate talent for looking at drawings of mechanical devices and grasping the theory of operation. It is not a textbook by any stretch of the imagination. There are no equations, analyses of operation, or vector-space drawings as you would find in modern mechanical engineering textbooks. However, as an idea book for mechanical engineers at its very low cost it cannot be beat. The Amazon title page says it is copyrighted 1995. However, the book was written in 1868 and its content remains unchanged from that date of publication. The language is therefore flowery and somewhat archaic as you can see from the book's complete title: \"Five Hundred and Seven Mechanical Movements, Embracing All Those Which Are Most Important In Dynamics, Hydraulics, Hydrostatics, Pneumatics, Steam Engines, Mill and other Gearing, Presses, Horology, and Miscellaneous Machinery: and including Many Movements Never Before Published and Several Which Have only Recently Come into Use\". The book's format is quite simple: On one page you will see 8-10 drawings of mechanical devices. On the opposite page you will have a paragraph or so each describing those 8-10 mechanical devices. If there are any equations being spelled out it is done via prose, so you may need paper and pencil in hand to write in equation form what the author is telling you about the theory of operation. I think it functions well both as a history book for mechanical engineers and as a source of ideas of how mechanical devices can be combined to create more complex machines. I highly recommend it, as long as you understand what you are getting.", "Helpfulness": 0.9583333333333334, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2E3F04ZK7FG66"}}, {"Date": "on March 14, 2007", "Text": null, "Helpfulness": 0.8181818181818182, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1D3T5RNKOCAMM"}}, {"Date": "on July 19, 2005", "Text": null, "Helpfulness": 0.9411764705882353, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A276AFN1BZB09U"}}, {"Date": "on June 17, 2000", "Text": "This book is around for a reason, even though it is old. The movements cover a huge variety of shape and patterns.  The drawback is that the movemnt is shown in very limited form.  There is a word explaination with  drawings, but even still a single piscture may not be enough.  Great to  browse through and probably a handy referance for any one who is  mechanically inclined to produce their own stuff.  Fun book.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2A8HQC3I9RE5I"}}, {"Date": "on January 11, 2007", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HLKOESHGF5ZW"}}, {"Date": "on June 1, 2000", "Text": null, "Helpfulness": 0.9333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32754HB4AHQFX"}}, {"Date": "on May 27, 2006", "Text": null, "Helpfulness": 0.9230769230769231, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LY9ZWBRC7QS5"}}, {"Date": "on February 22, 2005", "Text": "...you must be dead. Simply a gem of a book. I've bought modern copies on two separate occasions to make sure I have it on hand, and I recently was lucky enough to find an 1879 copy. Apparently it was published in 1868, and by 1879 it was already into its 12th printing- couldn't happen unless a lot of people found it really useful. Buy a copy- you definitely won't regret it.", "Helpfulness": 0.875, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AW595ZZNO6P4M"}}, {"Date": "on July 6, 2011", "Text": "Before you go out and buy this book, you might be interested to learn that this rather ancient tome is no longer protected by copyright, and is available for free and LEGAL download from the internet (google books, for example). A lot of illustrations with not much in the way of explanation, but most of the drawings are self-explanatory. Worthwhile reference if you are into mechanical engineering as a career or hobby.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXF0D6XH9QZ8C"}}, {"Date": "on February 6, 2003", "Text": "Excellent soruce of lots of mechanical ideas. Even though they are from the 1800's, this a wealth of info for engineers and tinkers like me. This helps to understand and lay out simple and complex levers, gearing, and control mechanisms that would be difficult to find anywhere else. A most valuable tool for any engineering/design/shop library!", "Helpfulness": 0.9090909090909091, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QT5YOP8KWYHP"}}, {"Date": "on September 24, 2005", "Text": "This book is great! It is simple and informitive, there are tons of useful movements in this book. I thought that I knew how to make things move and do things, but i had no idea that you could do so much with just mecanical movements.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1A6VGWKHRIS8D"}}, {"Date": "on November 9, 2006", "Text": "I spent 4 years studying to be a Mechanical Engineer, and during that time, I never came across a book this freakin' cool.  If you think any kind of mechanism is cool, you'll fall in love with this book.  A must buy for mechanicians everywhere.", "Helpfulness": 0.8461538461538461, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17ZRJ4NVN8C4S"}}, {"Date": "on March 10, 2010", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8CF33LEC4QEX"}}, {"Date": "on August 15, 2006", "Text": null, "Helpfulness": 0.875, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ADXWV6TEB4O8"}}, {"Date": "on January 25, 2003", "Text": "This book is interesting, but IMHO, it has too many similar mechanical ideas/pictures and the picure quality is poor.  I understand those picture/diagrams are very old, and the printing itself is not the problem, but still, they could resize the diagram little bigger.", "Helpfulness": 0.7777777777777778, "StarRating": "2", "Author": {"ProfileUrl": ""}}, {"Date": "on September 5, 2007", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TC5F874ETYTQ"}}, {"Date": "on April 28, 2008", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A384WJ08TC64RW"}}, {"Date": "on April 5, 2008", "Text": null, "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IUFG3GB7THIR"}}, {"Date": "on July 22, 2005", "Text": "really useful if you are a backyard tinkerer and if not this is a cool little bedside book to browse through", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5D4PNHB1V3A3"}}, {"Date": "on February 20, 2009", "Text": "Another case of \"I should have found a copy to thumb thru first\".  Apparently all of the pictures in it have been copied directly out of a book printed around 1900.  I didn't see anything original in the book.  If you're a rank beginner perhaps it would help you a bit, but I'm just sorry I bought it.", "Helpfulness": 0.8, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TDRS0DBXF3KC"}}, {"Date": "on April 27, 2006", "Text": "As an inventor I have found this book most helpful to thumb through in idle moments when an idea might jump out.  I am always left desiring more comprehensive textual discussion of each mechanism.  It is good enough to get an idea of the mechanism but plan on searching the web for additional detail.  It would be more helpful if there was a discussion of the advantages and disadvantages of each mechanism with cross reference to alternatives.  3D pictures from a variety of angles would also be helpful.", "Helpfulness": 0.8333333333333334, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25ZPD2JQ8N4LA"}}, {"Date": "on August 25, 2006", "Text": "I work as a Mechanical Designer/Draftsman and a Home machinist. Both of which I have a degree in, This book is worth every penny. It is interesting, detailed, handy! Although small it is packed with interesting sketches. I must warn anyone interested that this book is intended for the heavily mechanically inclined.", "Helpfulness": 0.8333333333333334, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35CV6GP96PH5P"}}, {"Date": "on November 10, 2006", "Text": "This is a fun, old-fashioned IX century book about mechanical devices. It consists in drawings and extremely short descriptions. May be of some interest for do-it-yourself amateurs like me; some devices are of outstanding ingenuity, some others nearly absurd. Anyway, a pleasure to look at.", "Helpfulness": 0.8333333333333334, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALKK6LJFKMD78"}}, {"Date": "on May 11, 2008", "Text": "The illustrations are well done, many of the mechanisms are repeated. The descriptions are dated. All in all, I would not buy this book again.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34WE1N0RWXCYE"}}, {"Date": "on June 19, 2011", "Text": "This is largely a historical book with quick mention of a large number of mechanisms using diagrams from either patent documents or old publications. While many of these mechanisms are still relevant in mechanical engineering today, the presentaion style positions this book more as a coffee table curiosity than a reference book. I do recognise that it is a low priced book and therefore we should not expect too much from it.  It is, however, easy to be seduced by a title and have higher expectations.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19APJXZ077CA8"}}, {"Date": "on August 8, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AFOQASSOM0AG"}}, {"Date": "on October 24, 2009", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A206ZWZCCFAU1L"}}, {"Date": "on February 20, 2013", "Text": "Book I received seemed to be a cheap photocopy of the original...pages were poorly copied...I've seen home-made books that were bound better than this one.  Book is comprised of very old mechanical devices and movements...far too old to be of any use to any modern engineer.", "Helpfulness": 1.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SJ4LPM477TX4"}}, {"Date": "on April 3, 2011", "Text": "This small book has a good selection of ideas to extrapolate from. It works well with the McGraw-Hill Mechanisms and Mechanical Devices Sourcebook to solve for mechanism parameters & limits.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AGI38ZB3DA07"}}, {"Date": "on February 2, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UEMW2ZBBFPEY"}}, {"Date": "on May 24, 2009", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AR0PWDMLH0A7"}}, {"Date": "on September 29, 2013", "Text": "This is a thin, smallish book with small type and itsy bitsy pictures. It's meant to be a catalog of various standard mechanical solutions to common problems, for example changing circular motion into linear motion. The good thing is that it is fairly inexpensive and you haven't wasted a lot of money if it doesn't fit your needs. A mechanical engineer would have no trouble understanding the text and interpreting the drawings. However, a mechanical engineer is not likely to need this book. If your interest in the subject is practical, like the actual design and construction of a special purpose mechanical device, I suggest you keep looking. There's probably another title that will serve you better.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALTGO6OCTO9UM"}}, {"Date": "on January 8, 2009", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FGF758RP88CE"}}, {"Date": "on February 15, 2010", "Text": "This appears to be a reproduction of an old book of unstated vintage. My guess would be from the 1870 to 1890 period. The illustrations are a bit small and a bit crude... I felt a few of them were misdrawn enough to be unworkable as shown. A lot of the mechanisms shown are really basic things like simple levers or pulleys unworthy of space in a serious book. And the whole book is poorly organized. My advice is to save your money for the \"Ingenious Mechanisms\" series.", "Helpfulness": 0.75, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QK91G8NM5XI1"}}, {"Date": "on July 7, 2009", "Text": "This is a small book, my fault for not reading the dimensions. There are multiple (6 to 8) diagrams per page, so each figure is small. A bigger problem is that there is no context for the movements. One can follow how everything within a figure meshes, but you would be hard pressed to see how some of these would fit into a real machine. Also, there are many repeats with minor variations on mechanisms.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A260YO83YCEGDM"}}, {"Date": "on November 29, 2008", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1V8A59QEW0TDR"}}, {"Date": "on March 27, 2014", "Text": "I really love this book!  I run a robotics team, and they are always in search of gear boxes, axles set ups and beveling to make their complicated mechanics work. We're had some issues in the past with bad gear configurations, and I really think this will be a great starting place for the budding engineers to find the inspiration they need for their next great build.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38TC6WEKK92G4"}}, {"Date": "on January 4, 2014", "Text": "A great collection, but the descriptions are minimal at best.  Leaves a bit to be desired. I would have preferred more info on the more complex movements, as some are extremely hard to visualize with one or two pics.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AB4G1BFUNHOVB"}}, {"Date": "on March 10, 2011", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32B9VV94H7CZR"}}, {"Date": "on February 2, 2009", "Text": "This is a reproduction of a book originally published over 100 years ago.  There are a fair number of mechanisms presented with some explanation, but overall the ideas are now very dated and there are better books out there.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2C8COJUP281B7"}}, {"Date": "on June 9, 2014", "Text": "The information in the book is fine, but the book is about the size of a short paperback book.  It is quite small. It appears to be larger from the pictures and description. It is hard to see some of the illustrations.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29NWBCWKD9XGX"}}, {"Date": "on April 30, 2009", "Text": "Just leave it on the coffee table and see what happens. Who would have thought a book like this could provide so many people with so much entertainment! A feast for those who like to know how it happens on the inside.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3M1YDU1IX58NB"}}, {"Date": "on September 21, 2011", "Text": "I give this book a A+++ for content! but its a thin little catalogue looking thing, 7\" x 6 1/4\"... looks like it only cost 40 cents to make... The picture makes the  item look better then it is! Not worth the cost!", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FGE50OZTKNW1"}}, {"Date": "on February 18, 2012", "Text": "Really just a bunch of pictures and somewhat vague explanations of the movements and actions. It's just photo copies of a more outdated manual or handbook from a bygone era. Okay for ideas though.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29SOTX2WMKPPA"}}, {"Date": "on May 10, 2012", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DO59N0N0CRG6"}}, {"Date": "on March 19, 2006", "Text": "This book is great for engineer's, engineer wannabe's and those of us who like mechanics. It's not expensive but I would give it another star if it were priced a little lower.", "Helpfulness": 0.75, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HV31CHSW2JTE"}}, {"Date": "on July 6, 2013", "Text": "All of the pages were darkened, as if someone had done a poor job photocopying the pages of the original and then bounding it to look like a book.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FXOQ4UO7L7N3"}}, {"Date": "on September 7, 2010", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIDI1OR3BWGRU"}}, {"Date": "on February 6, 2011", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NRFBE8NS0USE"}}, {"Date": "on September 27, 2010", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RAH4X9QHPFYM"}}, {"Date": "on August 29, 2013", "Text": "I really enjoy this book. It is a very nice addition to the Ingenious Mechanisms set, or all by itself.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15DNW9MGVFAIP"}}, {"Date": "on December 12, 2009", "Text": "Buy this if you want your own copy to annotate, but you can download it in .pdf form from Google Books.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TJ7HQZPFWR9D"}}, {"Date": "on February 8, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JXRXYVSUAW6I"}}, {"Date": "on September 18, 2013", "Text": "I have read two other books on mechanisms, and they were good. This one, however, is worthless. The diagrams are not good, and the explanations of how the mechanisms work are not clear at all. If the mechanism is very basic, then the diagram and description are OK; but you won't learn anything new. If the mechanism looks intriguing, then it will remain that way. Also, the same types of mechanisms are repeated time and again. I wish I had not bought this book, and I cannot recommend to anyone.", "Helpfulness": 0.6666666666666666, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQMTZ5FZFXZOH"}}, {"Date": "on February 24, 2007", "Text": "Food for thought. What geniuses to think up all these mechanisms so long ago. Very good book.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NCC4XU5WGFOI"}}, {"Date": "on November 11, 2014", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KDRLIBWILPMJ"}}, {"Date": "on December 26, 2012", "Text": "This is a great book! It gives clear illustrations and descriptions of many fascinating mechanisms. Looking at the diagrams and descriptions and figuring out exactly how they work and how they might be applied is a fun brain exercise. I read some of the negative reviews and saw they were often misguided. This is not a textbook. It assumes you have at least a basic understanding of physics, especially mechanics. If you don't already have a pretty good understanding of such things, you will be disappointed, but for the rest of us this book is one of those books that you will have fun keeping it next to your easy chair going through over and over.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AUGWCYCZ1ROV"}}, {"Date": "on May 10, 2015", "Text": null, "Helpfulness": "", "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2A8NHRD1DIUPN"}}, {"Date": "on July 19, 2011", "Text": "This book is full of interesting mechanisms starting with simple, finishing with incredible complexity. I really enjoyed looking through all the mechanisms and I already have some ideas on how to implement them. Although, some of the drawings are too complicated to understand by looking at them, and the book doesn't go into extreme detail. One thing I did find useful is that quite a bit of the items had the name of the movement so you can do your own research on those particular ones. I'm quite pleased with my purchase overall.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3160NUVDY3UWY"}}, {"Date": "on May 12, 2008", "Text": "Keep in mind that this book 1) is paperback, 2) measures 6 1/4 inches wide by 7 1/8 inches tall, and 3) most every illustration is less than 2\" square. All the illustrations are clear - printed in a grid on the left handside with a SHORT explanation of what it does on the right. The movements are described, but a lot of them leave me wondering what the heck you'd use them for in the real world. Certainly not as detailed of a book as I was expecting, but a nice LITTLE reference. On with a search for something more detailed!", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1M9DFWFETHVVY"}}, {"Date": "on August 26, 2009", "Text": "The book \"507 mechanical movements - mechanisms and devices\" was a really nice surprise. I did not have great expectations when purchased it. One of my hobbies is making mechanical toys, in paper or wood, and I needed some information about mechanical movements. Since it came, I've had very few oportunity of reading it. Both my father and my husband  are using it too, for totally different purposes. I believe it's quality rely on being simple, and showing the basic and the principles.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2V5O35L0W88KZ"}}, {"Date": "on July 16, 2010", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AR59D281WC2VP"}}, {"Date": "on August 30, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37SVYKG9X5LEE"}}, {"Date": "on August 28, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACYPGPIJRF034"}}, {"Date": "on March 12, 2014", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZK16AV07HF4L"}}, {"Date": "on September 17, 2014", "Text": "At first look, the language is dusty and filled with obsolete jargon, but who cares? The illustrations are what make this book the real treasure to builders of any stripe. If you intend to set something in motion, twist, relieve pressure, spin, or slow something, there is an option in here for you. This small book is a must-have for anyone who creates a mechanical device. Worth every penny.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2X2OIRA2PH2XK"}}, {"Date": "on June 19, 2014", "Text": "This book is fascinating for young and old.  Some movements are easy to picture and understand, others are like mind benders making you really think and logically deduce how the mechanics work.  It may be a little book, but it packs so much into it.  Wonderful for anyone even remotely curious about mechanical movements and highly instructional to anyone needing to practically apply it.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AN2WGLX1TI5WF"}}, {"Date": "on February 10, 2014", "Text": "I love this little book.  I tried a couple other mechanical mechanism books after getting this one but this one is the best by far.  I'm amazed how many ways there are to move things that I would have never conceived of on my own.  I modeled one of the mechanism and printed it on my 3D printer and leave it laying on my desk at work.  Its a great conversation starter.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28D4GN4M7SX4O"}}, {"Date": "on February 28, 2012", "Text": "Clear drawings and terse explanations of gears, ratchets and similar mechanisms for nineteenth century nerds (myself included).  Useful if you're building clockwork mechanisms.  I finally understand how the same hook that dangles a heavy lifeboat can also easily release it (and it's the same hook that releases a catapult arm, yay!) Never going to be a thriller movie.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1W9G3UH0Y43BM"}}, {"Date": "on July 14, 2014", "Text": "OK", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AR9ETHBU5TP11"}}, {"Date": "on June 6, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARF9YF0HF5M3V"}}, {"Date": "on June 2, 2014", "Text": "I purchased 507 Mechanical Movements: Mechanisms and Devices by Henry T. Brown, to have a source of information and examples of the Mechanical Engineering device concepts to reference while using other texts and studying Mechanical Engineering in review.  I know the five hundred mechanisms and devices are in drawings and illustrations, rather than digital or CAD drawings, but you can spend a lot of money purchasing CAD drawn examples of this type.  Each of the mechanisms is illustrated with drawings and descriptions of how it is used.  This digital edition includes an handy index to the contents also.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3L1VJMHFWONCB"}}, {"Date": "on May 12, 2014", "Text": "It does not think for you, it does not do the building for you, it is a book showing 507 mechanical movements. It may seem old-fashioned to some (though I consider a reprint of an 1830s era book to have a perfect right to be as old-fashioned as it wants, harrumph!), but if you've worked with Meccano or anything similar, you can build the devices in minutes and actually see how things work. Why should the book tell you what you can already are?", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TRDPTMDGQKVE"}}, {"Date": "on April 28, 2014", "Text": "I found that maybe 20% of the mechanisms demonstrated in this book made sense to me.  There were several which sparked creativity.  I would expect that learning from these cases could lead to applications.  I know almost nothing about mechanical movements so for me it was my first exposure.  I wonder if this sort of book could be used to educate young minds in the ways to think and design \"mechanisms\" of all sorts.  I wish the book would have included a glossary that would define the major terms in the field.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37HE0DBJ6QZMH"}}, {"Date": "on March 12, 2014", "Text": "If there is other ways out there to move machinery I would be very surprised, a great book for the trainee engineer, fitter or anyone interested in mechanical movement.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EDO9X5DT4K4S"}}, {"Date": "on February 12, 2014", "Text": "This book is necessary for every would be mechanic, Engineer and Inventor.  It can give insight and answers to mechanical processes that are not easily envisioned.  It is utterly amazing", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11RXOCWMIMX9W"}}, {"Date": "on January 31, 2014", "Text": "bought this to help me steampunk a walking dress and some automaton accessories.  I wanted any gears involved to move and do some sort of work, and this has lots of diagrams of lots of common movements that can be repurposed.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2237OIOZPEN8M"}}, {"Date": "on January 4, 2014", "Text": "This provided useful information for a kinetic sculpture project.  The possibilities for geared mechanisms was very inspiring. The illustrations are clear and brief text describes the drawings.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QA4CDFI3E8MJ"}}, {"Date": "on December 23, 2013", "Text": "plenty of detailed illustrations and an eye opener for the average engineer. you know the feeling when you see something different and wonder to yourself \"what in the world were they thinking when they made that\"; this book is one of those moments 507 times in one little book on my kindle.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AS7R911I3JM2Z"}}, {"Date": "on December 9, 2013", "Text": "I like technical things, and, I really enjoy seeing the good thinking much of what we take for granted today has been build upon. This book provides a bit of a resource into some of those past useful ideas (that just might become useful again in particular situations).", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28MQVJZQE2WAE"}}, {"Date": "on November 22, 2013", "Text": "Good drawings along with an exhaustive collection of interesting approaches to mechanical movement. At this price it's a must have for engineers and tinkerers", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A341HDYG0EPA48"}}, {"Date": "on October 25, 2013", "Text": "Many old sketches of mechanical movements drawn well before the age of CAD.  The illustrations are clear and some of the mechanisms are ingenious.  Many quite obvious.  As a casual machinist this was a worthwhile expense and if I am in an airport terminal or something and need a quick, non-involving time-killer this works.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HSYB3SL5KPWW"}}, {"Date": "on August 3, 2013", "Text": "As a fast guide to designer, fantastic! I recommend to get all the series actually, and in Kindle it's even better!", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3WZTQHCPCDN"}}, {"Date": "on July 30, 2013", "Text": "Nice and handy when need to solve problems in mechanisms. Good for students and engineers. Calculations are up to you.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EMXYXWP11N4"}}, {"Date": "on June 29, 2013", "Text": "I enjoyed this book and would read more this is interesting to me, I`'ll look forward to more books like this", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32X3457R1N06V"}}, {"Date": "on June 9, 2013", "Text": "This book has some of the wildest gear sets that do things that I did not know could be done with gears!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQECUEAXG089K"}}, {"Date": "on March 25, 2013", "Text": "Of interest to young and budding mechanics. Perhaps we do not realize how old some mechanisms are, or what can be done with levers and cogs etc.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARV0SJ8K68PE1"}}, {"Date": "on March 24, 2013", "Text": "If you like making new machines or preparing or restoring old equipment this BOOK will help solve many problems.  If used with paitience you can find a solution to almost any mechanical problem with a lineshaft or a jack staff, a WATER WHEEL.  As a reference for historical research it is a useful tool. Add it to your bookshelf!", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1D27J9YD2SNRJ"}}, {"Date": "on February 18, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PUCLZ2R0LLBH"}}, {"Date": "on January 26, 2013", "Text": "This was a reprint of a book that I tried to get hold of for years. It is great for us tool historians", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASHMEBTGNOGXH"}}, {"Date": "on November 17, 2012", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3U2OFT07JIU9J"}}, {"Date": "on May 10, 2012", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EGSZ3AQZOE8N"}}, {"Date": "on September 25, 2014", "Text": "If you would like to make things that move, this is an excellent source for ideas and drawings. It has drawings and descriptiond of msny ways to get movement or mechanical power from one place or kind to another. This is a copy of a book written many many moons ago and each drawing is easy to understand. Highly recommended  for makers.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1V8MTXII2HG0B"}}, {"Date": "on August 24, 2013", "Text": "great learning tools to have at work. when you are developing new proto types these kind of books really help the process of putting the machines into a working concept in your head and that makes it way easier to put it down on the design software. gives you a better sense of direction. not always but still great learning tools", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A230IATT2I5JAI"}}, {"Date": "on November 25, 2012", "Text": "If you are at all interested in mechanisms, this is a great book.  It's really not that practical, but it's neat reading a book (and looking at all the diagrams) that was originally written in the 1800's.  One more thing, I wasn't expecting it to be so thin.  Basically 10 \"movements\" per page, so it's a pretty small book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IJ22RQP0KP93"}}, {"Date": "on June 8, 2011", "Text": "Some of the movements described are really interesting. Clever, and often non-obvious. (Who'd have thought square gears could be useful.) Occasionally I wished for just a bit more explanation, but only a few times. I can imagine that the audience for the original of this was expected to be mechanically inclined.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1S0NVEWPJ6GZQ"}}, {"Date": "on February 5, 2014", "Text": "I was hoping to find mechanisms to help me design working sculptures and figures. These illustrations are extremely unclear as to how to implement the devices. It was not worth the small price to me, I studied each one, the easy ones are already known to everyone, the others are obscure as to how to make.", "Helpfulness": "", "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APA1FKFTR5FWL"}}, {"Date": "on December 19, 2014", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HRECTEMLDBIL"}}, {"Date": "on February 9, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MP1A2AIQX9W3"}}, {"Date": "on May 17, 2014", "Text": "The pages are smaller than I would have them, but the pictures and the articles that explain the processes and functions are well done. For those who need a primer on how devices work and their applications to a limited extent, than you would do well to have this little book in your library.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PBYRQ9L6Z852"}}, {"Date": "on June 17, 2013", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OZJV82H6U76O"}}, {"Date": "on February 26, 2013", "Text": "I love this book.  I have others with 2000 plus drawing, but this one is the one that I come back to.  I've tried to implement some of the drawings in LEGO, and really want to try to do some of them in wood.... I share the book with 4th graders and they love it too!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYODOFIBE8MM8"}}, {"Date": "on October 16, 2011", "Text": "...if you are completely autistic like I am. I would have personally laid less images and other material per page. Nevertheless, I liked the book a lot. I like old mechanical things, chronographs and steam engines, so possibly this was made just for me.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BPB3J1HYT42L"}}, {"Date": "on May 15, 2015", "Text": "Book is made up of pictured movements, which is fine however its not enough, I was looking for some sophisticated motions and this book covers between 3 - 5 popular movements for each device, recommend purchasing the 1800 mechanical movements book.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4QJ76XK8C18V"}}, {"Date": "on February 28, 2007", "Text": "This baby is a real gem at ~8 bucks.  Lots of really neat stuff and from the late 19th century.  This is a great little book if you are trying to get some inspirational ideas.  I think that the diagrams are neat - they look like woodcuts.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3E9ECU63D703A"}}, {"Date": "on August 4, 2013", "Text": "This book is fascinating and educational but in a way that is understandable to both men and women.  Sometimes mechanical projects scare women away, but the way that Mr Brown has written this book is understandable.  Highly recommend it!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DWPO86GWH685"}}, {"Date": "on January 16, 2013", "Text": "I design machinery for a living, so I always look for better ways to do things.  This works well on the coffee table.  Many of the mechanisms are obsolete oddities, but many are useful.  It's good to remind yourself of basic principles.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NSCNYYA2XVNR"}}, {"Date": "on January 11, 2014", "Text": "I purchased this book as an addition to my reference library. Appears to be chock full of interesting information.  Needs to have more information on calculating leverage and mechanical efficiencies, but otherwise an excellent book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1O7GKN3IQY6B0"}}, {"Date": "on January 22, 2013", "Text": "I thought I wrote a review on this ?? Just what it says. A hole bunch of mechanical movements with how they work in text, all in one nice little booklet. This to me is a book hard to fine and it takes so little room in my book case.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23QUBDXVG578P"}}, {"Date": "on February 28, 2015", "Text": "It's about what you'd expect out of a republished older book. Interesting/quirky, but some of the copied pages are difficult to read. Overall, the quality of it is certainly five star, just loses a star for clarity of the printing.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MUTW9IHINADO"}}, {"Date": "on October 4, 2013", "Text": "How stuff works 1920's style. Book has illustrations of how some funny machines work. In an age were people think all the innovation is in software design this reminds the reader that mechanical design has been around a lot longer.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2P8VR15M96KM5"}}, {"Date": "on January 24, 2014", "Text": "This book is real neat, it shows many things we take for granted and shows how they work, It is a one of it's kind, a look into the past, present, and future all in one book. See what you get from it, it will jog your mind.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A246ECVNXCF6WR"}}, {"Date": "on December 26, 2013", "Text": "This book surprised me! Collect perfectly different types of mechanical movements that have proven over the course of history, from the simplest to the most complex. I love this book! It will be a legacy for my son.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38BMLQ7RCVUN"}}, {"Date": "on May 31, 2013", "Text": "I hope this will give me some ideas for wood working projects, it looks like a very valuable resource for engineers and mechanics as well as tinkers like myself.  Sometimes old technology can solve new problems.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARR24DTH0U97P"}}, {"Date": "on April 29, 2013", "Text": "I was very pleased with this product. It a very accurate representation of the color displayed on the site. Also, it is very difficult to find similar item in a retail store Finally, cam when it was estimated", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12JW0O7TEMLF4"}}, {"Date": "on April 23, 2014", "Text": "Great little book for hobbyists and tinkerers. Have replicated several of the mechanisms in the book, tons of great inspiration for projects. Also great for explaining basic mechanic principals to my kid.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RLD48LIW01D0"}}, {"Date": "on December 14, 2014", "Text": "Wow, very good and very detailed book with great illustrations and discriptions on how gears and thing move!  I use it as a reference all the time for building small moving automation toys.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1F8VHWAO30NP4"}}, {"Date": "on March 4, 2014", "Text": "Too many non-circular gears, variations on cams, variations on clock escapements, not enough discussion of why one option would be prefered over another.  No design math. Copyright 1896.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Q0KT2ZBC95MY"}}, {"Date": "on September 3, 2011", "Text": "SOME OF THE MECHANICAL MOVEMENTS I DID KNOW ABOUT. MOST I DID NOT. FASCINATING. I HAVE ALWAYS BEEN MECHANICALLY INCLINED AND AM APPRECIATIVE OF THIS BOOK. THANKS! AMAZON IS A GREAT LINK!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PLTHXQGBG92U"}}, {"Date": "on February 16, 2015", "Text": "Interesting collection of illustrations showing how mechanisms work like they do. Nice to have the pictures and descriptions together so you can visualize the mechanisms in motion.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFLKI2YYA2RM4"}}, {"Date": "on January 14, 2012", "Text": "this book is fantastic for starting out on mechanical engineering knowledge and to use small scale ideas in real world problems ranging from the very complex to the very basic.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WERRNTIZYYWT"}}, {"Date": "on April 19, 2014", "Text": "A gift for my husband.  It is an interesting wandering into the various mechanical operations of things I had no idea about.  Interesting with some good drawings and pictures.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANO453594L7JX"}}, {"Date": "on October 18, 2013", "Text": "I was trying to find out how to make wooden gears for a project at home! This book has more gears than I've ever seen! I would recommend it for a historical reference as well!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QIBIITX1ZSTI"}}, {"Date": "on October 26, 2014", "Text": "The book is real basic. It shows an illustration followed by a paragraph or two about it. On some I think could have gone into more detail. But great for reference and price.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FDB5ZMVJYANF"}}, {"Date": "on January 4, 2013", "Text": "Great info book on the subject........this is a good book for the weekend warrior too, who wants to understand how gears ect work. Fast delivery and book was clean as noted", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KPP66D6K8B73"}}, {"Date": "on February 16, 2012", "Text": "It has a lot of devices but only one picture per device and explained only in a couple of lines. Some pictures are blurry and difficult to understand. Just my opinion.", "Helpfulness": "", "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AY3WMZNAM79PV"}}, {"Date": "on January 19, 2014", "Text": "I am a mechanical engineer, and though this book only shows images and a short few lines on the mechanism's intended purpose, it allows the mind to think and invent.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABBT3O4PLXC50"}}, {"Date": "on May 6, 2015", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A78GDRR7XAZK9"}}, {"Date": "on August 19, 2014", "Text": "Old school mechanical devices isn't really my area.  I just thought I'd see something useful.  I did and this book helped me get to sleep on more than one occation.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHG6BT3T8F68O"}}, {"Date": "on October 18, 2013", "Text": "Simple line drawings of a wide range of mechanisms with an absolute minimum of any explanatory information. I find it interesting and very thought provoking.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AM1LDK6ADEAP"}}, {"Date": "on August 2, 2014", "Text": "Excellence in illustration of most useful mechanical devices up to basic engine components.  I learned a lot very quickly, and keeping it for reference.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1C83CM59R6H8H"}}, {"Date": "on August 17, 2013", "Text": "Being a mechanical engineering major and a lover of mechanical movements, I find this book to be very intriguing. You won't regret the purchase.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30UM26VCYIZTW"}}, {"Date": "on December 28, 2012", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AH0J60E6W2YZ5"}}, {"Date": "on June 6, 2013", "Text": "arrived good job cud's it is silly i have to spend time and write 14 words instead of keeping it simple and saying great job it came-I am happy", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HOXUQJ6FYAOS"}}, {"Date": "on February 27, 2014", "Text": "Good read, Worth the price of ownership, some of the illustrations are a little hard to see, of course some of them are of very old devices.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1V54CHH9JVXY6"}}, {"Date": "on January 20, 2009", "Text": "a descent primer for those wanting to be inspired.  Not impressive but a good way to get some insight into some simple ealry 1900's gadgetry", "Helpfulness": "", "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FWIMNRYOE0NW"}}, {"Date": "on July 8, 2013", "Text": "An interesting historical document, but the diagrams are pretty basic, and could use more visual description of the resulting movements.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TFFQF9SC2SBA"}}, {"Date": "on June 5, 2013", "Text": "Overall, a good reference book. Book format size is good, very usable, very limber. The movement explanations are easy to understand.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3W0KZB8OOI8W3"}}, {"Date": "on April 25, 2013", "Text": "I really like the simplicity and the arrangement of the book and only wish Henry could have given me more. Thank you Mr. Brown. Today", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2S1DWUSMJY3FQ"}}, {"Date": "on January 12, 2014", "Text": "If you've considered the ingenuity of early inventors, this is a catalogue of mechanical innovation. I wanted it for collages.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19YDEQSUT69IF"}}, {"Date": "on November 30, 2012", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3O89Z9349BV0F"}}, {"Date": "on April 28, 2008", "Text": "What more can be said about this essential book for all gizmologists?  This is a great book just to get the brain working.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IUOTZP763SJN"}}, {"Date": "on February 23, 2015", "Text": "I think what is the most important part of the book is how to explain the various types of movements and plains and axis.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29G6RJYM1YGJ3"}}, {"Date": "on May 18, 2014", "Text": "This is one of the books that helps you build and understand how to make automatons.  Many photos for easy understanding", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3J4B3LIIJUGF1"}}, {"Date": "on February 7, 2014", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A679IS4ZVO9NC"}}, {"Date": "on May 10, 2013", "Text": "and good book for people who don't grasp how things work. interesting book about the origins of mechanics. detailed pics", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1R7Q3AGW3RHFN"}}, {"Date": "on February 27, 2015", "Text": "I love the drawings in this book. Paper copies have been hard to locate. When the e-book became available I grabbed it!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QGSDRHCASBV0"}}, {"Date": "on May 24, 2013", "Text": "It's fun to browse through this book and see how the engineers of an earlier generation met their technical challenges.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3472MQD8BEP75"}}, {"Date": "on July 2, 2013", "Text": "Horrible sketches with zero explaination about how it really works.  Not worth the money or the paper it's printed on.", "Helpfulness": "", "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OR8X7GJBBJEP"}}, {"Date": "on December 27, 2012", "Text": "Highly recommend this small book on how things were designed in the early years of inventions to make life easier.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3H3RXU2P6XLOO"}}, {"Date": "on November 21, 2013", "Text": "Great item with no problems and seems to be just what I thought it was when purchased. Would buy again if needed.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15J1O9XW80UX"}}, {"Date": "on September 1, 2006", "Text": "This book is a huge disappointment.  The cover is modern and promises a high-quality treatment of an interesting subject but the inside is ridiculously simplistic and leaves an awful lot to the reader to figure out on his own.  The extremely abbreviated text is arcane and the \"pictures\" are no more than primitive line drawings.  In many cases, this is woefully inadequate to understand what's going on.  This 1868 book belongs in the \"Antiques\" section.  It was a huge disappointment and simply annoying.", "Helpfulness": 0.6363636363636364, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31RJB41KN5FBT"}}, {"Date": "on December 10, 2014", "Text": "Excellent book for kinetic sculptures ,clock mechanisms, automata or other practical or entertaining projects.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1N619ER4P1W2T"}}, {"Date": "on January 1, 2013", "Text": "Glad I didn't pay too much for this. The pages are photocopied (poorly). I could have made this in my garage.", "Helpfulness": "", "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A135053J62CJKD"}}, {"Date": "on November 18, 2014", "Text": "Very Easy to read and understand. Appears to Cover a little of everything!  and will stand the test of time.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AV68T9P46K718"}}, {"Date": "on June 30, 2013", "Text": "nice job getting it to me as promised. a great little book if this kind of stuff interests you. enjoy", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVN6DGV93LUSZ"}}, {"Date": "on October 3, 2014", "Text": "Its great for what it is. Its so old that I think you can find it for free on the internet though.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AY0LXDB5AV6K7"}}, {"Date": "on May 1, 2015", "Text": "You will go cover to cover before you put it down! Old world lit and prints but very entertaining", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATM56M5MLF7PG"}}, {"Date": "on December 17, 2013", "Text": "I have skimmed through the book a few times and have added it to my list of books to read.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SMA1O26JGSNS"}}, {"Date": "on January 3, 2013", "Text": "I got my order fast and in it was in good shape. I would use them again for my next order.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2R1UQQWVPTMVY"}}, {"Date": "on July 5, 2014", "Text": "It would bore most casual readers but I loved this book as reference to old times Can_Do!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JV2YNXW2DVLO"}}, {"Date": "on May 25, 2009", "Text": "The title tells it all. This book is so handy for the person who likes to make things.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A206DDRYJ93KG7"}}, {"Date": "on September 15, 2010", "Text": "Exactly what I was looking for. Enough detail to allow me to implement the movements.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30WFB0ETUW0Q7"}}, {"Date": "on December 5, 2014", "Text": "Very interesting.  Be sure to look at the moving examples on the internet.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DNQBC8WK44S2"}}, {"Date": "on October 29, 2014", "Text": "Gave as a gift. No feedback from that person. Arrived in tip top shape", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A340FF5RVKPSKW"}}, {"Date": "on May 30, 2013", "Text": "A sad reprint - poor diagrams - this could have been great.  Many classic mechanisms have been overlooked.  No lever! no inclined plane!", "Helpfulness": 0.5, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3P635WP87B85C"}}, {"Date": "on January 30, 2015", "Text": "ok for simple introduction say late 1960's through mid 1970's :-(", "Helpfulness": "", "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14AAQBRP1R49Y"}}, {"Date": "on January 8, 2015", "Text": "A great primer for mechanical engineering. Good source for ideas.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALN88EUSYS7KJ"}}, {"Date": "on December 27, 2014", "Text": "Not as inspiring as expected. REALLY basic stuff in my opinion.", "Helpfulness": "", "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1L6WK23MM6F8H"}}, {"Date": "on December 19, 2014", "Text": "Kept me busy for hours, Good book for the mechanical minded.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29TR9XHU7AFKR"}}, {"Date": "on August 26, 2014", "Text": "awesome cheap book for a mechanical engineering friend.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2P76HD2H09MRM"}}, {"Date": "on August 18, 2014", "Text": "Great book, great explanations, easily understandable.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VA73W6XAOITV"}}, {"Date": "on March 16, 2015", "Text": "not really what i expected.  but it is full of info.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3B6NNMLII9XFQ"}}, {"Date": "on March 24, 2013", "Text": "This book contains no technical or descriptive information, it is mostly line drawings and old photos with little more than the device name.", "Helpfulness": 0.6, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKBFI49QK96S5"}}, {"Date": "on February 19, 2015", "Text": "Gave it to my g'son who is a budding engineer.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JR6FL6JYVI8P"}}, {"Date": "on February 19, 2015", "Text": "Great book to have when creating mechanisms", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2O0VC6QY2PMOU"}}, {"Date": "on May 5, 2015", "Text": "interesting read for mechanical movements.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QWVLDHNZGD2"}}, {"Date": "on February 3, 2015", "Text": "JUST RIGHT, GOOD PRICE. THANK YOU, REV. TC", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AWOVNYJAZDF1"}}, {"Date": "on December 19, 2014", "Text": "Great info for model makers and tinkerers.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BW21O178FPUI"}}, {"Date": "on September 1, 2014", "Text": "Nice reference book. Not highly detailed.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMZYVZBIMD7LY"}}, {"Date": "on March 9, 2015", "Text": "Item just as described. Fast delivery.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1L3XZKFZW8SE5"}}, {"Date": "on April 26, 2015", "Text": "lots of interesting items in the book", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXDU08YUY9XXV"}}, {"Date": "on November 1, 2014", "Text": "As an artist I find this VERY useful.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AY33KYK048PO"}}, {"Date": "on May 12, 2015", "Text": "Wow... what a book. Very Impressive.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NR94QXE2ZWY7"}}, {"Date": "on February 28, 2015", "Text": "A fun book, whith cool small Things.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OHGPVYQTCQI0"}}, {"Date": "on February 3, 2015", "Text": "Easy to understand and informative!", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PZ2294ZDBS76"}}, {"Date": "on November 17, 2014", "Text": "This is a fun and interesting book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GR0GN26M1YOX"}}, {"Date": "on April 23, 2015", "Text": "Godd excercise for the imagination", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14ZX62A50JNJT"}}, {"Date": "on January 28, 2015", "Text": "its just illustrations, no insght", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34RULIGY47UQE"}}, {"Date": "on May 12, 2007", "Text": "good book for someone that can identify mechanical parts, movements, and processes from diagrams only.  the book has very little text to explain diagrams", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AEXFHZTMVY98"}}, {"Date": "on August 30, 2014", "Text": "Very nice and educational book!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29V9CAQN9APH5"}}, {"Date": "on September 5, 2014", "Text": "good photos with explanations.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFZTO05KTGVAV"}}, {"Date": "on January 23, 2015", "Text": "Slim volume, clean drawings", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADLIVI3TCKOHJ"}}, {"Date": "on July 16, 2014", "Text": "It is what it says it is.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32BWWJBY0JETM"}}, {"Date": "on November 18, 2014", "Text": "A LOT OF PICTURES  NOT MUCH ELSE. NOT GOOD FOR IN DEPTH INFO ABOUT ANY PARTICULAR TYPE OF MECHANISM", "Helpfulness": 0.5, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TZQUXJEZTQUZ"}}, {"Date": "on March 5, 2015", "Text": "received as requested", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GTX7M1NPLMY9"}}, {"Date": "on January 6, 2015", "Text": "not much here for me", "Helpfulness": "", "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IRWBYF5P5O6G"}}, {"Date": "on August 14, 2014", "Text": "Reference booklet.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22U0P9O1GSMN0"}}, {"Date": "on November 5, 2014", "Text": "Interesting book.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARDP36UY04GXD"}}, {"Date": "on February 12, 2015", "Text": "AWESOME BOOK!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27I05964V03C6"}}, {"Date": "on August 16, 2014", "Text": "as advertised", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGYDC4UNMLGQ9"}}, {"Date": "on July 31, 2014", "Text": "As advertised", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AN651O7Y3GKNO"}}, {"Date": "on January 30, 2015", "Text": "Good product", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15UXQOOJ0TL8K"}}, {"Date": "on March 22, 2012", "Text": null, "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CI7PRZ33QV3Y"}}, {"Date": "on January 23, 2015", "Text": "fascinating", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17ZMLC5X3BVYN"}}, {"Date": "on May 11, 2014", "Text": "useful book", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AU2T4IPVFK3V7"}}, {"Date": "on February 27, 2015", "Text": "good stuff", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2011VQB7GJY65"}}, {"Date": "on July 16, 2014", "Text": "Wonderful!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31C9T1C03CDK1"}}, {"Date": "on August 15, 2013", "Text": "Modern Humans simply do not realize how more stupid they are becoming day to day.  Basic knowledge and know how that any ruth human knew centuries ago are now totally unknown to modern civilized humans.  What has tecnology made to us?", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SKJYHMXQXWUI"}}, {"Date": "on April 7, 2013", "Text": "A lot of mechanics, but most of them are old and might be obsoleted nowadays. For the price, it is ok to take a look.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HZP5XND9T6FW"}}, {"Date": "on March 18, 2015", "Text": "Excellent", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PFQ8GCLTY7I2"}}, {"Date": "on April 25, 2015", "Text": "Love it.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADJ8SQTBNUDJR"}}, {"Date": "on March 9, 2006", "Text": null, "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3Q95BE66KD8ET"}}, {"Date": "on May 9, 2007", "Text": "a practical book showing the most common movements explained in an easy and direct way.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20FHRWKV8D8Z5"}}, {"Date": "on February 2, 2015", "Text": "Good.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AA2LVLZ27PA1"}}, {"Date": "on January 17, 2015", "Text": "Waste of my time and money. It is an insult to my intelligence! Poor illustrations, repetitive illustrations. Many examples are the same, with very minor variation. Save your money.", "Helpfulness": 0.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A356T7K90GTAJD"}}, {"Date": "on March 1, 2015", "Text": "good", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FPXXNF1YJNR4"}}, {"Date": "on February 15, 2015", "Text": "good", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2P7QQKYK62HR6"}}, {"Date": "on August 10, 2014", "Text": "good", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UPIHZ4I0101N"}}, {"Date": "on October 15, 2014", "Text": "it just showed drawings of mechanical movement, not how it is applicable to projects or uses!! not really good!!!!", "Helpfulness": 0.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38R050XG09NC3"}}, {"Date": "on October 15, 2014", "Text": "Lame book.  The authors could have put a little more effort into their descriptions.", "Helpfulness": 0.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RILEKX9XQR9U"}}, {"Date": "on February 26, 2011", "Text": null, "Helpfulness": 0.3333333333333333, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28V5A5OMRPPX3"}}, {"Date": "on February 28, 2015", "Text": "Ok", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VE0YVAL9A6T4"}}, {"Date": "on July 21, 2014", "Text": "ok", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23VIJ1O8WKPTV"}}, {"Date": "on May 4, 2011", "Text": "I was hoping this book to show me mechanical movements that i could under stand. The pictures do not give good detail and after reading for each picture you still dont know what there talking about. I was looking for some thing to show me the movement on things and how stuff works", "Helpfulness": 0.4, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I9PQWPTHM4WV"}}, {"Date": "on March 24, 2006", "Text": "it has too many similar mechanical ideas/pictures and the picure quality is poor. I understand those picture/diagrams are very old, and the printing itself is not the problem.  My desires were for documentation on the mathamatics of design, not simple drawings with a paragraph of description.", "Helpfulness": 0.5, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RT45E7M2Z6Q0"}}, {"Date": "on December 25, 2003", "Text": null, "Helpfulness": 0.47619047619047616, "StarRating": "1", "Author": {"ProfileUrl": ""}}, {"Date": "on January 18, 2007", "Text": "Un très joli livre technique illustré comme au 19ième sciècle avec une multitude de planches décrivant autant de mécanismes. Chacune des cinq cent situations laisse imaginer un mouvement insolite. On en redemande...", "Helpfulness": 0.2, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17ESQTIXF6LVD"}}], "ReviewUrl": "http://www.amazon.com/507-Mechanical-Movements-Mechanisms-Devices/product-reviews/0486443604/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.0 out of 5 stars"}, "OfferPrice": "$8.89", "Salesrank": "#18,273", "ListPrice": "$8.95"}