{"Category": "in Books (", "Name": ["Mathematics at Work"], "Timestamp": "2015-05-24 23:11:19.742103", "itemurl": "http://www.amazon.com/Mathematics-at-Work-Henry-Ryffel/dp/0831130830", "Reviews": {"TotalReviewCount": "5", "ReviewList": [{"Date": "on October 25, 1999", "Text": "I went hunting for a book that had all or a good amount of the mathematical formulas/procedures explained in an easy to understand format.  This is the book.  I needed to brush up on my math from basics to calculus  and this book has made the task easy.  It's the type of book I would keep  next to the encyclopedias in my library but I carry it with me every where  I go.  An electronic version of this reference would be a nice addition.", "Helpfulness": 0.9545454545454546, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2R73OULR42SC7"}}, {"Date": "on November 27, 2007", "Text": "The title of this book might be misleading. \"Mathematics at Work\" would lead you to believe it is about applied mathematics. Instead, it is more about the math needed to solve certain basic mechanics problems. The math reviewed at the beginning of the book is simple arithmetic, algebra, geometry, and trigonometry. From that point forward the book is about briefly describing various problems in mechanics and how the mathematics described at the beginning of the book is used to solve these problems. I wouldn't recommend the book for students. If you are studying mechanics in either engineering physics or statics class, the math reviewed will be something you have a very recent handle on, thus the book won't help much. However, if you are already a practicing engineer and need to review either mechanics or math through trigonometry, it might help. You will have already studied both of these subjects, but you might need a refresher. The book is well illustrated with plenty of clear examples. There is very little mentioned in the way of calculus or problems that require it, thus the mechanics problems covered here are not very advanced.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2E3F04ZK7FG66"}}, {"Date": "on December 25, 2007", "Text": "Excellent book for the person that does a lot of do it yourself work.  Can also be used by the person who enjoys mathematical relationships between objects.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GDPB4W1YUCUP"}}, {"Date": "on March 20, 2014", "Text": "This is all the math you will ever need.  Very well written and easy to read.  High-school and college students should not be without this book.  Professionals, especially engineers, that do not have this book are doing a great injustice to themselves.  Math challenged?  You will be surprised what you will learn quite easily from this book.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATLF7IG4T1E1S"}}, {"Date": "on February 23, 2002", "Text": null, "Helpfulness": 0.2, "StarRating": "3", "Author": {"ProfileUrl": ""}}], "ReviewUrl": "http://www.amazon.com/Mathematics-at-Work-Henry-Ryffel/product-reviews/0831130830/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.2 out of 5 stars"}, "OfferPrice": "$28.45", "Salesrank": "#623,021", "ListPrice": "$29.95"}