{"Category": "in Books (", "Name": ["Apollo 11: The NASA Mission Reports Vol 1: Apogee Books Space Series 5"], "Timestamp": "2015-05-24 23:19:06.250912", "itemurl": "http://www.amazon.com/Apollo-11-Mission-Reports-Apogee/dp/189652253X", "Reviews": {"TotalReviewCount": "13", "ReviewList": [{"Date": "on July 26, 2000", "Text": "Of all NASA Mission Reports; the one on APOLLO 11 is the best and most exciting! I'm sure you can figure out why!  Next to the book: FIRST ON THE MOON; I'm using APOLLO 11'S ist volume and volume 2(nasa mission  reports) to represent all the other mission reports! You cannot; for the  money; find more information and hundreds of beautiful; priceless photos  of each mission; each mission report is priceless in itsself!  Robert  Godwin and NASA has really done a tremendous job on these reports; and  thank goodness they have finally came out! To me, a big APOLLO fan, this is  the next best thing , than having each book filled with real Moon rocks,  and the men who went there! P.S.: And the CD that comes with each book on  each mission has hundreds of photos; both in black and white; on lunar  surface, and in Lem as well, including orbiting the Moon, and showing  beautiful pictures of Earth! I simply do not know how you; Mr. Godwin and  NASA did it; but thanks so much for these mission reports!  They are  truly worth the money! Areal bargain for  sure!  I loved the Apollo 11 volumes 1 and  2 so much; that I purchased 4 copies of each; to put back for my son and  relatives, to always remember 1st lunar landing by!  I'm so looking to the future Apollo missions to come; and especially the  x-15 mission reports as well this Fall! They just cant come fast enough:  they're great! Thanks Mr. Godwin and NASA! many thanks indeed!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7366B6LZJCVT"}}, {"Date": "on August 19, 2006", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AO08WOIFUU7RR"}}, {"Date": "on February 17, 2000", "Text": "Anyone who has an interest in the history of Apollo will want this book.  The QTVR of the landing site on the CD-ROM is absolutely killer.  The QT movies on the CD-ROM remind me of something you'd see in a high-school  science class (all you need is the sound of the projector), but they were  still entertaining.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on June 16, 2006", "Text": "This is the first of 3 Mission Report volumes for Apollo 11 from Apogee Books.  It is a priceless collection of mission reports, press kits and interviews from both before and after the historic flight.  It also includes a CD ROM.  All reports are reproduced with great care and give the reader an impression of what it must have been like to receive these items when they were first released by NASA in 1969 (although some were declassified a few years later). Apogee Books should be applauded for their efforts to preserve these great documents for present and future generations.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NBJXRKP37RAU"}}, {"Date": "on January 5, 2000", "Text": "Great book!  If you are a collector of Apollo books, you must get this for your bookshelf.  Very detailed diagrams, charts and graphs.  The CD Rom is excellent too with 1400+ pictures from the mission.  I am working on  collecting the whole series!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXA2SFQLC7HL6"}}, {"Date": "on September 4, 1999", "Text": "This book and its CD Rom is not only full of the most interesting information I have seen on the subject. But the CD Rom is a masterpiece of modern technology's ability to show what it was really like at Tranquility  Base. The Quick Time videos of the landing site makes one feel like being  in a movie. Outstanding!!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on June 15, 2006", "Text": "This 3 volume series on Apollo 11 is a treasure of information on this historic flight of the Apollo Program. The CDs are a wonderful addition with incredible resources for use in the classroom. As a high school science teacher, it is wonderful to have these great resources!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27ZEY75O8ITPA"}}, {"Date": "on September 18, 1999", "Text": "If you like technical books about the space program, you will like this one. This is the first time I have found a publication so full of facts on the Apollo missions in one book. I plan on buying the entire series.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on February 15, 2001", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I0422Z9IK7OX"}}, {"Date": "on February 28, 2002", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A112R6SVDDLK6J"}}, {"Date": "on December 2, 2010", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11JMMUU3WH034"}}, {"Date": "on December 23, 2000", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3C3Z46127UG6S"}}, {"Date": "on December 14, 1999", "Text": null, "Helpfulness": 0.5, "StarRating": "2", "Author": {"ProfileUrl": ""}}], "ReviewUrl": "http://www.amazon.com/Apollo-11-Mission-Reports-Apogee/product-reviews/189652253X/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.5 out of 5 stars"}, "OfferPrice": "", "Salesrank": "#1,085,936", "ListPrice": ""}