{"Category": "in Books (", "Name": ["Shale Gas: The Promise and the Peril (Rti Press Book)"], "Timestamp": "2015-05-24 23:28:12.752116", "itemurl": "http://www.amazon.com/Shale-Gas-Promise-Peril-Press/dp/1934831107", "Reviews": {"TotalReviewCount": "28", "ReviewList": [{"Date": "on February 6, 2013", "Text": "This is the best book on fracking available.  The author gives a balanced analysis, with lots of technical details.  It is not a diatribe either for or against, but a thoughtful overview of the benefits and risks.  Only problem -- it might be a little too technical for the general reader.  Highly recommended nonetheless.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26ZBKWD1NXQAB"}}, {"Date": "on January 23, 2014", "Text": "Tempted by good reviews, I assigned this short book to an undergraduate class in environmental policy, to my regret.  The author seems competent, has a sense or humor, covers a full range of topics related to shale gas, and though he obviously favors its exploitation, gives respectful attention to objections raised by opponents.  BUT the short chapters often seem  like a staccato of numbers and chemical terms, making even readers with good backgrounds -- I include myself -- glaze over, looking for big pictures among the tiny details and asides.  There is a Glossary, but even that guide is inadequate to make this smooth reading.  Though Rao claims to be writing for a general audience, relegating \"calculations and chemistry details to shaded boxes, which can be skipped without losing the main thread,\" I often found the shaded boxes easier to read than the main text.  If this book merits a second edition, it would be worthwhile to do a major rewrite, making it more reader friendly.", "Helpfulness": 0.8571428571428571, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A117ARELDPM5CO"}}, {"Date": "on August 1, 2012", "Text": null, "Helpfulness": 0.8, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MPRTVE3M1TL9"}}, {"Date": "on January 21, 2013", "Text": null, "Helpfulness": 0.8, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKDF3N2SXY3SP"}}, {"Date": "on August 23, 2013", "Text": "This is a new area shale gas and shale oil, Dr Rao explained the subject in a simple way for new readers. I read the book and enjoyed it, being myself an expert in the Canadian oil sands area. I will recommend strongly to any one to read this book to increase their knowledge in Shale Gas, the boomimg industry in the US.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QIQ2OHHMTEG2"}}, {"Date": "on December 9, 2012", "Text": "It takes a very smart person to reduce a complex area to simple concepts.  Vik Rao is the smartest person I ever met, and has a very good readable way of presenting his unorthodox views of approaching the challenges of shale gas.  Rao's thoughts are presented in a clear and readable manner that make plain the risk we face as a nation in treating shale gas as business as usual rather than thinking through the management of a strategic resource for the benefit of society as a whole.  Almost anecdotally, Rao identifies the key threads to be brought into the policy and planning process at the outset, so as to extract shale in ways that do not cause earthquakes or spoil water.  Since most people lack the broad vision of Rao (or at least have narrower incentives) pretty much everyone will disagree with him at some point, which makes it even more fun for all to read.", "Helpfulness": 0.8333333333333334, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A390UR7T7EIPFA"}}, {"Date": "on June 30, 2014", "Text": "Highly researched and detailed information about various kinds of \"fracking\" and the process involved--so be prepared for some technical language and distinctions. Still quite readable though and has excellent information for anyone interested in learning more about fracking- also known as unconventional oil extraction--and the politics behind it. However, I have to say I don't agree with the conclusion of the book. The author seems to think that fracking (even in its extreme forms) could be safe enough to adopt on a widespread level within the next 2 to 5 years provided the oil industry, government officials and communities work together  to properly test, monitor, oversee and manage the process. His advice is to wait until the there are further tests to make the process more fullproof. Although I found the information given was useful in learning more in-depth information about fracking, I don't agree with his more positive outlook about the \"promise\" of fracking ---that it will lift our general economic level, be the boon in jobs or necessarily maintain our country's power and political clout on the international level.  I don't think his premise of cooperation will work. So far I have not seen that the oil industry has shown it can be trusted to monitor the process safely, be truthful with the public on environmental impact reports, be responsible and caring of the welfare of the people living near fracking areas, clean up, repair or recompense after \"accidental leaks\" or deal honesty with government officials whom they seem to pay off (or sue) to get them to support their agendas. Additionally, I don't agree that alternative forms of energy are too distant to come into play. They have not been supported, tested, tried or funded properly. As fossel fuel is limited. We must have the political will to seek alternatives. My conclusion is that Shale Gas is more peril than promise.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ECXBEDEW71DE"}}, {"Date": "on June 9, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8TGCRZ7BG6XD"}}, {"Date": "on March 23, 2013", "Text": "Exactly what I was hoping it would be. I'm knowledgeable about the subject. The book confirmed what I already knew and added some new items. Liked some of the author's tongue-in-cheek comments.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TFPH78XUFXYF"}}, {"Date": "on November 20, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJWYQS1KPTYJC"}}, {"Date": "on January 4, 2015", "Text": "Great informative piece on a very controversial subject, an easy read but chock full of solid information about what shale gas is, and how it is extracted. It looks at not only the production methods, but also the socioeconomic factors of tapping this enormous resource. Presented in a factual manner that avoids taking sides, this book provides facts and the science behind them, and leaves the reader to draw their own conclusions about the relative merits and future of this industry in America.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AJP7W5DZIW62"}}, {"Date": "on January 16, 2015", "Text": "Still reading it.  Good on what fracking process is and does.  Again, he is pro industry making the point that the process could be made safe if the industry and the regulators would make it so.  The main problem with this book is that it downplays the great destructive release of methane and its 80x plus ability over carbon dioxide to trap heat on earth.  If we frack, even with a better safety  record than the industry has posted, we will warm our globe and become part of a sixth extinction.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AM1RLTMU4IV2C"}}, {"Date": "on April 14, 2013", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YOKWM5267PFR"}}, {"Date": "on March 27, 2014", "Text": "An excellent and balanced account of this effort to make the U.S. self-sufficient in energy. Some knowledge of basic chemistry will be helpful in understanding all the arguments. It is well worth the effort. There is now far too much shouting on both sides. This book may not convince the reader of the right answer but at least they will better understand the real problem.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37PHECL0HC599"}}, {"Date": "on March 5, 2014", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3A7TSL4IQP398"}}, {"Date": "on February 23, 2014", "Text": "If you want to know, and not just have an opinion.  Read this book.  Vikram takes great care to present all sides and all possibilities.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D2SBJ2QJAN5F"}}, {"Date": "on December 19, 2013", "Text": "This book provides a comprehensive overview of shale gas development, issues, and associated industries. Towards the end the author goes into some discussion on what \"could be\", but the first 75% of the book provides a solid overview of the impact of shale gas to the energy market and the associated industries, i.e. oil, ethylene, etc.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MG3RIJXTULVN"}}, {"Date": "on September 24, 2013", "Text": "Good and detailed, vikram rao does a fantastic job in explaining the shale gas pros a cons . I reviewed with 4 stars because in some chapters it gets a bit technical ! But that wont ruing the experience of reading this awsome work.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VJ1VHBUZ9AIN"}}, {"Date": "on July 2, 2013", "Text": "I have already had a chance to read a lot on this subject. This book however showed this topic from different more practical angle which I very much appreciate. I find it little bit weaker when discussing international aspect of topic, neverthless this book clearly states it is outside of the scope.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANB2P4TKZGKV3"}}, {"Date": "on August 23, 2013", "Text": null, "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AX4YTFTWCWQH0"}}, {"Date": "on August 14, 2014", "Text": "In a very readable style, the author introduces many of the significant topics around hydrofracking.  All members of the political house should be required to read this text in shale states.  I will use this book in my 200 level energy course.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMSVBWSXOBNU8"}}, {"Date": "on May 7, 2014", "Text": "Well done.  You need to read this if your are interested in the subject of Fracking.  overs both sides of the issue without casting stones toward either.  Shows there is common ground.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21I66H3IUTM7X"}}, {"Date": "on August 26, 2014", "Text": "Very informative on how Washington and oil monopolies continue to destroy America", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AE0NVH4PQ5KN4"}}, {"Date": "on March 30, 2013", "Text": null, "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D5U80AXBCBO3"}}, {"Date": "on November 27, 2013", "Text": null, "Helpfulness": 0.5, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HS8AZ94KL57A"}}, {"Date": "on July 7, 2014", "Text": "very good", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IDSK5G4NSYXJ"}}, {"Date": "on February 17, 2013", "Text": null, "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UVKYWMU96LIT"}}, {"Date": "on September 8, 2014", "Text": null, "Helpfulness": 0.25, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AC1MMUX8QU7WI"}}], "ReviewUrl": "http://www.amazon.com/Shale-Gas-Promise-Peril-Press/product-reviews/1934831107/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.3 out of 5 stars"}, "OfferPrice": "$11.18", "Salesrank": "#257,822", "ListPrice": "$13.95"}