{"Category": "in Books (", "Name": ["Loudspeaker Design Cookbook"], "Timestamp": "2015-05-24 23:19:20.123853", "itemurl": "http://www.amazon.com/Loudspeaker-Design-Cookbook-Vance-Dickason/dp/1882580478", "Reviews": {"TotalReviewCount": "34", "ReviewList": [{"Date": "on January 17, 2005", "Text": null, "Helpfulness": 0.9122807017543859, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BHIQ269I3POI"}}, {"Date": "on July 24, 2002", "Text": "The font size used for my 6th edition as quite small, dust off those reading glasses! Even the hundreds of graphs will need a magnifying glass if you need to determine what is presented in the graph. Clearly, the size reduction is a compromise to reduce page count, and thus minimize cost, but in my opinion, this is a few steps boyond the boundary of good printing techniques. Look for larger sized fonts and reasonably sized graphs in the next edition. The book rarely presents alternatives to commercial software (and, similarly, to commercial hardware) for calculations and measurements. Some calculations, maybe even most of them, can be handled with a simple spreadsheet, yet the book rarely offers the full equation, instead directing the reader to commercial software, which costs well in excess of the price of a couple pairs of good bookshelf speakers. Home built test equipment is presented, for lesser devices, but here again, for all Thiele-Small parameters, you'd need to purchase commercial equipment. Some tests do not need professionally designed equipment! Regarding content, some points are not definitively explained, despite the authors obvious skills for explanation. In some cases, the equations which are actually offered contain unexplained terms: you might have just read about one term, but the equation might be calling for a subscript of the term, with no explanation as to what conditions define the subscripted term.... what, then, would you use for a value? My review sounds a bit negative, but above all, these kinds of problems can easily be searched in online forums related to loudspeaker design (if indeed you have internet access). Should there be any confusion: this is a reference, a standard by which other tutorials are measured. When in doubt, ask online. Good book for the beginner, despite a few concerns.", "Helpfulness": 0.9259259259259259, "StarRating": "4", "Author": {"ProfileUrl": ""}}, {"Date": "on September 6, 2003", "Text": null, "Helpfulness": 0.8918918918918919, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11IQ39CBJ8GJE"}}, {"Date": "on February 18, 2001", "Text": null, "Helpfulness": 0.8780487804878049, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12D1W27AMNG7O"}}, {"Date": "on May 16, 2007", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ROJNY48QN55E"}}, {"Date": "on March 22, 2000", "Text": "I bought this book after reading many positive reviews and recomendations and although it is a very useful reference book there are cetain things which I must say. The phrase \"but this is beyond the scope of this  book\" occurs far too often, leaving an empty feeling to most chapters.  Most chapters seem to end 10 pages too early. Vance Dickason seems to be  trying to get everyone to make exactly the same type of loudspeaker,  leaving no room for experimentation. Thus, personally, taking all the fun  out of speaker design. Finally the book has a very poor layout. with  hundreds (literally) of tiny frequency plots for which to get anything for  you need a magnifying glass and 4 hands in order to find the accompanying  text.", "Helpfulness": 0.9411764705882353, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABET5RZNGDAFC"}}, {"Date": "on August 10, 2000", "Text": null, "Helpfulness": 0.9333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26GY876YMYDM3"}}, {"Date": "on November 2, 2001", "Text": null, "Helpfulness": 0.8695652173913043, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39TAIGBW6C5LZ"}}, {"Date": "on October 18, 1999", "Text": "The Loudspeaker Design Cookbook is awesome, but believe it or not, it doesn't have an index. Fortunately, the index can easily be found on the web. A list of corrections is on the web too.  If you buy this book, you'll  want to print these out and keep them with your book.", "Helpfulness": 0.9285714285714286, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on April 4, 2002", "Text": null, "Helpfulness": 0.8181818181818182, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VCLDABDT4RQ"}}, {"Date": "on December 30, 2004", "Text": null, "Helpfulness": 0.8, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVON3VYMYHQEI"}}, {"Date": "on October 11, 1998", "Text": "This is one of the most common and useful books around.  It covers  everything crossovers, sealed systems, mid-high range systems, box  construction, and car and home audio.  I can't not reccomend this book  enough for starting off.  It has all the information you need to start  almost any project.  While being a good starting point the book is very  complex thoughout and takes a while to digest.  I find that I am constantly  refering to this book when I need some information or design guidepoints.  There are a very large number of graphs.  This book does have some editing  errors and mistakes which are negligible.  I am sure you while use this  book for years designing your own loudspeaker systems.", "Helpfulness": 0.8571428571428571, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on July 19, 1999", "Text": "This book is a must to anyone interested in loudspeaker design. It covers boxes very well, and goes a little bit into home theater and car sound. Crossover design was also extensive. What it lacked though, was anything on  electronic crossovers, but the rest was great", "Helpfulness": 0.7777777777777778, "StarRating": "4", "Author": {"ProfileUrl": ""}}, {"Date": "on July 24, 2002", "Text": "The font size used for my 6th edition as quite small, dust off those reading glasses! Even the hundreds of graphs will need a magnifying glass if you need to determine what is presented in the graph. Clearly, the size reduction is a compromise to reduce page count, and thus minimize cost, but in my opinion, this is a few steps boyond the boundary of good printing techniques. Look for larger sized fonts and reasonably sized graphs in the next edition. The book rarely presents alternatives to commercial software (and, similarly, to commercial hardware) for calculations and measurements. Some calculations, maybe even most of them, can be handled with a simple spreadsheet, yet the book rarely offers the full equation, instead directing the reader to commercial software, which costs well in excess of the price of a couple pairs of good bookshelf speakers. Home built test equipment is presented, for lesser devices, but here again, for all Thiele-Small parameters, you'd need to purchase commercial equipment. Some tests do not need professionally designed equipment! Regarding content, some points are not definitively explained, despite the authors obvious skills for explanation. In some cases, the equations which are actually offered contain unexplained terms: you might have just read about one term, but the equation might be calling for a subscript of the term, with no explanation as to what conditions define the subscripted term.... what, then, would you use for a value? My review sounds a bit negative, but above all, these kinds of problems can easily be searched in online forums related to loudspeaker design (if indeed you have internet access). Should there be any confusion: this is a reference, a standard by which other tutorials are measured. When in doubt, ask online. Good book for the beginner, despite a few concerns.", "Helpfulness": 0.7272727272727273, "StarRating": "4", "Author": {"ProfileUrl": ""}}, {"Date": "on October 27, 2000", "Text": "The FIFTH edition of this book is now out of print because the new SIXTH edition was released October 23, 2000.  I would expect AMAZON to have it soon.  List price is $39.95.", "Helpfulness": 0.7777777777777778, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on February 20, 2013", "Text": "This book has pages and pages of graphs and charts that, at first glance make your eyes glaze over but when you need to fully understand the comb filtering effects of your latest baffle arrangement or how driver placement will effect power output the references are very usable. This is also a very complete book in terms of walking you through measuring raw drivers to crossovers to baffle placement. It also has a complete home theater system plan that uses the latest drivers and passive designs to provide an excellent home theater, including 7.1 should you decide to go that way. The material is a little dated however. The pace at which computers have grown has outpaced this book, probably even before it was published but still very useful.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AB61IMOIT9B09"}}, {"Date": "on July 4, 2009", "Text": "I found this book to be an excellent theoretical discertation of the subject, with much emphasis on technical information. Good graphs. Almost intimidating. However it was lacking in what I expected, based on the title, that is practical information that would be of value for the average person wanting to build their own speakers. Frankly, an expert would already understand the information presented in this book, while it's well beyond the novice's capabilities, so I don't know where it would really be of oustanding value... perhaps as a lab reference manual? Coffee table at an audio factory?", "Helpfulness": 0.75, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATFXSIIYI5RXD"}}, {"Date": "on May 31, 1999", "Text": "Before you build an audio system for car or home you must buy and read this book.  It will save you lot's of time by know what works and what doesn't.  Design you own passive crossovers, bandpass enclosures, etc...", "Helpfulness": 0.7142857142857143, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on December 23, 2001", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "1", "Author": {"ProfileUrl": ""}}, {"Date": "on January 20, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2M9HYQO0PUPHL"}}, {"Date": "on December 7, 1998", "Text": "Terrific book with chapters that cover closed box enclosures, vented enclosures, band-pass enclosures, an extensive crossover chapter, and speaker testing.", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on March 23, 2014", "Text": "Since buying this it has been an extremely handy reference to speaker building.  Dickason has put together a very comprehensive reference covering sealed and ported enclosure designs, transducer construction, modelling tools, and so much more.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2L91Y3IZCG228"}}, {"Date": "on March 31, 2014", "Text": "Still the best book to learn basic to fairly complex speaker building techniques and theory.. History and resources to get parts are also helpful", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MO49IKK5YB6F"}}, {"Date": "on February 26, 2014", "Text": "This book has great information but I need to take it slow on some of the subjects that are a little over my head.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASNWT9R1U954O"}}, {"Date": "on August 18, 2014", "Text": "This book is full of graphs and tables. I suspect a more technical reader would find it useful.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APX14319QKA96"}}, {"Date": "on July 8, 2014", "Text": "Excellent book, good for beginner or more experienced speaker builder.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVSS9Y0Y8DCMZ"}}, {"Date": "on April 16, 2015", "Text": "Very detailed and relevant for diy loudspeaker designers :-)", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FMTY42MJFCP3"}}, {"Date": "on May 31, 2011", "Text": "Probably the best book for Loudspeaker Design. Includes some of the latest measurement and modeling systems available. A must read for anyone who wants or needs to understand Loudspeakers. Thanks Vance Dickason!!!!!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VQSDA66JBE91"}}, {"Date": "on February 11, 2013", "Text": "Almost the definitive bible for enclosure sizing and construction. Formulas and equations including volume specification are all there. It's a great reference and a must have for any audiophile.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Y9N0X45T8F8K"}}, {"Date": "on June 5, 2011", "Text": null, "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A207XZDNOMJD2N"}}, {"Date": "on February 8, 2013", "Text": "This is an excellent book on speaker design. Lots of information and formulas to help you design your perfect loudspeaker.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FQP8BTBRGCFK"}}, {"Date": "on June 16, 2011", "Text": "I had a previous version 5 of this book and it was filled with bs graphs and no real good information.  The sections that most people would find interesting or need information on such as transmission lines were left to a 2 paragraph chapter.  He stated that no one uses transmission lines therefore he will not get into it.  I guess he never heard of Bose, MB Quart, etc..  He did go into great detail on an accoustic lever that I have never heard of in 18 years of doing audio professionally let alone be able to find any parts to build such a device.  Total waste of money.  If you want to learn something about speakers, call up the boys at Electrovoice.", "Helpfulness": 0.42857142857142855, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXMUOOXAAJRQ5"}}, {"Date": "on July 27, 2005", "Text": "This book is laid out very nicely. It explains in detail inch by inch leaving nothing out. I am very pleased with its thorough explination. The author definately put alot into this book and is well worth buying and reading. I learned quite a bit on top of my previous knowlege, and it for sure gave me an edge with my custom work designs.", "Helpfulness": 0.14285714285714285, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1P8AC99ADUA5W"}}, {"Date": "on February 24, 1999", "Text": "a very good book for audio fanatics", "Helpfulness": 0.14285714285714285, "StarRating": "4", "Author": {"ProfileUrl": ""}}], "ReviewUrl": "http://www.amazon.com/Loudspeaker-Design-Cookbook-Vance-Dickason/product-reviews/1882580478/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.0 out of 5 stars"}, "OfferPrice": "", "Salesrank": "#278,537", "ListPrice": ""}