{"Category": "in Books (", "Name": ["The Saturn V F-1 Engine: Powering Apollo into History (Springer Praxis Books / Space Exploration)"], "Timestamp": "2015-05-24 21:26:53.297429", "itemurl": "http://www.amazon.com/Saturn-F-1-Engine-Powering-Exploration/dp/0387096299", "Reviews": {"TotalReviewCount": "14", "ReviewList": [{"Date": "on December 18, 2008", "Text": null, "Helpfulness": 0.9375, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3K6OT6XDN64NK"}}, {"Date": "on January 27, 2009", "Text": "I found this book to have a little too much about the people and too little about the technical side.  There was a lot of repetition because in the way the author chose to report about test sites, rather than chronological.  All in all, I learned quite a bit about an exciting project, our mission to land a man on the moon and return him safely.  My interest in the Apollo space program is still high after all of the years since the first landing occurred on my 20th birthday.  I'm always looking for another book to read about the program.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39ZZ5UY5ZXXG6"}}, {"Date": "on December 18, 2008", "Text": null, "Helpfulness": 0.7209302325581395, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MF862XU2WI2W"}}, {"Date": "on October 26, 2009", "Text": "For you engineering types out there who want to know the back story, this is the book. It talks at length about development, testing, production and the people behind it all. An enjoyable read about a very important engineering feat in world history. This is a moment modern man should be proud of and we should all know the story in more detail. This is the engine that took men to the moon, how sad it would be if we lost its history.", "Helpfulness": 0.8, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AUBCPIBMOGS4"}}, {"Date": "on May 12, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GZ6DMYRXFADP"}}, {"Date": "on July 3, 2013", "Text": "I suppose I wanted more meat, but the management of such projects is also the legitimate interest of those who study them. Too often, a 'History of Winchester Arms' turns out not to be about romantic firearms, but instead records the bond issue of 1884 and the accomplishments of Chairman Bulgebottom.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19BH5GP0QF2YJ"}}, {"Date": "on November 7, 2011", "Text": "One of the best books on the details of what went into building the Saturn Five first stage that I,ve ever looked at. Great book, the details I had looked for ..... for a long time.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25QE6BDBGK5A0"}}, {"Date": "on December 28, 2012", "Text": "A must read for all those technically minded real space fans.  Lots of info on construction etc.  Only wish photos were larger & in color, tho they may not have been in color.  So just the size of the photos was slightly disappointing, but it doesn't make the book a disappointment.  Plus this would have added to the cost of the book as it'd have to be made larger.  Read this book & watch the test firings from the Saturn V DVD- a real complement (not included w/ book).  Highly recommend.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YAQZRPHCEQFJ"}}, {"Date": "on November 17, 2012", "Text": "If you are interested in the technical and historical details of the development of the F-1 engine as I am, you will enjoy this book. It helps to have some technical knowledge, but you don't have to be an engineer to enjoy this book. It is a great addition to your library if you are a Saturn program and manned space flight fan.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AKQXBXN7V2L0"}}, {"Date": "on April 26, 2015", "Text": "In this easy to read book, but dense and rich information of a fantastic era of intelligence and competence in America! Very good to read! But we can not forget the genius Wernher Von Braun and your German team! In this book you see America as a fertile soil to Von Braun and his team!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKXNN95UB840G"}}, {"Date": "on July 25, 2014", "Text": "I was fortunate to have been part of the development and production of the F-1 engine 1961-1969. This book covers the subject with many details.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CPVCS9ZNYE79"}}, {"Date": "on March 6, 2013", "Text": "Growing up in the 60's I adulated the Saturn programme so it's great to be able to find out more about what made those babies tick.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17KJHIF24OK8"}}, {"Date": "on October 5, 2014", "Text": "History and theory. What more can a techy want. Enjoyed it much. Great service.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARRQW10SS4UYX"}}, {"Date": "on February 7, 2010", "Text": "Book arrived in great shape fine condition thanks to the shipping and plastic wrap it had.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18EXVMB7H1B92"}}], "ReviewUrl": "http://www.amazon.com/Saturn-F-1-Engine-Powering-Exploration/product-reviews/0387096299/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.4 out of 5 stars"}, "OfferPrice": "$44.96", "Salesrank": "#494,052", "ListPrice": "$59.95"}