{"Category": "in Books (", "Name": ["Blind Watchers Of The Sky: The People And Ideas That Shaped Our View Of The Universe (Helix Book)"], "Timestamp": "2015-05-24 23:17:21.309449", "itemurl": "http://www.amazon.com/Blind-Watchers-Sky-People-Universe/dp/020115496X", "Reviews": {"TotalReviewCount": "16", "ReviewList": [{"Date": "on May 24, 2001", "Text": "Unlike the other reviewers here, I *had* to read this book. Why is that? Because I took Natural Sciences 101 at the University of Chicago, and it happened to be taught by the very same Rocky Kolb. I must say, I was a little leery about reading a book written by the prof, I mean, how self serving is that? But let me tell you, this book captivated me more than any other that quarter. It's clear and concise, but most importantly, its humor keeps you wanting to read more.  He writes just like he teaches. That's his voice speaking from the pages, and he's speaking something he knows a lot about. If you want to get the basics of the history of cosmology and get in on the ground floor of a few of the more complicated cosmologiacl principals, all in an entertaining read, this book is for you.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3O96RA114TDFT"}}, {"Date": "on January 7, 2000", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CL39UJ5C7F0M"}}, {"Date": "on June 24, 1997", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on May 3, 2011", "Text": "I have to say that this book is one in a very long list of books I have read in the past, is the most informative yet intriguing. I had to read this book mainly for a class for school. I was very skeptical at first when I received thinking that I was never going to finish it and frankly how it looked boring. I was clearly wrong. The more I dove in to the reading the more I fully enjoyed the read. I was surprised at how enticing the words and how Rocky Kolb, the author of the book, made it serious yet comical. I have learned a great deal from this one book. I will most definitely recommend this book to anyone, even if they do not like astronomy and math based books. It's a good book that everyone should read through out there lifetime. If you do enjoy those subjects them most definitely pick it up, get cozy and take off in to the world of the universe. I have a totally new perspective of how our universe really is. I also enjoyed being introduced to some of the most gifted scientists the world has ever seen.  I learned new material that will go with me till I get old. I have enjoyed it, and I hope that you will too.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQ37TO027HJEL"}}, {"Date": "on May 10, 2000", "Text": "After reading Blind Watchers of the Sky all I have to is, \"wow!\"  I never thought I would learn more about (or care about, for that matter) astronomy.  The basis of my celestial knowledge before reading this book  was elementary to say the least.  My comprehension of astronomy now is not  that of a rocket scientist or anything but it is a secure foundation on  which further studying will be easier understood because of the basic  concept learned from this book.  These concepts are not exactly  abecedarian, they are not easy to grasp in a classroom or textbook.  For  some reason Kolb's intricate stories explain these concepts in a flowing  manner that doesn't stress the mind.  All of a sudden you are reading and  you pause to say aloud to yourself, \"Oh, I get it.\"  I  would recommend this book to anyone.  You need no past knowledge to enjoy  the book or any great passion to learn about astronomy because it is  entertaining aside from the fun facts you learn.  I am not an astronomy  scholar so I am unaware what there take on this book would be.  But this is  also an excellent source for high school astronomy students having a  difficult time grasping our celestial ideas.  -JoAnna Newburn", "Helpfulness": 0.7142857142857143, "StarRating": "4", "Author": {"ProfileUrl": ""}}, {"Date": "on April 15, 2014", "Text": "Blind watchers of the sky was much better and more comprehendible than I thought it was going to be. I had to read this book for my tenth grade physical science class, but surprisingly it was not even tough to get through. The first section, the solar system, was by far the most entertaining and very easy to follow. Although, when you do read this book make sure to pay attention to who created what theory and if that theory was correct or not. You may be confused later on if you do not and have to re-read a little like I did. The last two sections about the galaxy and universe are still well written, but more complex compared to the first section. You do not need to be a genius or a professor to read this book. Kolb does a very good job explaining things as simply as possible. There are also many pictures throughout the book that help to comprehend the subject in a visual way. I would definitely recommend this book. Kolb makes it humorous in parts, simple to read, and very insightful. After reading this book, I have more appreciation and respect for the scientists that dedicated their lives to find the information that we now call common sense. Don’t be a blind watcher of the sky; know a little bit more about what is really up there.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QK9QYPEEH9KD"}}, {"Date": "on January 9, 2007", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAIZAL3541ZJF"}}, {"Date": "on February 22, 2001", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3K8N5HRO0CHGY"}}, {"Date": "on January 20, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9LY9PKGCL0XJ"}}, {"Date": "on April 8, 2009", "Text": "This is a very interesting book, you learn about astronomy and its main actors in a pleasant and funny way! Rocky Kolb is amazing at his descriptions of the great astronomers of the past, their virtues and their big defects!", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MAP5554CHT2Q"}}, {"Date": "on January 18, 2013", "Text": "An inspiring book that introduces us to the greats of history that has helped influence our progression and understanding of the universe. A very interesting read and a book that I would recommend to others.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16QBNFP84CI0Y"}}, {"Date": "on February 27, 1999", "Text": "Excellent history of astronomy that explores the process of discovery and the possibilities of future dicoveries.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on April 23, 2015", "Text": "Received the book in good condition", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACGDZIZZBAJ1J"}}, {"Date": "on February 3, 2015", "Text": "okay", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3H8ORG2UX23WW"}}, {"Date": "on April 17, 2002", "Text": "If you have ever wonder how new stars were found, and how scientist came up with the alignment of the planets. Then read Blind Watchers of the Sky:The People that Shaped our Views of The Universe. Discover how the scientist came up with their theories, and the basic history of cosmology. The book flows very well and is interesting. Learn more about the thought of the scientist that have spent most of their lives studying the sky.", "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D6Q1NF7XMR2"}}, {"Date": "on November 1, 2010", "Text": null, "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IZRHH2VTL02P"}}], "ReviewUrl": "http://www.amazon.com/Blind-Watchers-Sky-People-Universe/product-reviews/020115496X/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.4 out of 5 stars"}, "OfferPrice": "$14.12", "Salesrank": "#618,661", "ListPrice": "$18.00"}