{"Category": "in Books (", "Name": ["Making Starships and Stargates: The Science of Interstellar Transport and Absurdly Benign Wormholes (Springer Praxis Books / Space Exploration)"], "Timestamp": "2015-05-24 23:18:04.716194", "itemurl": "http://www.amazon.com/Making-Starships-Stargates-Interstellar-Exploration/dp/1461456223", "Reviews": {"TotalReviewCount": "12", "ReviewList": [{"Date": "on February 1, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23TLO29177M21"}}, {"Date": "on May 17, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AN36A6JDBCVHC"}}, {"Date": "on March 8, 2013", "Text": "Woodward addresses the possibility of space travel using mechanical propulsion linking electromagnetic fields with gravity fields along the lines of Mach's principle. This is not crazy stuff, but courageous and very possible stuff. It is important that humanity takes such work extremely seriously as our survival (once all our fossil fuel account is depleted) depends on such ideas as far fetched as they might be. Only the foolish would ignore such work.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A110ZAUODIJJVQ"}}, {"Date": "on November 3, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TPRO8CELFZ71"}}, {"Date": "on September 15, 2014", "Text": "The title to the book is interesting--and sounds like something a publisher would push on an author. The read, however, is intriguing at many different levels.  I've read the book several times and each time come away with something new.  I understand the purpose of inserting the math and while it detracts a little from the read the concepts were not hard to follow.  The science behind the math was insightful and well explained.  Dr. Woodward is the type of individual that would be a wonderful dinner guest....he has a broad grasp of the  subject matter (adding a nice historical backdrop to the read) and from what little I have been able to find about him on YouTube ...he appears to have a good sense of humor and a great deal of patience.  These attributes come through in the book as well.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A187AV2P1G7QVF"}}, {"Date": "on January 10, 2015", "Text": "Woodward wrote not just a great book on his research but the history of the science behind it in a manner understandable by the average reader. Dr Woodward's research itself is very interesting and he approaches it in a slow, methodical and deliberate manner.  Additionally his musings on the potential use of Mach 's principle to create traversible wormholes is intriguing. The book is divided into three sections. The first gives a history from Galileo and Newton through Mach and Einstein. The second addresses Sciama and Mach theory and evolves into the actual research. The third addresses Absurdly benign wormholes and the science behind them and the restrictions the cosmos imposes on them.  A portion of the money generated by the book goes to advancing research into advanced propulsion research or Mach Effect thruster research and maybe one day wormhole travel. It's a great and easy to understand book, a worthy read and a worthy cause.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANOGGU9WD8VDN"}}, {"Date": "on September 18, 2013", "Text": "I am not a physicist, but found much of the book easy to understand because it is so well written.  The subject matter is important since we seem to be destroying this planet rather quickly.  And, the possibility of traveling beyond our solar system is fascinating.  I have recommended the book to many friends who have also enjoyed reading it and appreciate the fact that much of it is easy to understand.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Z8VOXVJS0M34"}}, {"Date": "on May 14, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KEZFMGLOJJ9H"}}, {"Date": "on July 7, 2013", "Text": null, "Helpfulness": 0.5, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A94YE657KXATV"}}, {"Date": "on April 19, 2015", "Text": "Beautiful!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IJRVYPRDSWGW"}}, {"Date": "on September 17, 2013", "Text": null, "Helpfulness": 0.25, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28BPGOGA7CSK7"}}, {"Date": "on January 1, 2015", "Text": "Woodward is not a serious researcher in either physics or propulsion, so why is this being taken seriously? Mach's principle, upon which the argument is based, is only conducive with General Relativity for a few simple cases, but falls apart otherwise and is wrong in general. No, distant gravity fields do *not* influence local physics. The idea of relativistic mass is really dated and is not used in serious physics research anymore and even if it were it never implies an object can gain or loose mass by interacting with \"energy\" while being accelerated--if that were true particle physics would be completely different! Lastly the experiments described are bizarre and don't really follow from the mangled gibberish that is the theory section and no data is presented beyond a few almost indecipherable scope traces! Has Springer actually *published* this? This is garbage \"science\" which is no more valid than the insane ranting of a crackpot who mails his theories to actual scientists an expects a reply to the tune of \"you're right, all of mainstream science has been wrong. You, random crackpot, are the new Einstein!\" How did this get published by an actual publishing house? Unbelievable!", "Helpfulness": 0.14285714285714285, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32TGJ577TG7H4"}}], "ReviewUrl": "http://www.amazon.com/Making-Starships-Stargates-Interstellar-Exploration/product-reviews/1461456223/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.3 out of 5 stars"}, "OfferPrice": "$33.71", "Salesrank": "#568,506", "ListPrice": "$44.95"}