{"Category": "in Books (", "Name": ["PCT, Spin and Statistics, and All That"], "Timestamp": "2015-05-24 23:14:03.855786", "itemurl": "http://www.amazon.com/PCT-Spin-Statistics-All-That/dp/0691070628", "Reviews": {"TotalReviewCount": "5", "ReviewList": [{"Date": "on January 26, 2002", "Text": "This advanced book exposes the mathematical framework of quantum field theory, as discovered by Wightman, who explained, in an article published in Physics Today, that he was led to such abstract language in order to understand the forces that bind the deuteron nucleus! This was only the beginning: present books and papers on the structure of quantum fields employ (and develop!) mathematics which make the Streater-Wightman book look like Harry Potter. Still, this book is assumed reading for all these advanced studies. It is extremely well written, for one thing. The initial chapter introduces the concept of free particle along ideas which I think belong to Wigner: particles are irreducible representations of the Poicare group. So, group theory is necessary for the grammar of quantum field theory. Fields require Schwartz distribution theory, as intuitively discovered by Bohr and Rosenfeld. Then follow general theorems for local field theory, like spin-statistics, CPT (and all that...). There is now an appendix where more modern topics are presented, but the core of the book is more or less what I described. This is a great book, written with great care and wit. It is a pity that most physicists, even quantum field theorists, did'nt read it.", "Helpfulness": 0.8846153846153846, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D7XC7USJ9X7J"}}, {"Date": "on December 17, 2010", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36K2N527TXXJN"}}, {"Date": "on November 5, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36K2N527TXXJN"}}, {"Date": "on February 8, 2005", "Text": null, "Helpfulness": 0.6363636363636364, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YSC1XZL8MVX6"}}, {"Date": "on March 29, 2015", "Text": "An excellent book but not easy reading for me. probably my failing not the book's.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SDJZXF2EBCQ3"}}], "ReviewUrl": "http://www.amazon.com/PCT-Spin-Statistics-All-That/product-reviews/0691070628/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.4 out of 5 stars"}, "OfferPrice": "$41.08", "Salesrank": "#1,368,584", "ListPrice": "$46.95"}