{"Category": "in Books (", "Name": ["Continuum Mechanics: Concise Theory and Problems (Dover Books on Physics)"], "Timestamp": "2015-05-24 23:10:56.163595", "itemurl": "http://www.amazon.com/Continuum-Mechanics-Concise-Problems-Physics/dp/0486401804", "Reviews": {"TotalReviewCount": "10", "ReviewList": [{"Date": "on February 21, 2001", "Text": "I first heard about this book when in engineering graduate school. At the time, this book was out-of-print, so my version came from an almost unreadable nth xerox copy, where n is a very large number. Having had two courses in Continuum Mechanics, I was in a position to appreciate this book. In addition to defining the trace and determinant in the usual way, for example, this book also lucidly presented invariant direct notation definitions. This book contains an excellent derivation of the jump relations that must be satisfied across moving shocks. This book is too disorganized and incomplete to serve as an introductory textbook, but it is fabulous as supplemental reading if you seek new insights on topics you already know.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39EZ1GNW60R9P"}}, {"Date": "on October 3, 2001", "Text": "This \"textbook\" is really a bare-bones, although reasonably comprehensive, outline of an entry graduate course on continuum mechanics.  Many of its 100 or so worked-out \"problems\" are not really problems as much they are part of larger derivations of theories.  If your professor does not specify a required textbook or does not provide lecture notes, buy this book as a supplement.  -UC Berkeley graduate mechanical engineering student", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": ""}}, {"Date": "on November 23, 2008", "Text": null, "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26V69GHN5DVOG"}}, {"Date": "on August 22, 2002", "Text": "This book contains all the required theory in compact, though mathematically strict and complete form. About 180 pages, it is a valuable supplement for the study of continuum mechanics.", "Helpfulness": 0.875, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on October 15, 2009", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AI9EIHVBHFPC"}}, {"Date": "on February 27, 2009", "Text": "As other reviewers have said, not the choice for the first exposure to the material, but really nice reference. It has some nice cute results. Pretty weak in some areas, but it has some unique aspects as well. The direct notation is nice. My three continuum mechanics references of choice at this time would be the books by Malvern, Chadwick, and I Shih Liu, in order of sophistication, which all basically cover the same material but in quite different yet complementary ways.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2R5UGLBFYDA7R"}}, {"Date": "on January 29, 2010", "Text": "I originally bought this book as a reference when I was taking my FEA graduate school course to supplement some of the concepts, namely tensors.  I found the book hard to follow since it did not have detailed examples worked out; this may be suitable for more advanced graduate level courses (i.e. doctorate level).", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7M7OYMCWNRV5"}}, {"Date": "on January 4, 2010", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DBDTTAS0J0A"}}, {"Date": "on December 10, 2014", "Text": "It is concise, however it is not a book for self study, more like an expansion of the class notes. Not limited to solid mechanics and written to provide very general  insight", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XIUB2GQYG97G"}}, {"Date": "on October 19, 2009", "Text": "It's a mathematical viewpoint for continuum mechanics derived from linear algebra. Not very practical for engineers that don't need to prove the mathematics involved.", "Helpfulness": 0.5, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXXQR7H6KML46"}}], "ReviewUrl": "http://www.amazon.com/Continuum-Mechanics-Concise-Problems-Physics/product-reviews/0486401804/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "3.5 out of 5 stars"}, "OfferPrice": "$7.47", "Salesrank": "#458,832", "ListPrice": "$14.95"}