{"Category": "in Books (", "Name": ["The Best of All Possible Worlds: Mathematics and Destiny"], "Timestamp": "2015-05-24 23:13:30.132125", "itemurl": "http://www.amazon.com/Best-All-Possible-Worlds-Mathematics/dp/0226199959", "Reviews": {"TotalReviewCount": "4", "ReviewList": [{"Date": "on January 20, 2007", "Text": null, "Helpfulness": 0.8292682926829268, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LMBOI3T91P87"}}, {"Date": "on September 29, 2009", "Text": "I'm inclined to like Ivar Ekeland as he's a very good writer and expositor of mathematical ideas. But this book seemed pretty sketchy to me, particularly the long winded later chapters which take an extremely long tour through various of Ekeleand's opinions to arrive at the rather non earthshaking conclusion that despite not being able to produce a practical utopia, rational social policy is probably a good thing. I'm not quite sure who the intended audience for this book is, as I doubt the general public (even the very well educated general public) needs much convincing that operations research or any of it's spin offs hasn't produced much in the way of practical social policy and that mathematical optimization methods are only useful in highly specialized applications. And on the other hand this seems like it would be even more obvious to those familiar with the mathematical ideas. The first few chapters present a nice, if not highly original, historical account of the origins of the idea of mathematical optimization. I felt that the accounts of isochrony and brachistichrony were particularly well written. But after that the book too often seemed to lose focus and jump from one incompletely developed theme to another, in what I felt was an ill conceived and strained attempt to relate too much of the history of ideas in too many different fields to the notion of mathematical optimization. A more focused and detailed historical account of the development of the least action principle, capitalizing on Ekeleand's talent for conveying mathematical ideas simply and clearly, would have been far more appealing to me. Including the details of the influence of the religious views of the various scientists and mathematicians, which Ekeleland touches on but frustratingly fails to develop, seems like it would have provided plenty of interesting material for filling a book. And while I applaud Ekeland's broad scope and decrying of the modern curse of hyper specialization, I couldn't help but feel as I read, that his explications of the shortcomings of various utopian thinkers were pretty pedestrian, uninformative, and outside the areas for which he had much to say.", "Helpfulness": 0.8333333333333334, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IGB17VY7HWO"}}, {"Date": "on November 10, 2013", "Text": "I've read other Ekeland essays. This one's one of the best. Why do I need more words. Who wants to read them?", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AK42JWGXYVTQP"}}, {"Date": "on May 23, 2010", "Text": null, "Helpfulness": 0.5, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NQE76HP1MCC"}}], "ReviewUrl": "http://www.amazon.com/Best-All-Possible-Worlds-Mathematics/product-reviews/0226199959/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "3.8 out of 5 stars"}, "OfferPrice": "$12.76", "Salesrank": "#94,867", "ListPrice": "$14.00"}