{"Category": "in Books (", "Name": ["Group Theory and Quantum Mechanics (Dover Books on Chemistry)"], "Timestamp": "2015-05-24 23:11:01.179042", "itemurl": "http://www.amazon.com/Group-Theory-Quantum-Mechanics-Chemistry/dp/0486432475", "Reviews": {"TotalReviewCount": "8", "ReviewList": [{"Date": "on July 20, 2000", "Text": "Even after taking 3 semesters of quantum mechanics, I felt like I had a pretty shaky grasp on topics such as selection rules and the addition of angular momenta.  I had heard about the important role that group theory  plays in quantum mechanics, so I took a mathematics class in abstract  algebra.  Though this covered a lot of interesting topics in group  structure and ring theory, I was left with almost no idea how the material  applied to quantum mechanics.  Tinkham's book is invaluable in that it  develops the parts of group theory that are extremely relevant to physics  and chemistry such as the theory of representations (topics that  mathematicians seem bored by) and then shows beautifully how it applies to  quantum mechanics.  Not only did I understand the selection rules, angular  momentum, etc...  I had a much better understanding of quantum mechanics  overall.  Group theory makes much more evident what is meant by \"good  quantum numbers\", where degeneracies come from, and other basic issues  in quantum mechanics.  Particularly clever was the discussion of the Bloch  wavefunction ansatz as a consequence of the Abelian symmetry group of a  periodic crystal lattice.  Invaluable for quantum chemistry, a subject  which is touched on, but which was not nearly as developed when the book  was written as it is today.  Tinkham knows his math, but he knows his  physics even better.  If you have any interest in quantum mechanics, get  this book!", "Helpfulness": 0.9611650485436893, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HIIF3VX923W8"}}, {"Date": "on December 26, 2005", "Text": null, "Helpfulness": 0.9743589743589743, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FC46G5WVP3UV"}}, {"Date": "on August 10, 2006", "Text": null, "Helpfulness": 0.967741935483871, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22G14Z9CZBMID"}}, {"Date": "on January 6, 2011", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16GAIJJE39T1S"}}, {"Date": "on August 27, 2007", "Text": null, "Helpfulness": 0.8333333333333334, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8GYCIIT91J21"}}, {"Date": "on September 10, 2007", "Text": "This book is an excellent reference for group theory. It gives you the detailed math behind group theory (which is great for me). It also gives you a brief introduction so you can work with molecular group theory. This was the recommended text in my chemical group theory class. It serves as a good mathematical reference. Also, see Cotton's group theory book, and Carters group theory book.", "Helpfulness": 0.875, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WYMKWJJOPXVM"}}, {"Date": "on May 17, 2015", "Text": "Great book great price", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KG1A34LNBFDK"}}, {"Date": "on July 19, 2005", "Text": "Both the content of the book and service of amazon are wonderful", "Helpfulness": 0.11627906976744186, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WWJBRPJ1JMSX"}}], "ReviewUrl": "http://www.amazon.com/Group-Theory-Quantum-Mechanics-Chemistry/product-reviews/0486432475/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.6 out of 5 stars"}, "OfferPrice": "$18.70", "Salesrank": "#41,525", "ListPrice": "$24.95"}