{"Category": "in Books (", "Name": ["Death by Black Hole: And Other Cosmic Quandaries"], "Timestamp": "2015-05-24 23:20:23.313331", "itemurl": "http://www.amazon.com/Death-Black-Hole-Cosmic-Quandaries/dp/039335038X", "Reviews": {"TotalReviewCount": "272", "ReviewList": [{"Date": "on February 4, 2007", "Text": null, "Helpfulness": 0.9701492537313433, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MVUWT453QH61"}}, {"Date": "on February 26, 2007", "Text": null, "Helpfulness": 0.9428571428571428, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XXJ6I7K2I7SI"}}, {"Date": "on February 28, 2007", "Text": null, "Helpfulness": 0.9607843137254902, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IFPL69GGM2X6"}}, {"Date": "on May 31, 2007", "Text": null, "Helpfulness": 0.9047619047619048, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATN1SSKTJD8Z8"}}, {"Date": "on March 8, 2007", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23US54A0OILE4"}}, {"Date": "on May 17, 2008", "Text": null, "Helpfulness": 0.9, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PR6NXG0PA3KY"}}, {"Date": "on April 21, 2007", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1X6A1MUWSMOC6"}}, {"Date": "on May 20, 2009", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LZQRKEU6BDY4"}}, {"Date": "on September 19, 2007", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1D9Z20TCUH6ZX"}}, {"Date": "on May 6, 2007", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20X749PCD47PQ"}}, {"Date": "on March 28, 2007", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A912C7977MO6O"}}, {"Date": "on March 9, 2007", "Text": "This book is a collection of essays - perfect for a series of short reads.", "Helpfulness": 0.8888888888888888, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25TUHAXJ969GR"}}, {"Date": "on March 20, 2007", "Text": null, "Helpfulness": 0.8571428571428571, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RDH693AF8H6G"}}, {"Date": "on April 13, 2007", "Text": "Pretty serious science here.  I'm an engineer by training and astronomy has always been an interest so I was able to follow his essays.  But deGrasse sprinkles in lots of humor especially in making comparisons.  This I think will help the non-scientist in reading the book.  I highly recommend it to anyone who looks up and wonders what's going on up there.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASG9I1SOZ1WRQ"}}, {"Date": "on December 2, 2009", "Text": "i own this in hardcover and the kindle edition is obviously a poorly done scan directly from the print edition. All the initial caps are missing and the typeface is thin and difficult to read. Not satisfactory.", "Helpfulness": 0.7777777777777778, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3485DQPKD75LG"}}, {"Date": "on March 12, 2007", "Text": "Really makes you think just how small and insignificant we are in the universe.  It also makes you wonder what is BEYOND the universe.  Tyson breaks complex subjects and theories into layman's terms for the average Joe to understand.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3M1JA3RNPA6VD"}}, {"Date": "on March 9, 2007", "Text": null, "Helpfulness": 0.8571428571428571, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AB8T9PLNEA28I"}}, {"Date": "on May 28, 2007", "Text": "I thoroughly enjoyed this reading. This is perhaps the best space related reading I've ever done in my life. I recommend it for anyone with even a small interest in the cosmos.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VR30YRTJTM4N"}}, {"Date": "on May 13, 2007", "Text": "Dr. Neil deGrasse Tyson is a wonderful writer.  He explains physics concepts with a detail and clarity that is missing even in good books like S. Hawking's, A Brief History in Time.  I loved this book.  The imagery is so good you can almost see the photons zipping around banging into each other in the baby universe minutes after the bang.  And some of his comments about God are hilarious.  I'm a believer but I have to admit that some of God's creation IS goofy, clunky, impractical and even dangerous.  \"Take the human form.  We eat, drink, and breath through the same hole in the head.\"  Not too smart or merely homicidal?  \"And what comedian configured the region between our legs -- an entertainment complex built around a sewage system.\"  There is so much to think about in this book, you will want to read it twice... at least.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OFMASZPPAURQ"}}, {"Date": "on March 8, 2007", "Text": "Neil deGrasse Tyson has been called the successor to Carl Sagan in his efforts to make the mysterious workings of our universe understandable to the layman.  He succeeds grandly in this book.  Mixing his unique blend of humor with an healthy dose of science he manages to captivate the mind and help us understand the current state of knowledge regarding Black Holes, dark matter and other goings-on in parts of our galaxy where the real action is.  He has repeatedly stated that \"death by Black Hole\" is the way he'd want to go.  After reading this marvelous book I'd want to follow him down the gravity well.  To quote the famous British Astronomer Sir Arthur Eddington...\"not only is the universe stranger than we imagine, it is stranger than we CAN imagine\".  Dr. Tyson shows us why in this book.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19HKRB4LU5YR"}}, {"Date": "on June 3, 2007", "Text": null, "Helpfulness": 0.8333333333333334, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AITIU2DG1MM4A"}}, {"Date": "on March 28, 2007", "Text": "This is a great book.  I knew very little about the universe and how it works and what is out there, until I read this book.  It did a great job of peaking my interest, giving me easy to read and understand knowledge about the solar system, and some of the events that happen in it.  What a true enjoyment.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GMPB428Z7GWX"}}, {"Date": "on March 18, 2009", "Text": "A fun read about the science of the universe. Sometimes repetitious. Clever analogies are given to aid in understanding discussion points. Plenty of good research. Some humor, some polite rants. Very little math and equations, more philosophy. Not designed to make you smart, just less dumber...er.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XB2X8UZPUILD"}}, {"Date": "on January 19, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIBRTGBN07D6A"}}, {"Date": "on February 7, 2009", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A141R97FHSSUQ0"}}, {"Date": "on January 2, 2009", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KJO5VP4K3CHU"}}, {"Date": "on February 26, 2007", "Text": null, "Helpfulness": 0.8333333333333334, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARKHPEKGV17W1"}}, {"Date": "on March 23, 2007", "Text": "This book is awesome!  Neil Degrasse Tyson is a fantastic writer. He has the ability to make complicated concepts like Astrophysics understandable to everyone.  If you love Astronomy or you just want to educate yourself more on the wonders of the universe, Read this book!  He has an awesome sense of humor and the book is addictive!", "Helpfulness": 0.8333333333333334, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25E7DY8365NJC"}}, {"Date": "on January 1, 2009", "Text": "This is the book for the intellectually curious but Mathematically lazy.  Neil deGrasse Tyson uses the time tested Star Trek analogies to make the complicated simple and open up the possibilities of cross discipline thought to increase humanities understanding of the wider universal constants.  This book was and is a pleasure to read.  Get it in Hard back because you will review it when you get to the next chapter. The book is exciting and makes you an evangelist spreading the word of our decreasing ignorance.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14FHOCUP9A1CC"}}, {"Date": "on April 10, 2007", "Text": "These essays on astronomy by a leading astrophysicist will find a way into not only science collections but general-interest readers who have enjoyed the writings in Natural History Magazine which created the author's 'Universe' monthly column. From astral life and biology to the movie industry's struggles to get the night skies right, Tyson blends hard physics with a lively writing style and provides a fun, readable approach for a potentially confusing topic. Public libraries should find it a popular pick.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14OJS0VWMOSWO"}}, {"Date": "on March 8, 2007", "Text": "Tyson offers the reader a small collection of his essays that have been published/written for his science magazine.  These essays are easy to read and introduce the reader to subjects that concern cosmology.  From the death of stars to the birth of the universe, Tyson offers up some dry and witty humor with his essays.  Here, it is the small, off-hand comments that bring a chuckle as the reader reads about the slow and meaningless death of all that we know.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EMO3ZEBWIO8O"}}, {"Date": "on April 11, 2007", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FNZ2LIDZXKW4"}}, {"Date": "on April 9, 2014", "Text": "This book is the reason my husband fell in love with me. I was reading it, and one night I was going on and on about it, like a total nerd, and normally this would have driven guys away. But he thought it was charming and cool that I was so excited about the universe. It brought us together, and now (6 years later) we credit Neil dGT for bringing us together.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SB6C6FQDAHB"}}, {"Date": "on May 14, 2007", "Text": "Neil deGrasse Tyson does an excellent job with this subject matter.  He presents it in a way that makes it easy for the non-scientist to understand and even enjoyable to read.  The book gives a new perspective on our lives, the Earth, Sun, and the entire Universe.  Do not be scared away thinking that the book is too advanced and you won't \"get\" it; the book is actually fun to read and I find it hard to put it down!", "Helpfulness": 0.8, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AO6XYJKPXPVYE"}}, {"Date": "on March 8, 2007", "Text": "This book will entice you to consider events that you never would have thought about.  It creates a sense of whatever happens will happen no matter what you do.  It also gave me a sense of acceptance for the future of earth as we know it today.  It was very enjoyable and thought provoking.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IJDU1Q5CIVLN"}}, {"Date": "on April 9, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ITCVZ46MUB3A"}}, {"Date": "on January 14, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NQU1649SH0Q4"}}, {"Date": "on March 23, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3C0380R9NMLHD"}}, {"Date": "on March 3, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUEY946M1L939"}}, {"Date": "on April 3, 2008", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DSXA1E02C86D"}}, {"Date": "on January 27, 2008", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2F3M93RRLFQNJ"}}, {"Date": "on November 26, 2007", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BWZGD7S0JZQJ"}}, {"Date": "on July 26, 2007", "Text": null, "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QDPJRVXL7P4F"}}, {"Date": "on June 17, 2007", "Text": null, "Helpfulness": 0.75, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQP1VPK16SVWM"}}, {"Date": "on October 1, 2007", "Text": "I have long known Tyson to be an excellent speaker and purveyor of scientific ideas with a Saganesque ability to convey the excitement of scientific findings with a bit more hipness and swagger to his talks than Sagan.  This book is an excellent read through and through.  I couldn't beat the feeling as I sat on the roof of a 14 story building in Curitiba, Brazil watching the sunset alone on the summer solstice (their winter solstice) while reading the section on Stick-In-The-Mud-Science and watching the long shadows creep across the sky and have Tyson explain to me all the celestial happenings around me (this really happened).  Quite a magical read.  The author presents complex scientific ideas in short, readable, cohesively-themed articles.  Each article is on a topic familiar to us, upon which he expands towards scientific ideas which may be unfamiliar to us.  There is enough overlap in the independent sections that the read feels like one is being 'taught' rather than just reading information.  And Tyson is first and foremost a great educator.  Although I did find myself trying to remember something from a previous chapter and flipping back through, I feel like I have learned a great deal about astrophysics from a book that was downright entertaining.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARFWFV1ANS9D7"}}, {"Date": "on March 20, 2007", "Text": "Neil deGgrasse Tyson has a nice way to explaining the dynamics of our quest for knowledge.He does not take himself so serious as to be removed from mere mortals.A very good book to learn about the formation of the universe.", "Helpfulness": 0.8, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JQHLNPP828XF"}}, {"Date": "on November 12, 2010", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AG7R3MMF8QLDT"}}, {"Date": "on May 6, 2007", "Text": "A great explanation of very complicated matters.  Interesting data with a touch of humor.  I very much enjoyed it.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AH9OVNH88PGUR"}}, {"Date": "on May 2, 2010", "Text": "My review refers to a hard back copy from my local library.  Bravo Dr. Tyson.  Death by Black Hole reminded me of the no nonsense science books that Isaac Asimov used to write, and that I loved, when I was young.  I recommend this book to anybody that loves to read science and especially to young people.  This book is basic Astronomy, but Dr. Tyson supplies the supporting science along with the Astronomical concepts he is teaching.  Additionally, he supplies a lot of the history that lead to our knowledge.  The result is a wide ranging comprehensive romp through many areas of scientific knowledge. We need more books of this sort.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KDB0JCJT5BD7"}}, {"Date": "on December 23, 2009", "Text": "If you want basic information on the physics of the universe, there is no better book for a non-scientist to read. From building of an atom, to the creation of a supernova. Dr deGrasse Tyson writes with humor, and an style that makes post-doctorate ideas simple to understand (well, except for string theory). If you have seen Neil on any television program, his part scientist, part educator, easy speaking essays flow from the pages. You probably won't realize you learned anything new, until days later during a conversation you say to yourself \"Wow, where did THAT come from?\".", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3943X3UAT85CI"}}, {"Date": "on April 5, 2008", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A175AURWUVBA56"}}, {"Date": "on March 4, 2015", "Text": "I love Neil deGrasse Tyson! The man is gifted in so many ways. He not only knows his subject matter like the back of his hand but he writes clearly and simply that anyone can understand and consider what they are reading. This book is full essays which Tyson wrote in years past, If you have never read and of Tysons work, this would be a great place to start as its subject matter covers so many questions in regards to the universe that most people have. A page turner, and excellent re-read value. Highly Recommended!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CTWHEVBAFGGM"}}, {"Date": "on January 15, 2015", "Text": "Neil deGrasse Tyson has an unusual style that I thoroughly love.  He is a \"big picture\" kind of guy that explains a discovery, concept, etc. without going into minutia that only a physicist or astronomer could understand or enjoy.  This book is a series of short chapters that are fast reads. I've heard of almost everything in this book, but most of my knowledge is Discovery Channel or History Channel deep.  I enjoyed this book very much and will be buying more of Mr. Tyson's work.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11BV9DZ5IU3P"}}, {"Date": "on January 23, 2014", "Text": "For those who dabble in the wonders of space, this book was insightful on almost all aspects.  Gathers many thoughts and questions and engagingly explains the facts and mysteries.  I was surprised at the candid story telling and confessions of ignorance.  I felt like the author was having a normal conversation at my breakfast table and wasn't talking down to me.  He should, however, steer clear of religious berating, for us God AND science loving people...", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AP2TOWWKCQS2D"}}, {"Date": "on January 27, 2009", "Text": "Tyson is the funniest, most enlightening, intelligent astrophysicist I've watched and read.  A wonderful way to understand what all that stuff in space really means and why!  This is a great gift for those with an interest in space, astronomy, etc.  Even young teens can digest this book easily.  Catch Neil deGrasse Tyson on PBS (NOVAsciencenow!)", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35FH8Z1SG4DAC"}}, {"Date": "on May 12, 2007", "Text": "I found this book to be a humorous and entertaining take on the many interesting aspects of known cosmology today. Fascinating facts told with wit and charm, this book takes you on a tour of the universe and it's many peculiarities without leaving you yawning. I highly recommend this book for anyone interested about the cosmos around them.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3U1GOK1GRR752"}}, {"Date": "on March 8, 2012", "Text": "This really is an excellent book. If you have any interest at all in astrophysics/astronomy, I would highly recommend it. Tyson has a wonderful ability to bring complicated astrophysical subjects down to everyone's level. He uses humor in his writing at all the right moments. I can't recommend it highly enough!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QAGXOIDFTC1R"}}, {"Date": "on October 14, 2007", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10G0UV69NCHXB"}}, {"Date": "on March 23, 2015", "Text": "Death by Black Hole: And Other Cosmic Quandaries is a fascinating book in which Neil deGrasse Tyson takes us on a journey from Earth’s geography to theories on relativity to the depths of our universe. He is able to discuss these topics for even those who aren’t famous astro-physicists or striving scientists; Tyson starts with basics and goes deeper, but as he does so, he breaks down the details explaining each step of the way. What makes the book more enjoyable, than simply reading articles about such topics, is Tyson’s ability to speak to his audience through his book. He often times relates these phenomenons to everyday life; for example, “... I was having a hot-cocoa night... I had ordered it with whipped cream, of course...I saw no trace of it… he asserted I couldn’t see the whipped cream because it sank to the bottom… I offered the waiter two possible explanations: either somebody forgot to add the whipped cream or the universal laws of physics were different in his restaurant” (Tyson 37). I, personally, found myself chuckling now and then. His comical side notes not only made the book more enjoyable, but it did help put ideas/thoughts into more simpler terms. Besides his witty comments, the overall layout and order of the book helps readers get deeper into topics without sudden jumps from one idea to another; starting from more literal and concrete theories then slowly progressing towards more radical ideas. The overall fluidity made it a quick and easy read. Finally, Death by Black Hole contains the perfect amount of information in which readers may grasp each topic discussed without too much unnecessary information being thrown at them. It was reassuring  looking at the pages of work cited, starting from professors, to scholarly journals, to other published books because there are books that discuss such topics, such as outer space, that are solely based on the authors knowledge, or contain little/bais resources. Neil deGrasse Tyson gives factual thoughts and concepts with little bias and persuasion. I would definitely recommend this book to people who enjoy the topic of cosmology, physics, or just want to learn something new; on the other hand, I would not recommend this book to people who lack interest in the topics discussed because some parts may feel dragged on.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11OFCH6PXIH8I"}}, {"Date": "on November 19, 2010", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADY0QI5IENSLY"}}, {"Date": "on January 14, 2015", "Text": "He is amazing and his ability to make science fun is uncanny. Please buy this book. I read it in a week and wanted more! If you don't know Neil start here and if you do know him and haven't read this, shame on you. GET IT.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JKYU2WRRK8PC"}}, {"Date": "on March 21, 2013", "Text": "Dr. Neil deGrasse is great and his narrative is engaging and informative.  The mode of educating the average person on topics that are grand and have taken years to develop is amazing.  I enjoyed this very much.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3U18J9XLHU2BW"}}, {"Date": "on December 13, 2011", "Text": "Very well written. Both knowledgeable and entertaining. Whether you have studied physics and astronomy in school, or have a limited scientific background, you will still be able to get a lot out of this.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CG4IXTK2UKBM"}}, {"Date": "on August 15, 2014", "Text": "This book was good, and it kept me interested. He goes into great detail about everything and even makes you laugh sometimes. I carried this with me everywhere I went just so I could keep reading.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEVK9B7YLJA3W"}}, {"Date": "on November 24, 2007", "Text": "I could not put this book down from beginning to end it read like a story not as a techincal manual for physics.  Any backyard science enthusiast will love it.  Neil deGrasse Tyson, thank you sir.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3T2399K6O590F"}}, {"Date": "on March 6, 2012", "Text": "What a great book. It is entertaining while being extremely informative. Don't know how much I will retain but since I have the book, I can always reread it.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13QPNLH49R879"}}, {"Date": "on July 27, 2009", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAZL1RNQ5M0VI"}}, {"Date": "on April 18, 2011", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14X49G241C990"}}, {"Date": "on June 11, 2013", "Text": "greatly enjoyed this book. although only one chapter is dedicated to the title that's fine with me. more about space in general than black holes.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APWUN1ZAF4HDH"}}, {"Date": "on February 7, 2015", "Text": "I bought \"Death by Black Hole\"  as a birthday present for a friend a thousand miles away.  He is NOT a science fiction freak, doesn't know a lot of science, but has always been fascinated by Physics, especially Quantum Mechanics and the world of sub-atomic particles.  \"Death by Black Hole\" positively THRILLED him.  He has been raving about how fascinating, diverse, informative, and well-written it is, and he found the subject matter as compelling as any of his other experiences with science.  He now sees the cosmos in a whole new and knowledgeable way, sprinkled with the stardust of the mystery and enigma of space and all we don't understand about it.  \"Death by Black Hole\" gives a good look at what we don't know, the thrill of finding out what we do know now, and how what we learn furthers our quest to unlock more and more secrets.  An excellent read, accessible, incredibly interesting, and the price is right, as it's available in paperback.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A388Y6RYPGXADL"}}, {"Date": "on February 21, 2015", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGQ0AV9UB3YOR"}}, {"Date": "on November 16, 2012", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HG0UNL010UCI"}}, {"Date": "on February 27, 2007", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2G9UVH0WU3APE"}}, {"Date": "on May 15, 2013", "Text": "Although I only read a chapter from this book, I thought that Tyson made the topic understandable and interesting to any average reader.  The theme in this book is one of the most important things to know about science.  We do not know everything about the universe and probably never will.  At the end of the chapter called, \"Antimatter Matters\", he relates to this theme, saying that the properties of antimatter are unknown. I found myself curious about the potential applications of antimatter.  When antimatter and matter make contact, they are annihilated, creating a ton of energy in the form of gamma rays.  Perhaps we could find a way to utilize that energy for the populations energy needs.  Even though we are far off from that point, I think it is important to continue researching its applications.  I would highly recommend this book and chapter to anyone who wants to learn about antimatter and other cosmic concepts.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FBX4NPF95DWL"}}, {"Date": "on February 17, 2008", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALZY1KI8PHJUY"}}, {"Date": "on October 2, 2012", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEWMQ4D7MBUNY"}}, {"Date": "on April 3, 2015", "Text": "Get ready to reread the same content over and over again. Getting though this book becomes a chore. Wouldn't recommend.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16I1YMB2ONZMW"}}, {"Date": "on May 11, 2011", "Text": "This is a series of 42 essays loosely strung together and divided into several themes. Although Neil deGrasse Tyson went to some effort to tie the essays together, they are basically free-standing. All the essays are very interesting and well written. Tyson assumed that the reader had no previous scientific knowledge, so the essays are very accessible to all and many might be too elementary for some readers who have an above average scientific knowledge. Tyson writes in a very light manner and his sense of humor shines through. By the end of the book, when I turned the last page, I felt that I was saying good-bye  a newly acquired friend. In this respect, Tyson is like Leon Lederman when he wrote The God Particle. I strongly recommend this book to anyone the least bit interested in science and to those who have been away from science for a while.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3I1J1K5Y8Q7PY"}}, {"Date": "on June 9, 2007", "Text": "Written by astrophysicist and award-winning author Neal DeGrasse Tyson, Death by Black Hole and Other Cosmic Quandaries is an audiobook collection of essays originally run in \"Natural History Magazine\" about the amazing mysteries of the night skies. Discussing the basic physics of black holes (including what would happen to a human body unlucky enough to fall inside one!), the pointless friction between science and religion, the movie industries noteworthy failings to get its science right, and much more. Accessible to readers of all backgrounds, and featuring tracks every three minutes for easy bookmarking, Death by Black Hole and Other Cosmic Quandaries is a first-rate simplified introduction to the mind-blowing discoveries of modern astrophysics. 10 CDs, 12 hours.", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14OJS0VWMOSWO"}}, {"Date": "on October 19, 2014", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33KE7GEEEWZZS"}}, {"Date": "on July 31, 2012", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZIIXRQ0R17FI"}}, {"Date": "on November 20, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IIAE80462P8D"}}, {"Date": "on August 14, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7XUM8VT5N9J0"}}, {"Date": "on April 5, 2008", "Text": "The first book in years that I couldn't put down once I started. I am 16 and thought I would give a challenging book a try, so I purchased this one. Good call! I fell in love with it as soon as I started. I love Tysons' sense of humor on scientific aspects of the universe. He explains stuff so well, even if you don't have a scientific mind. As I had said before, he adds a sense of humor not expected from someone with the title of an astrophysicist(and does it well!) I highly recommend picking this book up as it is maybe not only the best scientific book ever written, but quite possibly the best book ever! I don't think it gets any better than this!", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZIMPLOFHZ31F"}}, {"Date": "on January 17, 2011", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15KDT35A3DKR6"}}, {"Date": "on November 21, 2007", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUZUA8H2G7ZVQ"}}, {"Date": "on June 29, 2011", "Text": "Neil Degrasse Tyson is a likeable (and extremely intelligent) guy who is passionate about what he does. This book allows readers to see this. The subject matter is admittedly a bit over my head, but I would imagine this is one of the best books out there if you want to gain a better (basic) understanding of our solar system. I wouldn't say you should read it cover to cover, but to jump around to concepts that interest you. The way the book is structured and separated into sections allows for this. This will be a challenging read if you aren't already familiar with the subject (I had read some from Carl Sagan before hand), but it's well worth the read.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NIP6OAYE5CC2"}}, {"Date": "on February 18, 2013", "Text": "Written in understable terms with humorous asides tossed in to keep it light, this book is a great overall summary of how our universe was formed, how it now works and where it is going.  A lot of time is spent on our own solar system, from sun to earth to the planets, then continuing on to the author's views of the universe itself.  Well written by an astrophysicist who knows how to communicate in common terms, this book is for those who's minds can't quite wrap around the mathematics of quarks, muons and quasars but enjoy reading and understanding the overall concept of the universe.  Recommended to my by my son.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2I9QWUAGEG5OF"}}, {"Date": "on January 10, 2008", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2810KGXFMPENE"}}, {"Date": "on December 5, 2007", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1V7QD51WZSNDP"}}, {"Date": "on March 19, 2015", "Text": "That Neil D Tyson can get a bit poetic in his speech, but his thoughts are worth reading.  I loved the book and I had a difficult time putting it down.  I would recommend watching the revamped \"Cosmos\" series, which is free if you have Prime, before you read the book only because you can get a sense of how Neil Degrasse Tyson sounds when he talks/things about the universe (also check out \"The Inexplicable Universe\" on Prime).  It really does help.  Either way, if you've been wondering about what the hell is going on outside of our atmosphere, this book will give you some great insights.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZLPKD2LQF5RZ"}}, {"Date": "on August 7, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RPI1S9GOJK5C"}}, {"Date": "on June 11, 2007", "Text": "I have always been very interested in the way the universe works, particularly the stranger aspects of it (such as black holes). I am not, however, a big fan of reading non-fiction. This book attracted my attention because of its interesting title and I was certainly not disappointed by the book itself. The writing style is very conversational and the author clearly understands that bringing in vocabulary that the average person will not understand is not the way to keep a reader interested. \"Death by Black Hole\" blends humor with fact to create an informative, but still entertaining read.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39T9DCOLS31C4"}}, {"Date": "on January 10, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XIRK8WCGR6CF"}}, {"Date": "on November 25, 2014", "Text": "I originally checked this out of my university library for a paper, to act as support against the arguments boasting pseudoscientific phenomena regarding cosmic events. The truth is, it was SO good, that I decided to buy a copy for myself. Neil deGrasse Tyson is probably best known by the American public for his television show, the Cosmos--but some of his most thought-provoking, well-written, insightful, and plain entertaining essays are contained in this book. I totally recommend this to anyone interested in astrophysics, space, and science fiction.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A360A6O4C0CQ9L"}}, {"Date": "on November 14, 2012", "Text": "Death by Blackhole, was better than expected. The way Mr. Tyson explains everything made me wish for a science teacher like him 30 years ago. There are more questions than answers after reading this book but this is a good thing. I want to learn more. I would love to go see Mr. Tyson give one of his seminars because he makes space fun for me. The book is detailed & factual but a little long in spots, a great read while in the bathroom, because by the time you get bored you are done. A great read, I recommend it to anyone interested in deep space.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AA9QXAAVB9GWU"}}, {"Date": "on October 21, 2012", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3936N0IDZ4XPK"}}, {"Date": "on February 16, 2015", "Text": "Even if you have just a cursory knowledge of the sciences and perhaps less of the cosmos, but are curious as to what it all is and how it all got there, then this book is for you. Tyson doesn't go in to excruciating detail and explains things how my parents might understand. And that is not easy to do! With some wit and gentle handling of sensitive topics like religion, he lays out the case well as to why our universe is incredible and why the scientific method is our best hope for an educated and competitive society.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KJ6KWADIGITS"}}, {"Date": "on November 10, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A364RRYVVUG8AA"}}, {"Date": "on December 6, 2008", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38L9JPKG0G1VY"}}, {"Date": "on July 8, 2011", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MQ92M9OJJBU1"}}, {"Date": "on September 12, 2012", "Text": "The author must be indeed a good teacher. The treatment is very clear, without even one mathematical detail or astrophysical technicality. It covers a good range of areas of astrophysics, and what is most unusual, the book also discusses related subjects that belong in sociology. This aspect makes it especially valuable; very few authors of popular science venture into sociological ramifications. All in all, I give it five stars and recommend it without reservations.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUQGSA1GNNFYU"}}, {"Date": "on February 5, 2014", "Text": "Anyone interested in astronomy, whether they're a professor or have a casual interest in our universe will likely enjoy reading this! Neil deGrasse Tyson takes topics that normally make people feel glazed over in confusion in a way that makes sense. He also gets his readers excited about the universe, triggering critical thinking as to how the universe works, where we come from, and what our place is in the universe. We are part of this vast universe.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1F94YHZ9T2V2N"}}, {"Date": "on January 7, 2008", "Text": "Tyson does an excellent job, again, with Death By Black Hole.  The book covers an extensive array of topics from Quasars to Dark Matter.  He does a good job of keeping the text relatively simple to understand - any amateur physicist or astronomer...or astrophysicist...can learn a great deal; as well as some slightly more experienced readers gaining some knowledge or just dusting off what they learned in undergrad.  Good read.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1K3TKRPN0FK4F"}}, {"Date": "on March 25, 2015", "Text": "Once you get past Mr. Tyson's ego, it's a very good book. Explains a lot of the more fascinating elements of astrophysics in layman's terms, and also gives interesting & useful descriptions of the phenomena that create some of the more hostile & awe-inspiring components of the universe, as well as what advances in science have allowed us to discover them. A good read regardless of your knowledge base in physics.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UM0KX7ESIFSR"}}, {"Date": "on February 27, 2015", "Text": "This is an extremely biased review, because I am totally captivated by Dr. Tyson's style and content of his visual presentations.  With that in mind, this book to me reads exactly as that, with my imagination developing his inflexions, demeanors, etc. along the read. As far as content is concerned, great as usual, bringing science to us, neophites, in clear, understandable and many a times loaded with wit.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3R6BJSG1U6PGJ"}}, {"Date": "on August 22, 2012", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32FLI8UOPJMN"}}, {"Date": "on April 25, 2014", "Text": "Neil deGrasse Tyson explains the universe with a great sense of humor and destroys your misconceptions, ranting about ignorance the whole way. This is a must read for anyone who wishes to be an informed citizen. Think the Sun is yellow? Nope. Think objects with different masses fall at different rates? Nope. This was an eye-opening book, even though I love science. I learned quite a bit.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RZQLOYZVKHXV"}}, {"Date": "on March 11, 2008", "Text": "This is a fun and fascinating collection of essays from a great communicator. Tyson does a great job of engaging a disparate audience without alienating anyone. If you are more knowledgeable about astrophysics, his writing style is enjoyable, but those with less knowledge will learn much without being swamped. This is a great book for the nightstand or to give as a gift.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZLPSU05L7RIB"}}, {"Date": "on March 1, 2014", "Text": "Although some of his math leaves me far behind, his elegant prose leaves me awed and humbled.  He has a true gift for describing the most difficult to understand concepts.  His elequence has brought me a better understanding of astrophysics, and space exploration.  NASA needs such a spokesman who can communicate to the general public, the need for government financing.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19O0GFREM48WA"}}, {"Date": "on March 27, 2008", "Text": "I love astronomy but I am far from an astrophysicist; Neil Degrasse Tyson bridges the gap in this book.  It is informative and knowledgeable; he doesn't \"dumb down\" the material for the layman but also keeps it interesting and lively for the  person who is fascinated with the cosmos but who is not a rocket scientist.  I'm looking forward to reading more of his titles.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Y4TDYO18SCTO"}}, {"Date": "on September 11, 2014", "Text": "My son was the first to read this, and enjoyed it a great deal. He recommended it to me, and I'm glad he did. Tyson is a very good writer and a very clear thinker, and the book updated my knowledge of the cosmos in many ways, while also taking me nicely through much of the logic of astrophysics and explaining how we know what we know. A fun read, and very edifying.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YPC9AB2E8RE4"}}, {"Date": "on March 14, 2015", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGR1WPTDMAEAD"}}, {"Date": "on April 13, 2015", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AI80QHV74QYLX"}}, {"Date": "on May 15, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EG3FSUAZYWY8"}}, {"Date": "on February 4, 2013", "Text": "This guy is hilarious.  Really he could do stand-up.  I bought 3 of these books so that I could give one to my son-in-law and someone else too.  I kept one and have to be amazed every time I read it at how complex the subject/s are and how easily he presents the cosmos even to the layman.  Heard an interview with him on NPR- and decided to buy.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A392JBYWEERREN"}}, {"Date": "on May 24, 2013", "Text": "The study of engineering is harmed by scientist claiming to have discovered everything.  We need to get people to read history and understand that it was engineers who helped civilisation from access to clean water, to the production of goods and services.  Australia has a chief scientist but not a chief engineer.  What a total disappointment!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXH30PE1ODWH8"}}, {"Date": "on December 26, 2008", "Text": "In the print edition, most likely, the first letter of each chapter was done in an ornate lettering that was a picture, and not part of the font.  The effect of this in the Kindle edition is that the first letter of each chapter is missing.  Other than that, a good read.", "Helpfulness": 0.6666666666666666, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13K84BV2W66PF"}}, {"Date": "on April 25, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HFAZMC731Q7V"}}, {"Date": "on May 14, 2014", "Text": "what a great book! extremely complex information yet explained clear and precise enough for a moron like me to grasp a lot of the concepts discussed. his writing style is both literary and informative. people like this should run our government instead of the greedy corporate eastwards that have infected D.C.! NDT FOR PRESIDENT", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SXFGZW9NS20K"}}, {"Date": "on October 13, 2014", "Text": "I've always been interested in the cosmos but I'm veeery bad at science and math so I just figured it just wasn't my forte, but I stumbled across this and I understood it! Neil makes everything easy to comprehend and I enjoyed all his theories. It's defiantly staying on my bed side table for me to delve into anytime I want!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WXF09QD655PA"}}, {"Date": "on March 21, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CYS69PQDG24O"}}, {"Date": "on December 23, 2010", "Text": "I've really enjoyed this book, as well as Dr. Tyson's Universe Down to Earth, which I also recommend. Dr. Tyson presents interesting science explanation with well thought out wording, examples, analogy, and his hallmark sense of humor. I can just hear him speaking as I read his books. I highly recommend anything by him.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39MULB7OU501"}}, {"Date": "on April 12, 2015", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UM60GW8UOECA"}}, {"Date": "on March 4, 2013", "Text": "In this wonderfully accessible book on the universe, Dr. Tyson touches on many subjects. Although not going into major detail on any one thing, gives you the basic ground work on different points in the realm of astrology and astrophysics. If you're feeling curious about the cosmos, this is a great place to start.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FHTHG5IPWZOL"}}, {"Date": "on December 10, 2012", "Text": "Number one...it came earlier than predicted! Which was a wonderful surprise. So informative and interesting. I really think it's important to understand the world around me. I am only in 8th grade but I made my family read it too. Everyone liked it. I think it will stay on my shelf for a while.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IRRPQ2R09NU8"}}, {"Date": "on March 2, 2015", "Text": "Gives a great perspective and insight to our place in the universe. I enjoyed learning about about quantum mechanics and the progression of theories from physicists throughout history. It isn't overly confusing and the author writes with humor to keep you interested throughout the entire book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3N4R37LEA07FX"}}, {"Date": "on February 6, 2013", "Text": "This is a very funny, yet thoughtful book about significant scientific discoveries that are often overlooked. It is a great read for teenagers who are curious about science or for people who do not have much background in this area. Better be careful because you might even learn something.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JBLE5QZI5JI1"}}, {"Date": "on January 24, 2008", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARYY84WIKKLXD"}}, {"Date": "on September 28, 2012", "Text": "This is a very interesting book with the latest in cosmic discoveries mixed with humor.  He explains formulas that are common to us in words that are easiy understandable to lay people.  At times he gets into detail over my level, but all in all I am very happy that I purchased the book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAPNB5JOI01FZ"}}, {"Date": "on September 7, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KFOM0LD4XS1U"}}, {"Date": "on April 9, 2015", "Text": "This collection of essays is a ton of fun to read. A little bit of it went over my head, but NDT still does a great job making humongous scientific concepts accessible to common readers without oversimplifying or condescending. Definitely worth reading, and then re-reading for fun.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AS3MCM763KOBU"}}, {"Date": "on June 8, 2013", "Text": "Great book even if  you are new to astronomy. I have been into astronomy for a couple of years now and there was still plenty to learn. This book interested me in a couple of ideas i never even realized existed. But wasn't so advanced that someone new to astronomy would be lost", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UHC3FOHFRQY0"}}, {"Date": "on January 17, 2013", "Text": "I'm just a regular guy with no background in physics/science and this book was perfect. It's not dull, and actually quite the opposite! There is an enormous wealth of information in this book which is delivered in a down to Earth and sometimes humorous way. A MUST READ!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFVEC65TYTSSL"}}, {"Date": "on January 27, 2013", "Text": "Neil deGrasse Tyson makes esoteric facts about astronomy and cosmology interesting and exciting.  He has an engaging and animated style that pulls the reader in and holds their attention.  I enjoy this genre and this is one of the better books I've read in it recently.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARS9JXTG2F14A"}}, {"Date": "on December 31, 2010", "Text": "This is one of the best astrophysical books I've read.  It is worth reading for it has a great deal of knowledge while still being fun entertaining.  I would highly recommend this book to anyone.  Don't be intimidated by it, it is a pretty easy read, so give it a try!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33LERS81TEUTN"}}, {"Date": "on December 19, 2014", "Text": "Excellent read. Tyson is a master at breaking down the complex nature of everything from astrological to quantum physics in a way that is both palatable and enjoyable to read. I blazed through this in a few sittings. Great for the science buff as well as the layman.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6P7XDQBQ2COH"}}, {"Date": "on March 12, 2015", "Text": "Entertaining, but at times redundant (it's just a collection of essays) and a bit all over the place. If you are entirely unfamiliar with modern physics this will likely satisfy you, but if you've read any other popular science books, you can probably skip it.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YEZ4UBE76UHL"}}, {"Date": "on July 15, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JJ0STZ3OUJ6X"}}, {"Date": "on November 2, 2013", "Text": "I've been listening to Dr. Tyson's Star Talk podcasts during long trips, and this book is consistent with his knack for making astrophysics accessible to the masses. He is funny, engaging, and makes a great care for increased science literacy.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWH7V9U8UWN96"}}, {"Date": "on August 2, 2008", "Text": "I am a student of astrophysics and I just wanted something simple to read about my favorite subject. This is exactly what I got. Dr. Tyson's book conveyed the cosmos throughly in a very entertaining tone. I will be buying more of his books.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A630T24R6R02H"}}, {"Date": "on March 7, 2013", "Text": "Neil deGrasse Tyson is an expert at explaining the science of the universe to layman such as myself. This book is well written and very entertaining. I highly recommend this book to anyone interested in physics or astronomy in general.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DZCJNECKB9WY"}}, {"Date": "on January 1, 2014", "Text": "I purchased because it's on my son's Freshman Physics class \"teacher recommended\" list for random, personal reading. My son is a big non-fiction reader and was already into the book before he finished opening Christmas gifts.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AI3XVB3O1RNFE"}}, {"Date": "on July 12, 2014", "Text": "I liked this book a lot. NDT has a nice writing style, making his books easy to read and understand.  The range of topics covered in this is pretty wide, which should appeal to a broad audience.  I'll look for more of his titles.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJSXJMENPOH7M"}}, {"Date": "on June 6, 2013", "Text": "As highly entertaining as it is informative . . . Neil deGrasse Tyson's collection of essays is written with the layperson in mind. He has a marvelous sense of humor that permeates every subject from the Big Bang to black holes.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29O0X8EN7XY95"}}, {"Date": "on December 8, 2013", "Text": "An easy, entertaining, and humorous book about astrophysics.  I preferred the audiobook to the printed version.  Narrator Dion Graham puts on an amazing performance that perfectly captures Tyson's spirit and sense of humor.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34YE6DETXA5G3"}}, {"Date": "on October 5, 2014", "Text": "So many interesting subject covered in this book. I was just too busy to have time to read so I got the audio book and listen to in the traffic while going to and from work. It somehow made my commute going out of space ;)", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PJ0B0LA8LKI"}}, {"Date": "on May 28, 2012", "Text": "A highly enjoyable read on all aspects of astronomy. Witty, easy to read stuff from an expert. If you want to know what astronomers have been up to during the past deccenia (and before) I would highly recommend this book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NVSOI3I8OENT"}}, {"Date": "on May 22, 2014", "Text": "Informative, entertaining, humorous...and comprehensible.  This book made my imagination soar and awed me with the grandeur and immensity of our universe.  Dr. deGrasse Tyson makes difficult subjects easy to understand.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18MWLJL685FIB"}}, {"Date": "on April 5, 2013", "Text": "This is a great book and author for every layperson as well as physicist \"star gazer\" hobbyist.  I have read much of  N. D. Tyson and find him to be both entertaining and informative.  Check him out on U-Tube.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JTROGFINITGX"}}, {"Date": "on February 3, 2015", "Text": "Neil deGrasse Tyson covers a lot of ground in his essays.  Death by Black Hole warns us of the major danger of getting a little too close to an event horizon.  Much worth learning and pondering in this book!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LEK44EH8MBUB"}}, {"Date": "on September 4, 2014", "Text": "I'm writing for my 13 year old, who I bought it for...he says he loved it because it was really interesting. It explains difficult concepts in interesting ways. Neil DeGrasse Tyson's voice is very engaging.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EOYK0I8GLSGM"}}, {"Date": "on January 26, 2011", "Text": "Just a wonderful tour de force of Astrophysics, that doesn't shy away from the technical. I think this is the best non-mathematical book on astrophysics I've ever read. Read, think, enjoy, share this book!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJWQB1L6T7BFV"}}, {"Date": "on April 5, 2015", "Text": "Wonderful read. I suggest this book for anyone interested in science, even if you're nervous about the difficulty of the read Neil Tyson explains it so well and simplifies the topics with great examples.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWHTMUGCJ9805"}}, {"Date": "on March 11, 2015", "Text": "Amazingly written.. Explains very difficult scientific information in a way that is very understandable. A very easy read that teaches you some amazing facts and theories about our universe.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OCCUSUXDFEX6"}}, {"Date": "on April 13, 2013", "Text": "The first book that I found a collection of essays to make for exciting reading. Tyson covers all sorts of topics that I think about on a regular basis in a humorous and enlightening way.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3V89A2OSNU91S"}}, {"Date": "on May 8, 2014", "Text": "Neil degrasse Tyson is a great person to explain space to you.  He makes things easy to understand and makes reading fun and easy.  You can read this book quick and u will enjoy it all", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3IUSLMHZ4TFMW"}}, {"Date": "on June 30, 2013", "Text": "This is an entertaining but informative read. You don't need to be a science major to appreciate it or understand it. And each chapter covers a new topic, so its a great overview.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYFJS8L71VDIA"}}, {"Date": "on July 9, 2014", "Text": "Great book. It is very similar to the Cosmos TV show that he hosted but covers the topics in more depth, but with less historical context. I would recommend the book to anyone.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38QE6WMH4T0LD"}}, {"Date": "on July 23, 2012", "Text": "I enjoyed this very much though a bit short.  He writes this in a very casual way. He talks about very complicated subjects in a way that is very light easy to understand.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NK102DM17RCJ"}}, {"Date": "on January 24, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38CI0AJHK6DLH"}}, {"Date": "on November 30, 2013", "Text": "Fantastic. Must read for anyone even remotely interested in astronomy/astrophysics. Very interesting and entertaining, just what you expect from Neil deGrasse Tyson.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XNZK413CRBSQ"}}, {"Date": "on May 5, 2015", "Text": "It's a collection of short essays, and the format makes me feel learning something new every few pages. Neil explains everything in such a clear and candid way.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18GRF88OGIQ7P"}}, {"Date": "on March 10, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1271E89QKBH7V"}}, {"Date": "on April 12, 2013", "Text": "This is a book for the ordinary person. It is undestandable and sometimes humerous. Neil explains some of the most complex issues in science in a readable way.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A89D3DTKFUJE2"}}, {"Date": "on August 31, 2014", "Text": "Sent this to my husband as a gift, he enjoyed it so much he couldnt put it down.  Finished in one day and already has fellow co-workers asking to read it too.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OL1RFG6VH48"}}, {"Date": "on May 14, 2013", "Text": "Great read, I recommend it for anyone with an interest in science/astronomy. Written so that it can be understood by anyone, without feeling too dumbed down.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AN3PIXS080OC7"}}, {"Date": "on March 10, 2013", "Text": "Like all scientists, NTD is intelligent and interesting. I recommend this to anybody, regardless of interests! Great book; held my attention every page!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEPBUDNS84IGJ"}}, {"Date": "on July 8, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZZYBIDMVHWNZ"}}, {"Date": "on December 13, 2014", "Text": "Sorry, I find this book not as exciting as his shows. There are lots of interesting facts that are in the book but I don't care much for the style.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LMVNXI3AAZYD"}}, {"Date": "on November 30, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29J1L9W293MEC"}}, {"Date": "on May 10, 2013", "Text": "I got this book as a gift and it was a fun read! I would recommend it to anyone wanting to read up on the topic that wants it to be interesting", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3L0IK8GV0SUH5"}}, {"Date": "on October 14, 2008", "Text": "This is science writing at it's very best but more fun and more accessible than even past masters such as Gould and McPhee. Highly recommended!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UYZOJC8OE6SI"}}, {"Date": "on March 8, 2007", "Text": "I enjoyed this book very much since I've had a long standing fascination with the cosmos.  However, many chapters of this book contain some very technical information such as mathematical equations and problems of physics which I think could have been communicated in more simplistic language.  The humor of the author comes through which adds to the book's entertainment quality and helps to offset some of the very complicated issues.  I would recommend this book to those with some knowledge of the cosmos and not as an introduction to the subject.", "Helpfulness": 0.6, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10TA06JBIIMTK"}}, {"Date": "on August 12, 2013", "Text": "Makes you somewhat science literate in no time even if you have low level of knowledge about physics. Highly recommended even you do not read.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HDRZQ78LAGBE"}}, {"Date": "on April 20, 2015", "Text": "Easy to read, thought provoking yet still rich with scientific goodness. Highly recommended to anyone interested in the space beyond Earth.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PA56FWDJQ57F"}}, {"Date": "on April 23, 2014", "Text": "Good non-technical reading for general audiences. Geared to the high school level. Recommended for the budding scientist and layman alike.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QXRCPBC6DDZA"}}, {"Date": "on May 27, 2013", "Text": "Mr Tyson is a very intelligent man, but he can make you understand what he is talking about.,  He adds a little humor to the subject too.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJTL05H1DZKC5"}}, {"Date": "on March 4, 2014", "Text": "I love Neil deGrasse Tyson. If only all teachers could be like him. He explains difficult concepts in a way that anyone can understand.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ABSF3EJCUOXZ"}}, {"Date": "on August 20, 2013", "Text": "Tyson did an amazing job with this book.  I really liked how he explained many of the topics people would find confusing. Go Bearcats", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3O8Y1M2LPCSQ8"}}, {"Date": "on April 15, 2015", "Text": "Very good overall coverage of astronomy topics. Appreciate the discussion of religion at the end. Written in easy to understand way.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A142V0YCG1UIEI"}}, {"Date": "on March 22, 2014", "Text": "Excellent read for those at all interested in the heavens.  Neil deGrasse Tyson is as interesting in print as he is in an interview.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11ZEVNOK97V94"}}, {"Date": "on August 26, 2013", "Text": "Good reading, enjoyed the lessons within the chapters--Well thought out and well written, will be ordering more of his books!!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABJKQCJCULK20"}}, {"Date": "on April 5, 2015", "Text": "I love space and all but I've  never read a such interesting book.So buy it now ok.Please buy it now it's free  Jason.m age 8", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AU42QG1XNQ30Y"}}, {"Date": "on January 25, 2014", "Text": "Very informative but easy to follow.  The information is presented well with a dash of humor thrown in.  Highly recommended!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APLWVKWKPZIZ3"}}, {"Date": "on March 25, 2013", "Text": "On time, in good shape, and a great read.  I bought this book for Neil DeGrasse Tyson to sign and it worked out wonderfully.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATNL71XLU3EAV"}}, {"Date": "on July 25, 2014", "Text": "Excellent overview of the current state of astrophysics and views of the past and future of our universe.  Nicely written.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OP0P6VWJJ9GT"}}, {"Date": "on April 1, 2015", "Text": "Would recommend this book to any scientist or anyone with an interest in science and logical thinking. Would read again.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2B01LHWUF3ZWK"}}, {"Date": "on May 20, 2014", "Text": "dr. tyson knows how to write so that the readers interest is not lost and he is not talking down to them simultaneously.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AY7FFSYN2XKXA"}}, {"Date": "on April 16, 2013", "Text": "What an absolute delight! Very smart and very funny. Who knew astrophysics could be this engaging? This guy is a genius.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33WA4U4T7CVI6"}}, {"Date": "on August 4, 2013", "Text": "One of the few books on physics & related cosmic topics that I could understand! Made the subject matter accessible", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SA5MC3CIPIJC"}}, {"Date": "on February 15, 2011", "Text": "Neil has a writing style that flows easily.  This was my first book of his that I have read, it won't be the last.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABDOCK0Y3GN58"}}, {"Date": "on September 30, 2013", "Text": "Very enjoyable, wish I had a better memory to absorb and retain the details a bit better. But great just the same", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NCMMJRRRPTZC"}}, {"Date": "on February 17, 2013", "Text": "Came in promptly, nicely packed, everything in order. I have no complaints and the book itself is great as well.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DV8IFLD3N27S"}}, {"Date": "on March 10, 2015", "Text": "Great interesting read. If your curious you need to read this, Neil deGrasse Tyson is a plus as the writer.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QQY7NV7PW18I"}}, {"Date": "on January 5, 2014", "Text": "Bought for husband. He liked and says that it is good because it has mind blowing facts about the universe.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LYWVCCGWJDXE"}}, {"Date": "on March 15, 2015", "Text": "Such a great book. Neil is intelligent and funny. Put your thinking cap on and get ready for some science!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JCQ54MCEN4QC"}}, {"Date": "on June 19, 2014", "Text": "Very well written by a very intelligent man. It's a bonus that you will inevitably read it in his voice.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Q8S04EA0BBYJ"}}, {"Date": "on September 7, 2008", "Text": "This book is witty and well written. If you love to learn about astronomy this is the book for you.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33VRCNAZA5R3I"}}, {"Date": "on January 7, 2015", "Text": "Really well written, entertaining and covers most scientific topics that are popular out there!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AP2D4VWVWVSXX"}}, {"Date": "on October 9, 2014", "Text": "Very fun read. Humorous and informative, moving from one subject to the next quite well.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20A26WKF3AUUY"}}, {"Date": "on November 4, 2014", "Text": "He has such a cool sense of humor that makes his topics so easy to read and understand.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFT1VNGNMPWPZ"}}, {"Date": "on May 11, 2015", "Text": "Professor Tyson is an excellent writer who makes his subject come alive.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DNRMY4E5C78C"}}, {"Date": "on February 17, 2015", "Text": "Terrific book, very informative and a great read.  Definitely worth it.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25L61KS64ZOF"}}, {"Date": "on November 22, 2014", "Text": "Dr. Tyson has a natural gift of presenting his science to the layman.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HHYWO8RWMUBG"}}, {"Date": "on March 4, 2015", "Text": "Got this as a gift for my boyfriend and he absolutely loved it!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4RJHT2WVKZO6"}}, {"Date": "on October 9, 2014", "Text": "They sent the merchandise out right away, perfectly satisfied.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FUMDIE0XSVI5"}}, {"Date": "on October 10, 2014", "Text": "Loved this book so much!  Tyson is such a great story teller!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PJTNWSWJZV9V"}}, {"Date": "on July 28, 2014", "Text": "A very entertaining and readable journey around the cosmos.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APOMB77RA4JOO"}}, {"Date": "on September 27, 2007", "Text": "The qualities that make Neil deGrasse Tyson so annoying on Nova Science Now are absolute positives when it comes to the written word. He is an intelligent and entertaining writer with an uncanny ability to reduce complex scientific concepts to bite sized chunks even I could (mostly) understand.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QIJ21RO4QZN4"}}, {"Date": "on July 17, 2014", "Text": "Great author, great stories.  Should be required reading.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2I9XZCVBNPHBN"}}, {"Date": "on February 22, 2015", "Text": "Love NDT!!! Now it is autographed by him!  Great book!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIEFAW9XLU88J"}}, {"Date": "on October 1, 2014", "Text": "What can I say? It's Dr. Tyson, it's an awesome book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A391F3KPI74QZ0"}}, {"Date": "on January 26, 2015", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AHZZNSCL2XEC"}}, {"Date": "on March 16, 2015", "Text": "Great book! Very well written and easy to follow", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2N1Q2B8PNHRUC"}}, {"Date": "on October 19, 2014", "Text": "Tyson entertains as he teaches. Love this book!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MTDY36YE0NJF"}}, {"Date": "on March 22, 2007", "Text": "This was my first Tyson book. As sure as what goes up does not necessarily have to come back down, this will not be my last Tyson Book.", "Helpfulness": 0.6, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3M18I3IAYSLK3"}}, {"Date": "on May 12, 2015", "Text": "Just got it in today. Can't wait to read it!!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGWHLU62NHJ94"}}, {"Date": "on March 28, 2015", "Text": "Mr Tyson is awesome, thank God for Mr Tyson.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A50EI5WOLWW7H"}}, {"Date": "on September 14, 2007", "Text": "Anything by this author is worth reading. I like the way he starts off explaining things in a very simple way and winds up getting deep into the end result. \"A professional con job with very educational results\".", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A306TD65XWCW6N"}}, {"Date": "on October 3, 2014", "Text": "An excellent book and entertaining as hell.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYTIGQ9SVGRBP"}}, {"Date": "on March 22, 2013", "Text": null, "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22RY8N8CNDF3A"}}, {"Date": "on August 28, 2014", "Text": "Love Neil DeGrasse Tyson. Enjoyed the book", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9CIDKR3FESF8"}}, {"Date": "on February 14, 2015", "Text": "Very interesting and thought provoking", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A346FZ4VT87RXT"}}, {"Date": "on September 20, 2014", "Text": "received quickly and was as described.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TT2MHZ7YUDZE"}}, {"Date": "on November 18, 2014", "Text": "Dr. Tyson at his best!!! Must read!!!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQTQDB8HY8PKR"}}, {"Date": "on May 6, 2015", "Text": "Awesome book. Could not put it down.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6BV5C9C9NA75"}}, {"Date": "on March 7, 2015", "Text": "Black Science guy has done it again.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A362AABVTFUBUU"}}, {"Date": "on March 4, 2015", "Text": "Excellent I re-read it every year", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EUD0LO4HEVA8"}}, {"Date": "on February 5, 2015", "Text": "Great. :) definitely  recommend", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZ73NBBXYRSH4"}}, {"Date": "on January 1, 2015", "Text": "Great book. Easy to understand.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YRKNW6TSJOJF"}}, {"Date": "on February 5, 2015", "Text": "Poorly edited but well written", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1239B0JKXNCAZ"}}, {"Date": "on February 12, 2015", "Text": "Because SCIENCE. Nuff said.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHQDTNSU5OK3W"}}, {"Date": "on January 11, 2015", "Text": "ITS FREAKING SCIENCE!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KVAEH5XSYSK5"}}, {"Date": "on May 18, 2015", "Text": "Recieved as expected", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22XMWBY506A79"}}, {"Date": "on March 16, 2009", "Text": null, "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ME4C08J183J9"}}, {"Date": "on April 30, 2009", "Text": "The writing style of this book was easy for me to understand, which was an important factor for me. It explains the scientific facts in a very accessible manner. And being composed of individual essays, I can read one at a time, focusing on what that particular essay is imparting--I don't feel pressured to finish a chapter. Another good plus! This is a nice introduction to some of the more complicated subjects in our universe. It is a little dry at times, and there were occasions when I had to re-read sentences over and over to understand them, but overall, I enjoyed this book. It's fairly easy to find specific subjects within the book too.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8YDXMFXJ4R6X"}}, {"Date": "on March 19, 2009", "Text": "Death by Black Hole is a fantastic read that succeeds where many of its predecessors did not.  The ease and grace with which DeGrasse Tyson brings the cosmos within reach is surpassed only by his ability to make complex concepts relevant and entertaining.  The masterful manner in which he blends science and philosophy will challenge your preconceptions about the origin of life and the universe, and his enthusiasm and passion are as contagious as his scientific optimism.  Whether you are new to the world of astrophysics or a fan of the works of Carl Sagan, you will find Death by Black Hole a witty, entertaining and educational book.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NCERSLT0ER68"}}, {"Date": "on September 27, 2014", "Text": "Wonderful read.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PAC3EYR9ZTRM"}}, {"Date": "on August 25, 2014", "Text": "NDT is awesome.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3G2SO1Y0CRW6U"}}, {"Date": "on December 28, 2014", "Text": "Excellent read", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SP6KWA51DZU8"}}, {"Date": "on September 17, 2009", "Text": null, "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13JPG5LAJR6OY"}}, {"Date": "on July 13, 2014", "Text": "Great book!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12UX1AULQTRVW"}}, {"Date": "on July 6, 2014", "Text": "Great book", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3S9HA99O0S5GE"}}, {"Date": "on November 9, 2011", "Text": null, "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1CMA8NGO2RZVS"}}, {"Date": "on April 10, 2015", "Text": "Very good", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PSB118PVQY77"}}, {"Date": "on March 1, 2015", "Text": "Amazing", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3M1Z2MAKI239D"}}, {"Date": "on December 8, 2014", "Text": "Enjoyable read, fun and interesting,  Not overbearing or too technical to enjoy.  Neil is a great writer and this is essentially a collection of essays from his published work in magazines.  A wide collection of interesting topics,", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZOQZ4DCG8JNQ"}}, {"Date": "on January 3, 2010", "Text": "Neil Degrass Tyson captivated me with Death By Black Hole on the first sentence.  It aught me more about spce than I would have ever learned in other books!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FHRPNKEBOP2M"}}, {"Date": "on March 1, 2015", "Text": "Gift", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MLP9UZJFVPY5"}}, {"Date": "on November 29, 2009", "Text": "Excellent book.  Neil is more fun to listen to though the speaker did do a decent job of imitating him.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31Z8UBWQCM5OV"}}, {"Date": "on December 8, 2014", "Text": "Great book by an even greater author. If you love space and all it's mysteries, get this book!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D39SLC3KR29K"}}, {"Date": "on December 15, 2012", "Text": "An illuminating collection of essays from one of the world's pre-eminent popularizers of science. Well put together and at times fairly amusing, this serves as a good introduction to the fascinating worlds of astrophysics and cosmology.", "Helpfulness": 0.3333333333333333, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36Z87A9OEE4V"}}, {"Date": "on January 10, 2014", "Text": "I was disappointed by this book. I expected more from somebody of Tyson's stature. This book is a collection of short essays and there is a lot of repetition since the essays were written at different times. There is no flow in the book whatsoever. There is no logical sequence or relation among chapters. Not to mention the content is watered down - more suitable for a middle or high school kid than an adult. Lastly, the title of the book is clearly geared to get in sales. There are no more than 5-7 pages about the title in the book. The only good thing about this book is that it is highly accessible to even somebody with no knowledge of cosmos. For me it was a complete waste of time.", "Helpfulness": 0.4, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16XDO25GALUK6"}}, {"Date": "on December 8, 2014", "Text": "A book from a genius in science and teaching !", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UD080TBQWT88"}}, {"Date": "on November 10, 2014", "Text": "my wife loved this book!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARJLVVURNLY8R"}}, {"Date": "on December 19, 2014", "Text": "Excellent!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Z7627PMCW2VX"}}, {"Date": "on December 25, 2008", "Text": null, "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMCV2P7IHKAA"}}, {"Date": "on March 19, 2007", "Text": "i havent read the book because i dont think black holes are anything special however i like the author, he makes some very valid points on his c-span apperance on february 13th 2007, he mentioned how people fear numbers and etc.. such as the number \"13\" and the number \"187\" , ironicly i just noticed there are exactly 13 reviews on this book as of right now but i am about to change that hehe.", "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANDMH75PJ1JMP"}}, {"Date": "on December 22, 2013", "Text": null, "Helpfulness": 0.3333333333333333, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ENILFWZ6M83L"}}, {"Date": "on December 27, 2014", "Text": "My Grandson is a fan of Neil  deGrasse Tyson and this book met his expectations", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10XIFWCMK871A"}}, {"Date": "on September 19, 2007", "Text": null, "Helpfulness": 0.35, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NBL1TI2M3CW1"}}, {"Date": "on April 16, 2014", "Text": "OK, I get the point that the universe is old and huge and we are young and insignificant.  The anit-religion tirade is outdated;  I suppose the target is creationists, but there is a lot of religion that doesn't merit that tag.", "Helpfulness": 0.125, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11U4AX818U6H4"}}, {"Date": "on July 3, 2007", "Text": "Alot of interesting facts, but rambles on too much. Also, very little info on black holes. \"Origins\" is much better book.", "Helpfulness": 0.2, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3I2BAUWG2QXUE"}}, {"Date": "on April 15, 2015", "Text": "I like the material but the book came damaged th cover was torn and the first 10 pages were severely wrinkled", "Helpfulness": 0.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8MCB37Z6XX1V"}}, {"Date": "on August 6, 2007", "Text": "Information overload!  You better bring your high IQ to the table when reading this one because Tyson's constant use of astrophysics jargon will go over the head of the average reader.  I could only read this book a small portion at a time because my head started hurting after 20 minutes.  He did cover some very interesting topics that I have never delved into.  The most interesting scientific fact in the book deals with Diet Pepsi. ChrisNovinger.net", "Helpfulness": 0.16666666666666666, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A231LL94ETLVH8"}}, {"Date": "on April 24, 2007", "Text": null, "Helpfulness": 0.32432432432432434, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2988B52PKKNHL"}}, {"Date": "on December 8, 2011", "Text": null, "Helpfulness": 0.16666666666666666, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1II9J82QHA67C"}}, {"Date": "on June 26, 2007", "Text": "The book provides a pleasant review of astrophysics interspersed with attempts at humor - which themselves become funny, given their probable intended audience.  The author seems to disdain intellectuals from the perspective of an intellectual and, in a probable attempt at a self-comparison with Newton's Principia, concludes with a flat promotion of a form of agnosticism - or is it denial? - to fall into the camp of chaos.  The story is well written, filled with anecdotes that make for a pleasant read, an interesting insight into the manager of the Hayden Planetarium, but a disappointing ending about a squabble.  I recommend \"The Chilling Stars: The New Theory of Climate Change\" by Henrik Svensmark  as a better read of current goose bumping astrophysics.", "Helpfulness": 0.23076923076923078, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALA9URW8ED0OG"}}, {"Date": "on March 31, 2007", "Text": "The author spent more time on other planets than on our planet, earth. I know little more about the earth after reading this book than before.", "Helpfulness": 0.07407407407407407, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14BB4SS378VK5"}}, {"Date": "on December 15, 2007", "Text": "I love science and good books about science.  As an amateur astronomer, I have read many excellent books... unfortunately, this is not one of them.  First the author rambles and dithers about for most of the book, repeating himself and making very, very lame attempts at bad jokes.  It's not cute.  The presentation feels disorganized and the content has been presented by others in a more lucid and professional manner.  It's a shame as it could have been a good book, but the author injects himself far more than he should have into the work, replacing a sense of wonder at the cosmos with a sense of annoyance at someone who obviously thinks he's just too cute.  I know the book is simplified to appeal to the masses, but I don't think it serves that purpose well due to its smarmy, annoying attitude.  If you're unlucky enough to get the audio CD version you'll be driven crazy by the reader's sickening saccarine rendition.  Altogether, a work best skipped and forgotten.", "Helpfulness": 0.21929824561403508, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2L5WNGNYHPYOO"}}, {"Date": "on December 28, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2L1KC5CTPF9UD"}}], "ReviewUrl": "http://www.amazon.com/Death-Black-Hole-Cosmic-Quandaries/product-reviews/039335038X/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.6 out of 5 stars"}, "OfferPrice": "$9.97", "Salesrank": "#4,050", "ListPrice": "$15.95"}