{"Category": "in Books (", "Name": ["The Electromagnetic Field (Dover Books on Physics)"], "Timestamp": "2015-05-24 21:25:10.856487", "itemurl": "http://www.amazon.com/Electromagnetic-Field-Dover-Books-Physics/dp/0486656608", "Reviews": {"TotalReviewCount": "12", "ReviewList": [{"Date": "on January 10, 2002", "Text": null, "Helpfulness": 0.96, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3J5JTEB1OPT2Z"}}, {"Date": "on August 8, 2007", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KO47TAP3R4XN"}}, {"Date": "on February 12, 2000", "Text": "I am a graduate student in Physics and have found this to be a wonderful reference manual to the \"Jackson\" graduate text. Shadowitz offers great explanations for sometimes complicated mathematical terms.  Additionally, he gives valuable, indepth examples for tensors and makes no  illogical or complicated jumps in his derivations of other mathematical  formulae.", "Helpfulness": 0.9615384615384616, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on May 12, 1998", "Text": "Book goes beyond classical text(state theory, give minimal amount of related examples, move on, etc..) Author is an educator(not just an instructor) and the strengths of the book are in the extent to which he attempts(and succeeds)  to illuminate the subject so that every facet of it is clearly revealed. Well Done!", "Helpfulness": 0.9583333333333334, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A134A09WI2HPXL"}}, {"Date": "on December 14, 1999", "Text": "When it comes to a Junior-Senior textbook on electromagnetism, electrical engineers and physicists will want a different approach. However, electronics engineering is close to physics and this book comes close to  pleasing both  groups.  Probably the best book on EM theory for electronics  engineers is \"Fields and Waves in Communication Electronics\" by  Ramo, Whinnery, and van Duzer.  Ramo is the R in the company called TRW.  Nonetheless, Shadowitz covers the basics of an EM text for electonics  engineers, for example, transmission lines, waveguides, and antenna  radiation.  Sprinkled throughout the text are interesting tidbits of  theoretical physics.  The book is in SI units, but  he adequately informs  the reader about esu and emu units, a discussion of which seems to have  become unfortunately banned at some American colleges.", "Helpfulness": 0.84, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26BKV6R6XFJT6"}}, {"Date": "on August 6, 2013", "Text": "I was Dr. Shadowitz's student in E+M while he was writing this book(he had already published his book on Special Relativity when I met him). As is the case in most all universities, even the largest, the physics department is usually like a family, very close and friendly and somewhat smaller than other departments, with fewer major students. We had one of the best physics curricula of any university!(Even European university representatives would visit us to see how we handled our curriculum.) Dr. Shadowitz tested out many if not most of the exercises in this book on us with good results. I learned a great deal from him, both in physics and in life. He loved teaching and explained the subject in the most revealing way possible. This book reflects his methods and love of the subject. I hear he is no longer with us. I will miss him.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TIL1PC2ZE97B"}}, {"Date": "on May 16, 2014", "Text": "First published in 1975, I use this book to understand complex topics that other Physics books explain poorly.  I would compare the way Albert Shadowitz writes to how well Linus Pauling (an award winning Chemist) wrote in exploring General Chemistry.  You study just the material you need to understand.  Shadowitz makes the information accessible because he obviously enjoyed his work.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11FNDXYXNC9SC"}}, {"Date": "on November 11, 2002", "Text": "You can't possibly get more for your money than this book.  Don't let the price fool you - this is a well written book on electromagnetics.", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on March 16, 2013", "Text": "I was very excited that dover books are now available for the Kindle, however, technical books such as this are junk when they are poor conversions...many of the formulations and equations contain squares in lieu of the proper symbols, characters, Greek letters, etc. Useless.", "Helpfulness": 0.6, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2V2SCB60ZVM6Q"}}, {"Date": "on February 23, 2015", "Text": "I wish I had this before I had to endure a course with Jackson's E/M text.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FSHGR18V1M0P"}}, {"Date": "on May 24, 2015", "Text": "great", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGH22LH74Z4OE"}}, {"Date": "on March 22, 2006", "Text": null, "Helpfulness": 0.2564102564102564, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXRCPBNEFIYRW"}}], "ReviewUrl": "http://www.amazon.com/Electromagnetic-Field-Dover-Books-Physics/product-reviews/0486656608/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.3 out of 5 stars"}, "OfferPrice": "$18.37", "Salesrank": "#379,429", "ListPrice": "$24.95"}