{"Category": "in Books (", "Name": ["About Time: Einstein's Unfinished Revolution"], "Timestamp": "2015-05-24 23:21:36.906221", "itemurl": "http://www.amazon.com/About-Time-Einsteins-Unfinished-Revolution/dp/0684818221", "Reviews": {"TotalReviewCount": "50", "ReviewList": [{"Date": "on October 14, 2000", "Text": null, "Helpfulness": 0.975, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OVSKQCT56NTT"}}, {"Date": "on June 27, 1999", "Text": "In this book Paul Davies provides a comprehensive, brilliant discussion of the nature of time.  Beginning with Einstein's revolution which abolished the classical view of absolute time and space, Davies ranges widely into the scientific and philosophical ramifications of relativity.  The bottom  line is that our \"common sense\" notions of past, present, and  future and our perception of time as flowng from present into future are  distortions of reality.  Instead of a flowing time that moves from present  to future, time is actually a block of past, present, and future that is  simply \"there.\"  The common sense notion of past, present, and  future must be discarded if we are to understand the nature of time.Davies'  discussion of time is exhaustive. And, while the book is difficult,  particularly to a non-scientist like me, Davies has a gift for explaining  very complex ideas in a way that a layperson can comprehend (but with  effort; this is not casual reading!).  Davies' prose is elegant and clear.  He provides interesting insights into the lives of major scientific  figures, particularly Einstein.  And, he has a likable sense of humor.  This book was a JOY TO READ.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28C48Y55PY2EO"}}, {"Date": "on December 29, 2005", "Text": null, "Helpfulness": 0.9090909090909091, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BT7PRPVH8HBI"}}, {"Date": "on June 9, 1998", "Text": "Paul Davies doesn't mince words. I just finished reading this book so I flipped to page 1 and started over again. It's a very enjoyable, exciting journey. I agree with the first reviewer who said it reminded him of reading a novel. The book is somewhat technical and some of it was over my head, but I read it because I knew it would be slightly beyond my grasp. I like the challenge. I liked the chapters on quantum physics the most. Oh, I'm no writer, so I'll just say it's an excellent, entertaining, incredibly thought-provoking journey to a place I wanted to go!", "Helpfulness": 0.9285714285714286, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21TZDC7HIBMA6"}}, {"Date": "on April 29, 1997", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on January 9, 2003", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12A08OL0TZY0W"}}, {"Date": "on November 22, 2000", "Text": "This was such an enjoyable and lucid book I was sorry it wasn't even longer!  Although I've come across many of the concepts in other books on quantum and relativity physics and cosmology, this is the first book I've read that was specifically dedicated to time itself.  I was amazed at the number of ways there are of analyzing time.  Among a myriad of other topics, Davies discusses it: as an historical subject of conjecture among the early Greeks, a subjective experience of the human mind as a byproduct of consciousness, a possible artifact of the \"big bang,\" a possible reversible process in the event of the \"big crunch,\" a vector quantity exhibiting directionality, rate of movement and even possibly a rate of change, the multiworld hypothesis and the possiblity of different types of time in these other worlds, and so on.  Although some of the book is a little dated--the information from the Hubble orbiting telescope is mentioned in future tense--on the whole almost everything that can be said of time is included in the book in a clear fashion.  I'm not a math-physics type person really, but I found the Davies book quite understandable.  I especially enjoyed his insertion of a \"devil's advocate,\" so to speak, who could point out problems or ask pertinent questions of the author.  It was like attending a class with a particularly gifted student in its midst.  Very much worth the time!", "Helpfulness": 0.875, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXSH6O4OP5L4M"}}, {"Date": "on February 15, 1999", "Text": "This is a masterpiece.  I have read all of the relativity/time books by Hawking, Feynman, Rohrlich, etc., and this is the best by far.  It is extremely easy to understand, plus Davies presents ideas that most authors  leave out (such as Wheeler's single particle universe).  If you have any  interest in relativity or the nature of time, read this one.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on September 29, 1999", "Text": "This is by far one of the best books I have read in a long time. It explains strange ideas in time and quantum physics and such. It was also very explanatory and easy to comprehend, even to me, a 13 year old.", "Helpfulness": 0.875, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AN617CF2OFUT"}}, {"Date": "on November 19, 1998", "Text": null, "Helpfulness": 0.9, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AH88WGWK9PMDL"}}, {"Date": "on February 23, 2005", "Text": null, "Helpfulness": 0.8888888888888888, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1P0ZB4YAA312R"}}, {"Date": "on April 24, 2000", "Text": "Dr. Davies, although profoundly eloquent, doesn't add anything new to the peculiar notion of \"Einstein's Time\".  The book starts out strong with an overview of what was put forth in the late 19th and 20th  centuries, but stalls when asked the question \"what have you done for  me lately\".  I found the total lack of anything mathematically  orientated suspect.  Perhaps Davies own views and interpretations of  others' work are hidden behind the smoke and mirrors of tremendous  vocabulary, which inevitably transformed into hopeless banter.  All and  all, if this book ended around page 100 (out of 300 or so), it would be  stronger.  If you enjoy essays of this length, pick up this book, the price  is right.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JJONDKI7BNJX"}}, {"Date": "on July 5, 2000", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AL6JIT43D8D4Z"}}, {"Date": "on November 6, 2007", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KJO5VP4K3CHU"}}, {"Date": "on November 20, 1999", "Text": null, "Helpfulness": 0.7407407407407407, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on May 3, 2001", "Text": null, "Helpfulness": 0.8333333333333334, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADXSUMA0L8EOF"}}, {"Date": "on May 13, 2001", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SY4KNAONV1DC"}}, {"Date": "on March 26, 2011", "Text": "Paul Davies states the premise and offers his conclusions about time in the very last chapter of the book.  He writes, \"The nature of time was one of the central founding topics of early philosophical thought, and it dominated scholarly debate for centuries.... In 1905, Einstein plucked time from philosophy and placed it at the heart of physics.  It suddenly became a physical thing, subject to laws and equations, and inviting experimental investigation.  Nearly a century later, our understanding of time has advanced enormously, yet the Einstein revolution was clearly just the beginning.  We are still a long way from solving the riddle of time.\"  The bulk of the book is a free-wheeling review of physicists' conception of time.  Davies summarizes various models and metaphors scientists have devised to measure time.  But time has a \"quality\" dimension as well as a measurable \"quantity.\" In an epigram to a sub-chapter on time travel the author quotes the physicist John Wheeler: \"Time is clothed in a different garment for each role it plays in our thinking.\"  In another epigram he cites Einstein himself: \"There exists, therefore, for the individual, an I-time, or subjective time.  This in itself is not measurable.\"  Of course, mystics have always known this.  Science is just coming to the same conclusion in contemporary investigations of the nature of consciousness.  Davies writes: \"Attempts to explain the flow of time using physics, rather than trying to define it away using philosophy, are probably the most exciting contemporary developments in the study of time.  Elucidating the mysterious flux would, more that anything else, help unravel the deepest of all scientific enigmas- the nature of the human self.  Until we have a firm understanding of the flow of time, or incontrovertible evidence that it is indeed an illusion, then we will not know who we are, or what part we are playing in the great cosmic drama.\"  (Page 278.) This is perhaps a bit shortsighted. On the very next page Davies admits that the history of science is the story of physics \"hijacking\" topics from philosophy.  Contemporary science seems ever to be proving the contentions of mystical insights from the past. Among these is the intuitive awareness that the material world is indeed \"illusion.\"  Davies, in this rather dated (1995) analysis of physicists\" models of time acknowledges that much is still to be learned.  \"Roger Penrose, John Eccles and others have sought an explanation for the flow of time in the operation of the human brain itself, with the bold claim that some cerebral processes are irreducibly quantum-mechanical in nature.\"  The quantum-mechanical interface of time is where investigations into consciousness and the nature of time are now focused.  The jury is still out.  Interested readers should investigate more up to date enqiries into quantum theory and the nature of consciousness.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARBKEA8U7JLPR"}}, {"Date": "on July 18, 2004", "Text": "I never found such stimulating and satisfactory explanations about time in other books. This book is really wonderful, especially when the author expounds the case of the apparent paradox of twin's travel and her asymmetric aging at the end of the voyage or explains how to coordinate the concept of relative time with an \"absolute\" age of the universe or when he treats the problem of the \"now\" with the explanation (based on the Bayes'theorem of probability)of the future of the human race and so on. In conclusion, this book is very interesting and recommendable.", "Helpfulness": 0.8333333333333334, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1M3FPY1DP77FX"}}, {"Date": "on April 21, 2000", "Text": "An Incredible Look at a complex issue and still managing to walk the balance between having enough for the Inteligencia yet still directing much of its comments and explanations to the young physicist without talking  down. If you are all interested in the Theory of Relativity, read this  book.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AMMXQRWC9QOG"}}, {"Date": "on April 10, 2001", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUM3YMZ0YRJE0"}}, {"Date": "on March 23, 2000", "Text": "This book was, as it is described, full of wonderfull insight.  I does a great job of taking complex ideas, and relating it to terms that are more easily comprehendable.  it's a good read for the science oriented person.  It puts a new spin on the subject.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IM2M9MM17R75"}}, {"Date": "on July 30, 2002", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QBRUKCS3AO9Q"}}, {"Date": "on June 2, 2007", "Text": null, "Helpfulness": 0.8, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35ST9DS1SQ7CR"}}, {"Date": "on October 25, 2003", "Text": "This is a highly ambitious book about time from the physicist's point of view (there is even an interesting chapter from the psychologists viewpoint).  The concepts it deals with are profound, and sometimes absurd (cf. the paradoxes of quantum physics).  The book is well organized and well written, but at the same time I don't believe that Davies has a special gift for explanation.  I could follow much of what was being said at a superficial level, and even at a superficial level it is breathtaking.  My biggest disappointment?  Davies spends a fair amount of time on a concrete example of a case where one twin rockets into space and returns, younger than the other.  I reviewed the simple math in detail, but was still confused.  I think the problem is that as part of the example you need to separate the delay effect (the light coming from a star left years ago), from the time dilation effect (due to relativity), and Davies never bothers to show how this is done.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3T4KN9XO3PIXG"}}, {"Date": "on July 30, 1998", "Text": "This is an easy to read book with great examples that explain relativity without needing to escape from your physical intution. Definitely worth a read.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": ""}}, {"Date": "on April 1, 2011", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XE2JOZZKMEG6"}}, {"Date": "on May 20, 2015", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JZLZGQZ62RSO"}}, {"Date": "on March 26, 2007", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UTKYA2U8542F"}}, {"Date": "on December 7, 2007", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KFCCRRXEB5KY"}}, {"Date": "on January 21, 2011", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33JLSUIGLR0OQ"}}, {"Date": "on October 10, 2013", "Text": "I got this book to learn about what physicts really thought about the philosophy and math on time.  While the center of the book gave a pretty good history of gen relativity and quantum mechanics, it did not deal with time particularly and what it is.  I've looked and have yet to find a medium level discussion on time.  I have tried Roger Penrose and while he is a brilliant person he gets you thinking for 10 pages that you really get this stuff and then on the next page line 10 you find out that in those 10 lines he has left you light years behind without you knowing it.  Good luck until next time.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30LSR1QQLLGCO"}}, {"Date": "on February 9, 2010", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KRJXM0PIYFZD"}}, {"Date": "on November 6, 2013", "Text": "Beautifully written non-mathematical explanation of the General and Special Theories of Relativity. The book is divided into 2 sections. The first is all about what time is/isn't - fairly easy reading and totally fascinating. The second section is an explanation of Quantum Mechanics - also totally fascinating but very difficult (even without the math). Davies is a top notch writer.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1S48ZOG75IK11"}}, {"Date": "on February 8, 2013", "Text": "Over 5 or more years (of time) I have been reading books and articles on the \"nature\" of TIME, and have now become a serious student/investigator. Some books I have found to be extremely arcane, and though fascinating,  impossible to agree or disagree with. Davies' book is not one of these. It is a beautifully written account of the issues AND history(ies) (in brief) of the important men and their attempts to grasp the true meaning of one of the most elusive yet important concepts we live with. He discusses the major controversies, and places them, briefly, in their historical context. At times, he manages to wax humorist as he lays out a hypothetical scenario. If you have little or no physics background, you are not likely to understand many/mosst of the major concepts that are involved in the cosmological understanding of TIME, but if you decide you want to 'get what you can for the fun of it' I heartily recommend.this book for its historical perspective and writing style.  E> E> Roberts,Ph.D.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TXUKVIWNLUIU"}}, {"Date": "on November 20, 1999", "Text": "I've read many of Davies' books, I like him because he doesn't lower his  views to meet the laymans, but he also doesn't try to confuse you etheir.  With \"Time\" I got everythig I was looking for, and lots more.  It's great to have someone in the field of sciences who is welling to pass  on his knowlage to more then just a few scientists.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on August 5, 1998", "Text": "This book was very well written, a bit slow and overwhelming, but overall good.  Davies has a unique talent of putting complex theories into surprisingly easy to understand analogies.  I did require a dictionary and my science desk reference every now and again.  Overall I understood it and I am only a 19 year old second year college student.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LHTN06DMGK9C"}}, {"Date": "on June 13, 1998", "Text": "This book is an extraordinary glimpse into the way contemporary science is moving. Much like all of Davies' books, About Time manages to be factually accurate, as clear as it is possible to be and much much more intriguing than ANY science fiction.....", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on December 29, 2012", "Text": "Davies clearly has a good grasp of the subject and if you haven't read many other books it is probably worth reading. My only real complaint is that he spends way too much time and effort trying to be \"cute\".", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1P5P9W1O1HKVV"}}, {"Date": "on May 27, 1998", "Text": "Davies has managed to capture the very essence of physics, and at the same time explains it so clearly that it feels like reading a novel. I bought this book in December of 1996, I was 17 at the time, because I have laways had a flair for the dramatic and seemingly immposible like time travel. Davies not only convinced me that it is actually possible to accomplish time travel and how it can be held in our hands to mold it, but also kept me thinking that in time and with technology constantly increasing, we will soon capture the universe itself. Davies introduces to the reader the bigger picture, how we are so insignificant in  our own universe and how we must prevail to understand it like Einstein did. \"About Time\" is so gracefully and fluidly written that anyone with  interest for science or physics can understand even the most complex situations such as the Theory of Relativiy. I highly recomend this book to anyone, it is one of the best books written in the field.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AI8URKSZ7HCVZ"}}, {"Date": "on March 14, 2015", "Text": "Davies explains time in a readily understandable and beautiful manner.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SG5S0HB2G7C"}}, {"Date": "on November 26, 2002", "Text": null, "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FBOHQIB38SPB"}}, {"Date": "on August 18, 2005", "Text": null, "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AV7Q95QGPTO0"}}, {"Date": "on May 27, 1996", "Text": null, "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": ""}}, {"Date": "on March 21, 2002", "Text": null, "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LZZKVZO70T26"}}, {"Date": "on February 25, 2015", "Text": "Book was yellowed and hard to read. It belongs in a recycle bin.", "Helpfulness": 0.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2H1BIQ4Q1H5E5"}}, {"Date": "on December 20, 2001", "Text": null, "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": ""}}, {"Date": "on July 11, 2001", "Text": null, "Helpfulness": 0.45454545454545453, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2P6G8W48NLP6L"}}, {"Date": "on May 15, 2000", "Text": "\"About Time\" is an excellent book. Written by the Aussie Philosopher, Stephen Paulus, this is one great book that talks about time in a frank way. It's peppered with great, sometimes hilarious quotations  from everyone to Yogi Berra to Eddington to Einstein to Shakespeare and  more. It makes you very comfortable in taking in what Paulus is telling  you. And just when it seems you're wanting to ask him a question about what  he's talking about in a particular passage, there are special questions  that Paulus asks himself as the reader that he then goes on to elaborate  and explain for you. This isn't some egghead book written by a triple Ph.D.  in a subject you've never heard of. The Philosophical side of Paulus lends  a softer edge to the book. It is talking about adavanced physics concepts  in some parts, so  be ready to have beefed up on your gluons, kaons, and  every flavor of Quark (If you pretty much instantly recognize the terms  I've just used, push the buy button now!) althogh you never have to do any  number crunching in your head. The only thing that might happen is that  your brain will find itself uncomfortable as it digests and simply tries to  come to terms with what is being said, as in \"A Brief History of  Time\", because the concept, while easily understandable, are mentally  obtuse at some times. Of course, this is in no way a bad thing. What was  the book you read that fundamentally changed the way you percieve time and  space around you, not just as a person, but as a member of the universal  scheme.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKXCAAM43BEXR"}}, {"Date": "on May 26, 1999", "Text": "This book has some absolutely fabulous line drawings.  I, being an easily amused high school, stared at these beautiful renderings for hours without even contemplating their content.  I like drawing.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}], "ReviewUrl": "http://www.amazon.com/About-Time-Einsteins-Unfinished-Revolution/product-reviews/0684818221/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.2 out of 5 stars"}, "OfferPrice": "$12.88", "Salesrank": "#293,048", "ListPrice": "$15.99"}