{"Category": "in Books (", "Name": ["Pocket Book of Integrals and Mathematical Formulas, 3rd Edition"], "Timestamp": "2015-05-24 23:18:02.595405", "itemurl": "http://www.amazon.com/Pocket-Book-Integrals-Mathematical-Formulas/dp/0849302633", "Reviews": {"TotalReviewCount": "6", "ReviewList": [{"Date": "on March 9, 2001", "Text": "I've had the 2nd edition of this book for about six years and I can't tell you how many times I have used it.  When I was in college, it came in very handy with the tables of derivatives and integrals, along with all those trig identities.  After I graduated and started working, it became a great reference for those geometry equations that you start to forget or methods for solving multiple equations.  It's also compact, so it will easily fit in a briefcase or a drawer.  I would definately recommend it to anyone looking for a good, quick, easy to use math reference.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8KKZX7WZVRSY"}}, {"Date": "on April 13, 1998", "Text": "A great reference for all undergraduate and graduate level engineering and mathematics students.  Pocket Size - easy to bring along.  Tables of Trig Identities, Integrals, Fourier Series, Laplace Transforms, Statistical Functions... a very convenient tool.  It should be issued to all students.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on March 27, 2002", "Text": "This Book is good for general to advance caluations in geometry to advanced calculus and differential equations. Help in Bussiness and other areas too. Very good book for engineers and physics to math majors!!", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XUZ3QU6C1TZO"}}, {"Date": "on January 3, 2007", "Text": "good for those nagging little identies and theorms you never thought you would actually use.  the intergral tables are useful for basic integration, but for advanced integration I would suggestion something else (namely Schaum's) to do the heavy lifting.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AECLZ4BU8KLNM"}}, {"Date": "on October 2, 1998", "Text": "1.  Elementary Algebra and Geometry 2.  Determinants, Matrices, and Linear  Systems of Equations 3.  Trigonometry 4.  Analytic Geometry 5.  Series 6.  Differential Calculus 7.  Integral Calculus 8.  Vector Analysis 9.  Special  Functions 10. Differential Equations 11. Statistics Table of Derivatives  Table of Integrals Appendix", "Helpfulness": 0.6, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29WQ2YPIHV5TX"}}, {"Date": "on November 24, 1998", "Text": "Schaum's Mathematical Handbook of Formulas and Tables is slightly less portable but I found it  to be more complete", "Helpfulness": 0.25, "StarRating": "3", "Author": {"ProfileUrl": ""}}], "ReviewUrl": "http://www.amazon.com/Pocket-Book-Integrals-Mathematical-Formulas/product-reviews/0849302633/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.2 out of 5 stars"}, "OfferPrice": "$0.01", "Salesrank": "#1,684,737", "ListPrice": ""}