{"Category": "in Books (", "Name": ["Standards of Brewing: Formulas for Consistency and Excellence"], "Timestamp": "2015-05-24 23:17:25.839960", "itemurl": "http://www.amazon.com/Standards-Brewing-Formulas-Consistency-Excellence/dp/0937381799", "Reviews": {"TotalReviewCount": "9", "ReviewList": [{"Date": "on August 6, 2004", "Text": "This book was thorough and informative about big brewery quality controls.  But, be warned if you are a 5 gallon a time homebrewer the book will have little guidance/application for you.  Andrew Steele - New Zealand", "Helpfulness": 0.9230769230769231, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AW8E0QQQA9ABM"}}, {"Date": "on August 17, 2002", "Text": "This book addresses a great many of the problems that one encounters day to day in a beer quality laboratory. The writing is in a style that is easy to understand and I thought that the best part was that the book was written with a great sense of humour. I never thought that I would enjoy reading a chapter on  \"statistics and process control\" and yet the author guides you through it in such a way that he leaves you with a clear understanding of the concepts and you enjoy the journey. The author appears to be  superbly qualified to write the book from his experiences in the brewing industry.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on August 23, 2002", "Text": null, "Helpfulness": 0.8888888888888888, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on June 29, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RW694OV7G8AI"}}, {"Date": "on May 31, 2010", "Text": "I am a home brewer.  Much of what is in the book I will never use.  I knew this going into the book, but I am interested in the theoretical side of brewing.  It gives a good introduction into the various tests that can be performed on raw materials, wort, and finished product.  Recommended for brewers.", "Helpfulness": 0.6666666666666666, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AS7DA2Z50ANQZ"}}, {"Date": "on July 14, 2014", "Text": "Clear cut, as expected. Much more geared toward commercial brewers than home brewers but some principles translate. I bought this as the text book for Dr. Bamforth's practical brewing laboratory class.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TBH29DNUFH3I"}}, {"Date": "on October 19, 2009", "Text": "For beginners only! The content is written for someone who doesn't have any background with quality control in an industrial setting.  Basically one course in statistics and food chemistry will greatly exceed the knowledge presented in this book.  The information that is presented is clear and well written, but lacking in depth or actual applicability.  I was disappointed in the amount of applicable equations, tables and data, especially based on the title of the book and the academic background/experience of the author.  The 200 pages are a result of a very small book size. This book wasn't worth the price.", "Helpfulness": 0.5, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11IFQ2TYJA6A3"}}, {"Date": "on February 3, 2003", "Text": "A wonderful book. I learned as much as I laughed. I would recommend this book to anyone that wants to know more about brewing. A++++!", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on August 10, 2007", "Text": null, "Helpfulness": 0.06666666666666667, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31WQUIM83YIJ9"}}], "ReviewUrl": "http://www.amazon.com/Standards-Brewing-Formulas-Consistency-Excellence/product-reviews/0937381799/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.1 out of 5 stars"}, "OfferPrice": "$29.68", "Salesrank": "#325,643", "ListPrice": "$39.95"}