{"Category": "in Books (", "Name": ["Introduction to Tensor Calculus, Relativity and Cosmology (Dover Books on Physics)"], "Timestamp": "2015-05-24 23:15:39.673340", "itemurl": "http://www.amazon.com/Introduction-Calculus-Relativity-Cosmology-Physics/dp/0486425401", "Reviews": {"TotalReviewCount": "13", "ReviewList": [{"Date": "on September 19, 2003", "Text": "There are many books on General Relativity but the reader has to be careful to pick the right one so as not to waste his (or rarely her) time and money! Lawden's book belongs to the class of technical introductions - it requires you to have an undergraduate background in physics and mathematics. The author is primarily a teacher and he has taken care to make the material as easy to understand as possible. On the other hand, this book will not enable you to go directly to the research literature. A great plus of the book is the very reasonable price. I have had the infuriating experience of paying more than $100 for a highly praised textbook only to find it unreadable. The mathematical formalism Lawden employs (tensor calculus based on covariant and contravariant tensors) is now considered old fashioned but it is still the easiest for a beginner in my opinion. Once you have finished this book, I recommend that you read Synge and Schild's \"Tensor Calculus\" for more depth in the mathematics and also \"The Principle of Relativity\" (a collection of original papers by Einstein and others) to get a feeling for the history of the subject. Both of these are also Dover paperbacks and very cheap. Then if you want a more modern approach, I recommend Schutz's \"A First Course in General Relativity\" which is still reasonably priced and will bring you closer to the level of contemporary research. Schutz uses a formalism of tensor calculus which aligns it with differential geometry and is now used in advanced textbooks.", "Helpfulness": 0.9818181818181818, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SRG05KBH1AT3"}}, {"Date": "on July 8, 2005", "Text": null, "Helpfulness": 0.9885057471264368, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LZLO4DUHAHBE"}}, {"Date": "on March 19, 2005", "Text": null, "Helpfulness": 0.9577464788732394, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1L99RKJ5YI11"}}, {"Date": "on June 2, 2009", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30LIGVRXCGKZK"}}, {"Date": "on September 23, 2010", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QT5GIQYJYRWB"}}, {"Date": "on May 2, 2009", "Text": "I bought this work years ago as an undergraduate and worked through most of it. It does a decent job of presenting the basics, though generally in an old-fashioned approach to the subject. I have never found occasion to return to it (except to write this review). There are quite a few texts that do a better job. For example, at the undergraduate level there is Hartle's excellent text and for the more serious student Carroll's and Wald's books are the solid standard texts. In short, I advise bypassing this little volume, despite its tempting price.", "Helpfulness": 0.8333333333333334, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VD6DG51IZE3U"}}, {"Date": "on January 13, 2015", "Text": "The notations that the book uses are very confusing. Explanations are not clear, and contents are outdated. If you want to learn General Relativity, I suggest \"Spacetime and Geometry: An Introduction to General Relativity\" by Sean Carroll or \"Advanced Mechanics and General Relativity\" by Joel Franklin. Both are very good books and available on Amazon. I ended up using those two for my independent study course on General Relativity.", "Helpfulness": "", "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3U5BYLM9F7PSG"}}, {"Date": "on August 27, 2013", "Text": "Although the book is requiring me to do an extensive review of vector calculus, I'm learning things I did not catch when I took the course.  The book answers many of the questions that I have asked over the years; I am sure after reviewing vector fields I will continue to the book and have a much better understanding of how to apply tensors in various fields of Physics!!!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AM1046DMH9EGC"}}, {"Date": "on January 21, 2013", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24C8PNLW6TJ3B"}}, {"Date": "on November 9, 2013", "Text": "i only got to special relativity section.  Maybe okay for mathematicians, but assumptions not clearly stated and not physically motivated.  I went back to old E&M; book to review special.  I'll probably come back to this later.", "Helpfulness": "", "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QHXLJ0808QAC"}}, {"Date": "on May 4, 2012", "Text": "If you want to know Relativity, buy this book. If this book have a little more diagrams it will be better.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20WG11LKZOW02"}}, {"Date": "on December 15, 2014", "Text": "The book covers the subject nicely and is a great addition to our library.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ENCSNTN3P5ZL"}}, {"Date": "on February 13, 2015", "Text": "Good book between a text book and a high level vulgarization text.", "Helpfulness": "", "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31OJKSKBI5KVZ"}}], "ReviewUrl": "http://www.amazon.com/Introduction-Calculus-Relativity-Cosmology-Physics/product-reviews/0486425401/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "3.8 out of 5 stars"}, "OfferPrice": "$14.28", "Salesrank": "#627,472", "ListPrice": "$16.95"}