{"Category": "in Books (", "Name": ["Our Mathematical Universe: My Quest for the Ultimate Nature of Reality"], "Timestamp": "2015-05-24 23:17:37.774660", "itemurl": "http://www.amazon.com/Our-Mathematical-Universe-Ultimate-Reality/dp/0307744256", "Reviews": {"TotalReviewCount": "246", "ReviewList": [{"Date": "on December 6, 2013", "Text": null, "Helpfulness": 0.9211822660098522, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CWIYIETNBAK3"}}, {"Date": "on December 31, 2013", "Text": null, "Helpfulness": 0.835, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36A9HWQ9U1IK4"}}, {"Date": "on January 2, 2014", "Text": null, "Helpfulness": 0.85, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FKGKUCI3DG9U"}}, {"Date": "on February 7, 2014", "Text": null, "Helpfulness": 0.8235294117647058, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A317HMX9I10C09"}}, {"Date": "on May 5, 2014", "Text": null, "Helpfulness": 0.7619047619047619, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AT03FFXYHKE3T"}}, {"Date": "on February 22, 2014", "Text": null, "Helpfulness": 0.8461538461538461, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADPYY8VRH8YAF"}}, {"Date": "on January 8, 2014", "Text": null, "Helpfulness": 0.7555555555555555, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AOPVQ7EZHTWA"}}, {"Date": "on December 9, 2013", "Text": null, "Helpfulness": 0.7454545454545455, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADKZOXAOV8EXD"}}, {"Date": "on February 23, 2014", "Text": null, "Helpfulness": 0.7391304347826086, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JDX97QQLKJID"}}, {"Date": "on July 8, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FKGKUCI3DG9U"}}, {"Date": "on June 10, 2014", "Text": null, "Helpfulness": 0.8, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABZMUCHL1VV6"}}, {"Date": "on May 3, 2015", "Text": "Tegmark's books starts with the usual run down of contemporary research in physics and astronomy.  He starts by telling us about the age of the universe and its size while telling us a little about his personal journey in researching these things. Later chapters however take us into areas of physics which, by Tegmark's own admission, are much more speculative.  Tegmark suggests that our universe is really a multiverse and that this multiverse is really four levels of different multiverses.  The first level of multiverse is the physical universe we cannot currently observe.  The second level of multiverse is the physical universe we cannot currently observe and never will be able to observe due to cosmic inflation.  The third level of multiverse is the creation of parallel universes by the quantum wave function. In this multiverse observers break off into different worlds describable mathematically by an infinite dimensional Hilbert space.  The final multiverse is determined by all the mathematical structures that define the many different fundamental laws of physics that are theoretically possible. It is this final multiverse, postulated by Tegmark, that gives us the title of the book.  As the book progresses one starts to feel that Tegmark is no longer talking physics but metaphysics.  For example, Tegmark suggests that the mathematical multiverse is premised on the notion that this multiverse describes a reality independent of our minds.  Tegmark suggests that we discover rather then create this mathematical reality but how come the mind can use math to discover this reality?  Is the square root of 2 something that exists independent of the human mind?  If so, what does it really mean to say that the square root of 2 exists independent of the mind? Interestingly, another physicist, Saul Paul Sirag, when talking about a higher dimensional mathematical structure as the ontological structure underlying all reality, came to the conclusion that this mathematical structure was consciousness or mind itself.  Sadly, I think no lab experiment is going to settle these issues.  Tegmark's book helps one think about the bigger questions that physics may pose and is worth checking out.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BFH14K06V3O1"}}, {"Date": "on March 20, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UO765ATJJ7AO"}}, {"Date": "on October 21, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JM71CZLVDIJV"}}, {"Date": "on December 14, 2014", "Text": null, "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IU9VPCBKZPE8"}}, {"Date": "on July 1, 2014", "Text": null, "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RF584254TOIV"}}, {"Date": "on June 11, 2014", "Text": null, "Helpfulness": 0.7142857142857143, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AC60530HL43E"}}, {"Date": "on September 22, 2014", "Text": null, "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AL5RHOTVO7J50"}}, {"Date": "on March 27, 2015", "Text": "Too much discussion by the author about himself and not enough on the theories. I found myself jumping ahead to read the summary pages. I also ordered the Kindle version and it was a pain to link to find diagrams referenced then going back to the page you left reading. The author would starting talking about a chart but you had to move forward pages to find it.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D1GIZLOI45M3"}}, {"Date": "on February 12, 2014", "Text": null, "Helpfulness": 0.7, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12RYZLUMF4F2Y"}}, {"Date": "on April 21, 2015", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14U8I2K67CE69"}}, {"Date": "on October 20, 2014", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEV6JGV6WP67N"}}, {"Date": "on January 24, 2015", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IIGIXBH9NX4J"}}, {"Date": "on July 26, 2014", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EQQP0LD4Z375"}}, {"Date": "on May 11, 2014", "Text": "I would like to review this book, but don't even know where to begin. It's a book on cosmology, but in many ways it borders on metaphysical speculation -- and that is probably why it has stirred up so much controversy. Tegmark makes some very extravagant claims in the book, and perhaps the biggest of all is his statement that if he's wrong, then physics is doomed. By that he means that if the multiverse is not essentially mathematics, then physics can never hope to understand it fully, and will at some point encounter a dead point beyond which it cannot go. Without knowing more about Tegmark, one might question whether he is an opportunist or just someone who loves to rock the boat. I suspect the later, and that's probably why despite all the extravagant claims, I like him as a person; he is not afraid of making waves, even though it might cost him somewhat academically. The Level III multiverse is certainly the most controversial hypothesis in the book. And while it's extremely hard for the average individual to wrap his or her head around, it should not be ruled out solely for that reason. To simply state that it is way too far-fetched and absurd is not sufficient grounds for discounting it. The chapters dealing with the Level III multiverse are what make this book, in my opinion, so extraordinary and frankly unforgettable. The initial response is bound to be skepticism, but after some reflection perhaps an open mind is the best way of handling it. In refusing to dismiss it out of hand, one's whole view of life may change dramatically. That's the power of this book: you will come to view reality as a much grander, stupendous realm than you ever imagined. In the final pages of the book, Tegmark makes another extravagant claim: that our planet Earth is the only planet in our part of the Level I multiverse that has intelligent life. This, to my mind, seems almost harder to accept than Everett's Many Worlds Interpretation. Furthermore, insufficient arguments are presented to back up this contention. He also does not define what he considers intelligent life. It seems abundantly clear, based upon what we know about the lifeforms on our own planet, that there are various species that exhibit some forms of intelligence. Intelligence is not binary, all or nothing; there are gradations. This last claim, that our planet alone has intelligent life, has made me question the entire book more deeply and wonder whether there are underlying political motivations for arguing along these lines. Tegmark seems to be saying that our portion of the universe is ours for the taking, for us to exploit as we see fit. He says in so many words that mankind is the very crown of creation, and that it is our destiny to rule over our portion of the visible universe. I'm sure Ayn Rand would approve of such sentiments, but personally I find the book's ending a bit too jingoistic. We are not the center of the universe, metaphorically or otherwise, and we need some humility in respecting the vast multitude of lifeforms that make up this universe, intelligent and otherwise. All in all, however, this book is unforgettable, and one that will make waves for many years to come.", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXWX5NPVWR8KG"}}, {"Date": "on June 22, 2014", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A283M26442MULW"}}, {"Date": "on January 7, 2014", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OY5TUB6O5WXE"}}, {"Date": "on December 30, 2013", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1U7LS93I03MFW"}}, {"Date": "on October 22, 2014", "Text": null, "Helpfulness": "", "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39MULB7OU501"}}, {"Date": "on August 18, 2014", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AW5T67ZIU08O"}}, {"Date": "on March 4, 2015", "Text": "There is no question that Max Tegmark has some unique things to say about the nature of the \"universe.\" His tone is conversational and he is adept at making complex topics understandable. That said, there are a number of areas of misattribution, especially in the area of Darwinian Evolution, which he continually cites as being the basis for many phenomena that it is incapable of predicting or extrapolating towards. The inner workings of cells, biochemistry, etc were not developed in Darwin's time, and as in so many texts, too much is assigned to Darwin's theory, and to Darwin himself . To attribute the nature of the universe to mathematical description is a phenomenon of the chauvinistic, arrogant, anthropomorphic human mindset. Whatever direction current technology is headed towards at a given time becomes the metaphor for the true nature of the universe. Currently, information in the form of quantum computing is regarded as the ultimate dynamic, and so the universe is a very large quantum computer. Prior to that it was viewed as energy. In earlier times, a mechanistic/clockwork view was favored. Max knows a lot of math. But Max really doesn't know any more of the true nature of the universe than the average man on the street who's read some sci-fi novels.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QJRMDI08UZZT"}}, {"Date": "on May 28, 2014", "Text": "This is a readable and well-informed. It is an elegant presentation in an area of widely different theories, This one is idiosyncratic but clearly put.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14A4JYIAEAG9S"}}, {"Date": "on May 23, 2014", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NDMBOKN6DSAL"}}, {"Date": "on February 25, 2014", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Q8YA1ETANNSV"}}, {"Date": "on March 31, 2015", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16N46DU8BCNVW"}}, {"Date": "on May 10, 2014", "Text": "Brain surgery and philosophy are best left to professionals. I would have enjoyed this book more if the author had partnered with a well-seasoned, professionally-trained philosopher rather than doing a too-short survey of the philosophical literature and then proposing his own epistemology. The author makes a impassioned defense of philosophical realism without (it seems) being conscious of what he's doing, or having the intellectual tools to properly approach the subject. On the positive side, I applaud the author's attempt to inject philosophy into physics; I think that at this stage it's better to do it badly than not do it at all.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3P41BMF0SSI6M"}}, {"Date": "on September 11, 2014", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HJMXCAMWY0TI"}}, {"Date": "on May 20, 2014", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18N8ITWFPRART"}}, {"Date": "on October 27, 2014", "Text": "Tegmark has taken all he cares about and tried to poor it in one book. The result is a potpourri of fascinating topics and arguments, with jumps that are sometimes dazzling. Not a bad book to read, with some interesting arguments for the Universe (with Big U) being a mathematical expression, and for the Multiverse thesis. My three stars (instead of four) is due to the lack of focus, and the in my eyes sometimes disturbing \"personal\" style of Tegmark, that in my eyes gives the impression of \"showing off\" what he has done and who he knows.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FNLT6MTO93WM"}}, {"Date": "on April 26, 2014", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25EVNLD4ZCO32"}}, {"Date": "on July 12, 2014", "Text": "I would have enjoyed Professor Tegmark as a new student. He spins a fascinating story of modern physics struggle with many of  fundamental questions of man in our vast universes.  I think he applies what he knows, cosmology, to many of our fundamental questions.  He is not without his own hubris and like the carpenter with his hammer of mathematics everything looks like a nail.  A great thought provoking read", "Helpfulness": 0.6666666666666666, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATOFT83K0CFNH"}}, {"Date": "on April 30, 2015", "Text": "Fun to read but a bit too speculative for my taste in the end", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CKLZPXXS4P97"}}, {"Date": "on May 31, 2014", "Text": "I have always wondered why science is so well described by mathematics. Max Tegmark's book provides an idea that our reality is an equivalence to a mathematical structure. Now physics is entering the space heretofore occupied by philosophy and religion. The book is well written for the abstract ideas being presented, but it would be nice to have Max face to face and ask him \"Do you really mean......?\" a dozen times to get the wild ideas straight in my mind.", "Helpfulness": 0.6666666666666666, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1A8VOSWXO5GIK"}}, {"Date": "on December 30, 2013", "Text": null, "Helpfulness": 0.625, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJ2PPTWZ0IIJS"}}, {"Date": "on August 21, 2014", "Text": null, "Helpfulness": 0.6470588235294118, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1COQ2DOO1O9HD"}}, {"Date": "on December 27, 2013", "Text": null, "Helpfulness": 0.6, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28QNU0N7NN6R0"}}, {"Date": "on December 20, 2013", "Text": null, "Helpfulness": 0.6, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AO9UNKQG83BUP"}}, {"Date": "on December 26, 2013", "Text": "Max Tegmark, a prominent Cosmology researcher at MIT provides a description of his personal journey of discovery and hypothesizing about the ultimate nature of reality.  It is unlike many popular science books written for the non-scientists in that while describing things that are already known (such as measures that can be made of the size and properties of the earth, sun and other stars) it shares the basis for the reader to intelligently examine many problems that are not yet definitively solved, including the ultimate nature of physical reality, and the nature of consciousness.  In the unsolved/exploratory areas of this journey Tegmark endorses and describes certain theories shared by many prominent scientists such as Cosmological Inflation, and others prominently his Mathematical Universe Hypothesis ones shared by a few leading researchers (such as Konrad Zuse, Edward Fredkin, Steven Wolfram giving his justification for each (as well as a means for refutation).  Interestingly, he also theorizes on the nature of a conscious entity (what he calls a Self-Aware Substructure [SAS]), explores the notion of whether we might be living in a simulation, and the likelihood and character of a Technological Singularity. I am slightly unclear (my limitations rather than the book) about what is the exact nature of the \"Mathematical Structure\" on which he claims physical reality is based, whether is is the same or differs from the Algebraic Structures referred to in modern Abstract Algebra.  I find his theorizing about subjects which might be outside of a physicist's expertise refreshing and interesting rather than ill-informed.  I highly recommend this book for a challenging and enlightening intellectual journey.", "Helpfulness": 0.6, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15PV8J0IYVDNH"}}, {"Date": "on December 6, 2013", "Text": null, "Helpfulness": 0.6363636363636364, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QWCRVV9VNLOK"}}, {"Date": "on June 19, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AV7O9WC9PMZOU"}}, {"Date": "on May 10, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JDOP7ASUNSER"}}, {"Date": "on May 18, 2015", "Text": "I found the book well written and easy to follow - even for a non-mathematically oriented reader. Explanations and analogies are clearly stated and the author jumps through hoops keep the reader focused as he makes his proofs. A demanding, but rewarding explanation of a fascinating concept.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3E380OD4O1QI1"}}, {"Date": "on July 13, 2014", "Text": "Middle of book highly speculative, but enjoyable to see where a great mind is thinking what is possible. The last couple of chapters was more about philosophy than science, but very rewarding and provocative.", "Helpfulness": 0.6666666666666666, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1F2NXY7JDEGCI"}}, {"Date": "on February 15, 2015", "Text": "Both Max Tegmark's enthusiasm for his subject and skill as a writer come through in this book. As an armchair physicist/mathematician I have read many popular novels in this genre and I find Dr. Tegmark's explanations and examples the most readable and understandable. Similarly I liked the way he subsequently would present questions/ramifications for topics he presented which I think were also presented as unbiased or with as much disclosure as is reasonable for the scope of this work. I also liked that there were summaries at the end of each chapter to help one review and keep track of the heady subjects presented. While I am not sure if I completely agree with all his arguments, I will say that this book has made an impact on me in terms of how I think and approach life's big scientific and philosophical questions and has inspired me further in these pursuits. My only criticism of this book, and reason for only 4 stars, is that I sometimes found his anecdotes more distracting than helpful in making the point he was trying to convey; especially when the topics were already complex and challenging to follow. Furthermore, I think the book was one chapter too long as the last chapter was more of a personal outlook on life that became preachy at times. Even though I did not necessarily disagree with his points it seemed disjointed from the rest of the book as only made VERY loose tie-ins to the main premise of the book. I would still strongly recommend this book but suggest that one could skip the last chapter without reservation of missing anything.", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZIVNW10K31GV"}}, {"Date": "on December 26, 2014", "Text": "I prefer books in which the author disappears within the story.  This book is not one of those.  The author does  give fair warning in the title by stating at as \"My quest\". On a positive note, he reduces complicated material to recognizable chunks.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A262XPZMSC39GT"}}, {"Date": "on April 16, 2015", "Text": "Wonderful. Just e bit too long.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AG6U47H23RSYK"}}, {"Date": "on June 18, 2014", "Text": null, "Helpfulness": 0.625, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A201F46RXJB1ST"}}, {"Date": "on March 11, 2014", "Text": "I loved this book.  I had seen Tegmark talk in person, and was hoping this would provide better explanations of what could only be hinted at in a short talk.  The writing is accessible, comparable to the level of Scientific American articles.  More than merely accessible, it's lively, persuasive, and even inspiring.  Note that the figures in the e-book are in color, but in the hard-cover book they are in black-and-white.", "Helpfulness": 0.625, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36F94H3AUWUVK"}}, {"Date": "on January 7, 2014", "Text": null, "Helpfulness": 0.625, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18PQYOVPN6RSS"}}, {"Date": "on May 7, 2015", "Text": null, "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JI6G4R19I2OS"}}, {"Date": "on April 14, 2014", "Text": null, "Helpfulness": 0.6, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WI3I0LRTKD7W"}}, {"Date": "on December 29, 2013", "Text": "If you enjoy \"Nova\" on PBS, you will love this book. It is a walk through history of math and science with a brilliant companion, who sheds a new light and insightful comments on all of math, space, and science. Is he right? I did not care; the book was such a brainy tour de force that thrilled and made new connections in my brain; I enjoyed being swept of my feet,, with my brain cells in uproar.", "Helpfulness": 0.6, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AS7SB0A3QKVQV"}}, {"Date": "on August 28, 2014", "Text": "It is so fascinating and insightful that you can't just read it once :)", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKT64UJBVQ8JL"}}, {"Date": "on April 15, 2014", "Text": "I've been reading this book a little at a time, because the material is so deep, and I want to take the time to let it sink in. However, it is written in a very engaging style, and I am enjoying the ideas it presents very much.", "Helpfulness": 0.6, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32DHQZSO97CZF"}}, {"Date": "on March 23, 2014", "Text": null, "Helpfulness": 0.6, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15SSMK54K19AY"}}, {"Date": "on February 14, 2014", "Text": "I have an engineering background, and took a fair amount of math in college.  This book, however, helped me understand the \"big picture\" better than anything else I have studied or read.  I recommend it.", "Helpfulness": 0.6, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10H8HRFHGWT4S"}}, {"Date": "on April 29, 2014", "Text": null, "Helpfulness": 0.5714285714285714, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1O4ZGUQ7XB9H9"}}, {"Date": "on December 31, 2013", "Text": null, "Helpfulness": 0.5714285714285714, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18OLZIT0DGVJR"}}, {"Date": "on December 5, 2013", "Text": null, "Helpfulness": 0.5714285714285714, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1H7Y5XKPGT0OS"}}, {"Date": "on December 4, 2013", "Text": null, "Helpfulness": 0.5714285714285714, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2L1KC5CTPF9UD"}}, {"Date": "on February 6, 2014", "Text": "Tegmark's enthusiasm for his work and the big questions is infectious, and the are many wonderful elements in this book that make it very informative and entertaining.  Multiverse theories are complicated to visualize - as is a mathematical view of reality - but Tegmark manages to paint a vivid picture.", "Helpfulness": 0.6, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16MSDGQUZAG6G"}}, {"Date": "on January 9, 2014", "Text": null, "Helpfulness": 0.5714285714285714, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LIR7WQ20GXQ7"}}, {"Date": "on May 10, 2015", "Text": null, "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAD0HZLJHL3BI"}}, {"Date": "on August 11, 2014", "Text": "Good exposition of the current understanding of the \"cosmos\" but the author's theory is based on so many assumptions and correlations of experimental physics that his conclusion of a mathematical universe as the basis of reality is speculative at best and fiction in the least. But it was a good read and easy to follow especially his theory of consciousness as the result of processing information.", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HR2VSW1W6NUT"}}, {"Date": "on March 29, 2014", "Text": "An excellent approach to cosmology and also written with a sharp sense of humor. I've suggested this book to several post-doc physics scholars asking them to translate their work for the public as clearly as Dr. Tegmark has done. A fine book, very fine indeed.", "Helpfulness": 0.6, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TQT2PC3WSQMD"}}, {"Date": "on June 26, 2014", "Text": "One of the best.  He goes into all the concepts VERY deeply without math, but with a clarity and simplicity of description that allowed me to really understand some very mind-bending issues.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVCKOWC3C9GFS"}}, {"Date": "on May 27, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HQ0A2LO9KURO"}}, {"Date": "on May 23, 2014", "Text": "for us, no scientific professionals, this book help to feel better with our past destiny and impredictable future, a little less ego - a little more matter.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JWF4X7C3PAZA"}}, {"Date": "on May 21, 2014", "Text": "The author combines a solid understanding of the history of physics with a solid takes on his own theories and beliefs of the universe.  He draws lines between what is known theory and speculation; Observable and unverifiable.  Books can become out dated.  But a good part of the book holds on as a reference and document of what was known at the time of the book's writing.", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABIRF818ECZKR"}}, {"Date": "on May 8, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3U8YCPG7X71V8"}}, {"Date": "on April 29, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RHQI2320LTOO"}}, {"Date": "on April 11, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ETBY5KD20L6K"}}, {"Date": "on March 17, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOT86E19KMKOJ"}}, {"Date": "on May 31, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PZLWR1ZIG0R9"}}, {"Date": "on February 18, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHCA0TKJE4MFL"}}, {"Date": "on January 30, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3K2ILNHGAETJJ"}}, {"Date": "on January 3, 2014", "Text": null, "Helpfulness": 0.5714285714285714, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16W8HTCIWYDZ6"}}, {"Date": "on October 9, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WU2GH2HFC7D2"}}, {"Date": "on August 17, 2014", "Text": "Brilliant Author. Since much of the material is difficult for a layman to comprehend, I especially appreciated his summaries at the end of each chapter.  He believes in multiverses, a concept I find difficult to accept. If you understand uantum physics, you will especially enjoy this book.", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AX8RMMB7RIXQ4"}}, {"Date": "on January 23, 2014", "Text": null, "Helpfulness": 0.5714285714285714, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATYUQROTHLNYV"}}, {"Date": "on January 31, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26HN7YMEJI4V9"}}, {"Date": "on April 14, 2014", "Text": "The first half was a resonable review of what we know about the cosmos.  The illustration of how we come together in space time was novel and believeable.  However, the later chapters, as a whole, were not convincing.", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AI900FGODR478"}}, {"Date": "on August 19, 2014", "Text": "If nothing else Tegmark remains a man of his convictions and he certainly reveals them in this book. His basic thrust is that mathematics, that is mathematical structure, is the foundation of reality. By this he doesn't mean that reality is described by mathematics, but that it *is* mathematics. In making this claim, Tegmark takes us on a tour of the universe from its beginnings in inflation and the big bang to the vast scope of 4 levels of multi-universe all in an effort to demonstrate that all of this ultimately comes down to mathematical structure. Personally I have doubts about these claims on many levels but there is no getting around the fact that Dr. Tegmark does an excellent and very accessible job of explaining himself without recourse to a lot of mathematics. The universe must fit together in some way, and Tegmark's view of it all, while quite likely not the final word on the subject, is very well argued and always interesting. For those interested in the intersection of physics, cosmology, and philosophy, this will be a very good read.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16XUHEYEYF8TB"}}, {"Date": "on May 4, 2015", "Text": "OMG!  This is an enthralling book!  I loved every page of it.  My theory is that intellectual stimulation is one of the greatest pleasures in life, and this book offers a Great, Big, Free-Flowing Abundance of it.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A256Y38CLTOU3V"}}, {"Date": "on December 5, 2013", "Text": null, "Helpfulness": 0.5833333333333334, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RPTVW5VEOSI"}}, {"Date": "on November 2, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VZP1K5EBI13R"}}, {"Date": "on January 26, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28DPWQWUGETEV"}}, {"Date": "on July 5, 2014", "Text": "bought for science book club in adult living facility- we have several engineers, a physicist, lawyer and physiologist- . This is a real thought provoking book as seen by each member", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CWB9NF3VBUE2"}}, {"Date": "on April 20, 2014", "Text": null, "Helpfulness": 0.6176470588235294, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AY6ETHM6JZ3EY"}}, {"Date": "on December 22, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GSPLYHQYNYX3"}}, {"Date": "on April 21, 2015", "Text": "Clearly stated research on the last scientific explorations of the boundaries of our known (and speculated) universes. Good read for anyone!", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36NVTRPX5CUC"}}, {"Date": "on October 7, 2014", "Text": "Not more than a couple of pages, when put all together, on why and how math is the most basic fundamental reality. None of the questions on the purported subject are discussed. I feel cheated; I was looking for how the author supports his extraordinary claim. But the book turns out to be no different from twenty or so others in circulation, all written by eminent personalities, repeating over and over again the latest theories in fashion - on cosmology, quantum mechanics, and so on.", "Helpfulness": 0.6, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIL009Z8XWX14"}}, {"Date": "on April 9, 2014", "Text": "Tegmark is the latest of a group of physicist who is attempting to popularize science for the general public. Like Brian Greene and others. His book at least starts out and ends as fairly readable. I think it slows down a bit in the middle when he is trying to explain fundamental laws and theories. His basic argument is that while there is a consensus that mathematics is the language of the Universe, Tegmark takes it further and argues that mathematics IS the basis of the Universe or of reality. Rather the Universe is a mathematical structure. I think it is a fairly convincing argument. Where I am a little unsure is where he endorses multiple universes, also known as Hugh Everett's \"Many Worlds Theory\". He feels that a truly mathematical Universe makes that not only entirely possible but necessary. I would recommend this book as it has an innovative argument and seems to be supported well. I enjoyed reading it for the most part. Some of the middle chapters were a little too complex for me. He does a good job of summarizing his points at the end of each chapter however.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AH1HXN20AYVHJ"}}, {"Date": "on February 2, 2015", "Text": null, "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KXGLNYY61VUC"}}, {"Date": "on December 16, 2013", "Text": null, "Helpfulness": 0.5555555555555556, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9ELHLPXF7JKD"}}, {"Date": "on April 22, 2015", "Text": "Thank you for so clearly sharing such exciting ideas and your love of science, mathematics and life.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AY620M6LFXPML"}}, {"Date": "on April 22, 2015", "Text": "This is a challenging read.  If you like strong intellectual reading, this book will be for you.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14PEP29XQT3PV"}}, {"Date": "on April 22, 2014", "Text": "A fabulously written book for readers like me whose background is not in science, but who harbor the interest in exploring reality. It's very understandable, even though the different levels of multiverses require a healthy dose of imagination. I also liked the omission of including religion into the narrative.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30EH2Y1B679ZF"}}, {"Date": "on April 21, 2014", "Text": "We may be alone in the universe. Fortunately, neither we nor our universe appears to be alone in the multiverse (which, btw, is my odds on pick for word of the year). Whether you've been watching Cosmos or just found out about inflation theory from the news recently, Tegmark's book will catch you up on all the latest insights physics has to offer.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38UTYM56DF96B"}}, {"Date": "on April 19, 2014", "Text": "This is quite an interesting book with a lot of information. I have learned much about the world of physics and cosmology. Many details were provided to support the author's stance on the mathematical universe and the logical conclusion is satisfying.", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5L19EC39HRIC"}}, {"Date": "on April 14, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3N10W4T5GBPR2"}}, {"Date": "on March 19, 2014", "Text": "This book covers the important concepts in particle, quantum, and cosmological physics (without math) and manages to discuss a mathematical universe without requiring the reader to know or even understand complicated math concepts. I have been reading physics books for years and I learned new things about the core topics of modern physics.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3K33LA5MWB6OM"}}, {"Date": "on February 12, 2014", "Text": "More and more science is showing that reality is stranger than fiction; this book does that in spades. The first half of the book is basically a review of the enormous advances in cosmological research. The second half is about Tegmark's search for the meaning of reality. It gets pretty heavy for the layman.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GI1OKBU3R4HL"}}, {"Date": "on February 1, 2014", "Text": "This book exposes us to cutting edge theories and deep discussions in a very informal way, without requiring higher knowledge on both math and physics. The text is crystal clear and the author, as any good scientist is not afraid to share with us pros and cons, always based on a rigorous scientific methodology.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AL5H5GBPK9PNN"}}, {"Date": "on October 18, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BFDL7I7YU5LW"}}, {"Date": "on May 29, 2014", "Text": "Having just written a review noting that scientist authors often fail miserably when trying to author a book as opposed to a academic paper, I found Max Tegmark to be an exception. Tegmark's writing style makes the difficult topic of theoretical physics easy to understand and without a doubt I'll be looking for future works from this author.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VNZ0VVW3FWI4"}}, {"Date": "on August 16, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8JFGVXDLED39"}}, {"Date": "on March 22, 2014", "Text": "Mr. Tegmark has a bright, inquisitive and inventive mind.  He is persuasive in his explanation of his theory of multi-universes--both parallel and some not so parallel.  It's a fun and interesting read and though I'm not a physicist and not much when it comes to mathematics, I was able to ride the storm and learn.  However, he loses me when I see a card or other object standing on end waiting for it to tip one way or the other thinking, while watching, that this very thing is going on in another universe with a different result.  That is something that I find too far-tetched to contemplate and might be left out of the equation.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARG5SW5QXVZ4X"}}, {"Date": "on April 17, 2014", "Text": null, "Helpfulness": 0.5555555555555556, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HLSPVXTVU08E"}}, {"Date": "on November 29, 2014", "Text": "An extremely stimulating book about understanding our universe and our place in it. It is written in a very engaging and clear style, which will be accessible to anyone who has an interest in the cosmos, in how to think about reality, and in the meaning of life.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AC1MRKC4QYXIA"}}, {"Date": "on September 5, 2014", "Text": "A rare point of view,explained with lucidity, I love the concept of three levels of reality ie external,internal and con sensual. Tries to provide answers to deep questions of complexity and symmetry. Very engaging book. Thanks Mr Tegmark", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWXJU9821Y758"}}, {"Date": "on September 16, 2014", "Text": "Read this book! Max writes as well as any theroetical physicist and much better than most, and he has some wild ideas that will drag you (kicking and screaming or not) into the several levels of multiverse that inhabit his fertile mind.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2O1SZDRW03P5X"}}, {"Date": "on January 10, 2015", "Text": "Great book for someone who is not a mathematician to get an understanding of the current topics in cosmetology. Max Tegmark explains four levels of multiverse  theory, discussing how current experimental data applies.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12LPN31NEPGES"}}, {"Date": "on August 28, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24MOJM79H2A8G"}}, {"Date": "on March 13, 2015", "Text": "I thoroughly enjoy Tegmark's elaboration of issues underlying and beckoning us toward serious consideration of 'what creates us', as well as 'what lies before us', both individually and as a species. Some reviewers seem offended by the audacity of his questioning and dismiss his ideas as too speculative. But just where are new ideas to come from if not from such wide-ranging probes of prospects and possibilities?", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KNNP9F5GFPH1"}}, {"Date": "on July 6, 2014", "Text": "this is a great book. but it may go over the heads of non-mathematicians despite the minimum use of math. but as far as the ideas this is the breakthrough!!! really enjoyed it.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZIF1LOX9XCA4"}}, {"Date": "on March 18, 2014", "Text": "Easy to read for a non-scientist like myself.  His overview of current theory is refreshing and easy to understand.  I like the informal approach to a very esoteric subject.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3K23NMC9XDSRT"}}, {"Date": "on December 21, 2014", "Text": "A book on a difficult theme written by a very enthusiastic author. Many parts are in my humble opinion very speculative, but must naturally be very speculative. I think it's necessary to read the book twice. Will humankind ever find the final answer? I think this book provides the right questions, and it's written with much humour which makes it easier to read.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10UCDUP3GQ6C9"}}, {"Date": "on January 4, 2015", "Text": "I first came across the author giving a lecture on the topics expanded on in this book and I am glad I pursued that interesting notion. Tegmark makes digestible what should be difficult material for a non-physicist to comprehend. I feel I have a much deeper appreciate understanding of reality and alternate perspectives. The call to action is inspiring.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3M0KC08HMY8I3"}}, {"Date": "on August 4, 2014", "Text": "An extremely readable explanation of some of the most difficult cosmology and physics questions and the mathematical principles behind the workings of the universe.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15A45QCAWH02K"}}, {"Date": "on May 4, 2014", "Text": "Well written for one fairly schooled in cosmology and the latest views on physics. This is not an easy read, tho well written.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AO2OTUB4TZRD"}}, {"Date": "on February 8, 2014", "Text": "Well written, interesting concepts backed up science, in the realm of the unknown his theory is as plausible as any other. It is refreshing that some people like Max are thinking and writing about the really important ideas that maybe one day will reveal our purpose in the universe.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20TM3894DCFIO"}}, {"Date": "on November 1, 2014", "Text": "I have a resonable mathematical background, but it did not hinder me (wink!) because Max Tegmark leads the reader through the beauty of both the mathematics and the univers(es). The multi-univers theories are mind boggling and very well argumented while creating a suspens . The reader cannot escape wondering how far the book will go.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GWJO4M7JEAGL"}}, {"Date": "on July 29, 2014", "Text": "This is one of the best books on Cosmology. The book keeps reader's interest all the way end of the book. Thanks", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XD2V4E8EEFKU"}}, {"Date": "on July 17, 2014", "Text": "Max Tegmark's personal theory is grounded in very solid science. It is the interpretation of current knowledge as it makes the most sense to him. The question of \"What is Reality\" is one that scientists and philosophers have sought an answer from the dawn of civilization. Quantum Mechanics itself forces us to alter our understanding of 'reality'.  It's become very popular for well-spoken scientists to write books detailing their own conclusions about what the facts as we know them actually mean to us. Tegmark is to be congratulated on his superb ability to explain both the facts of particle physics and QM and clearly show how he reaches his conclusion to that favorite debate question: \"Is mathematics simply a tool to explain reality or is it the inherent property that is reality?\"  This is a fun topic to ponder and Tegmark's book will very likely affect how you think about it... you may agree, or you may strongly disagree, but you will learn a lot about the science involved.", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36JK2BSXS0U43"}}, {"Date": "on March 2, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AO78ZHG78SHZ1"}}, {"Date": "on April 29, 2014", "Text": "Contemporary science provides a sense of satisfaction as explanation of nature surrounding us.  The personalities of science contribute to pleasure in this understanding both through their personalities e.g. the sense of humor of Feynman, or a fundamental humanitarian view of the world as in the case of Einstein.  In other words personality of our cadre of scientists is integral to our understanding of science.  Comes now a variation on this experience in Max Tegmark.  With his \"Our Mathematical Universe\" we get a double dose of insight with a novel twist.  Not only does he provide exemplary, readable insights into quantum weirdness (at the smallest scale) or cosmic background radiation at the largest of possible scales. The twist is he grasps mathematics of these issues as both fundamental to our knowledge but also considers mathematics as 'the' reality of our world.  All that we observe, and are, is mathematical!", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15JILJ8QQ4W2X"}}, {"Date": "on August 18, 2014", "Text": "Enlightening and mind boggling. Enjoyable easy reading. Max makes complex things easy to comprehend.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23IFYUE7I1ZW5"}}, {"Date": "on April 26, 2014", "Text": "This book is a highly entertaining, profound, and thought-provoking romp through the bleeding edge of the most fundamental frontiers of the biggest and smallest unanswered, but peppered with many compelling hypotheses -- questions.  A must-read for anyone with an interest in the big questions about Life, The Universe(s) and Everything.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEZSES2UEQG34"}}, {"Date": "on January 17, 2014", "Text": "I had the pleasure of discovering Professor Tegmark on television and subsequently interviewed him on my radio show. I must admit I am still reading the book but I absolutely love it. It is for both the science enthusiast or anyone interested in the workings of our existence. The graphics are tremendous in illustrating the ideas and make this the all more approachable. I recommend it highly and thank him for being an amazingly gracious guest for \"This is Diana\"!", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1B39SZDIUCRSM"}}, {"Date": "on December 31, 2013", "Text": "On initial read I was a bit disappointed in this book. Too wordy, I thought, and a little too conversational. And too long. Then I realized I was unfairly comparing Tegmark to Feynman and Gamow — not so much as a scientist but as a writer. And that's really not fair. I still prefer those other scientists' styles to Tegmark's — this is a bit of a slog — but the content is fascinating. I am on a board that recommends books for purchase as awards to high school students and I may very well nominate this next year. Recommended.", "Helpfulness": 0.5454545454545454, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TUDA3O519RYJ"}}, {"Date": "on April 6, 2014", "Text": "I had read Tegmark's paper on parallel universes in Scientific American and I was curious to know how the author can justify such an apparently crazy theory. The book is an e\"xpansion iof the paper, very well written. The first half is devoted to a general theory of inflation and is a preparation to the second part, the theory of parallel universes. What is really fascinating and very exciting  is the defense of the platonist thesis saying that universe  is purely mathematical. It is not to say that we can admit completely by this thesis, but Tegmark's discussion is clear, informative and gives a new light on many topics. A marvelous reading for anybody interested in the deep structure of universe and reality.", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13127GY9888KT"}}, {"Date": "on September 15, 2014", "Text": "Arrived timely.  Exciting and stimulating.  Well written.  Thank you.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UB7J05NTBNVO"}}, {"Date": "on April 29, 2014", "Text": "A good book that makes as understandable as possible the world of the very small (quantum mechanics) and the very large (theories and origin of the universe.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FD4L75JR2A0Z"}}, {"Date": "on September 24, 2014", "Text": "Slow reading for me, the concepts are brilliant, very quotable.  Many I didn't agree with but have to give 4 stars because of how it challenged my thinking.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAVSRHVZ1IJP2"}}, {"Date": "on June 28, 2014", "Text": "A little crazy at times and sometimes hard to follow the logic, but an interesting overview of the current state of quantum physics/mathematical thinking.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1H2O10QXM682G"}}, {"Date": "on October 6, 2014", "Text": "A great example of a Pythagorean philosopher from our own time.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22C6LLLFXKXLG"}}, {"Date": "on February 2, 2014", "Text": null, "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQEWU8G8BWLQW"}}, {"Date": "on March 21, 2015", "Text": "One of my favorites. Tegmark does a really clean concise job of taking you Alllll the way.. If you enjoy having your mind blown, this is a fun read.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VKOEJT4J6FBP"}}, {"Date": "on March 12, 2014", "Text": "Describes the universe in broad strokes that does not talk down to the reader, humanizing the physicists and mathematicians who make the discoveries, with links to the original scientific papers for those who want the deeper math.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LVQA407J120S"}}, {"Date": "on June 29, 2014", "Text": null, "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEY3QMECFRRQ7"}}, {"Date": "on September 26, 2014", "Text": "... interesting presentation ... I would have like to see more details about the assumptions that underlie many of the estimates", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KLREAADKAOGD"}}, {"Date": "on July 16, 2014", "Text": "This book was like a time machine that allowed me to go advance my 42 year old physics education to the present state of knowledge on the origin and nature of our universe.  I'm also grateful to the author for his willingness to extrapolate/speculate on the true nature of the universe from his rare perspective as an accomplished theoretical physicist.  Anyone with a strong curiosity as to the nature of the universe will enjoy this book (heavy math knowledge is not required).", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ZSI9T81QH44"}}, {"Date": "on March 8, 2014", "Text": "My brain hurts. This was an excruciating ride but one well worth taking. In the end, I have to admit that I feel that I've only skimmed the surface of this book, only gained a better feel for the state of everything from quantum mechanics to cosmology today. I can't say I've understood it but I've come to appreciate it just the same. That great minds can think along these lines and outline their thoughts for the rest of us is reassuring.", "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24AH4H01RMYPT"}}, {"Date": "on November 5, 2014", "Text": "Engaging and fascinating. Max Tegmark makes a strong case for the existence of many kinds of multiverse. I appreciated his willingness to take this thinking all the way through it's implications for our lives. He shows us that a thorough examination of reality, using what we now believe to be true about physics and our brains, leads us to realize we live in a reality far stranger and more complex than is commonly believed.", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AU2CDUGWZW3KC"}}, {"Date": "on July 10, 2014", "Text": "Interesting ideas but self indulgent and does not address alternate views sufficiently to support his ideas.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HGKC4AEHIXW3"}}, {"Date": "on September 24, 2014", "Text": "Tegmark is always interesting whether you subscribe to his theories or not. This is no exception", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KZXETJEUURCE"}}, {"Date": "on September 18, 2014", "Text": "Interesting book, but I'm not convinced of some of the \"infinite universes\" hypotheses.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11JT1OSUUW35G"}}, {"Date": "on May 14, 2014", "Text": "I enjoyed the challenges to my. Mind as I read this book. At times it was hard to understand his thought process but I stuck with it and was rewarded", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DREXXV5Z626I"}}, {"Date": "on May 4, 2014", "Text": null, "Helpfulness": 0.3333333333333333, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FEMJH8XVLQO4"}}, {"Date": "on March 20, 2014", "Text": "Don't worry, it's not full of incomprehensible mathematical equations.  This is a very different perspective written so that those with basic scientific knowledge, can understand it without being a math major.  Max Tegmark is a scientist with a keen sense of humor who obviously loves sharing the wonder of science as it relates to everything from the universal to the personal.  Although I got a little lost in some of his analogies near the end, he caught and held my attention throughout the book.  If you like books in this genre, this is a must read!", "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35GO4VSQ5PUJ4"}}, {"Date": "on March 18, 2014", "Text": null, "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1K6OJ9X0ODN8V"}}, {"Date": "on March 16, 2014", "Text": "An awesome and interesting book to read that opens your mind to many possibilities. Anyone that reads it will, for sure enhance his/hers knowledge and will gain a huge amounts of possibilities about our universe(s).", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CXICA7JJPDTM"}}, {"Date": "on March 8, 2014", "Text": "A layman's look at the universe and all its possibilities in easy-to-understand form. So much is covered, its like taking a ride through the universe or should I say multiverses. A very cool book... need to read, think, reread, read some more and then lay back and let your imagination run wild.", "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGRX0OWYZTL3T"}}, {"Date": "on March 2, 2014", "Text": "Present a good overview of the main theories in support of the existence of the multiverse and a curious Neoplatonic suggestion regarding mathematics as the ontological underpinning of reality rather than merely a tool by which the physical world can be explained.", "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQAWEKIGZADJG"}}, {"Date": "on February 14, 2014", "Text": "Easy-ier to understand than a text book! I loved this guys enthusiasm for something of which I have so little understanding", "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10LJ7108S4B40"}}, {"Date": "on February 8, 2014", "Text": "Great read. Unlike many popularizers of contemporary physics, he anticipates the questions the curious layman is too shy to ask.", "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Y91AWNMW6QYB"}}, {"Date": "on February 7, 2014", "Text": "It was great fun to see some of the mathematical logic behind fascinating concepts. This is a great book to have when it is too cloudy to do astronomy but you still want to do some exploring. I would recommend it for anyone that wants to see how Math is used to explain and support hypotheses.", "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DRSG38Y5XKQ8"}}, {"Date": "on December 31, 2013", "Text": null, "Helpfulness": 0.5, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1M2WK58L35MXJ"}}, {"Date": "on March 13, 2014", "Text": null, "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HKR48G28NRUC"}}, {"Date": "on February 8, 2014", "Text": null, "Helpfulness": 0.5978260869565217, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TQ5AT70LZJI6"}}, {"Date": "on February 16, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IP0CLSLCPYWC"}}, {"Date": "on November 11, 2014", "Text": "Excellent book.  Makes complex subjects understandable for the non-scientist.  His enthusiasm is evident in every page.  A book that will be enjoyable reading a second time.  Leaves you wanting more.  Hope he writes a follow-up.", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23V9JAJWWVZQL"}}, {"Date": "on October 11, 2014", "Text": "With a touch of humor (Surprise!  There is a sense of humor in Sweden!) in this well researched, scholarly work, Dr. Tegmark helps the reader understand and accept our Reality in our Universe.  Good job!", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31XG71I93K5NQ"}}, {"Date": "on June 21, 2014", "Text": "Wonderful panorama of first standard modern cosmology and then, a stupendous tour of fascinating speculations on life,mind, the universe and everything and all of that with a very good sense of humor.", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFARJNMMRT0LK"}}, {"Date": "on September 29, 2014", "Text": "Absolutely stunning!", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3V81HDA769OA"}}, {"Date": "on October 23, 2014", "Text": "Again purchased for my husband and he seems to like it", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQKIU5A37GK2G"}}, {"Date": "on May 25, 2014", "Text": "This book is an excellent read. I recommend this for anyone, whether they are Physicists or just interested in the future of science and the exploration of the universe.", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZYB1HVYJZPTS"}}, {"Date": "on March 1, 2014", "Text": null, "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2P3G985CCCX5I"}}, {"Date": "on June 18, 2014", "Text": "Max Tegmark is one of the most adventurous thinkers alive today, and this book is a well written exposition of the core of his thoughts for a general audience.", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2V124TMAOVCNN"}}, {"Date": "on June 25, 2014", "Text": "Mind blowing, wonderful!  This book has be starving for more. The book is very well organized and remains intellectually accessible to the non-mathemetician.", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AP3094FY468AY"}}, {"Date": "on February 24, 2014", "Text": null, "Helpfulness": 0.42857142857142855, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LM1HE1HAXMVB"}}, {"Date": "on November 6, 2014", "Text": "Accessible tour through modern physical theory. Even if you don't agree with the assumptions your worldview will be changed by reading this.", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DDH6YGT815XO"}}, {"Date": "on February 15, 2014", "Text": "Some of the ideas are a little hard to follow and require multiple readings of selected chapters. But that said, the author does a great job of explaining some very difficult concepts to the layperson. A little knowledge of mathematics helps, but is not necessary to get most of what he is trying to say. The crazy aspects of the multiverse was treated with a strictly reasoned approach, and I almost believe him.", "Helpfulness": 0.4, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HM1O8RFZYI44"}}, {"Date": "on March 17, 2014", "Text": "This book is a really tough read.  Unless the reader has a considerable background in physical science he shouldn't be reading this book.  Try something considerably more basic.  For those with a good grounding this will be a very interesting presentation..", "Helpfulness": 0.4, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VAO7ZZNW8UAN"}}, {"Date": "on February 11, 2014", "Text": "Even if it turns out that he's wrong, he'd be wrong in such a wonderful way that this is absolutely worth reading. And if it turns out that he's correct you'll be thanking yourself (literally, possibly) for taking the time to absorb it.", "Helpfulness": 0.4, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Z7P20NMZ0GNP"}}, {"Date": "on September 14, 2014", "Text": "Good start - monotonous finish.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SW21OCCFLICU"}}, {"Date": "on March 12, 2014", "Text": "This is one of the most interesting books I have ever read. I has shaken my perspective on the world.", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LSLQFUE7BN8P"}}, {"Date": "on July 12, 2014", "Text": "Excellent book for who is interested in the latest scientific insights in how the universe works.", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUMKBY4XCPT2O"}}, {"Date": "on December 20, 2014", "Text": "Too technical and repetitive", "Helpfulness": 0.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FTNRZ1P3APWA"}}, {"Date": "on June 11, 2014", "Text": "I appreciate the author's effort to make the far-reaching and complex science accessible to people who do not make the topics their work, though the topics and their implications touch most of us, if only as fleeting questions about our universes.  Max's weaving of his personal experiences and personal ideas with scientific explanations of the Universe is fun as well as enlightening.  I think that he does a good job distinguishing his personal thoughts from the accepted and controversial science.  His explanations of the controversies in science are excellent and enlightening, as well.  Most of us think that statements from scientists or branded as scientific are the end-all-be-all of them, those people, the scientists and their industry.  Max explains various understandings of major scientific theories and some of their history.  Not so easy to read even for someone with a technical background, but fun to work through.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RW3T27TBV5WF"}}, {"Date": "on December 19, 2013", "Text": "Max Tegmark’s idea of a mathematical universe is admittedly a “radical extreme” idea that all matter is made up of particles that can be reduced to mathematical properties.  Someday, there will be a mathematical function that will explain the universe and everything in it; the illusive grand unified theory perhaps.  “Our Mathematical Universe” is much more than Mr. Tegmark’s pet theory.  If you have an inquisitive mind like Mr. Tegmark’s, many of your lingering questions may be answered, and progressively, you will be immersed into universes that get wackier by the chapter.  If there is even an ounce of truth to any of the ideas espoused by Mr. Tegmark, truth is indeed stranger than fiction.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WFXYRDB5A0N5"}}, {"Date": "on February 21, 2015", "Text": null, "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVZYYKY6Y7D5M"}}, {"Date": "on February 20, 2015", "Text": "Tegmark is obviously a very bright guy with a deep understanding of physics.  Still trying to wrap my head around the idea that the universe is mathematics.  It's an intriguing concept and is certainly the work of someone willing to think in a very unconventional way.  He is careful to write in a way that doesn't require a strong background in math or physics.  I would recommend it to anyone interested in how physics might develop.  There is no way to be sure whether Tegmark's ideas will hold up, but that's fine.  He is clear some of what he's describing is speculative.  Now, if he could just work in some vampires, or Hobbits or something...", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24E52XLWLZTE4"}}, {"Date": "on February 20, 2015", "Text": "The best features of this book is the clarification of precision cosmology and the non-technical exposition of quantum physics. H strongly advocates different multiverses. I don't find his relation of the many worlds interpretation of quantum mechanics to the multiverse implicit in inflation theory convincing. One could use the consistent histories interpretation of QM which does not entail many worlds and does not relate to inflation but fits the same problematic that the Everett interpretation does.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A258MX8OUH847G"}}, {"Date": "on December 30, 2013", "Text": null, "Helpfulness": 0.42857142857142855, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQ6YJM2J2LNOP"}}, {"Date": "on August 15, 2014", "Text": "MAX makes cosmology understandable and fun!", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GM18480DLQ81"}}, {"Date": "on July 16, 2014", "Text": "The best book on the cosmos I have ever read. It is well written and highlights interesting new ideas. I loved reading it.", "Helpfulness": 0.4, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IGCNN83GTWAA"}}, {"Date": "on April 9, 2015", "Text": "Excellent...", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A308G00PAX6QJ4"}}, {"Date": "on March 28, 2014", "Text": "I'm through the first chapter,and I am enjoying the personal style this is written in. You definitely feel the author's enthusiam for the subject matter, which makes the information he is conveying interesting as well.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Q21K2HLI8RUL"}}, {"Date": "on March 25, 2014", "Text": "Author is an authority in field and writes well.  Cosmology is currently  a very active field both  in observations and in analysis.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4LKZM3XLLIHL"}}, {"Date": "on March 10, 2014", "Text": "Not a lot of books hold my attention. This one certainly does. A fascinating journey thru parallel universes and beyond.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Q9CDUV9E5IT7"}}, {"Date": "on July 4, 2014", "Text": "It's fascinating ... but much of it was WAY over my head.  Still, getting the general concept and knowing that there is this kind of detail to back it up was worth the slog.  Methinks Prof Tegmark is mighty fond of himself ... but then he's good a very, very interesting view of the world.  I do wish he'd written down a tad; that would have helped.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3V7NOWF08QGX9"}}, {"Date": "on April 3, 2015", "Text": "excellent", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1135FP96QI88F"}}, {"Date": "on January 16, 2014", "Text": null, "Helpfulness": 0.25, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOVI5Y45L6B0J"}}, {"Date": "on December 11, 2014", "Text": "In my view \"Our Mathematical Universe\" is a great book, probably in some of the chapters a little far fetched but who can blame a curios mind of being asking grander question and in so many occasions inventing new creative answers.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37NCBYELSXPJD"}}, {"Date": "on February 18, 2015", "Text": null, "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VNM3WC4ZTTE1"}}, {"Date": "on October 27, 2014", "Text": "...to be blown away and mind-boggled by Our Mathematical Universe.  Even if it turns out that Tegmark's answers are off the mark, his questions always are right on.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJFJJQN4JSODY"}}, {"Date": "on January 22, 2014", "Text": "Reality is not what it used to be. This book will give you insight into the world and universe around us. Some of the concepts may seem a little out there but they will stay with you forever. Enjoy this book!", "Helpfulness": 0.25, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IWZ2B4BAZD3X"}}, {"Date": "on January 12, 2015", "Text": "Did not answer the fundamental question where are the scales that separate the quantum and classical regimes.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3NT3NNXXLOCZ4"}}, {"Date": "on November 2, 2014", "Text": "Do not be afraid of the math.  Charts do not show up well in Kindle editions but you don't really need to be able to read them.  I am a fast reader (sometimes finding myself reading a book in a single night), this one lasted me months.  Viva multlvers IV.  Mystical but not woo woo.", "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IIZW3QDR1VI"}}, {"Date": "on February 24, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10PZ4IV79SGP7"}}, {"Date": "on February 15, 2014", "Text": "Great. The reading instructions are helpful depending on how \"lay\" a person you are. Well re-read it again soon. I recommend it to anyone that is interested in physics and how the world works", "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FMQG35GII1QR"}}, {"Date": "on July 15, 2014", "Text": "maybe most important, Chapter 13 is an honest appeal to scientists everywhere....to start informing people on Earth there is limited time.... http//www.thefutureoflife.org/", "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OHW1N4XNPWI6"}}, {"Date": "on December 10, 2013", "Text": null, "Helpfulness": 0.5517241379310345, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIWDGRTLV7IQF"}}, {"Date": "on July 5, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2U0XHQB7MMH0E"}}, {"Date": "on May 1, 2014", "Text": "A unique view of physics written in a way than even I can enjoy. Excellent writer, sense of humor, and any unabashed love of physics.", "Helpfulness": 0.25, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEM7OKQW7GLBA"}}, {"Date": "on January 14, 2015", "Text": "Excellent Item and Fast Shipping! Thanks!", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NVWB6JT4TCMS"}}, {"Date": "on January 16, 2014", "Text": "This book belongs on the list with Schneider's Beginner's Guide to Constructing the Universe, Dunham's Mathematical Universe (the alphabetical journey is fantastical!). Turns math haters into fascinators, and lovers into scholars.", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A265IEMG2K5R4W"}}, {"Date": "on December 23, 2013", "Text": "Max Tegmark  has written a book based on today's assumption on expansion, Big Bang, particle theory and of course parallel worlds. The author tells readers it is is own thought process and applying mathematics for his hypothesis that our physical reality is a mathematical structure. Author takes each section of learned sciences on the subject of How big is Space? To the subatomic Particle Physics and waves. After building of a base of understanding he second half of the book takes a leap of faith with quantum and reality discussions. Very interesting to read and absorbing to try to comprehen all the author's points. Look forward to more from the author.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOPGDH5M54SWN"}}, {"Date": "on November 29, 2014", "Text": "Well written in a style understandable to a layman.", "Helpfulness": 0.25, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KCBODZ2PMHIR"}}, {"Date": "on January 30, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BGCVO7PJ0FWP"}}, {"Date": "on December 28, 2014", "Text": "Great book!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGSSK0Z0SLLCK"}}, {"Date": "on January 3, 2015", "Text": "Stunning!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2P0UOE5EDBJR3"}}, {"Date": "on March 3, 2014", "Text": null, "Helpfulness": 0.2, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOL80INNS0YWP"}}, {"Date": "on April 29, 2015", "Text": "Good", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUWV2R6E0MWR0"}}, {"Date": "on January 8, 2014", "Text": "This book needs to be required reading for anyone interested in the reality we live in.  Its an easy read, I read it in one day, and yet I am sure the ideas it contains will stay with me forever. Every page is a joy to read even though I was already familiar with many of its topics. If you buy one book in the next year this should be the one.", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2W17SY43QT800"}}, {"Date": "on November 30, 2014", "Text": "The most thought-provoking physics popularization I have ever read.", "Helpfulness": 0.2, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1THX7VA2DBWA"}}, {"Date": "on February 19, 2014", "Text": null, "Helpfulness": 0.5084745762711864, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10U3PIZ1BJ9II"}}, {"Date": "on February 1, 2014", "Text": null, "Helpfulness": 0.515625, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3H1QNH0Q2L04C"}}, {"Date": "on August 26, 2014", "Text": null, "Helpfulness": 0.3333333333333333, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A39ATYLO255URE"}}, {"Date": "on December 5, 2014", "Text": "Too much fantasy", "Helpfulness": 0.2, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A203B495WRAF2S"}}, {"Date": "on November 18, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DIWPPO52S64R"}}, {"Date": "on June 13, 2014", "Text": "Interesting and maybe difficult topic. Poorly presented with too much ego and little scientific based explanation. Definitely not in Penrose or Dawkins class.", "Helpfulness": 0.42857142857142855, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARGVVT5WB3MVJ"}}, {"Date": "on January 2, 2015", "Text": "Enjoy life as it comes to you", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RRZO1I1H4YA7"}}, {"Date": "on November 12, 2014", "Text": "Great book, thanks", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CV39BJEAYBHU"}}, {"Date": "on January 30, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALHB393IWFUF"}}, {"Date": "on January 24, 2014", "Text": null, "Helpfulness": 0.39285714285714285, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AYZSTWTSNWM9"}}, {"Date": "on February 9, 2014", "Text": "The book came quickly in excellent, new condition.  The advertising of the book was accurate.  I have not read the book yet, but I have glanced at it and believe I will like it.", "Helpfulness": 0.125, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GFY2QV7EVT4Y"}}, {"Date": "on February 28, 2014", "Text": "this is a comprehensive compendium of early galaxies starting from the dark matter halo to total galaxy.  Dr. David Rosenberg Norfolk Va", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BHKQ6GEQXJOJ"}}, {"Date": "on February 23, 2015", "Text": null, "Helpfulness": 0.2608695652173913, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TGFEF8YQ1H86"}}, {"Date": "on January 25, 2015", "Text": null, "Helpfulness": 0.15789473684210525, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8HS6N6BLZVSJ"}}, {"Date": "on January 29, 2014", "Text": "Very popular, reviewed well in some quarters, but I can only warn you to think twice before spending your good money on this book.  Google it and find opinions not reflected here on Amazon.", "Helpfulness": 0.28846153846153844, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PXR1MZ685TRO"}}, {"Date": "on April 21, 2014", "Text": null, "Helpfulness": 0.09375, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HZMHCB3HKUE1"}}, {"Date": "on February 18, 2014", "Text": "The review I wrote for this book was under the fourth discontinuity - sorry about that.  The 4th discontinuity is fine. Thanks, Mic", "Helpfulness": 0.08823529411764706, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AO355HVKOO80X"}}], "ReviewUrl": "http://www.amazon.com/Our-Mathematical-Universe-Ultimate-Reality/product-reviews/0307744256/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.2 out of 5 stars"}, "OfferPrice": "$13.82", "Salesrank": "#9,094", "ListPrice": "$16.95"}