{"Category": "in Books (", "Name": ["Ten Lectures on Wavelets (CBMS-NSF Regional Conference Series in Applied Mathematics)"], "Timestamp": "2015-05-24 23:21:20.093739", "itemurl": "http://www.amazon.com/Lectures-Wavelets-CBMS-NSF-Conference-Mathematics/dp/0898712742", "Reviews": {"TotalReviewCount": "11", "ReviewList": [{"Date": "on July 11, 2002", "Text": "This book has become a classic,-- and a hit;-- for more than ten reasons. It is multilayered, and yet presents a unity of ideas: The material, and the writing is engaging for the beginner, and for the research mathematician alike. When I used it in my teaching, it was equally popular with the math students, and those from engineering. I don't know if I can say this about any other book I have taught from. The students could follow all the carefully presented proofs, and the engineer could generate algorithms from the applied chapters.", "Helpfulness": 0.875, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1N2477VRD8OIZ"}}, {"Date": "on October 10, 2000", "Text": "This is the document that started it all.  It is by far a great mathematical and theoritical piece of work.  HOWEVER, if you are just starting off and want to learn about wavelets and do not have an advanced math or engineering degree (and I do mean ADVANCED), do not pick up this book.  At least not at the beginning.  There are much better books written for explaining wavelets and to better present the material.  Ten Lectures is essentially one big proof.  Try Mallat/Kovacevic or Strang...once you've got a solid understanding, come back to Daubechies and marvel at her work.", "Helpfulness": 0.7777777777777778, "StarRating": "3", "Author": {"ProfileUrl": ""}}, {"Date": "on June 22, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16GAIJJE39T1S"}}, {"Date": "on May 24, 2002", "Text": "This book is a treasure of details if you know what you are doing. As another reviewer noted, it is not for the beginner. But if you have had some experience with the subject this is a must have for your library shelf.", "Helpfulness": 0.7142857142857143, "StarRating": "4", "Author": {"ProfileUrl": ""}}, {"Date": "on May 15, 2015", "Text": "Original papers ... a good starting point to learn about wavelets.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UZ3VZS16H639"}}, {"Date": "on April 2, 2000", "Text": "Clearly Dr. Daubechies (the inventor of wavelets herself) has written the best (and most comprehensive) introduction to wavelets available.  This book is suitable for the beginning graduate student in mathematics or  physics and will also provide a extremely useful reference guide for years  to come!", "Helpfulness": 0.5714285714285714, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on May 6, 2013", "Text": "This is an excellent book, very lucid and rigorous.  I took Daubechies' course on wavelet analysis while I was at Princeton some years ago, and her course essentially follows this book.  So this book makes a lot of sense to me, after taking her class.  But beware, this is a book on mathematical analysis.  It is not a book to learn about wavelets from a practical standpoint.  If you are engineer, most likely you do not have the required mathematical background to understand anything from this book.  This is really for math people, or engineers/physicists who are mathematically inclined.  The pre-requisite are real analysis, complex analysis and analysis in several variable, and maybe a slight amount of functional analysis, although the latter is not really needed because most of the theorems are derived in this book.  So to re-iterate, this is an excellent book, but it is not for learning about wavelets.  Read Stephane Mallat's textbook instead, which was written to teach the topic from a more practical standpoint.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3R1VUH9MIOE5N"}}, {"Date": "on September 6, 2014", "Text": "great book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZ0U89818WFYW"}}, {"Date": "on July 15, 2000", "Text": "This book is classic. For anyone who wants really to know wavelets, in particular comapctly supported wavelets, this book is a must-read. Also, this book is truly well-written, which makes it suitable for text of a  beginning gradaute course. Thanks to Dr. Dabechies!", "Helpfulness": 0.4, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on May 14, 2007", "Text": "What can I say, Wavelets explained by Ingrid Daubechies! You can't go wrong.", "Helpfulness": 0.2, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29Z0B2L367ZO"}}, {"Date": "on December 23, 2002", "Text": "There are so many well written books on Wavelts out nowadays. Don't waste your money on this one. It's famous because it was first (or one of the first). On the positive side, it does present a strong mathematical foundation. I recommend you buy a readable book (just do a search on Amazon.com and you'll find half a dozen great books on Wavelets), then when you approach the \"expert\" level, use this one a s a reference (if at all).", "Helpfulness": 0.3888888888888889, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FE8SKA6J4LJI"}}], "ReviewUrl": "http://www.amazon.com/Lectures-Wavelets-CBMS-NSF-Conference-Mathematics/product-reviews/0898712742/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.4 out of 5 stars"}, "OfferPrice": "$82.00", "Salesrank": "#971,519", "ListPrice": ""}