{"Category": "in Books (", "Name": ["The Principle of Relativity (Dover Books on Physics)"], "Timestamp": "2015-05-24 21:25:32.423282", "itemurl": "http://www.amazon.com/Principle-Relativity-Dover-Books-Physics/dp/0486600815", "Reviews": {"TotalReviewCount": "28", "ReviewList": [{"Date": "on January 15, 2002", "Text": null, "Helpfulness": 0.9545454545454546, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D7XC7USJ9X7J"}}, {"Date": "on March 23, 1999", "Text": null, "Helpfulness": 0.9333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UB3TFZXBL569"}}, {"Date": "on April 16, 2004", "Text": null, "Helpfulness": 0.9523809523809523, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17E7K3MQ5KKR5"}}, {"Date": "on February 26, 2003", "Text": "I do not know how I can adequately review this.  That this is indispensible to any theoretical physicist is pretty much the extent of what I am about to say.  I mean, here you have the greatest scientific giants of all time grappling with some of the deepest, most complicated issues of 20th century physics: you not only get the opportunity of finding out what they really thought about relativity, with all mathematical and philosophical details, but you also are able to see how truly great minds go about solving difficult problems (which, I feel, should be an inspiration for modern theoreticians as to how to solve the problems associated with quantum gravity, string theory, etc.).  Just the section of Einstein's paper The Foundations of a General Relativity Theory on the deep, philosophical reasons why a theory of nature should be generaly relativistic are well worth getting this book; I personally think that this one paper is the greatest scientific publication of all time (Principia is certainly bolder, more revolutionary, but Einstein's deepest ruminations, I feel, are almost religious).  To be sure, one needs certain mathematical training to get the full benefit of this book, but this could be said of relativity in general; I personally do not think that one can fully comprehend relativity theory, in all its beautiful glory, without this training.  Despite this, I still think it is possible, even without sufficient mathematical training, to get a real feel of how these titans thought and felt, even if just by osmosis (you know that profound thoughts are being expressed when you can almost grasp them without really understanding them).  In short, it is the duty of every physicist, maybe even every scientist, not just to read, but to EXPERIENCE this book (that is the only way I can adequately describe this; it is an experience).", "Helpfulness": 0.8823529411764706, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZ9FDV76PVB5G"}}, {"Date": "on July 17, 2003", "Text": null, "Helpfulness": 0.9166666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Y7EDZE7EU055"}}, {"Date": "on August 12, 2000", "Text": "I really do not know how to rate this book. I hope that rating it with  three stars could be a neutral point between the opinions of laypeople and  the physics' community. This book is a collection of the most important  lectures given by Einstein, Lorentz, Minkowski and Weyl that led to the  formulation of the theory of relativity in its two parts. The first part is  the special theory, which studies the inertial and moving reference frames  without considering the effects of gravity. The second part, the general  theory, explains the nature of gravity as a consequence of the curvature of  Minkowski's four-dimensional space-time. The expositions featured in the  book are, of course, the written version of the lectures given decades ago  by its authors. Because of this, they are plenty of strange-looking and  complex equations to the laypeople but, for any physicist, is a beautiful  mathematical symphony that explains with accuracy the principle of  relativity. You have to be a physicist to fully understand this book,  namely, if you are not a physicist, or, if you are not formally studying  physics, please avoid this book!. I am almost sure that you will get tired  of reading it after the first lecture if you do not have solid knowledge of  physics and mathematics. Try to look somewhere else for less complicated  explanations of the relativity. Maybe the book: \"Relativity: The Special  and the General Theory\" could be useful for you, the laypeople.  Nevertheless, in the other hand, if you are a physicists or something like  that, this book must be in your shelf as one of the richest treasures in  all-time physics.", "Helpfulness": 0.7551020408163265, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WB7712KRT758"}}, {"Date": "on March 21, 1999", "Text": "This book clearly illustrates the theory of relativity and all of its aspects.  I am a junior in high school and I found this book both captivating and easy to understand.  I think anyone who is interested in  this subject like I am should read this book.  It is one of the best books  I have ever read.", "Helpfulness": 0.7894736842105263, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on November 2, 2006", "Text": null, "Helpfulness": 0.875, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9C8GEBNAWOUV"}}, {"Date": "on December 16, 2006", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANDO9OR68P8GL"}}, {"Date": "on March 1, 2003", "Text": null, "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SUXJ6D9JGAFK"}}, {"Date": "on June 9, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OJW07GQRNJUT"}}, {"Date": "on March 8, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZL0RV52196YL"}}, {"Date": "on June 18, 2010", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KJO5VP4K3CHU"}}, {"Date": "on December 28, 2007", "Text": "This book presents Einstein's orginal papers on relativity along with many other \"classics\" on the subject. A good understanding of college math and physics is a must.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TMPAGMLJI54F"}}, {"Date": "on February 10, 2013", "Text": "With the end of the Ether Theory, and fixed reference frames in the universe, all motion had to be considered \"Relative\" (and reciprocal) to the participants. Lorentz, Poincare and Einstein (with Minkowski and Weyl) were the principal contributors, writing in German and French. This book is an early translation into English. The names are well known to science specalists (and beyond). Nowadays it is common to derive Relativity Theory from Maxwell's Equations (although Maxwell thought they were in error!).  Apparently that was not Einstein's starting point. In any case, Planck championed Einstein and that settled it for History.  But if (like me) you want to write on the subject, you are obligated to state exactly to what points each can claim priority.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2757LK3RA89X3"}}, {"Date": "on January 7, 2015", "Text": "I am researching Einstein's special theory of relativity basis and this book by Einstien provides more of a complete set of information. I am aware that Einstein's world view was different as his view of the cosmos was much smaller. In his day technology had not developed to view the cosmos and find trillions of Galaxies. They thought many of the sparking were stars; but in reality they were whole galaxies. With that view he projected other theories about space travel that were in error. Thus, one should examine his special theory of relativity as well. Dr. Ronald Cutburth, Management of engineering science operations, Engineering Scientist.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XJI13JNZXNMZ"}}, {"Date": "on February 18, 2014", "Text": "I had gone through this series of papers several years ago and found it 'different' in that the way the thinking was compared to what I had been exposed to while an undergrad. Now, a reread told me that it is just the way thinking was then, and is still good.  No mysteries in it, just clear presentations based on what the writers had to work with at the time.  And, considering it was all 'paper and pencil', no computers, should definitely make an impression on the level of thought and understanding was then in force.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14AWWTA1VTEE5"}}, {"Date": "on August 9, 2013", "Text": "These are the seminal works in the foundation of quantum physics. Not easy reading, but truly foundational if you have an advanced interest in the topic.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2M6Q0M563E6V6"}}, {"Date": "on August 15, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AASXAPCLLQLKB"}}, {"Date": "on December 29, 2002", "Text": null, "Helpfulness": 0.6, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A309EHJNLF8ORQ"}}, {"Date": "on August 27, 2013", "Text": "The book was exactly as espected. Perfect in form and content. Really good. I will store it with my books and read it as soon as possible.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A146QZ6XWLQZ2N"}}, {"Date": "on July 26, 2014", "Text": "No one could explain Relativity better than Einstein himself.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31CC89LPEJFRW"}}, {"Date": "on August 26, 2014", "Text": "Tough reading without modern interpretation", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19VUEJIFFO9AK"}}, {"Date": "on September 5, 2013", "Text": "This book is a compilation of articles, which contributed most the development of the theory of relativity. Namely, they are articles written by H.A. Lorenz, A. Einstein, H. Minkowsky, and H. Weyl.  Therefore, some library in my neighbourhood would have been available.....", "Helpfulness": 0.2, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19FNJ992L15DG"}}, {"Date": "on October 29, 2014", "Text": "Good casual read to remind one of the concepts etc.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LKUL0UNVV5RS"}}, {"Date": "on April 3, 2014", "Text": "Why would someone begin with their philosophy, only to end on such clear terms that only Buddhism can save humanity and the sciences, and then unlawfully position himself as an opponent to his own viewpoints in a dialectic so as to reach a conclusion midway that would divide humanity for centuries?  I know everything about this man, and he took one half the inverse of a square radical.  This leads us nowhere.  Why do we reverse such a person as would divided humanity, and destroy half the universe?", "Helpfulness": 0.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6R3HUTCRVR26"}}, {"Date": "on March 22, 2008", "Text": null, "Helpfulness": 0.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2U1M5DOGULIQA"}}, {"Date": "on July 6, 2001", "Text": "I think the theory is flawed.  A giant goat with a big magnet is responsible for gravity.  That's until the goats keeper takes it away for milking and then there's no gravity.", "Helpfulness": 0.07258064516129033, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VKWD9SJ32DI0"}}], "ReviewUrl": "http://www.amazon.com/Principle-Relativity-Dover-Books-Physics/product-reviews/0486600815/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.4 out of 5 stars"}, "OfferPrice": "$9.79", "Salesrank": "#127,653", "ListPrice": "$10.95"}