{"Category": "in Books (", "Name": ["Applied Hydro- and Aeromechanics (Dover Books on Aeronautical Engineering)"], "Timestamp": "2015-05-24 23:16:15.846918", "itemurl": "http://www.amazon.com/Applied-Hydro--Aeromechanics-Aeronautical-Engineering/dp/048660375X", "Reviews": {"TotalReviewCount": "4", "ReviewList": [{"Date": "on May 4, 2001", "Text": "This text is more easily readable that the companion volume 'Fundamentals of Hydro- and Aeromechanics.' Although the text is somewhat outdated, Ludwig Prandtl was responsible for most of the critical simplifying assumptions which made aerodynamic design possible before the advent of high performance computers. Prandtl was largely responsible from turning aerodynamics from a rather obscure branch of applied mathematics into a practical engineering application. Read this, and you may start to understand how aerodynamics developed through the 20th century.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NZNAKHU6TZ7"}}, {"Date": "on April 3, 2010", "Text": "This little fluid dynamics book is still one of the best intro works to the whole field of theoretical and applied fluid dynamics. My edition is a very early one which I value so much that I had it rebound. It seems oddly up-to-date despite being written by a World War Two era author. That seems to show just how big an influence Prandtl has had on the applied mathematics of fluid dynamics -- we basically follow-on directly in the direction Prandtl found -- using its ideas, terms and math. Just a bit of my edition's notation is odd -- not so common nowadays -- but the notation of this general field varies so much anyway that this is not much a problem. The style is clear and sharp with great illustrations and explanations -- I am surprised by just how much was already known so long ago -- at least by Prandtl. So we can see why an engineering support group insisted on getting Prandtl translated early-on from German into English. Prandtl has been re-issued via many updated editions by-the-way +++", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AES697PC2IW5"}}, {"Date": "on November 10, 2000", "Text": "Prandtl was a pioneer in wing theory. His theories and data have been passed on into numerous college level books on aerodynamics. However, the theory is a bit abstract for one seeking a basic understanding of wing operation. A better choice for that would be \"Stop Abusing Bernoulli!- How Airplanes Really Fly.\" ISBN 09646806-2-9", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": ""}}, {"Date": "on July 21, 2014", "Text": "Fundamentals of Hydro- and Aeromechanics by Prandtl is much better", "Helpfulness": "", "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34AI5AERM39Q1"}}], "ReviewUrl": "http://www.amazon.com/Applied-Hydro--Aeromechanics-Aeronautical-Engineering/product-reviews/048660375X/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "3.8 out of 5 stars"}, "OfferPrice": "$11.66", "Salesrank": "#208,296", "ListPrice": "$12.95"}