{"Category": "in Books (", "Name": ["Flatland/Sphereland (Everyday Handbook)"], "Timestamp": "2015-05-24 23:28:49.344806", "itemurl": "http://www.amazon.com/Flatland-Sphereland-Everyday-Handbook-Abbott/dp/0062732765", "Reviews": {"TotalReviewCount": "23", "ReviewList": [{"Date": "on July 18, 2001", "Text": null, "Helpfulness": 0.9583333333333334, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14DV5W2N1EAJJ"}}, {"Date": "on March 13, 1999", "Text": "I am only 17 and I read both of these books and understood every word of it. Not to say that the things covered in these two books are easy to see or comprehend but the authors did such a beautiful job of making everything  easy to understand from life in the 2nd dimention to slightly grasping the  4th dimention through mathmatics and to flipping 3 dimentional objects in  the 4th dimention thus reversing them like turning a left shoe into a right  shoe. Even if you are not interested in math or science these books let you  see the world in another way and will stay with you provoking thought at  every turn.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Q7C5YRBZO042"}}, {"Date": "on December 14, 1998", "Text": "This book introduced me to the amazingly interesting possibilaty of a fourth dimension, or even an infinite number of dimensions, and the way the material was presented (by a story of A Square and A Hexoagon and there  adventures with a sphere) is delightfully entertaining. Since the human  mind has such a horrid time visualizing the fourth dimension, taking it  down one level by having creatures living in a two dimensional world who  try to understand the third dimension is an excellent way to help people  grasp the possibility of higher dimensions. I was also very interested in  the books discussion about a curved space and an expanding universe. This  book is great for any teenager interested in theoretic sciences and  geometery and it is a great intellectual read.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on January 15, 2002", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11YFIQ4XVBASG"}}, {"Date": "on December 1, 2008", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UTKYA2U8542F"}}, {"Date": "on May 27, 2001", "Text": "Many topics in modern physics and astronomy involve thinking of the universe in more than our customary three dimensions. Super-string theories, for instance, suggest as many as ten dimensions in our universe. Yet the general public is completely unfamiliar with this mode of thinking.  Flatland and Sphereland are both stories with the perfect blend of simplicity and sophistication. Their simple, precise language is easy enough for even the casual reader to follow, yet the concepts presented are advanced enough that even experts in the field will be churning it around in their minds for days after.  When I ordered these books, I expected an entertaining story that, while intriguing, would contribute little to my education in the long run. What I found, beneath the delightful tale, was a depth of concept that has changed my thinking.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2M4ZVSG37UZ7R"}}, {"Date": "on January 7, 2003", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16CRWAAX3S85Y"}}, {"Date": "on June 24, 1999", "Text": "I am 17, and I thought that these books opened doors to a new way of thinking for me.  It is very likely that anyone who didn't like these books simply did not understand them.  Yes, the language was very wordy compared to modern literature, but no more difficult to understand than *Sherlock  Homes* or Charles Dickens.  I recomend this book to anyone who is scared of  physics or simply wants too expand their mind.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on April 11, 2008", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5A25SHEUX6ZK"}}, {"Date": "on June 6, 1999", "Text": "Flatland the book is about many intelligent geometrical creatures who think 2 dimensions is all there is until one day a square starts thinking otherwise.  Learn what is would be like to live in 2 dimensions and try to  fill in the holes", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": ""}}, {"Date": "on December 5, 2000", "Text": null, "Helpfulness": 0.75, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUVX4758GOLUX"}}, {"Date": "on June 28, 1997", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on September 5, 2001", "Text": "This was a good morsel in the midst of my newest interests...chaos, quantum mechanics, sacred geometry, etc...if you enjoy numbers and thinking hard - it is a good read.  Reading for everyday pleasure may be disappointing.", "Helpfulness": 0.75, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3M9191ZY80GXK"}}, {"Date": "on June 28, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EQJSK0UWW8P5"}}, {"Date": "on January 10, 2012", "Text": "I have been a fan of flatland since I first read it as a schoolgirl. This time, I was buying them as a gift because this is a great book to give someone else becoming old enough to appreciate it. I had never thought to view math like this, and through this, I began to understand how math is really just a language used to describe shape an motion.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AT17C6CLPGIQD"}}, {"Date": "on November 18, 2014", "Text": "To understand different dimensions you need to read this book. I wish I knew of this when I was in high school.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18Q3WIZAK19GK"}}, {"Date": "on July 17, 1999", "Text": "Flatland is one of my favorite books of all time.  It's one of those stories I've been searching for all my life...  A tale of multiple dimensions, written with captivating style.  Dionys Burger's sequel lacks  Abbot's elegance and sense of adventure, and seems lackluster compared to  the original.  \"Out of your plane you go!  Once, twice, thrice!  'Tis  done!\"  Flatland is a fabulous realm, and I only regret that I cannot  draw illustrations for it...  They'd look like mere diagrams from a  geometry text!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on October 2, 2008", "Text": null, "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXVORKGHPNFN5"}}, {"Date": "on September 3, 1997", "Text": null, "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": ""}}, {"Date": "on March 14, 1999", "Text": "Jesus' time in our world could be compared to the flatland story.  What he was able to do in terms of miracles could be compared to what \"A Sphere\" was able to do in flatland.  It makes a great story and an  excellent analogy for understanding God and Christ for a mathematical mind.", "Helpfulness": 0.42857142857142855, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on August 7, 2001", "Text": null, "Helpfulness": 0.3333333333333333, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1U20CUTG6I28X"}}, {"Date": "on August 7, 2001", "Text": null, "Helpfulness": 0.2857142857142857, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FPIRH8R6K0MM"}}, {"Date": "on June 3, 1997", "Text": "Once a classic of imagination, but now an outdated, tedious read, it is at least short.  Read it if you have to in college (if you happen to major in Computer Science or Math)", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": ""}}], "ReviewUrl": "http://www.amazon.com/Flatland-Sphereland-Everyday-Handbook-Abbott/product-reviews/0062732765/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.5 out of 5 stars"}, "OfferPrice": "$14.54", "Salesrank": "#257,847", "ListPrice": "$16.99"}