{"Category": "in Books (", "Name": ["Introductory Guide to High-Performance Audio Systems: Stereo - Surround Sound -  Home Theater"], "Timestamp": "2015-05-24 23:18:48.244891", "itemurl": "http://www.amazon.com/Introductory-Guide-High-Performance-Audio-Systems/dp/0978649303", "Reviews": {"TotalReviewCount": "21", "ReviewList": [{"Date": "on March 24, 2010", "Text": "I've had my fill of arrogant Hi-Fi sales people who reside in many high end stereo shops.  I, for one (and I'm sure I'm not only in this matter) do not enjoy being insulted and talked down to by these insecure jerks. I'm amazed these people are are able sell anything? As Someone interested in upgrading my stereo system into the lower high end and not being an electronics techno-geek, I was delighted to find a book such as this. Harley's book is an easy to understand guide to the basics of Hi-Fi. What a relief to read a book about Hi-Fi written by someone more interested in music then the techno-jargon so many audiophiles and Hi-Fi sales people seem to speak. I would highly recommend this book to anyone interested in Hi-Fi but were afraid to ask or don't know the right questions to ask when looking to buy equipment.", "Helpfulness": 0.9285714285714286, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YQVS4WEXFRF4"}}, {"Date": "on March 27, 2007", "Text": "I got Harleys' \"Complete Guide to High End Audio\" before the \"Intro Guide to High Perform...\" although I ordered the \"Intro\" first. Wasn't to arrive for a couple of months so I couldn't wait to find things out & got the earlier \"Complete...\" Confused? Well, anyway this newest is basically a condensed version of the 'Complete\". So if you have it you really don't need this. If not this work is going to get you all the high points and teachings of the other. Either way one or the other will get you started understanding the complexities of sound. Very useful & helpful info!", "Helpfulness": 0.8461538461538461, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IBRO4WLDTBZ4"}}, {"Date": "on May 1, 2010", "Text": "This book was a great reference point for challenging my ears to become better listeners. While I was reading I could feel my ears changing as I was listening to music over the course of the two weeks it took me to finish this book. The book is very descriptive about components and the right way to go about getting them. They make it easy to understand why you don't want 'filters' to make your music different from the way it was supposed to be received. I bought this book and halfway through it I bought a turntable, and towards the end of it I bought a preamplifier. I still need to buy a power-amp to replace the 'best-buy' model I have right now but my overall system is sounding great and I know why it is sounding great do the help from this book. Great book, easy read.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JKI7O7U31KUU"}}, {"Date": "on October 17, 2007", "Text": "The author does a very credible job at covering the universe of high-end audio. It's a very good companion to the first book which was geared towards experienced audiophiles. This book is designed to be more of an introductory 'course' to music lovers who may not yet be 'hooked' on the joys and frustrations that come with the hobby but it does include sufficient new or different thoughts and comments so as to appeal to more experienced audiophiles as well. Whether you start with this volume or Harley's first and more in-depth book, if you love music and have not experienced high-end audio - get one of the books, read it - get some great stereo gear (and the books guide you in how to choose)and dive into your favorite recordings. You'll discover great new sounds you may not have ever heard before.", "Helpfulness": 0.8095238095238095, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APE369SEPGD54"}}, {"Date": "on November 13, 2009", "Text": "This is a good basic book for someone who is interested in getting a broad view of stereo/audio equipment.  For somebody like me, who has not kept up with audiophile equipment for 20 years, it was a good book.  There is more detail than I need , but that's good--I am sure I will go back to it.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BA92GX8G73OZ"}}, {"Date": "on June 5, 2009", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQ65W3FQVY2LF"}}, {"Date": "on March 7, 2014", "Text": "I remember purchasing the 1st edition of Robert Harley The Complete Guide. This is Very well put together book for anyone who wants a quick understanding of what it takes for HIGH END Equipment and planning.  Worth the purchase when you are serious about not wasting dollars and want MUSIC and VIDEO Quality instead.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MBKW5DA9YLU3"}}, {"Date": "on February 18, 2009", "Text": "It's a good book to start with. Gives you a broad picture of almost every aspects of High End Audio. Functional descriptions as well as advices for how to set up a very professional and good sounding system", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5IELFVUAIKD"}}, {"Date": "on September 3, 2013", "Text": "Great book for anyone who loves audio equipment. Buying the equipment is just the beginning, to enjoy the music, proper setup is required.  This book takes you to the next level.  Highly recommended.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2B7GQWVZ2WRAF"}}, {"Date": "on September 2, 2012", "Text": "I am a novice, but learning quickly - I read 6 - 8 books prior to this (Sound recording, sound studios, Dummies, Home Theater) just to get background - that info helped me a lot to really appreciate this book - so many tips, warnings and general and specific advice was given that I really loved it! I would recommend it!", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQPMGEYW0QRVO"}}, {"Date": "on February 25, 2013", "Text": "I was in search of information in my quest to understand more about the higher end world of hi-fidelity. Mr. Harley did a good job in holding my attention, and giving me the information needed to proceed in building a system. Though, I will need to refer back to this book, since there's still more to absorb.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UOYA0OOX8C0Y"}}, {"Date": "on February 19, 2015", "Text": "Extemely interesting book.  I am a long time audiophile, and this serves as a great reference to dig deep into topics as I expand my knowledge and system.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MVPUVUGC1R0P"}}, {"Date": "on October 23, 2012", "Text": "If you want to improve your system, this book will give you the best hints. The explanations are not only helpful, but also very easy to understand.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KRQNTGRZTPCI"}}, {"Date": "on February 12, 2015", "Text": "Great read for people who are trying to establish home theater audio system. This book answered many of my questions.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Q7SY4JVLL2GV"}}, {"Date": "on January 25, 2013", "Text": "This book has good info, Helped me pick out what I would like to purchase for my home theater and HiFi system", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36QBR0PYKZ6K9"}}, {"Date": "on April 29, 2015", "Text": "Fantastic book...easy read with a lot ok information...well written.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36Z80I4L8FB6X"}}, {"Date": "on February 2, 2015", "Text": "Some practical knowledge mostly techno crap.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5P4865TFJ3DQ"}}, {"Date": "on January 27, 2008", "Text": "I found that chapter 12 answered my questions on room design for optimal acoustics, and speaker placement. If you would like to gain audiophile knowledge this is definitely the book for you.", "Helpfulness": 0.2, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1K8PY2SS9D3WV"}}, {"Date": "on September 4, 2008", "Text": "The author is very knowledgeable about audio and video systems.  It is very helpful for people looking to buy an audio system.  HIGHLY RECOMENDED!", "Helpfulness": 0.16666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FHW78YQ7ZJ7W"}}, {"Date": "on October 30, 2007", "Text": null, "Helpfulness": 0.2727272727272727, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23E0VI9Q46BZ5"}}, {"Date": "on June 12, 2007", "Text": "This is a very good book on explaning equipment options and definitions of new audio terms. However, quite redundent.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWI8W6LI2QGBQ"}}], "ReviewUrl": "http://www.amazon.com/Introductory-Guide-High-Performance-Audio-Systems/product-reviews/0978649303/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.3 out of 5 stars"}, "OfferPrice": "$16.58", "Salesrank": "#243,681", "ListPrice": "$19.95"}