{"Category": "in Books (", "Name": ["Mathematical Fallacies and Paradoxes (Dover Books on Mathematics)"], "Timestamp": "2015-05-24 23:17:08.092568", "itemurl": "http://www.amazon.com/Mathematical-Fallacies-Paradoxes-Dover-Mathematics/dp/0486296644", "Reviews": {"TotalReviewCount": "8", "ReviewList": [{"Date": "on March 29, 2000", "Text": "Being a physicist who has always had an interest in math, I've found this book a good way to learn about aspects of mathematics usually saved for metamathematical philosophy courses.  The book is not a textbook but it has  enough depth for you to understand why paradoxes like Godel's, Grelling's  and Russell arise and what their implications are.  Each chapter gets more  interesting and more complicated than the previous.  Even though the book  does not have a completely polished feel, I recommend it to any  recreational mathematician.", "Helpfulness": 0.972972972972973, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AF1DNGGMRYPP8"}}, {"Date": "on December 12, 2001", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on August 21, 2005", "Text": null, "Helpfulness": 0.9230769230769231, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABY8F18FTPAC7"}}, {"Date": "on April 2, 2007", "Text": null, "Helpfulness": 0.875, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UTKYA2U8542F"}}, {"Date": "on June 29, 2008", "Text": "If you've never encountered the problems in MFaP before, you're sure to find MFaP a decent and generally easygoing introduction to the subject matter.  If you have encountered them before, you're sure to find little new between the covers of this slim volume.  MFaP is an able and by-the-numbers overview of an exceedingly complex and fascinating topic.  Should you read to the end  of it, I'd highly recommend having a look at the brief bibliography Bunch assembled.  Not all of it represents 2008 state-of-the-art, but there are several outstanding titles on this list to whet the appetite for further study.  Read MFaP to taste some choice bits.  But be sure to read elsewhere if you it's a feast you're after.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AS6EPVW1IRRP5"}}, {"Date": "on April 22, 2000", "Text": "I would recommend this book to anyone interested in Mathematics.  The fallacies are interesting, including the author's.  For example, on page 94 regarding Oscar Wilde's epigram : \"The only way to get rid of  temptation is to yield to it\".  Mr. Bunch suggests this to be a  fallacy due to the key word \"only\", and offers an example such as  suicide to show \"only\" to be invalid.  But would not suicide be a  temptation as well?  Or for that manner, anything one would try?", "Helpfulness": 0.25, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1L88P5J81CAIE"}}, {"Date": "on March 26, 2000", "Text": "My 8 year old niece loves her schoolteacher but as she has a bit of devilment in her ... yesterday she ask the school m'arm, \"what is 1 divided by 1 - 1\"? And where did the little sweetheart get that lovely bit of  nothingness? Seems her uncle was reading this book  ... : Hey, this is a  swell book fun to read with calculator at hand and niece [with her dog ]  at knee.", "Helpfulness": 0.18518518518518517, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WNJOHEGA1V4N"}}, {"Date": "on July 29, 2001", "Text": "It is the paradoxes that keep us honest in mathematics. Tarski with Banach found a basic flaw in the axiom of choice in set theory. Zeno has puzzled children for two thousand years... Time travel paradoxes are the modern \"new\" problem of tacyonic loops and the Hawking conjecture. Without examples of critical thinking doctrine rules and men become fools!", "Helpfulness": 0.1, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A126KX6FVI4T66"}}], "ReviewUrl": "http://www.amazon.com/Mathematical-Fallacies-Paradoxes-Dover-Mathematics/product-reviews/0486296644/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.3 out of 5 stars"}, "OfferPrice": "$10.65", "Salesrank": "#1,303,511", "ListPrice": "$10.95"}