{"Category": "in Books (", "Name": ["A History of Mechanics (Dover Books on Physics)"], "Timestamp": "2015-05-24 23:16:08.559326", "itemurl": "http://www.amazon.com/History-Mechanics-Dover-Books-Physics/dp/0486656322", "Reviews": {"TotalReviewCount": "6", "ReviewList": [{"Date": "on April 25, 2002", "Text": "This book is a fascinating overview of the history of mechanics. One learns just how much was known about mechanics before the time of Galileo, and the facts are surprising. The work of Galileo and Newton was not a sudden leap in knowledge of mechanics, but grew out of work done in the middle ages and in ancient times. Here are just a few of the highly interesting historical facts that are expounded on in the book: 1. The work of Plato, who held that the weight of an object was the result of a force that was pushing it downwards. 2. The approach of Aristotle to mechanics: he was much more elaborate than Plato, and he made an intensive effort to understand the origin of motion fundamentally. The Aristotelian conception of motion and dynamics can be summarized as follows. There are two kinds of motion, natural and violent. Aristotle gives the falling body as an example of natural motion, whereas projectile motion is an example of violent motion. Violent motion has the property of being temporary, and objects undergoing violent motion will eventually undergo natural motion. Natural motion is in turn divided up into two classes: celestial motion and terrestrial motion. Objects that undergo celestial motion are characterized by what is now called uniform circular motion. On the other hand, terrestrial motion is rectilinear, and for Aristotle rectilinear motion is either straight up or straight down.  An object needs a force and a resistance acting on it if it is to be in motion. Heavy bodies fall faster than light ones. Aristotle refused to admit the existence of a vacuum since such a void would not sustain the motion of an object. In addition, a total vacuum would offer no resistance to the motion of an object, and thus the object would, according to Aristotle, move off with increasing speed. In a vacuum he concluded that heavy bodies would move with the same speed as light ones, again unacceptable he argued. 3.In the sixth century, the philosopher John Philoponus gave what is probably the first systematic attack on the Aristotelian ideas of motion. He argued that the planetary motions, as confirmed by observation, are much more complex than the simple circular motion that Aristotle imputed to them. Philoponus also proposed the so-called \"impetus theory\" to explain projectile motion. As the name implies, according to this theory the thrower imparts an impressed force or impetus to the projectile which keeps it moving until the \"natural\" motion and the resistance of the medium takes over. The projectile then falls straight down. The power given to the projectile by the impetus will gradually damp out because of the resistance of the medium and these \"natural tendencies\" of the projectile. 4. A somewhat more axiomatic and mathematical approach to mechanics in the thirteenth century was proposed by Jordanus of Nemore. His work is interesting in that it contains a notion of virtual work, a concept that was really not developed extensively (and proven to be practically useful) until the nineteenth century. Jordanus also attempted to quantify the idea of acceleration, and in his writings he deduced that an object accelerates when, in a fixed interval of time,  a greater amount of space is covered by the object, and so when the speed of the object increases. Jordanus discussed this in the context of falling objects, but he did not in his writings relate the distance the object falls in terms of the time it took the object to fall. As for the cause of the acceleration of the object, Jordanus held to the view that as the object descended, the object caused the air surrounding it to be less resistive, thereby causing the body to accelerate. Lastly, and most interestingly from the standpoint that it occured during the thirteenth century, an anomynous author of a work entitled Liber Jordani de ratione ponderis solved correctly the problem of the equilibrium of a heavy body on an inclined plane. 5. John I. Buridan of Bethune (1300 - 1358) developed a theory of the impetus which rejected the idea that air is the motive power for projectiles, Buridan took the impetus to reside permanently in the projectile, until the object is acted upon by some other forces. This belief of Buridan regarding the impetus is very important from a modern standpoint, because it is somewhat similar to the idea of inertia that was developed in the sixteenth and seventeenth centuries. In Buridan's view a heavy body would receive more of the impetus than a lighter one. Buridan gave as an example the difference in impetus gained from a heavy iron versus that of light wood. If two objects, one of wood and one of iron have the same volume and the same shape, then the iron object will be moved farther because it will have a greater impetus imparted to it.  6. The ideas of Buridan were discussed by Albert of Saxony (1316 - 1390). He held basically the same beliefs as Buridan about impetus and projectile motion, free fall, etc. Albert concluded that the speed of a falling object increases as the distance of the fall.  Most interesting is that he used the idea of impetus to treat the problem of a stone dropped through a hole in the Earth, and concluded that the motion of the stone would oscillate about the center of the Earth until the impetus in the stone was exhausted. 7. Noted work on mechanics in the fourteenth century was performed by logicians at Merton College. One individual of this school was William Heytesbury, who distinguished between the velocity of an object and the measure of how much the velocity is changing: the acceleration of the object. Heytesbury gave definitions of uniform velocity, uniform acceleration, and instantaneous velocity, but these were not correct from the standpoint of modern mechanics. He rejected the Aristotelian ideas on free fall, noting that a falling body travels three times as far in the second second of its fall as in the first.", "Helpfulness": 0.9333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EQQP0LD4Z375"}}, {"Date": "on September 20, 2010", "Text": null, "Helpfulness": 0.8888888888888888, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AI9EIHVBHFPC"}}, {"Date": "on August 25, 2014", "Text": "Not an easy book to read, you have to possess some technical knowledge on the subject before gaining from it.  Not for common readers.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11VP1HS4GW2IJ"}}, {"Date": "on October 6, 2000", "Text": "This book is refered by the publishers as the best book on history of mechanics. Indeed, it is a very complete work, showing in cronological order all the developments and contributions made by a great number of scientists and mathematicians, many of them famous but including also many not-so-famous and even not known.  The book is very well written. However, when I bought this book I was expecting something more informal, more enjoyable to read. The feeling I have is that the book is somewhat too formal, arid, like the common textbooks. Although, it is still a very fine, very good book, and I suggest that every physics student to read it.", "Helpfulness": 0.5909090909090909, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2467VV6L4XPL"}}, {"Date": "on December 27, 2012", "Text": "If you don't have a Doctorate in mathamatics don't buy this book.  It would take a lifetime to finish it.", "Helpfulness": 0.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22QTAIEDEN3YU"}}, {"Date": "on June 13, 2006", "Text": null, "Helpfulness": 0.1111111111111111, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27WZ9POKBN1OV"}}], "ReviewUrl": "http://www.amazon.com/History-Mechanics-Dover-Books-Physics/product-reviews/0486656322/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "3.7 out of 5 stars"}, "OfferPrice": "$12.47", "Salesrank": "#475,874", "ListPrice": "$24.95"}