{"Category": "in Books (", "Name": ["Introduction to Lie Algebras (Springer Undergraduate Mathematics Series)"], "Timestamp": "2015-05-24 23:18:10.511014", "itemurl": "http://www.amazon.com/Introduction-Algebras-Springer-Undergraduate-Mathematics/dp/1846280400", "Reviews": {"TotalReviewCount": "3", "ReviewList": [{"Date": "on June 21, 2007", "Text": "As a senior math major I decided I wished to learn Lie Algebra, and based on my experience with the SUMS Number Theory book, I chose this one. I am taking a reading course on Lie Algebras which consists of me reading and doing the problems and asked the teacher if i have issues. This book is perfect. In about two weeks I have gotten through the first 11 chapters, and done about 80% of the problems. In addition to being very clear and simple, it is very complete. Often my adviser will ask if the book covered a particular concept, it has yet to fail. It also provides some nice examples to relate to. Unfortunately it does have several typos and not a complete solution guide, these things kept it from the 5. I especially recommend this book for self-study.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17W1H3L371IHR"}}, {"Date": "on April 18, 2012", "Text": "With very nice (and not at all always easy) exercises. Requires hardly any background (linear algebra is, not surprisingly, essential; group theory very helpful). MUCH better for a beginner than the Bourbakist treatments.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23W13JR7RTOJY"}}, {"Date": "on November 24, 2013", "Text": "I love the delivery service. I have not had a chance to read the book yet but the condition of the book is very nice.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A18D19S2II8RCI"}}], "ReviewUrl": "http://www.amazon.com/Introduction-Algebras-Springer-Undergraduate-Mathematics/product-reviews/1846280400/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.7 out of 5 stars"}, "OfferPrice": "$39.96", "Salesrank": "#121,468", "ListPrice": "$49.95"}