{"Category": "in Books (", "Name": ["Origins: Fourteen Billion Years of Cosmic Evolution"], "Timestamp": "2015-05-24 23:22:21.965988", "itemurl": "http://www.amazon.com/Origins-Fourteen-Billion-Cosmic-Evolution/dp/0393350398", "Reviews": {"TotalReviewCount": "106", "ReviewList": [{"Date": "on November 23, 2004", "Text": null, "Helpfulness": 0.9736842105263158, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMQS95OACZAQX"}}, {"Date": "on October 29, 2004", "Text": "If you saw the PBS special on \"Origins,\" you know that Neil DeGrasse Tyson does a great job of translating astrophysics into normal human language. This book goes into much greater detail and merits a gradual reading by non-scientists like myself. The Preface is a clear introduction to the issues. The next section, Overture, is intentionally overwhelming with its \"Greatest Story Ever Told.\" If you are not frustrated by this chapter, you know a lot more about physics than I do! Ah, but that is the point. Hang in there, because the rest of the book explains the Overture, one topic at a time. I am reading part of a chapter each day at lunch and find something amazing each day. This is a good book for people who want to challenge their assumptions about reality.", "Helpfulness": 0.9722222222222222, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A331YM8BT7ZOBC"}}, {"Date": "on September 17, 2004", "Text": "\"Origins\", Neil DeGrasse Tyson and Donald Goldsmith's new book, subtitled -the search for ourselves in the universe, has attempted much in tackling the real `biggest story ever told'. It is largely successful. It presents a general survey of cosmologic history from the `big bang' through the formation of galaxies, planets, and life with most of the emphasis on the earliest period. All of this is accomplished almost entirely without math, with some humor, and is a good starting point for the high school or college undergraduate student without a scientific background. It presents a more detailed scientific picture with less `wonder' than the late Carl Sagan's \"Cosmos\" but some readers may want more depth. For those I would recommend Steven Weinberg's \"The First Three Minutes\", or from the biologist's viewpoint, Morowitz's \"The Emergence of Everything\" which starts with the `big bang' and continues the story step-wise to explain complexity and emergence. For the general reader \"Origins\" presents an introduction to much mind-opening material including the mysterious `dark matter', isotropism, discussions about the curvature of space-time and the inflationary model of the universe that has the potential to stimulate further study or simply be enjoyed for itself.", "Helpfulness": 0.8703703703703703, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2C4EDQ54BJ6OQ"}}, {"Date": "on September 30, 2004", "Text": null, "Helpfulness": 0.9230769230769231, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1M8PP7MLHNBQB"}}, {"Date": "on November 21, 2004", "Text": "This book was fantastic in terms of it's scope and presentation of astrophysics. It's easy to follow style and plain language make it a good read for even the most amateur science lover. Mr. Tyson does a great job of showing us how insignificant we really are in this galaxy (let alone the universe as a whole).", "Helpfulness": 0.9411764705882353, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AV6KNE5KQNRBO"}}, {"Date": "on June 29, 2005", "Text": null, "Helpfulness": 0.9166666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A912C7977MO6O"}}, {"Date": "on March 3, 2005", "Text": null, "Helpfulness": 0.9, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJDYDG7YZY9QL"}}, {"Date": "on January 16, 2007", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KJO5VP4K3CHU"}}, {"Date": "on August 21, 2005", "Text": null, "Helpfulness": 0.8888888888888888, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2C3E35FDWR8WV"}}, {"Date": "on April 22, 2007", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2F3M93RRLFQNJ"}}, {"Date": "on January 17, 2005", "Text": null, "Helpfulness": 0.8571428571428571, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A70E4YBII2B1"}}, {"Date": "on February 11, 2011", "Text": "Like the title says, this book was mind blowing. If your looking for a book that can both educate you and bring you on a journey, then I would have to recommend this.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7DFPVLAZWY7G"}}, {"Date": "on June 10, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VCI3Q81S8EVI"}}, {"Date": "on May 6, 2007", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PBP7UYPRC1KD"}}, {"Date": "on June 23, 2008", "Text": null, "Helpfulness": 0.8, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3F3UFDD890CMA"}}, {"Date": "on May 30, 2014", "Text": "However, while I do love the cosmologist and physicist, this book was somewhat difficult to get through on account of its density and assumed negligible understanding of the universe.  I read it in its entirety, and was honestly disappointed.  Carl Sagan's Billions and Billions was much more poetic, and yet maintained a very scientific outlook.  I don't hate the book, but I think that the author Neil collaborated with could have been much more eloquent without just getting into knitty gritty details.  I know that Neil is far more passionate than what this book conveys.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2P5L7NFLZUU6R"}}, {"Date": "on June 16, 2009", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Y7JNGSI9M7OX"}}, {"Date": "on September 17, 2009", "Text": "You can't go wrong with any of Neil Degrasse Tyson's books. He is a wonderful teacher who makes astronomy come alive! No matter what your age he is spellbounding. I love his DVD with \"The Teaching Company\", too. he is as interesting to watch in person as he is an author. I hope he remains a director of the Haydn Planetarium forever!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALEBGFOZMHYTA"}}, {"Date": "on February 2, 2006", "Text": null, "Helpfulness": 0.7, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2B9Y0WXNSN17U"}}, {"Date": "on September 6, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7L69SMHASQP1"}}, {"Date": "on January 25, 2014", "Text": null, "Helpfulness": 0.6842105263157895, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A782XK9PZXA2F"}}, {"Date": "on April 29, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3J83JLH0TJQ90"}}, {"Date": "on April 2, 2014", "Text": "A much faster read than I had anticipated. The Kindle edition suffers from shoving all the illustrations to the back, as usual, but otherwise, fantastic read!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AW7N9DMT2DH6"}}, {"Date": "on July 23, 2013", "Text": "Tyson is simply stunning in this overview of cosmology, very readable with just enough math to support the incredible detective work that we have accomplished from our tiny corner of the universe. Highly recommended.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RQIFIV3Y7WE6"}}, {"Date": "on April 14, 2013", "Text": "While not 100% current, this is an excellent book with tons of accurate info.  A great read in easy to understand English.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EHLUNTOQHJ1I"}}, {"Date": "on February 19, 2013", "Text": "I only wish I had a teacher like Mr. Tyson. The way he talks about space makes me interested in it. I want to learn more about it. I always look into the night sky and wonder what is happening and when it happened.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AA9QXAAVB9GWU"}}, {"Date": "on September 6, 2012", "Text": "If you want a lucid, concise, passionate and up to date history of our universe then this would have to be in the top ranks. Never dry, always comprehensible for the non scientist, yet elegant in descriptive power this book kept me engrossed as the authors ranged over contemporary mysteries such as dark matter, dark energy, string theory and the fate of the universe. I recommend this to anyone interested in the great burning questions of our time. I dont think you will be disappointed.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RWA1B9JKQPAH"}}, {"Date": "on September 4, 2012", "Text": "as always i am very very pleased with my purchase from amazon.com and this dvd on origins meets all my expectations.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RP7D2BEQQ3EF"}}, {"Date": "on April 2, 2015", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANTO6T0C82XCL"}}, {"Date": "on February 6, 2014", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22F3BWM7RAHDA"}}, {"Date": "on November 21, 2014", "Text": "Making my way through this like a fat kid loves cake! Some of it will make your brain hurt, and other parts will blow your mind away. My thirst for astrophysics remains unquenched, so onwards I go with more Neil deGrasse Tyson books!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOUYL5JG53K3"}}, {"Date": "on August 23, 2007", "Text": "This is the best summary of our cosmic history, written for the intelligent laymen. Dr. Tyson is a master at bringing things down to a intellectually respectable level without resorting to baby talk.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34VE27KILSVAZ"}}, {"Date": "on November 28, 2012", "Text": "This book is one of the greatest books I have read. It has everything from Charles Darwin to Albert Einstein. And Everything from Sub-atomic particles to supernovas.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3G7YZ2DZT16UD"}}, {"Date": "on March 4, 2013", "Text": "This book is incredibly informative, well put together, intelligently written, and perfectly mimics the voice and personality of my favorite astrophysicist.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GBKLE4I8DBPP"}}, {"Date": "on February 19, 2013", "Text": "This book kicks so much ass. I love reading all this science stuff. If you're interested in the origins of the universe, this is your book. ~", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3I0YXLX4OSN6Z"}}, {"Date": "on March 3, 2013", "Text": "Origins is a very good primer on cosmology and astronomy for the lay reader. One of its strong points is its sweeping scope, from the origins of the universe down to the origins of life on Earth and the search for extraterrestrial civilizations. The book has its drawbacks. Some of the early chapters can be difficult to grasp; perhaps the authors could have explained some concepts more clearly, although to be fair, some of the ideas of cosmology (e.g., dark energy, antimatter) are just plain difficult to wrap one’s head around. There are also some places where the text shifts focus between topics abruptly, making it more difficult for readers to follow. Nevertheless, Origins is a fascinating overview of the nature of the universe and our place in it, and it achieves what all good science books do: it makes the reader what to learn more.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3A8PC10JJIDAR"}}, {"Date": "on April 2, 2015", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1M2QMV7QICH3"}}, {"Date": "on April 21, 2014", "Text": "With Cosmos V2 coming out, I had to catch-me-up on all things N dG T (and Goldsmith) Was not disappointed.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AN8BVKNIX37HY"}}, {"Date": "on October 22, 2008", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARLKWJQGZ25HG"}}, {"Date": "on March 27, 2015", "Text": "It was everything I hope for.....when I now look up into the night sky I experience a whole new perspective of our Universe and where we fit.....and whether your faith has led you to believe where we live on the third rock from our Star is the only place like it in this vast Universe, after reading Origins you might find your self asking how could that be possible with all the other millions of planets that orbit all the other millions of Stars that were in the Universe before our Star and the millions more that have been born since.....strongly recommended for those who want to dream bigger dreams when you look up into the night sky......", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PVGM5PSD5YJD"}}, {"Date": "on March 13, 2007", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3H3WOA38S1QG8"}}, {"Date": "on May 13, 2015", "Text": "This book really spans a wide range of topics.  I started with the kindle book, but couldn't help it and purchased the Audible version, and liked it even better!  When I finally finished this book, I felt invigorated and enlightened.  Tyson is brilliant, well-spoken, and as anyone who has watched his excellent TV show \"Cosmos\" can attest, he is extremely charismatic and engaging.  Certainly I would consider this one of the most important and best written works on contemporary cosmology.  Get this book and read it, listen to it, or both!  You won't regret it.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AR4NURQ42A0Q5"}}, {"Date": "on September 10, 2014", "Text": "I am a 'layperson' without extensive education in the fields ot cosmology and astrophysics so some of the more technical details were beyond me BUT the book was filled to bursting with the wonder of science and the splender of the universe and that I got loud and clear!  It's a great book for 'ordinary people' although I'm sure a cosmologist would find it very simplistic which was just what I needed.  Dr. Tyson reminds me of Carl Sagan in his ability to communicate complicated subjects.  Very worthwhile read.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DD9STJ5QAMLN"}}, {"Date": "on January 31, 2014", "Text": "This book is a great read for people who would have enjoyed reading books like Cosmos. Not too complicated for the lay person or too simple for somebody who already has an interest in the cosmos.", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MQJLTL8I2ODK"}}, {"Date": "on October 23, 2013", "Text": "An excellent compendium of modern science, linking the various tools, concepts and humor as the authors unite our understandings of the idea of Cosmology.", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GKVAC1KBNW5L"}}, {"Date": "on January 29, 2013", "Text": "A very good read to broaden your insight into the human origin and a lot different than the apple in the garden tale we have been taught. Carl Sagan was no dummy.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMX400U028ZLO"}}, {"Date": "on January 26, 2013", "Text": "I read this book because I am  big fan of Big Bang. I wanted to get an understanding of Astro Physics and this book was a good start.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15L3CJBJ4SS1B"}}, {"Date": "on December 30, 2012", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVM440NIV1DC7"}}, {"Date": "on September 21, 2014", "Text": "The greatest teachers make you want to learn. Neil has that gift. I found this book to be incredibly thought provoking. I learned a lot but some of it went over my head, so I going to re-read it again more slowly while looking some things up. The chapter about the periodic table was a lot more interesting than I expected.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OV0JRWONFLK1"}}, {"Date": "on September 10, 2014", "Text": "This is an excellent book.  I have an interest in the cosmos but lack the formal education in the subject.  I found this book helped bring the subject to an understandable level.  I can now put my head around what was more mystery than fact and theory based on the remarkable discoveries made in the last two decades.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALD9IPN679KJQ"}}, {"Date": "on January 15, 2013", "Text": "I enjoyed this book, overall i think the book is more of a basic intro to cosmology and astrophysics as I am sort of familiar with the material presented, but i still learned and picked up alot of information in the book. I found the book pretty easy to read and was a pretty fast read.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19E736NZT4D70"}}, {"Date": "on September 19, 2014", "Text": "Real mind-blowing stuff, made as digestible as is possible.  If you have read other astrophysics books in the last few years there will be some redundancy, but that isn't the book's fault.  Recommended.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VEUIR3OO968J"}}, {"Date": "on August 21, 2014", "Text": "Wow! What ana amazing book. Has everything a curious mind would want to know about modern astronomy and astrophysics. It's more detailed than the Cosmos from Carl Sagan and I really enjoyed the read", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WC3PI8XQWNDN"}}, {"Date": "on January 10, 2015", "Text": "Great book, easy to read with simple and fluent writing. The authors make a complex subject look simple and easy to understand, making the flow easy and fun.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ALRXO1C7UL6J"}}, {"Date": "on August 30, 2014", "Text": "This is a great and easy read for non-science people. Doc Tyson is so empathic with his audience, his book eases along very understandingly and compellingly.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2D8KB0D900WKY"}}, {"Date": "on April 29, 2015", "Text": "amazing and well written book. tyson makes understanding the universe easier for the average person. would definetley recommend reading/buying this book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3I8BO1P7X79KO"}}, {"Date": "on May 6, 2015", "Text": "Absolutely a pleasure to delve into the multibillion year history of the ground that we stand on. I came away with humility and awe.... go for it.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZMIYRC782KE9"}}, {"Date": "on January 28, 2015", "Text": "If you are starting to be interested in this subject matter this is a great book to read. Very interesting. It covers many different disciplines.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28RN146D4UP4U"}}, {"Date": "on April 24, 2015", "Text": "I loved it, it was an amazing journey thru time and I recommend it to everyone. It's great that we understand so much and is quite astonishing.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3R2O3XOLZCE8R"}}, {"Date": "on May 9, 2015", "Text": "Well presented. It is just a as survey of the astrophysicists world. Would recommend for the newly wondrous and quizzical.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3M6DCC9KXKDEH"}}, {"Date": "on July 24, 2014", "Text": "Incredibly complex ideas are deftly broken down for the amateur astronomers with a wit rarely matched in the world today.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17OCPG76BJKF8"}}, {"Date": "on August 25, 2014", "Text": "Written more understandably than other books on the same subject, Tyson writes with humor. I really enjoyed this book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3L4JY6RPV5E9V"}}, {"Date": "on March 7, 2015", "Text": "This was a gift for my husband and he loved it.  Said it was pretty \"heady\" but that was to be expected.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13JH2NRRR2NF6"}}, {"Date": "on May 14, 2015", "Text": "The book is in itself good, but its just a repetition of his other books and essays. More of the same.", "Helpfulness": "", "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22LUWYVLXVDGW"}}, {"Date": "on December 17, 2014", "Text": "Very informative. Nothing new,but he helps one to understand things better if you're a layman like me.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AH978L6RQJ0T3"}}, {"Date": "on March 2, 2015", "Text": "Educational and entertaining read for a lay person with a strong interest in astrophysics", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QECLIKQW86QI"}}, {"Date": "on February 28, 2014", "Text": "Really enjoyed this book. These guys explain things in a way that was understandable and fun. I loved how the authors acknowledged the limits of current understanding and describe efforts to expand knowledge in these fascinating fields.  Inspiring reading. I will be reading more science in this area as the book is a few years old; but in those few years so much more has been discovered. This book answered so many questions for me. More science please!", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QLISDOQHZX9E"}}, {"Date": "on April 5, 2015", "Text": "Space is fascinating and complicated. Neil makes it fun to learn how it works", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1RVHB99XTHO7F"}}, {"Date": "on December 27, 2014", "Text": "Got this as a gift for my brother-in-law who says it is really great!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEGF0V8UYW4WU"}}, {"Date": "on May 3, 2015", "Text": "Very understandable language- even a non scientist can understand it", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I53B00S8UUDB"}}, {"Date": "on February 15, 2014", "Text": "Great read.  Well written.  Great explanations of theory real world and lab. Loved it.  Paints a mental & visual journey.  Thanks Neil!", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CX290YFEQXC2"}}, {"Date": "on October 2, 2013", "Text": "This is an informative and appropriately entertaining examination of the cosmos only as it could be done by Mr. Tyson.  While it may not be a deeply scientific read for those who are scientists or extremely well informed on scientific matters, I still found it worth the time because Mr. Tyson is a delightfully entertaining presenter and definitely increased my knowledge base.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A286ZS1IS17TP0"}}, {"Date": "on July 26, 2013", "Text": "well written - he uses a very layman friendly non technical style and makes the analysis , humorous, and informative", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BC7KSIVFOM8W"}}, {"Date": "on April 22, 2015", "Text": "This is a very well written book, well worth your time to read it.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2N74P1ESN3YTY"}}, {"Date": "on April 11, 2015", "Text": "Extremely readable. Great color illustrations on kindle tablet.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUKHX87BOEZE9"}}, {"Date": "on March 4, 2015", "Text": "Easy to read, just what you would expect from Dr. Tyson", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28L3KAZM9HJSX"}}, {"Date": "on May 8, 2015", "Text": "Very well written and was easy for me to understand.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LWW9C1L3JEWO"}}, {"Date": "on January 18, 2014", "Text": "I've been reading this book a few pages a night since I purchased it and I find it utterly fascinating.  I even take the time to research concepts and investigate current findings.  I hope someday my daughter will read it.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OOQ3N9IL9CTS"}}, {"Date": "on March 1, 2015", "Text": "Excellent - mind-blowing", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2L0M9J0WZ8MS7"}}, {"Date": "on April 1, 2005", "Text": "I found this book to be well thoughout on the subject of the big bang ,formation of galaxies, planets, and life  before the huble and it's finding to be a very good read. I still enjoy books on this subject and with new tech coming our way we will see if these authors  change thier view points or not like the string theory and such. Highly recommended.", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOPGDH5M54SWN"}}, {"Date": "on April 20, 2015", "Text": "One of the best.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ACW3ITNRCRUZ"}}, {"Date": "on January 2, 2015", "Text": "Love this book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TWTV8PCHSYJT"}}, {"Date": "on April 19, 2015", "Text": "Captivating.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AU84GDW3GTMFU"}}, {"Date": "on July 3, 2007", "Text": "Highly recommend. Prof. Tyson is good teacher, and despite his position and impressive curriculum vitae, personally responded to some questions that arose from reading the book. Inspirational topic and author.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3I2BAUWG2QXUE"}}, {"Date": "on March 4, 2015", "Text": "Great book!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LMRJ60THMMGO"}}, {"Date": "on August 31, 2013", "Text": "Origins is an enlightening and entertaining journey from the beginning of the biggest subject known to humankind down to the reasons why we're here to be amazed by it all. Mind bending science is delivered in plain language that makes the book a breeze to read.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A82623WXEWX5B"}}, {"Date": "on May 17, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13JVY5TS8GXA0"}}, {"Date": "on July 5, 2014", "Text": "Excellent well written easy to  understand and humorous.  Very informative.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28WJHGDUR7YTJ"}}, {"Date": "on September 23, 2014", "Text": "Top read, should be compulsory reading for the masses! Blows away a lot of the crap we're brainwashed into from an early age--shudder!", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KPWRA1TRNCOZ"}}, {"Date": "on July 30, 2014", "Text": "Just another great NDT book.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22UV9PQ94JGPX"}}, {"Date": "on August 29, 2014", "Text": "Brilliant man!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PCC32KSXGIYS"}}, {"Date": "on August 17, 2014", "Text": "Great read.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2I9XZCVBNPHBN"}}, {"Date": "on October 12, 2014", "Text": "Great points, great photographs, reads really smoothly. Going to get it signed by Tyson in a couple of weeks.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SW2FBJI2IA3N"}}, {"Date": "on December 11, 2014", "Text": "good s*** though still pissed at my astronomy(/physics) teacher for not hearing me out regarding 9/11", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIO948PBGMN5B"}}, {"Date": "on July 22, 2013", "Text": "This book is for beginners in the science of Astronomy It can wet your appetite but if you have knowledge in the subject you might be disappointed..", "Helpfulness": 0.2, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SUIEKBB5Q1QD"}}, {"Date": "on December 1, 2014", "Text": "Bought the Audio version. Way to many mathematical formulae being read via audio to make this interesting.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23YK4DYOYWI55"}}, {"Date": "on November 2, 2014", "Text": "Great book", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OG7J9WQ2QE2E"}}, {"Date": "on February 4, 2013", "Text": "His book, Death by Black Hole, is a much better book, well written, poetic, illustrative. I dislike some of the explanations about the origin of everything.", "Helpfulness": 0.14285714285714285, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AONAAHKKLC9N"}}, {"Date": "on December 15, 2006", "Text": null, "Helpfulness": 0.2727272727272727, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2D9IEFJGB483Q"}}, {"Date": "on December 11, 2008", "Text": null, "Helpfulness": 0.10526315789473684, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A126KX6FVI4T66"}}, {"Date": "on April 8, 2005", "Text": "The material presented is substantial, but something as simple as the phrase \"degrees Kelvin\" (which any science person knows is wrong since there are no \"degrees\" Kelvin) makes me wonder whether or not there are other mistakes like this one that I didn't catch due to unfamiliarity.", "Helpfulness": 0.2054794520547945, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AGJZZDYH473GY"}}, {"Date": "on April 22, 2005", "Text": "I love a good cosmic documentary, but this is a little dry. Didn't really get anything out of it. I watched Hyperspace again just to see if I had remembered incorrectly, but alas, it's still the best. I really hope someone is showing that doc to our kids in schools somewhere.", "Helpfulness": 0.10416666666666667, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KD8NJPZ01R37"}}, {"Date": "on January 14, 2013", "Text": "Naturalistic Darwinian evolution cannot account for the laws of logic which is not natural therefore evolution is false! I am surprised how many people love Dawkins's fairytales and billions of years that gives us such an awe of `mother' nature. We can't help to have some deep religious awe of nature; we just want to bow down before nature and `science so called' to guide us into the unknown future. We want to cover our ignorance of the universe with deep religious faith that what we have in front of us is billions of years old. Now stop the bus for a moment and watch Age of the Earth by Kent Hovind and that lie suddenly explodes in ones face like a big bang. After reading John Hartnett's book, `Dismantling the big bang', one cannot but feel betrayed by Scientific America, National Geographic, Your Lecturer at university, etc for changing the age of the universe from 5 billion to 10 billion to 20 billion years to accommodate their false religion of evolution and their ever changing `scientific theorems'.  And what does the average McDonalds eating, soap opera watching non thinking person do? He accepts it as `science' because after all, naturalistic `science' is the end all of all knowledge and modern science fits right in with the `God is dead movement'. One can see how this religion of evolution and its evil twin, atheism has managed to fly through under the radar of `science'. 99% of people hate the God of the bible and will believe any fairytale rather than God! The majority is always wrong! The universe is only 6000 years old according to God!", "Helpfulness": 0.05555555555555555, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZL3AFONT6DGW"}}, {"Date": "on December 2, 2004", "Text": "The cornerstone of ORIGINS is the ingrained premise of contemporary cosmology that nonlife managed to generate the structures of the universe and life over billions of years. But if nonlife is the cause of structure formation in the universe, it ought to be demonstrated that at one time life did not exist, or that nonlife on its own - i.e. in the total absence of life - can generate life. The authors do not even attempt to make that point. So their unconditional bias in favor of nonlife's imagined self-organizing capabilities is most evident. They maintain this bias in face of the fact that in our experience structure formation is the basic quality of life and not that of nonlife. So instead of rehashing cosmology's divorced-from-reality mathematical models, on my part I would be delighted to see what makes them think that life did not play an intimate part in the creation of the universe. It is evident beyond any reasonable doubt that the cosmic system yields life, and it is equally evident that in our experience any natural system that yields life is itself the product of life. To illustrate my point with nature's model: over 97 percent of a giant Sequoia' mass is considered to be dead, yet it yields leaves, flowers, and millions of tiny winged seeds. We know it yields seeds as its output because a seed generated that tree structure for the purpose of self-reproduction. What makes the authors believe that the universe is the sole exception to this most basic principle of nature? Or did they manage to refute, without our knowledge, the principles of biogenesis and causality? (Namely that life comes only from life akin to itself and can never originate from nonlife, and that a cause cannot produce an effect superior to itself because the difference between the cause and the superior effect would have to come from nothing.) Only when they can refute these principles of nature should we join them in the celebration of nonlife's incredible creative potentials. In the meantime we should study nature's life-giving systems and based on those observations infer that the universe yields life because the cosmic system itself is the product of life. Since that initial seed or genotype of the phenotype universe is both the input and the output of the universe, the authors and the rest of the pro-nonlife cosmologists ignore its existence. After all the seed or final cause of the universe exists beyond the self-imposed limitations of science, and those who remain in that box will pretend it does not exist. Metaphorically speaking, it is like the seeds of a giant Sequoia pretending that the seed which created their tree for the purpose of self-reproduction does not exist. Instead of ending with the search for extraterrestrial life, the book should begin with the realization that life is immortal, which immortal life created the universe for the production of life in its own image. I recommend the book for those readers who want to embrace and to worship nonlife as the creator of the universe, and want to read more about the mushrooming crank theories that posit multiple hidden dimensions and universes. On the other hand this book is definitely not for \"out of the box\" thinkers, or for rational thinkers.", "Helpfulness": 0.09090909090909091, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3U4JLRZTXHFM"}}, {"Date": "on December 28, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2L1KC5CTPF9UD"}}, {"Date": "on April 12, 2012", "Text": "Why do so-called scientists continue to preach their unproven religion? They have a belief system (usually atheisim) and everything they present is colored by it. There is not and never has been any proof for creation (origin of life) that is nontheistic. The Bible's recording of the origin of life cannot be disproved, but atheistic \"scientists\" will always keep trying. Just let them prove their theories and they cannot. Why? Because origin of life is a faith issue whether one is a Christian or an atheist!", "Helpfulness": 0.011961722488038277, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37LSL3JF7N5SP"}}], "ReviewUrl": "http://www.amazon.com/Origins-Fourteen-Billion-Cosmic-Evolution/product-reviews/0393350398/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.5 out of 5 stars"}, "OfferPrice": "$12.80", "Salesrank": "#6,471", "ListPrice": "$19.95"}