{"Category": "in Books (", "Name": ["X-Ray Diffraction (Dover Books on Physics)"], "Timestamp": "2015-05-24 23:17:16.254037", "itemurl": "http://www.amazon.com/X-Ray-Diffraction-Dover-Books-Physics/dp/0486663175", "Reviews": {"TotalReviewCount": "13", "ReviewList": [{"Date": "on April 20, 1999", "Text": "As it may be clear from the one-line summary given above...it is quite difficult to evaluate this book. I personally like this book, however, I would not recommend anyone to try to learn x-ray diffraction by reading it.  This book  elegantly shows the theory behind a broad range of experimental  observations one can accomplish using x-ray diffraction by going into the  broader theory of scattering. Hence it is basically a book on scattering as  applied to x-rays. The use of space group determination and Structure  determination are given only a superficial attention, which I think must be  discussed in detail in a book on x-ray diffraction. However, the  chapter  on x-ray studies on order-disorder is outstanding (it is Prof. Warren's  personal area of interest).  In other words, this is a rather advanced and  quasi-theoretical treatment of a very applied  method indeed. Therefore, in  my opinion, it is of limited use to the solid state science community in  general. However, it is a very nicely written book (though quite abstract)  hence I'd rather give 4 stars instead of 3. Get this book if you really  have a very specialized interest in x-ray diffraction...otherwise you can  live without it.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FKYMZZC4GRK7"}}, {"Date": "on January 3, 2007", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HWZFM6DZ5QQR"}}, {"Date": "on April 14, 2005", "Text": "This is the allround single best book for learning X-ray diffraction theory from the ground up.  It is superbly written.  The most lucid and precise explanations I have seen anywhere.  The relevant fundementals of electromagnetic theory are reviewed, as are any needed quantum results, but the emphasis is on exact and elegant derivations of all the major results of practical X-ray diffraction.  This book has been a great help in my research developing new X-ray quantitative methods for complex envirnmental materials.", "Helpfulness": 0.8, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2URFZH5IN8MMW"}}, {"Date": "on April 27, 2013", "Text": "Warren is the expect on X-ray diffraction, no doubt about it.  However, this book is not intended for neophytes or people who are new to the field of x-ray diffraction.  He immediately jumps into the Ewald Sphere for deriving scattering, and works with a lot of vector calculus, so if you're not familiar with XRD most of this book will go over your head.  He does a good job of describing how different deviations from Bragg's law - such as a sample displacement, finite particle size, and crystal strain - play a role in changing the diffraction pattern and how the different two-theta dependence, such as the sine dependence on stress, come about.  But again, you'll be working with a lot of vector calculus to get there.  If you have a good understanding of XRD and want to learn the math and physics behind the technique, this book is a good supplement for your understanding.  It would be a good choice for graduate students or people with PhDs.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3X22KFA8ZFYY"}}, {"Date": "on August 21, 2009", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AR5PPS57ZVBCN"}}, {"Date": "on November 14, 2011", "Text": "Even if a little old, covers all the basics in an excellent manner. The math, while sometimes involved is not that complex and is very educational. The plus side of it being several decades old is that everything is presented in a rather fundamental and easy to grasp way. One does need to spend a little time going through the equations, but it definitely makes understanding the matter easier.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMAPDCU1XY8KF"}}, {"Date": "on January 7, 2013", "Text": "This book must be on your shelf if you are interested x ray diffraction.  got this book for a class but i kept it because it was so helpful", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1MTJQ2OULA6G6"}}, {"Date": "on April 16, 2015", "Text": "Very classic XRD book. The book condition is good.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KSQWF4WGDERQ"}}, {"Date": "on December 11, 2007", "Text": null, "Helpfulness": 0.5, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AULX4XGD9PXA"}}, {"Date": "on November 6, 2014", "Text": "Good book!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Z3LS5DVU7O04"}}, {"Date": "on October 14, 2013", "Text": "If you work with xray diffraction, you will need to keep this book handy for reference. I go to it all the time.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1V781OOF33QRH"}}, {"Date": "on December 3, 1999", "Text": "This is a mathematical approach to x-ray diffraction.  If you want a more technical, less abstract book (with some history), order the Sir L. Bragg book.  That one is much more comprehensible, actually enjoyable.", "Helpfulness": 0.36363636363636365, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3N0Z6YDCXDOMI"}}, {"Date": "on January 13, 2003", "Text": "This book can probably be good for anybody looking for a specific information about X-ray diffraction. For this price really cool. But please, definitely not for anybody who has never heard about diffraction and really wants to understand this topic. Book has very little sample examples not completely solved and explained. On the other hand, it containes a number of really complex problems without any results! Take a look at another book instead.", "Helpfulness": 0.14285714285714285, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A261TKOO29ZU57"}}], "ReviewUrl": "http://www.amazon.com/X-Ray-Diffraction-Dover-Books-Physics/product-reviews/0486663175/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "3.9 out of 5 stars"}, "OfferPrice": "$12.48", "Salesrank": "#478,389", "ListPrice": "$19.95"}