{"Category": "in Books (", "Name": ["Theoretical Physics (Dover Books on Physics)"], "Timestamp": "2015-05-24 21:18:28.164824", "itemurl": "http://www.amazon.com/Theoretical-Physics-Dover-Books/dp/0486652270", "Reviews": {"TotalReviewCount": "42", "ReviewList": [{"Date": "on July 18, 1998", "Text": "Georg Joos was an experimental physicist, yet wrote this outstanding compendium of classical theoretical physics, a model of clarity and simplicity, not to mention soundness. Perfect for learning something when the time is short! I recalled having learned AC circuits from it, using complex numbers, one day before the exams, and learned it thoroughly (and passed!). Freeman Dyson lists this book as the one from which he learned most of Theoretical Physics. What more could be said?", "Helpfulness": 0.9325842696629213, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D7XC7USJ9X7J"}}, {"Date": "on July 23, 1997", "Text": "I am a Physicist, and in the event of preparing my general post-graduate exam I have not found a better summary for review my knowledge in Physics. From Vectors to Modern Physics, I found a great quantity of material and problems adequately inserted in text which can help every Physicist, no mater his (her) personal interest, to expand his (her) ideas. I recommend it widely. I used this book as sel-study and I am completely satisfied", "Helpfulness": 0.9354838709677419, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on November 17, 2004", "Text": null, "Helpfulness": 0.9545454545454546, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Y8GWKBMHQRKZ"}}, {"Date": "on August 11, 2012", "Text": "This book is truly excellent as a compendium on most of classical physics (minus General Relativity, which deserves a volume all to its own). As already noted, it is a little dated on its approach to quantum mechanics, but it is interesting to get a viewpoint on the subject from the founding era of quantum theory.  It can be difficult to get through, but any advanced undergrad who is comfortable with basic calculus, vector analysis, and differential equations should be able to learn the whole of classical theoretical physics and leave it with a sense of the underlying unity and mathematical beauty of nature.  I would just like to point out one minor mistake in physics... On page 244 where Joos explains length contraction in Special Relativity, he writes, \"a body which appears to be spherical to an observer at rest relative to it will thus appear to a moving observer to be an oblate spheroid.\" This is a popular and incorrect misconception about length contraction in SR. Although the theory predicts that the geometry of a moving object should become distorted, this does not mean that an observer will SEE this object as visually distorted. In fact, a human observer will instead see the objected as not distorted but instead as rotated. This is known as the Terrel-Penrose effect and it wasn't fully recognized until sometime in 1959 (44 years after Einstein proposed the damn thing!!), so it is easy to see how this could've been overlooked by Joos. Other than that infinitesimal hiccup, this book is an incredible buy for only $20 and deserves to be on the bookshelf of every serious physics lover!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FCHL2A53R8GY"}}, {"Date": "on May 12, 2012", "Text": "It's straight forward and to the point. It explains a lot of theorems in an understandable way, without loss of mathematically consistency. By reading this book you can actually learn something without getting lost in bunch of 'high level' mathematics. For me, it's the Hamiltonian mechanics. I'm a mechanical engineer without systematic training in math and physics, so I failed couple of times when I was trying to understand the Hamiltonian mechanics by reading some more comprehensive books specialized on that topic. However, after reading this book for just about 20 pages, I finally got the idea and could pick up a pen and formulate my own problems in a systematic way.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ECN62FQAG8D9"}}, {"Date": "on November 20, 2007", "Text": "This book combines the best parts of experimental and theoretical physics study; an intuitive knowledge of how the mathematical relations apply to the world, as provided by the experimental, and the ability to derive the equations from first principles, and understand their conceptual foundation, provided by the theoretical and theoretical/experimental, respectively. Furthermore, the book has a wonderful habit of teaching by presenting the very essence of the many subjects treated, and then progressing to their application; the brilliance of this is difficult to describe, but among other things it involves the demonstration from first principles that a perpetual energy machine is not possible, and it is shown how this relates to the first and second laws of thermodynamics, each presented separately. It should be noted that this book does tend to favor the theoretical side; the author usually depends on mathematical relations that are related to a physical counterpart, as with the first and second laws of thermodynamics, and proceeds by mathematical operation, rather than the physical operations that correspond to them, often referring to the physical result by analyzing the mathematical relations at the end of this formulation ----- this is the theoretical side taking root and sprouting. It is a wonderful book, full of gems with their corresponding sparkle, and many colors, all chosen by a master miner and jeweler.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AITSJAK877SWK"}}, {"Date": "on February 14, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QOF415R8PIJO"}}, {"Date": "on March 11, 2012", "Text": "I love this book it is cheap and is full of information. The first chapter on vector analysis is very good and essential reading for learning physics. This book assumes only a knowledge of basic differential and integral calculus. It is an old book so there is a lot of quantum physics that is not included, but still this book is, in my opinion, unbeatable. I love this book.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3K9K53Y7E1OTM"}}, {"Date": "on December 26, 2013", "Text": "The Kindle edition is absolutely worthless.  The equations are impossible to read.  The equation text is so small that you cannot make out the symbols - the size is less than one-fifth the size of the text for normal text size.  increasing the font size does not increase the size of the equations.  Big, big disappointment.  Do not buy the Kindle edition.  I would post a zero star if zero was available.", "Helpfulness": 0.7727272727272727, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AD5Y5XFI2L4B7"}}, {"Date": "on April 25, 2013", "Text": "As a physics student and aspiring HEP physicist I have a sizable collection of physics texts.This one is one of my favorites! It covers such a large range of topics that it makes for a exquisite reference text. If you are in the field of science and you are looking for that \"book\" to keep on your shelf to refresh your mind on certain fundamental mathematical topics in physics, this is a great book to have. From classical dynamics to Bose-Einstein Statistics, this book probably talks about what you need a \"refresher\" on from your college physics days.", "Helpfulness": 0.8571428571428571, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A200NAUIWF8XMC"}}, {"Date": "on April 25, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1C08T6OED6Q4E"}}, {"Date": "on August 5, 2013", "Text": "This book is very thorough in what it does cover and it covers things very well. The book is concise, but still has a little bit of philosophical perspective. You certainly don't feel like you're getting the dummies explanation. The explanations are clear and enlightening. The problems are all pretty good, and there aren't too many.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3B83N3SAQRU21"}}, {"Date": "on April 30, 2012", "Text": "This book is heavily, but not intuitively or logically unacceptable, based on the beauty of mathematics. If you want to understand physics at its most intelligible level, than that's your book. Furthermore, it's perfect for self-studying.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WAPTA0V88AH9"}}, {"Date": "on August 6, 2007", "Text": "It's an excellent book, with the quality of all Dover books in physics. It's clear and concise, ideal for people who want to review or clarify some points in general physics.", "Helpfulness": 0.7777777777777778, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1UYK3NBI427YG"}}, {"Date": "on January 8, 2013", "Text": "This text is mainly for undergrad physics students, perhaps one of the masterpieces, i enjoy reading it. And Would recommend to all Physics majors.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AT44OGUIXS7OA"}}, {"Date": "on October 19, 2013", "Text": "A thorough and comprehensive book on physics. A must for the physics-interested! Very cheap also. Landau and Lifchitz' books are best, but this is a great supplement!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A159H0EVLUGXCY"}}, {"Date": "on June 9, 2014", "Text": "The book is a bit out-of-date but is very well written and generally accessible to mathematically oriented non-physicists.  The first few chapters on math preliminaries are excellent and the book is worth the meager $6 price tag for that alone.", "Helpfulness": 0.75, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24REE4CG7F12V"}}, {"Date": "on August 20, 2014", "Text": "This book seems to have almost every topic in physics covered.  When I took my Physics class last year, every topic we studied was included in the book.  (I admit, that I am still in the process of learning calculus, so most of this book is difficult to understand). I still enjoy flipping through the pages and admiring the well thought out formulas.  I hope to someday be able to understand these formulas in a way different from that if just memorizing.  That is the reason why I got this book.  Overall, this book is definitely worth getting and is a good choice for any grade level college and up.  Even if you are not familiar with calculus, the book gives a useful introduction to vectors and attempts to explain calculus to the \"average joe\".", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LYBN47IAEJBA"}}, {"Date": "on March 29, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1R2ONP3JLPL76"}}, {"Date": "on April 10, 2015", "Text": "I am legitimately curious as to how many people have read this book in its entirety. There is so much material in this book, it is hard to describe. Just reading the table of contents will take a decent amount of time. A lot of the later covered subjects that I had never even heard of. I find it unlikely I will ever remember everything in this book but it is a great read. On the paper version, the formatting is spot on as well.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SCFMGX9TEK7C"}}, {"Date": "on July 30, 2014", "Text": "I'm not fond of the layout, the illustrations more specifically, of the book for the Mechanics, Electrostatics, or Magnitostatics sections. However the chapters on Geometric Optics and EM Wave propagation was excellent! It could uses more clear explanations of boundary value problems. Throughout the portions I read, the text was very clear and concise.", "Helpfulness": 0.6666666666666666, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KF4UDWVRAOUE"}}, {"Date": "on August 18, 2013", "Text": "Great book if you can handle the math.would be of tremendous use for a college student in a physics class", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KL0JRHGBV9WF"}}, {"Date": "on June 18, 2014", "Text": "For the price, this is a very worthwhile purchase.  The hefty volume can serve as a refresher on various standard topics in physics although the treatment of quantum mechanics is limited -- no Dirac notation and the index fails to cite entanglement, projection operators and the like.", "Helpfulness": 0.6666666666666666, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GFGRCGMEEXEK"}}, {"Date": "on February 21, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A259Q2GSJ76NCJ"}}, {"Date": "on March 24, 2015", "Text": "Excellent text! Wish I had had a copy of this wen I was an undergraduate senior and in grad school! Verifies my fundamental hypothesis on texts: the original is always simpler and more straightforward than subsequent, derived texts.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1T1UHFWP7YQZE"}}, {"Date": "on March 16, 2014", "Text": "This book covers a wide range of topics in basic theoretical physics with simplicity and elegance. It's very good for reviewing things and learning a few others not usually taught in basic undergraduate courses.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2J67LOP2NBSXL"}}, {"Date": "on February 24, 2015", "Text": "Good coverage of a lot of Physics subjects. Easy to read. A bit of math. As a retired Physicists I love it.  Paul", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KFQP9P7JHQOZ"}}, {"Date": "on July 11, 2014", "Text": null, "Helpfulness": 0.6, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GZGZHOQWJZZX"}}, {"Date": "on February 9, 2015", "Text": "Very well detailed at an affordable price.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WJNWNPMYRRJ0"}}, {"Date": "on April 20, 2015", "Text": "A must read for beginners!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2T0WH1BSOEPIM"}}, {"Date": "on September 17, 2013", "Text": "This is a highly theoretical thesis with high math justification of theorems, written in the 1980's. Even so, it is a very good review for those who need a reference and have been out of college some years on a graduate level.", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AG591S9N7B80S"}}, {"Date": "on April 5, 2015", "Text": null, "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2T3W5YNLU85EC"}}, {"Date": "on March 12, 2014", "Text": "Good short summary of core physics as of 50 years ago;  obviously not up to date, but still a handy reference, and generally easy to follow", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RBLCWO1KBVM4"}}, {"Date": "on February 16, 2014", "Text": "As good as you would expect from this classic. A wonderful reference work. Anyone with a physics background will enjoy this work.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A902VBZHE5G0Z"}}, {"Date": "on September 17, 2014", "Text": "excellent series", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25XQWQLVXOOSF"}}, {"Date": "on January 23, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1J1RAZQ48WAQM"}}, {"Date": "on July 27, 2014", "Text": "All fine.  No problem.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3USBRPM7TMR1D"}}, {"Date": "on October 20, 2013", "Text": "Judging from the title I thought I was going to buy a short book with only reading contents, no formulas or mathematics. However, this is a 800+ pages book with contents about vectors, fluid mechanics, electromagnetism, thermodynamics, quantum mechanics, and nuclear physics (just to mention a few), every topic explained with a math approach, making the book a lot more interesting. It needs to pass some time before I start reading this book (therefore I don't have a review for the content itself), so for now I will say that the price was very affordable, its condition is excellent and the shipping was very fast. Appropriate for every advanced scientific and engineer.", "Helpfulness": 0.16666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQK1VKIH2O8N5"}}, {"Date": "on March 16, 2014", "Text": "I have not yet finished the book  but so far is very enlightening in the way it approaches physics.  Good book.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GKQ2W4CSETRE"}}, {"Date": "on December 10, 2013", "Text": "Great book for relearning what was lost on a young undergraduate. Yes, I know buying and reading physics books is not normal, but define normal.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EOF1IQ3I1DDG"}}, {"Date": "on February 17, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AF5VA8PNN0TIM"}}, {"Date": "on June 25, 2013", "Text": "its solved so wide theory problems to think is principally the reason for its value to like, so seems to be written at once.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AE0UPLLRVG6NL"}}], "ReviewUrl": "http://www.amazon.com/Theoretical-Physics-Dover-Books/product-reviews/0486652270/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.7 out of 5 stars"}, "OfferPrice": "$5.99", "Salesrank": "#34,422", "ListPrice": "$29.95"}