{"Category": "in Books (", "Name": ["The Sound Book: The Science of the Sonic Wonders of the World"], "Timestamp": "2015-05-24 21:27:06.214120", "itemurl": "http://www.amazon.com/Sound-Book-Science-Sonic-Wonders/dp/0393350584", "Reviews": {"TotalReviewCount": "23", "ReviewList": [{"Date": "on August 26, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VF4BV5ONRSL6"}}, {"Date": "on March 2, 2014", "Text": "Interesting to learn how musical instruments reverberate, as explanations for some of the great sonic spaces in nature and man made.  I will now listen to everything differently, and as a result, hear my surroundings differently.", "Helpfulness": 0.8, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANOFXSJJYSD82"}}, {"Date": "on September 22, 2014", "Text": "(This review refers to the audio CD edition which I purchased directly from Tantor Audio).  This is an entertaining, informative, and thought-provoking book that examines a wide variety of acoustical effects.  It may be a bit light on the science and a bit basic for the acoustical engineer, but for a lay person, it should be quite enlightening.  Unfortunately, the audio edition did not fully capitalize on that medium to convey examples of sound described in the text, but it was still a quality production, Jonathan Cowley, the narrator, having a great voice and style for delivering the content.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A187CQD9X6BHU8"}}, {"Date": "on June 30, 2014", "Text": "After hearing an interview with the author on NPR, I was intrigued enough to order this book. It was very much well worth it. If you're an audio engineer or lay-person interested in the way sound works in our world, you'll enjoy this book. From natural phenomena to man-made artifacts, both old and new, the way sound works in our world is intriguingly explored in a very easy to read manner. This is not a technical book, nor a difficult read - and neither is it unnecessarily dumbed-down either. Get it. You'll enjoy it!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LQZGCQCXIYBS"}}, {"Date": "on October 15, 2014", "Text": "This is an absolute gem for anyone who is curious about the world. Yes it's about sound, but it's a journey with a person who has so much to teach us about the world. You'll never wince from a subway train in quite the same way, nor will an autumn chorus of crickets ever escape you. I urge anyone to buy this book and cherish it. It will reward you over and over again.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MD1UXA0GJZLN"}}, {"Date": "on June 4, 2014", "Text": "There was so much information, much of which I had never focused on before and/or thought about.  Today, I listened to my favorite birds singing with an even more sensitive interest.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16677KN4P9SLI"}}, {"Date": "on March 25, 2015", "Text": "it's a bit hard to read for those not sophisticated in physics, but still very interesting to dig into. a bit less of science, a bit more of entertainment would give it 5 stars.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1X1NHXPYQQQOK"}}, {"Date": "on March 21, 2015", "Text": "Great read. I highly recommend it for both audiophiles and anyone with an interest in the world around them.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A9JWQ9PD2RDKE"}}, {"Date": "on August 14, 2014", "Text": "Gave this book as a gift to an audiologist friend who found it quite fascinating", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMYDS3XCPMK3B"}}, {"Date": "on September 23, 2014", "Text": "This book is fabulous!  A great read, very informative and fascinating.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QLUXNYS3I7U"}}, {"Date": "on April 3, 2014", "Text": "Shortly After reading the chapter on echoes, I visited Mt. Bromo with my family. Instead of just looking at the crater of this volcano and viewing the surrounding caldera, we experimented with listening to this area as well. Mt. Bromo  is another place to add to any sound tourism list as its echoes were splendid. I am glad for the increased awareness this book gave me for observing soundscapes as well as views.", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EP5VR9MS5928"}}, {"Date": "on December 4, 2014", "Text": "WHAT EVER YOU WANT TO FIND OUT ABOUT SOUND- THIS IS IT. DREW", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JVKQ84O1H3D0"}}, {"Date": "on July 21, 2014", "Text": "Very fun read.  Made me more aware of my sound surroundings.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FJJIHGYVHN81"}}, {"Date": "on April 16, 2014", "Text": "For those with scientific interest in acoustics, you'll find little science here.  The book reads more like a tour guide, complete with over the top and unnecessary scenic detail, that falls far short of increasing anyone's knowledge of acoustics in more than the most elementary terms (and that's an understatement).  Best placed in the travel section.", "Helpfulness": 0.6, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34I4LEKUX08J"}}, {"Date": "on April 2, 2014", "Text": "A great book on the sounds that occur in nature and the influence that structures, natural and man-made, have on what we hear.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AI8GDY07XEUU6"}}, {"Date": "on March 24, 2015", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DMVMDODOG6ZL"}}, {"Date": "on July 23, 2014", "Text": "Although I enjoyed the book, I was expecting more \"science.\"  Additionally, writing a book about sound is like giving a slide presentation about color photography - in black and white.  Fortunately, I read the book on my kindle fire and on my Kindle for PC.  This allowed me to highlight and then search the internet for audio files of his examples.  That made it a lot more fun.  Thank Amazon for this wonderful technology!!  I love my Kindle.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A408WN8WJM2VU"}}, {"Date": "on November 12, 2014", "Text": "thanks", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LDUAM6CQM4YZ"}}, {"Date": "on April 29, 2014", "Text": "This book was ordered as a gift and the recipient was happy to get it. Heard the author on NPR and prompted me to buy the book.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DK8ELEMUJTDA"}}, {"Date": "on February 19, 2014", "Text": null, "Helpfulness": 0.5833333333333334, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PWPQ90NQFE53"}}, {"Date": "on April 8, 2014", "Text": "I've always been interested in Audio and Acoustics, and I think this book has the perfect balance between theory and common phenomena explained in an easy way.A great book for experts and regular people. Loved it!", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LHFRYM0VNH69"}}, {"Date": "on March 20, 2014", "Text": "A wonderful book. He conveys a sense of adventure exploring sound phenomena. It made me listen more closely to my everyday world too.", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AO67UOB1KDOTE"}}, {"Date": "on March 4, 2014", "Text": "He writes well but doesn't say that much.  His material might be presented in a more interesting, even more retainable fashion via a novel by Dan Brown.  If you don't enjoy this kind of knowledge for its own sake, you might not find it fascinating and probably won't read through to the last chapter.  However, if you are intrigued by the detail of nature surrounding you, Mr. Cox's skill with phrasing and pace will support your glide through often repetitious materials.  My read has been a chapter at a time and I must admit that I have yet to read the last chapter, but only because I left the ipad on which I'd downloaded this book on an airplane.", "Helpfulness": 0.2, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DZ0Y7WRW6E4X"}}], "ReviewUrl": "http://www.amazon.com/Sound-Book-Science-Sonic-Wonders/product-reviews/0393350584/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.6 out of 5 stars"}, "OfferPrice": "$13.56", "Salesrank": "#273,444", "ListPrice": "$16.95"}