{"Category": "in Books (", "Name": ["Hidden Order: How Adaptation Builds Complexity (Helix Books)"], "Timestamp": "2015-05-24 23:10:17.118205", "itemurl": "http://www.amazon.com/Hidden-Order-Adaptation-Builds-Complexity/dp/0201442302", "Reviews": {"TotalReviewCount": "24", "ReviewList": [{"Date": "on April 11, 2001", "Text": null, "Helpfulness": 0.9672131147540983, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LNUBK8OQCGAE"}}, {"Date": "on March 4, 2000", "Text": "Dr. Holland is a truly remarkable person.  After creating the study of genetic algorithms he has gone on to further investigate concepts like complex adaptive systems.  This book is an amazing look into his mind and an examination of some interesting theories on complexity science.  He  provides here a proposal for research and lays down a theoretical framework  that can be used to examine questions like emergence and agent interaction.  A must read for anyone interested in these questions.  It is important to  remember that this is an introductory text meant to be read by the general  public.  If you want more detailed looks into Dr. Holland's work I  reccomend any number of his articles as well as his landmark treatise  Adaption in Natural and Artificial Systems.  The monograph that founded the  study of genetic algorithms and was a major contribution to the study of  evolutionary programming.  Overall this book is rich with much insight and  has many exciting ideas for possible research.", "Helpfulness": 0.9736842105263158, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NF2Y5WSC4KM8"}}, {"Date": "on March 19, 2004", "Text": null, "Helpfulness": 0.9818181818181818, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYA7BD21FUWCL"}}, {"Date": "on March 19, 1998", "Text": null, "Helpfulness": 0.9361702127659575, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on May 8, 1998", "Text": "John Holland's work \"Hidden Order\" is a treatise from the creator of the genetic algorithm on \"Complex Adaptive Systems\" or CAS.  Holland explains in easy to understand language the concept of CAS, how one goes about designing them, and how one can use them to make observations about the universe.  Holland is not well known to the general public, but his work in this field is ground breaking and of great importance, and carries on the tradition of logicians such as John von Neumann and Alan Turing.  I would advise reading this book before moving on to his later work, \"Emergence,\" as this gives one a sound basis in Holland's thought, and \"Emergence\" is a slightly more difficult read.  A wonderful book.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PR70XCP996LG"}}, {"Date": "on July 5, 2002", "Text": null, "Helpfulness": 0.84375, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19EWP1U3X1I2B"}}, {"Date": "on October 20, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2V4HNNGJMWVJ2"}}, {"Date": "on January 24, 1999", "Text": "The ideas treated here scarcely justify an article much less an entire book.  It is as much work to plough through this tedious writing as it must have been for the author to pad it out to book length.  There is nothing  said that is new or compelling.  Most of the ideas fall into one of the  three categories of obvious, arbitrary, or completely glossed over.  The  author presents his previous work on genetic algorithms with a great deal  of handwaving and mumbo jumbo.  I suppose when the only tool you have is a  hammer, every problem looks like a nail.  And as the only subject in the  book treated in any detail, genetic algorithms certainly help to up the  page count.  I imagine that anyone who has thought about adaptive systems  to any degree will find this book as tedious as I did.  If this is your  first encounter with abstracting the notion of a system or with genetic  algorithms, you might be able to wade through the muck and learn something,  but any book that treats its subject so shallowly should at least be well  written, and this book isn't.  The mostly ridiculous diagrams look like  they were printed on a dot matrix printer.  This is a five page grant  proposal for graduate research stretched to 170 pages with a tutorial on  genetic algorithms thrown in.  Could the author not have waited for some of  that research to actually be done before writing the other 165 pages?  Ugh.  If you want to read something intelligent about complex systems, try At  Home In The Universe by Stuart Kauffman.  A little bit of thought FOLLOWED  BY SOME ACTUAL SCIENCE would qualify anyone to write a much, much better  book than this.", "Helpfulness": 0.7017543859649122, "StarRating": "2", "Author": {"ProfileUrl": ""}}, {"Date": "on April 28, 2014", "Text": "I learned about a new way of looking at mathematical formulae that can be used to see the \"Hidden Order\" (by John Holland) in complex nonlinear systems. \"Wow!\" I thought. \"So this is the kind of stuff these guys do!\" Patterns in Nature that are adaptive repeat themselves at every of level of Complexity. Sometimes, however, no doubt out of enthusiasm for his discoveries and work in this area, Holland strays into a writing voice that made me feel he believes it is his formulae that account for the 'hidden order', the adaptivity of these patterns, or how & why they build toward Complexity rather than that he has found a simple way to describe a remarkable phenomenon that Nature discovered billions of years ago and has been using ever since, even in the face of increasing Complexity! The mathematical ideas Holland has discovered are simply simple ways to reduce the complex variations in an adaptive pattern discovered by Nature long ago into a set of fomulae that are merely descriptive! That certainly has its utility in this Renaissance Time we find ourselves in. We are fortunate to live in an atmosphere where scientists from mathematics, to cosmology, to molecular & genetic biology, to cultural anthropology, to developmental psychiatry & psychology, to civil engineering and computer science (to mention a few!) have begun to appreciate the value of thinking and working together to unravel the mysteries of the birth of the Universe and the evolution of Life here on earth (and very likely on other planets similarly positioned in other solar systems in other galaxies in this and maybe even other Universes!) It's an exciting time for the educated and thoughtful professional of ANY educational background who wants to spend his or her leisure hours (!) trying to wrap his/her mind around this proverbial elephant we blind folks are trying to define, integrate, and--most importantly--understand. I did not experience the 'humor' in Dr. Holland's writing others have spoken of. And, as someone who has only late in life discovered the pleasures of understanding mathematics beyond calculus, I still found I had to work to maintain an optimal level of enthusiasm for Dr. Holland's efforts to reach out to me with as little 'math' as possible. Perhaps that characterizes the problem that exists in the scientific community--trying to make our work and the language we use to describe it as understandable and useful as possible to those in other disciplines. Dr. Holland has clearly drawn together a vast diversity of knowledge from an enormous variety of seemingly unrelated fields of information and thought, and shown us how we can understand the adaptive patterns that underlie their functioning and their increasing Complexity that still exists within their fundamental nature. But I caution the reader to remember--for all its ingenuity--it does not (to my mind) explain the 'why' or even the 'how': It simply--but brilliantly--lays out for us the formulae that can explain the 'whats' that Nature has adaptively discovered. Although I managed to read the entire book & found it informative & helpful to me in my own research, I could only take it in mangeable chunks. I appreciated his efforts to make his ideas accessible & useful to us non-mathematicians; but it was neither a fun nor an easy read for me. In particular, I was disappointed in not being able to grasp what I was looking for--his subtitle, \"How Adaptation Leads to Complexity\". That seems to me a point of fundamental importance, as it should help us understand how Life--the ultimate in Complexity--seems to go against the very nature of the 2nd law of thermodynamics. Maybe my failure to grasp that understading from Holland is because interdisciplinary discourse of this depth of understanding is by its very nature neither fun nor easy. In this regard, I would recommend \"Sync\" by Strogatz who tackles many of the same ideas with a language much more like English (and even laced with some humor). Together, the two books are a terrific combination. 1 + 1 = 2.5. In closing, if you talk to an artist, he/she will tell you that true creativity may be rewarding, but that does not mean it is either fun or easy: Perhaps that's why we call it work! If you want to play, go buy a mediocre novel! Thanks for your interest in my ideas! Gary C. Martin, M.D., Psychiatrist & Psychoanalyst", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A259G9KOCJMW8V"}}, {"Date": "on March 17, 1998", "Text": "This book is a clear, succinct, and accessible primer on some of the basic premises of the science of \"Complexity\".  On it's own, it's a worthwhile investment for anyone who is curious about the field;  given Holland's status as one of the field's \"pioneers\", it is a \"must-have\" addition to any scientifically-literate person's library.", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on February 6, 2009", "Text": "The book begins with a bunch of statistical formulas, but don't let that throw you. This is an extremely readable book on the nature and structure of complex adaptive systems.  It explains how complexity evolves from chaos, and it uses clear, precise language that anyone can understand.  It takes a complex subject and makes it easily understandable. It can bring up up to speed on this topic quickly.", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A5M3MLF0FSWZV"}}, {"Date": "on December 25, 2014", "Text": "very cool angle on complexity theory", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1F9DJU7445HHX"}}, {"Date": "on March 6, 2015", "Text": "it is very good.fast and excellent", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKRVGYMLQI6UX"}}, {"Date": "on January 5, 2014", "Text": "Our environment is far from getting simpler, unless you are ready to believe a cheap ad and someone's exclamation \"this product changed my life\", or \"it is amazing\". Both, are instant turn off for me. The Hidden Order is my toil to understand better complexity and the book did a good job in explaining that. This will not be the last book I buy on this subject!", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A234BBOJ690LOP"}}, {"Date": "on June 13, 1999", "Text": "Simply stated, this is a primer...and an excellent one at that. If you need an easy reading overview before getting into the dry reading of technical literature, this is the place to start.", "Helpfulness": 0.5555555555555556, "StarRating": "4", "Author": {"ProfileUrl": ""}}, {"Date": "on June 5, 2013", "Text": "I waited a long time to get this book from an initial description of the contents.  It was the idea presented that intrigued me.  Short but too abstract for me.  Clearly written, however.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DJXSNBL55067"}}, {"Date": "on December 21, 1998", "Text": "Holland does a great job of explaining Complex Adaptive Systems (CAS) in simple terms, a great book and I recomend it to all.", "Helpfulness": 0.5555555555555556, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXRTCT3463L26"}}, {"Date": "on February 3, 2014", "Text": "Genetic algorithms do not get covered in school. I wish that there was a web site with software apps to do demos of the principles.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PVEI9AB4TYYP"}}, {"Date": "on December 22, 2010", "Text": "This book talks about the questions related to the complexity, what can be resolved also using the game theory. It is important as the agents operate around them in according to an approach that can be stathic or dynamic. The most important application of this book is the theory of networks. The non-linear phenomena are studied with the Markov chains.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KBV0G9ULFG7V"}}, {"Date": "on August 4, 2014", "Text": "I WANT TO SEE THE TABLE CONTENTS OF AMAZON BOOKS!!!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3S141RQQRK89I"}}, {"Date": "on February 10, 2004", "Text": "The ideas presented in this book by John Holland are no doubt interestring.  The thought of spontaneous self-organization though hardly new has intrigued humans for centuries. Intuitively it makes sense and appeals to most peoples physical and methaphysical sensibilities. We know and hope that there is more to life than our common sense knowledge of it and the often dull and mechanistic accounts of natural science. Emergence theory therefore has an immediate appeal. Holland manages to keep this \"flame\" alive for one chapter (the first one) then the wholle enterprise is drowned in techno babble and most \"non-hacker\" readers are bored and dissappointed. This book is one more instance of a genuinly interesting idea being mercilessly slaughtered by bad writing. It's a true waste. It makes you wish writing courses were made compulsory for natural scientists and techo folks. Unfortunatelly it is hard to reckommend a better book on this subject... Most of the existing books are either written by litterary incompetent but hard core techno devotees  or by soft science writers ruminating the self evident and riding the tidal wave of hype. All for the buck and a snapshot in the spotlight. A non-trivial sign of an over-hyped field of inquiry, dangerously bordering the realms of pseudoscience. At least chaos theory had Edward Lorenz as a respectable and astute front figure, managing to keep the delicate balance between scientific integrity and popular appeal. As for emergence theory that post is still vacant. Holland may be an important contributor to the field of emergence theory but he fails the requirements for that post.", "Helpfulness": 0.3559322033898305, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AH5SGJWQK8MEW"}}, {"Date": "on July 7, 2007", "Text": null, "Helpfulness": 0.18181818181818182, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HR6MGB7QZVOH"}}, {"Date": "on September 16, 2005", "Text": "It gave me the basic concepts in very clear and rogorous way", "Helpfulness": 0.18181818181818182, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AT12H6CGQMBLV"}}, {"Date": "on May 1, 2001", "Text": null, "Helpfulness": 0.2807017543859649, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LMBO89XTU96E"}}], "ReviewUrl": "http://www.amazon.com/Hidden-Order-Adaptation-Builds-Complexity/product-reviews/0201442302/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.1 out of 5 stars"}, "OfferPrice": "$9.26", "Salesrank": "#385,998", "ListPrice": "$16.00"}