{"Category": "in Books (", "Name": ["Applied Drilling Engineering (Spe Textbook Series, Vol 2)"], "Timestamp": "2015-05-24 23:17:32.920316", "itemurl": "http://www.amazon.com/Applied-Drilling-Engineering-Spe-Textbook/dp/1555630014", "Reviews": {"TotalReviewCount": "9", "ReviewList": [{"Date": "on January 25, 1999", "Text": "This book provides a very detailed reference source for most aspects of drilling engineering. It covers everything from bit design to hydraulics to derived burst, collapse and tension equations for casing design. Diagrams  and pictures are well presented and helpful in explaining some of the  subject matter. The only thing that is lacking is a chapter on drilling  optimization.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on October 18, 2009", "Text": "Used this textbook for a graduate course in 2009. That said, it's INCREDIBLY outdated. While very comprehensive and full of useful information, from a learning perspective, it's not very good. Examples are one of the major problems with this book. There are no labels for units during many of the example calculations and mysterious conversions pop up fairly regularly. The layout is frustrating as well, as many of the images, diagrams, charts referenced aren't on the same page as the written descriptions. You're better of buying a more up to date book. There's tons of them so you can't go wrong.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HFQG9ERESZUY"}}, {"Date": "on June 29, 1999", "Text": "I have been able to pick up technical calculations and great drilling information that would have taken several years of  hands on experience.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": ""}}, {"Date": "on January 16, 2000", "Text": "This is an excellent book for it covers most of the aspects of drilling engineering. However, in some sense it is becoming outdated; it needs additional chapters on Novell Drilling techniques (Horizontal &  Underbalanced drilling, Coiled tubing Drilling, MWD) chapter on drilling  muds should go more in depth, one example of preparing drilling program and  small completion chapter would be a definite assett for this book.", "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RLZAAUQ6G4L6"}}, {"Date": "on August 9, 2013", "Text": "It's all what I expected, there is a lot of helpful formulas, luv it I highly recommend it to anyone out there who is a well site supervisor", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1V4D5ORE04LX8"}}, {"Date": "on January 18, 2013", "Text": "great read. I love catching up on a little light readying of applied drilling.  I really liked the price too.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Z2EQCRQUAWQV"}}, {"Date": "on October 4, 2014", "Text": "As a grad student of petroleum engineering, I must say this is a MUST-BUY, if you were thinking of starting a career in petroleum engineering too, or at least drilling engineering. So I don't think I have to elaborate here, if you understand what I mean.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TL77HKZL7PR1"}}, {"Date": "on April 16, 2015", "Text": "No complaints..... Good job and the book was deliver on time..", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXP6SOPY7XDRS"}}, {"Date": "on August 8, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VKVEUZNISOR0"}}], "ReviewUrl": "http://www.amazon.com/Applied-Drilling-Engineering-Spe-Textbook/product-reviews/1555630014/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.4 out of 5 stars"}, "OfferPrice": "$27.43", "Salesrank": "#410,406", "ListPrice": "$80.00"}