{"Category": "in Books (", "Name": ["Surely You're Joking, Mr. Feynman! (Adventures of a Curious Character)"], "Timestamp": "2015-05-24 23:21:50.735433", "itemurl": "http://www.amazon.com/Surely-Feynman-Adventures-Curious-Character/dp/0393316041", "Reviews": {"TotalReviewCount": "706", "ReviewList": [{"Date": "on September 23, 2002", "Text": null, "Helpfulness": 0.9475982532751092, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CZQJX3V1VKNQ"}}, {"Date": "on December 5, 2000", "Text": null, "Helpfulness": 0.9340659340659341, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OVSKQCT56NTT"}}, {"Date": "on February 13, 2000", "Text": "This book is a jewel.  One would be hard pressed to find a more comical and enjoyable book to read - anywhere.  Feynman is the scientist who breaks (or should I say, shatters?) the stereotype of the lab-coat physicist who  wears thick, taped up glasses.  The great Richard P. Feynman is a testament  to how great we as a race can me.  I like to think of him as a cross  between Goethe & Robin Williams (and I do NOT mean that in any sort of  deragatory way).  As a physicist, he was top notch, but as a person he was  something even more.  He had a marvelous sense of humor & enjoyed  playing pranks on people.  His love of life spilled over to all the people  he met during his sojourn on the planet.  I only wish that I had been one  of those lucky few to have met & known him personally.  Perhaps what is  most remarkable about him is that he had friends from all walks of life.  Many were scientists, yes, but many more were \"ordinary\" people  off the street.  That is rather noteworthy given the fact that so many Ivy  league-calibre professors feel that they too \"intellectually  gifted\" to associate with the rest of we mere mortals.  Someone once  said that Edwin Hubble wasn't a humble man, but then again, Hubble didn't  have very much to be humble about.  I would argue that one could say the  latter of Feynman as well, but not the former.  READ THIS BOOK and share  the experiences of one of the most extraordinary and yet fun loving  personages of the 20th century (if not all time).  I guarantee it will make  you laugh like few other books you will ever read.", "Helpfulness": 0.8961038961038961, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35YWA2V4QHOJ3"}}, {"Date": "on September 23, 2000", "Text": "This is a great book, for both geeks AND non-geeks.  It explores the exciting life of Richard Feynman, one of the greatest physicists of the century.  But this book is not about physics, rather it tells you how interesting of a life a physicist can have.  It has stories of how the author got girls, tricked and joked on friends with his wits, did stupid things at formal occasions, and blabbered about many parts of the government and other recognized systems. I definitely recommend this book to those thinking about a career in research science like I am.  It gave me the impression that being a scientist doesn't necessarily make you stay in a white lab coat all day talking geek-talk.  On the contrary, you can still have a life.  It confirmed my want to pursue and education and career in research chemistry. As for non-geeks, you'll get a good laugh about the interesting character of Feynman, without needing any knowledge of math or science to read the book (though there are about 1 or 2 jokes that somewhat relate to math).", "Helpfulness": 0.9565217391304348, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BLIL2PCWB3DC"}}, {"Date": "on June 7, 1999", "Text": "Recently, during a course in Quantum Mechanics, my professor suggested reading this book and I feel that my life has a new meaning now.  Richard  Feynman was a true genius and anyone remotely interested in the field or  the man must read this book.  Feynman's autobiography brings to light an  amazing man who fixes radios since he was ten, who cracks safes, who can  smell like a dog, does tricks like a conjurer and even picks rooms directly  opposite to the girls' dormitory!!!  One of the most brilliant minds of  twentieth century, the autobiography also portrays him as a human being who  didnt do extraordinary things but ordinary things extraordinarily well.  A  must read for students or even for ordinary people because the book also  shows that human capability is in the will and the mind.  We set boundaries  and limitations to our abilities ourselves not bothering to think that we  are capable of a lot more if we put ourselves to the task.  For a more  scientific approach to his work, you may wish to read the book, 'QED' which  has a series of his lectures at Caltech for the general public and the  famed 'Feynman's Lectures on Physics' his lectures in college physics at  Caltech during 1965-66.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALEQQ4YT36N8C"}}, {"Date": "on January 29, 2002", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A15S44J4NHU4LS"}}, {"Date": "on January 4, 2007", "Text": null, "Helpfulness": 0.9411764705882353, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOOZD3SGGDXUT"}}, {"Date": "on July 14, 1997", "Text": null, "Helpfulness": 0.9411764705882353, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on May 19, 2003", "Text": null, "Helpfulness": 0.9375, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31WE0G828ZWY5"}}, {"Date": "on December 13, 1999", "Text": "I wish someone had given me this book when I was 12-13 years old.  I have always enjoyed math and science, but this book would have really made me more excited to learn as much as possible instead of \"just enough to  not look too dorky\".  Anyway at 24 years old I read the book and loved  it.  I have given away several copies since then.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on December 20, 2000", "Text": null, "Helpfulness": 0.9, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOQW57I26ZN5"}}, {"Date": "on December 22, 2005", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PJDV044CLYCY"}}, {"Date": "on January 1, 2011", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A912QKZ7UYI8L"}}, {"Date": "on June 1, 2001", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VIFG16QXT0MV"}}, {"Date": "on May 27, 2006", "Text": "I'm in the camp that believes Feynman was a brilliant scientist but somewhat of a jerk.  His practical jokes, though perhaps brilliantly conceived, were often hurtful and arrogant.  His stories about his bar-hopping and womanizing lack credibility.  I'm not impressed that he knew how to play bongo drums -- who doesn't?  And then there are his \"cultural\" pursuits. I know other scientific types who look down on the arts and believe they are easy.  As a result, we get a lot of scientists who think they can write, compose or play music, do art, write poetry, etc., when, in fact, they are usually embarassingly terrible at those things.  Feynman is guilty of that; his prose is mundane and cliched.  Where was his editor?  On the other hand, I was very impressed by Feynman's passion for correct learning, that is, to make sure you UNDERSTAND something, not just rely on rote.  That's valuable.  Ditto for his belief that if a person does not live up to another person's expectations, it's the fault of the person who set the expectations too high, not the person who failed to meet them. I enjoyed the vignettes of other great thinkers. I appreciated his plea for total intellectual honesty in all endeavors. And although I think Feynman was a wiseacre, I have to admit that he had me laughing in a few places.  I believe Feynman was a great man -- perhaps more accurately, a great nerd.  I'm glad I read the book, but in its entirety, I would have to say it merits only three stars.", "Helpfulness": 0.7745098039215687, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QS5UYAGHF4IU"}}, {"Date": "on June 5, 2001", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AS7MDGC3HVTP0"}}, {"Date": "on December 25, 1997", "Text": "I was flipping through TV channels one day, around 4 or 5 years ago, when I came upon a show with this guy playing bongo drums and singing about orange juice! Since I am a drummer, I was curious as to who the person was - he didn't look at all like a drummer. In fact, he looked more like a professor of some kind or another. I was intrigued and I kept watching this guy wailing away at the drums. Well, it of course turned out to be Richard Feynman. It was the first time I ever heard of Richard Feynman, but it was not the last. The TV show (it turned out to be a PBS special) was about Feynman and his quest to visit a place called Tuva something. Anyway, they talked about Feynman and his life in physics and teaching, and I was mesmorized. After watching this show, I purchased a copy of the book \"Surely, Your Joking, Mr. Feynman\" and I have become a Feynman fan ever since. The book is inspirational. Feynman comes across as a \"doer\" who understands the difference between awareness and knowledge, and points out that you can only really ever know anything by doing. My only regret is that I never got to see a live Feynman lecture. However, one can follow his example and continually challenge themselves by separating facts from opinions and assumptions, and by proving the facts themselves (therein lies true knowledge). All in all, an amazing book I would recomend to just about anyone!", "Helpfulness": 0.9090909090909091, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on November 2, 2000", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23OLHL5RPQKLP"}}, {"Date": "on June 13, 2006", "Text": "I can't really add much to the hundreds of reviews already posted but to say one thing in response to a common criticism I've read.  Many have criticized this book for its poor writing style.  This would be a valid critique - if Feynman had actually sat down and written it.  Nearly the entire book is transcript from a series of taped conversations between Feynman and a friend, and the effect is  amazing. Enjoy!", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3P9DITRAAYMUM"}}, {"Date": "on April 22, 2007", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AODMB0PQ0XDIY"}}, {"Date": "on January 31, 2002", "Text": null, "Helpfulness": 0.9, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LPMI7GGRU83E"}}, {"Date": "on April 30, 2005", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25V93ULIXHM5N"}}, {"Date": "on September 22, 2002", "Text": "\"Surely You're Joking\" frankly and unabashedly has the sole purpose of explaining what its like to be Feynman.  It reads as if you've cornered him at a party, and asked him to explain just why he acted so weird, then transcribed what he said for five hours.  For those who are unfamiliar with Feynman's particular brand of eccentricity, his unwillingness to accept anything he's told as gospel, this should be an eye-opener.  For those who consider themselves the same, if not in intelligence but in approach to life, it's an egotistical trip wherein one has the guilty pleasure of saying \"Yes, the Universe really is so stupid, isn't it?\"", "Helpfulness": 0.9, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D2M1KYJ18T7E"}}, {"Date": "on November 23, 1999", "Text": "This is easily one of the funniest books I have ever read -- and the best part of it is that it is non-fiction.  Rarely can one see into the mind of a genius and extremely rarely into the mind of a genius who is also  mischievious.  His encounters with great minds such as Einstein,  Oppenheimer, Teller, von Neumann, etc. are engaging because we see those  people as humans, with human foibles.  The title chapter (number 2) has to  be read to be believed.  I challenge anyone to read that chapter without  laughing out loud!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on September 2, 2003", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QVSQFCJRDRX5"}}, {"Date": "on May 13, 1997", "Text": "Well, what can I say about this book?  The truth is, it left me in such laughing fits I looked utterly and totally maniacal while reading it in public.  Who would have thought that a brain that he was (mind you he was a Nobel prize winner who worked with some of the greatest minds known to date, was involved in the making of the atomic bomb, lectured in Cornell, etc etc) was as warped as he?!  I mean, this guy went through life playing pranks on people, doing the most weirdest experiments (such as ferrying ants to determine if they left trails and if they had a sense of geometry, and persisted in controlling his dreams to the point where he could navigate himself in full colour), tried to prove a point by peeing while doing a head-stand and hung out six times a week in a topless bar even while still a professor in Caltech! Feynman was a real character to say the least.  I thoroughly enjoyed the book, and truly don't remember the last time I loved a book this much for its style, its seeminly identifiable everyday-like experiences but with a hilarious Feynman twist to it, and most of all Feynman's life, pranks and adventures. Interestingly, he also tried to explain some (few) physics laws in humourous ways (probably for the scientifically impaired such as myself) and highlights the problem of rote-learning, which most encouragingly, he says is also practiced by MIT students.  Finally, his insight into MIT and Princeton makes some of the best stories in this must-read book.  A very enlightening and inspirational man.  Very very very highly recommended", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on July 26, 2006", "Text": "This book was an absolute joy to read. I found that I could not put it down. It makes a great book for a small break in the day because each topic is only a few pages. I will warn you that reading just one topic may be difficult. If you enjoy science, physics, how things work, brilliant minds, you will love this book.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3EJQ5AGBPEAQ1"}}, {"Date": "on April 8, 2002", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1S3C5OFU508P3"}}, {"Date": "on October 11, 2001", "Text": "I first heard of Richard Feynman when I was taking Physics in high school and my teacher showed us a movie in which he was interviewed.  In fact, the movie had nothing to do with physics, but with Feynman's quest to visit some obscure country (Tuva??) in the South Pacific.  I was struck by the man's wit, not to mention his intelligence.  Both aspects of his personality came out in this entertaining book.  If you have never heard of Feynman or you have and want to learn more about him, I highly recommend this book.  It includes memoirs both of his work in physics and of his travels through America and around the world.  I found his chapters on safe cracking at Los Alamos and on his army physical examination particularly enjoyable.  \"Surely you're joking...\" is not too heavy on the physics aspect of his life, but it provides just enough to satisfy the scientifically curious.  A great read to stimulate the mind and keep you smiling throughout.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2C2KOG7VFCTJI"}}, {"Date": "on December 24, 2006", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SVMHV2P1Q9Q2"}}, {"Date": "on July 15, 2011", "Text": null, "Helpfulness": 0.7647058823529411, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AZZZNX7EN6YQ"}}, {"Date": "on December 23, 2001", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUH0LW4H829UA"}}, {"Date": "on August 15, 2001", "Text": null, "Helpfulness": 0.7, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AR62AZIQLYARV"}}, {"Date": "on April 16, 2004", "Text": null, "Helpfulness": 0.7777777777777778, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2S7EQBUEZLY9A"}}, {"Date": "on June 17, 2003", "Text": null, "Helpfulness": 0.8, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10R81SKUK3TG6"}}, {"Date": "on November 1, 2001", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMFVKQ2270HIJ"}}, {"Date": "on February 15, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BYV7S1QP2YIG"}}, {"Date": "on January 21, 2008", "Text": null, "Helpfulness": 0.8, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1V1K3VVFXUMDH"}}, {"Date": "on April 8, 2004", "Text": "\"Surely You're Joking, Mr. Feynman\" is a very interesting book. The many amusing and captivating stories in this autobiography keep you wanting to read more. I personally had a hard time putting this book down every night. Even though I started reading this for a physics project it turned out to be a very entertaining assignment due to the many diverse topics discussed in the book. The subjects discussed range from physics to biology and even touching on hypnosis in one chapter. The book starts out by telling how he acted growing up and then went on to tell about his college life and eventually went all the way to his adult life. This book is a humorous look at the world of science through the eyes of one of the greatest physicists of all time, Richard P. Feynman. It is a must read for anyone interested in any science related field.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14SKMF2IOLD9K"}}, {"Date": "on August 24, 2004", "Text": null, "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YRV8ICHSL41F"}}, {"Date": "on March 10, 2002", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16SS8HYJW7IEJ"}}, {"Date": "on September 19, 1996", "Text": "I was checking on this book because I just recommended it as an acquisition for the library at the community colllege where I teach.  The book describes the life of a brilliant Nobel Prize-winning physicist, and shows him as a completely accessible human being.  He gives a marvelously entertaining account of some of the experiments he conducted while a college undergraduate - all of them completely understandable to a layperson.  But the book continues through his adult life: his attempts to learn Japanese, his experiences as a patron and legal defender of a local strip club, his encounters with military stuffed shirts during WWII, and dozens of other adventures.  If you want to convince yourself or someone else that it's possible to be a brilliant scientist and a real human being simultaneously, then this is the book.  Both as entertainment and as information, it's a smashing success", "Helpfulness": 0.8, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RTKL9KB8KLID"}}, {"Date": "on July 22, 2001", "Text": null, "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IANEBSMVGHS9"}}, {"Date": "on July 5, 2001", "Text": "Okay, I admired and respected Richard Feynman alot and this book was a good read.  But I agree with some of the other reviewers that he might have come across as being arrogant and that some of the anecdotes were gleefully condescending.  I had the unconfortable feeling that I might have been one of the hopeless luddites he was lampooning! If you can get past this feeling, however, you will enjoy the book.  It does reveal how a truly great mind works, warts and all.", "Helpfulness": 0.7333333333333333, "StarRating": "3", "Author": {"ProfileUrl": ""}}, {"Date": "on June 5, 2003", "Text": "Mr Feynmann has shown us that while it pays to be good at what you do, life is far more interesting if you poke your nose into things you know little of. There are people who complain about how boring life is. Mr Ofey has shown us that the joy of discovering things can keep us young forever. I am sure if he lives to a thousand years old he will still be the same curious character we all love. Like most who read this book, I am sad that we can no longer enjoy his antics. This book changed my life.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13L8GETXPQC2Z"}}, {"Date": "on August 7, 2000", "Text": null, "Helpfulness": 0.8, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ALUNVOQRXOZIA"}}, {"Date": "on November 27, 2001", "Text": null, "Helpfulness": 0.8, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6VKLR1PVJLFS"}}, {"Date": "on May 17, 2006", "Text": "Yes, it's true that Feynman was a great scientist. Fortunately, for those not well-versed in physics, it's not necessary to know anything about it to enjoy this book. His escapades are funny, and, if some thought them cruel, I don't think that was his intention. He learned from everything around him, from how people act, to cracking safes (which he did to point out security flaws), to learning about the fascinating world of ants. His sense of humor shines through in all his stories, so that makes this book great fun to read as well as a great resource into the mind of an intelligent and thoughtful man. I cannot recommend this book enough.", "Helpfulness": 0.8, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EFWG9DMWKB2L"}}, {"Date": "on May 20, 1996", "Text": "Even before finishing the first chapter I was laughing and couldn't believe how one man could have such an incredible life. You just can't stop reading it. It's like a magnet that pulls you in. And if you finish it, you feel so inspired and awed that you just can't believe it's real and you want to read it again just to make sure.  -Mike Sheppar", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on August 14, 2006", "Text": "This is a fantastic book!  Richard Feynman is a fascinating person and an excellent writer.  His view of the world is exciting and interesting and his life experiences make for enjoyable stories.  One lesson that comes through in this book is 'Think', don't be afraid to stop and think about something, a problem, a point of view, etc.  Through these stories and the life of Richard Feynman, we are all shown what it is to live a life well.  Get this book!", "Helpfulness": 0.8, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YULPSMPKWNFF"}}, {"Date": "on January 3, 2000", "Text": "I am NOT an avid reader, I usually read around 6-10 books a YEAR and I read this one in a matter of days. I absolutely could not put it down. One of my all-time favorite books. This man is not only a incredible mind, but  has incredible talent in conveying his thoughts through the written word.  The book is full of anecdotes which you can draw from in everyday life. A  must-read!", "Helpfulness": 0.8, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWQMAR2GD78E9"}}, {"Date": "on January 28, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GCNKRNKPF3RW"}}, {"Date": "on April 4, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIZH1NSOVVKG9"}}, {"Date": "on April 23, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OKM2VZZQV0YQ"}}, {"Date": "on November 30, 2011", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AX1H2COFPEDN"}}, {"Date": "on July 24, 2011", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LI8P7VU8UWPU"}}, {"Date": "on February 28, 2010", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DI67ZSLU883A"}}, {"Date": "on January 8, 2010", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IZDAXMU972RA"}}, {"Date": "on January 13, 2009", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JNKGC3C6OVGQ"}}, {"Date": "on January 9, 2004", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on March 4, 2004", "Text": "this is one of the best books ever. being in Geometry and using the pythagorean theorem, deals A LOT with numbers being squared. with the neat little trick i learned in this book, i hardly ever use my calculator if the number is around 50 or any multiple of 50. it has saved a lot of my time and i am not kidding, Mr. Feynman is a genius. WOW!!! =)", "Helpfulness": 0.8, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on August 26, 2005", "Text": "The subtitle of this work is `Adventures of a Curious Character' - an apt description of Richard Feynman, physicist and Nobel Prize winner.  Although the narrative is not purely chronological, and certain areas of his life are glossed over (his marriages and family life), this is an entertaining and informative glimpse of how Feynman lived his life and more importantly, his thought process.  By his own admission, he thinks in a different way about math and physics, and his `hands-on' practical approach to science is not appreciated by everyone he encounters.  A good example of this is the section on Brazil: although his students there can regurgitate scientific information, they have no clue on its application, or HOW a theory works.  As a teacher myself, I see this every day - students who can memorize, but not analyze.  Other sections of the book deal with his participation on the Manhattan Project, which illustrates the frenzy the US government went through to develop the atomic bomb; Feynman's running theme here is how `fast' everyone worked, despite limited and unfinished laboratories and resources.  Other topics include his safecracking at Los Alamos; his artistic endeavors (the sequel to this book, `What Do YOU Care What Other People Think?' actually includes some of his artwork, which is outstanding); and his varied musical experiences.  To try to encapsulate all the areas covered in this book would be impossible; at times, it's almost a stream of consciousness monologue.  That, however, is what makes the book so entertaining and definitely worth reading.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33872WCAUCJ60"}}, {"Date": "on February 16, 2004", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BOUPGDLG7QPP"}}, {"Date": "on September 23, 2007", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3HPTHQ259YJDH"}}, {"Date": "on October 28, 2004", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NOZB6VZCTOI4"}}, {"Date": "on March 8, 2008", "Text": "Think of every stereotype you can of the scientist:  stodgy academic wearing a herringbone blazer with suede patch elbows, mad scientist with a penchant for the over-the-top experiment, intelligent misfit with pants cinched too high and a pocket protector.  Feynman is none of these. He is so very much more.  A misfit more apt to find humanity in a stripper than a theologian.  A man who never outgrew the natural curiosity of childhood, coupled with an entirely un-childlike willingness to follow through.  I can only imagine what working with him at Los Alamos might have been like.  The glimpses into his personal life here are few, but telling.  In these pages, we understand why Feynman is considered one of life's remarkable personalities.  He's the nerd we aspire to be...or at least wouldn't mind having dinner with.  But perhaps more important, what is revealed is the heart and the mind of a man whose life is testament to the richness of the human experience...and how easily we can get in its way.  I am forever glad that I met this man in these pages.  It was worth every moment.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHYCAEPJ3ROG4"}}, {"Date": "on April 25, 2010", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WFLPBJTIN85F"}}, {"Date": "on April 2, 2008", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16ZJF0NNTOEPR"}}, {"Date": "on December 12, 2002", "Text": null, "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22NP67VS11F71"}}, {"Date": "on February 20, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20JSLNO952J0H"}}, {"Date": "on January 2, 1998", "Text": "Feynman challenges the Challenger Commission Inquiry (pun intended) with an in-your-face, simple demonstration of thermal expansion/contraction for the O-Ring seals.  Wasn't he the only one of this select group not kowtowing and susceptible to employment retribution [NASA, Ride, et al.]?  Imagine if everyone actually said it as it is?  Feynman, in a bar, says he'll buy a woman drinks (after first  being asked to by her) only if she first agrees to bedding w/him afterwards.  Conditions point blank.  Cold.  No silly games.  Too intelligent and life's too short.  Feynman had great disdain for affectation: a pope's gown, military bars & stars, long titles.  I don't recall the book giving you all of this, but you do get a very refreshing insight into a real person - Dr. Richard P. of Rockaway.  And you know that question: Of all the people ...whom would you like to have a dinner with?  Sorry, D-Cups.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on September 16, 2003", "Text": null, "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1M2T0J45TTE64"}}, {"Date": "on January 26, 2005", "Text": null, "Helpfulness": 0.75, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AMW9M1RS1ELO5"}}, {"Date": "on November 24, 1998", "Text": "This book is extraordinarily funny, and not in a subtle or literary way.  Quite simply it will have you rolling on the floor as the Nobel-laureate tells of his stint playing the frigideira (a sort of inverted metal pot) in  a Brazilian school of Samba, of the time he was declared mentally unfit to  serve in the army because he insisted he could sometimes hear voices in his  head, or the time he serendipitoulsy pointed out a fatal flaw in the design  of an uranium enriching facility even though he couldn't tell whether the  symbols in the blueprints were valves or windows.  Whether the stories he  tells are all true or not, you have to admire Prof. Feynman's sheer  inventiveness and his unmatched talent as a narrator and a humorist.  A  word of caution, however:  a faithful movie adaptation of these memoirs  would not be rated PG.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on September 7, 2007", "Text": null, "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TFB33Z44839A"}}, {"Date": "on June 8, 2007", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DVPGMT4IU827"}}, {"Date": "on December 20, 2012", "Text": "Mr. Feynman integrated his humorous into his writing. This book contains fewer amounts of math equations, science proper noun compare to other scientist's autobiography. Thus, it is easy to understand for any age groups of people. A lot of people could not understand about reading a math or science book. If you are one of them, \" Surely You're Joking, Mr. Feynman\" should become your first reading. The author showed connection between theories and real life. You may discover many of math equations, science theorems that apply in life. After finish reading this book, you will see your life differently. Mr. Feynman has proven how wonderful life could be if you keep looking at one thing from new perspectives. This book is not only a boring autobiography of a scientist, but also is a combination of life and theories.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABU99LE15ON43"}}, {"Date": "on May 31, 2013", "Text": "This is one of the few books that I started to re-read immediately after I finished it for the first time. The book itself is written as a collection of stories as dictated by Feynman himself, which at first is slightly off-putting. His prose is somewhat terse and clunky. However, once I got past the style, I fell in love with the book. The stories provide a very personal and deep view into Feynman's insatiable curiosity and powerful intellect. My favorite aspect of the book is that his character is incredibly easy to relate to, despite his obvious genius. I finished the book with the sense that I knew Feynman very well, and that he was a down-to-earth guy who just happened to have an endless appetite for knowledge, a penchant for making rational decisions, and a liking for physics.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYLMAZ4NV6OM5"}}, {"Date": "on March 5, 2003", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": ""}}, {"Date": "on July 22, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZIV93Y7J7GJ"}}, {"Date": "on February 2, 2001", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1JVWCB77AULNT"}}, {"Date": "on November 20, 2000", "Text": "This is the best book I've ever read. It is not only very funny, but gives you a lot of wisdom and insights.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3S0DC862SLYG6"}}, {"Date": "on July 1, 1999", "Text": "Let's put it this way:  I have to repeatedly buy copies of this book because my friends won't return mine.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADNIGZKIOU9U7"}}, {"Date": "on March 16, 2014", "Text": "He was a funny character.  The problem student.  The particle accelerators.  I can appreciate his intolerance for illogical philosophies.  I like the short chapter arrangement of the book.  I found his chapter on safes and locked cabinets during the Manhattan Project really funny.  The lines of students simulating a calculator.  His chapter on the ant problem is interesting.  And also how he egged on the mathematicians on.  He had a very interesting life.  I did find him a bit sexist, but not any more so than other men of that era that I have encountered.  So I just skimmed over those parts.  I read this only once years ago, and still remember so much about this book.  It is quite memorable.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AKHG7SGRXX62"}}, {"Date": "on May 4, 2001", "Text": "Be prepared to meet Richard Feynman, learn about his drumming in a steel band, his cracking of safes, his portrait painting, and his very wise, and very humorous look at what goes into his life.  Feynman pretty much excels at everything from radio-repair to philosophy.  The book is an insight into his days as a child, at school, at MIT, at Los Alamos research center, at the nuclear research center during world war two, his non-existent social life and how he goes on to learn the tricks and become a social animal.  It's really amazing how one man can play so many roles in one life.  But one also admires that Feynman was absolutely committed to his subject with a no-nonsense attitude.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JSL6AJFPOW20"}}, {"Date": "on March 27, 2000", "Text": "This man is an inspiration to us all.  In an age of mediocrity, complacency, and super-specialization, Feynman shows that the combination of an open mind and willingness to reason through anything from first  principles ultimatedly will win the day.  Following his nose into all kinds  of interesting situations, Feynman proves that the right attitude is what  ultimately counts.  A stern dig at 'Science', with it's lingo, pompeous air  and attempted distancing from the general public.  Feynman is undeniably a  genius, but at the same time totally human.  I find myself partaking in  hero worshiping at the same as thinking we could get on well with each  other over a few beers!", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20INRLWG0HKGO"}}, {"Date": "on May 24, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1B8J2TXL5XK6P"}}, {"Date": "on November 7, 2001", "Text": "This is my favorite book.  Although it is considered to by a science book or possibly a biography, I consider it to be a combination of self-help and comedy.  The writing style is light, easy and extremely comical.  I could not put the book down. But to me, the book was mainly inspirational.  Here is a nobel prize winning physicist who tries nearly everything at least once.  He tried safe cracking, mind reading, learning languages, different technicals for meeting women, and living life fully through experimentation.  I now realize that there is another level that life can be lived.  I recommend this book to everyone I know.  It's entertaining, educational and good fun.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MFD9N7ZQBEEZ"}}, {"Date": "on July 21, 2010", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A13JR4DLRGE2TZ"}}, {"Date": "on May 9, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BD51TSHLLSV5"}}, {"Date": "on September 21, 2012", "Text": "Lively, funny, twisting, turning anecdotes with a little science hidden inside, SURELY YOU'RE JOKING, MR. FEYNMAN will keep you reading and looking forward to the next short chapter.  I read this book over the last two weekends and am surprised at how many quotes I remember, not to mention the new practical jokes available to me.  I can't wait to remove someone's door the next time they tell me to be sure to close it and leave behind a sign with those words, though I don't think I have a future in safe-cracking, an inside joke that only people who have read the book will understand.  Highly recommended... - lc", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZBXGLO83U73E"}}, {"Date": "on April 27, 2005", "Text": "\"Surely You're Joking, Mr. Feynman!\" Adventures of a Curious Character is an awesome book about a nobel prize winning physicist named Richard P. Feynman, who encounters many interesting, and at times, unusual obstacles and adventures throughout the span of his lifetime. Mr. Feynman's crazy antics throughout this book remind me of a more professional Michael Richards (Cosmo Kramer, Seinfeld) but still with humor. The book starts with his life as a child with some short stories, to his college days, up to his assistance to the atomic bomb. This book is an awesome book for people from teenagers on up, and will always draw your attention to the book, wondering what crazy thing Mr. Feynman will do next.", "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SLEWVRSB8E1O"}}, {"Date": "on July 26, 2002", "Text": "An outstanding anthology! This work will educate the reader about the genesis of the atomic bomb, physics, and the inimitable character that was Richard Feynman. Don't let the fact that he was a physicist scare you, Dr. Feynman presents articles that explain physics (in a common-sense, rather than intensely mathematical) way, as well as his observations on human behaviour, life, and a more human side to working on the nations most top-secret project during WWII.  Feynman was a genius, not only in his approach to physics but his approach to communicating, and observation in general. A real gem!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABCMQXEU1V1VA"}}, {"Date": "on June 1, 2013", "Text": "The late and great Richard Feynman meticulously and beautifully takes us on a journey of his wild, adventurous and intellectually gifted life in this collection of his adventures. This genius and Nobel Laureate was one of the great minds of the 20th century and demonstrates in this collection of his personal experiences why it is not necessarily WHAT you think but HOW you think that makes a great mind. If there is any reading that I would highly recommend to others, it would be this funny witted collection for precisely the aforementioned reason. A wonderful read and HIGHLY recommended.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16QBNFP84CI0Y"}}, {"Date": "on October 1, 2004", "Text": "I read excerpts from this book in college, and after hearing about it for what seemed to be the hundredth time in a recent seminar, I finally decided to read it in its entirety.  I was not disappointed.  Richard Feynman reveals his inner most thoughts in the form of a series of anecdotes that will make you laugh out loud.  Feynman is a true genius, but he does not come across as aloof I was worried he would.  Instead, he remains grounded, and simply tells you (the reader) what happened to him in the past.  I highly recommend everyone read this book whether you are an aspiring scientist or simply curious how a Nobel Prize winner leads thinks about his own dreams.", "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IOR293XHFBQ6"}}, {"Date": "on April 10, 2014", "Text": "I bought the book after seeing a made for t.v. movie on the CHALLENGER accident that followed Feynman's work on the accident investigation board (a fascinating story).  I wanted to know more about this man.  A very interesting guy who led a very interesting life. The book is more about his personal exploits and not so much his professional, though that is covered as well.  I only wished the book had covered his time on the accident board in his own words, but there is probably enough history out there to get into that.  If you like biography's you should enjoy this.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LML105JY3OIB"}}, {"Date": "on February 4, 2015", "Text": "Got this for my son for a belated Christmas present.  We both love Richard Feynman.  He hadn't reread it since high school (he's now 43), and he says Richard is as witty a raconteur, as clever a skirt-chaser and as eager a bongo drummer, as he'd remembered!  If you like Feynman, or physics, or want to understand the absolute THRILL of the scientific method, the adjustments of going to a school in another country with a different language, experience Rio's Carnival from the inside, and engage in many more aspects of RF's amazing earlier years, DON'T MISS THIS!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31Z708U15LT3J"}}, {"Date": "on October 21, 2014", "Text": "I loved parts of this book.  I wish it had more detail about Los Alamos.  Most of that story was focused on his safe cracking abilities which was slightly interesting but nowhere near as interesting as what was really happening around him.  I felt like he only wanted to point the spotlight at himself.  A lot of the stories seemed like the point was just to show how clever he thought he was and not really profound or thought inducing stories.  I am not usually bother by this but I felt like some of the book was dated and sexist towards women", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19LIFDLCGMDJ"}}, {"Date": "on October 20, 2000", "Text": "Okay, the man had/has a cult of personality, and he was flawed.  Aren't we all?  Fact is he was one of the greatest minds of the century and he had a unique and sometimes uncompromising view of the world.  I picked this book up by chance, and now I'm reading about chaos theory, subatomic particles, quarks.  The man had a way of convincing people that these things were not and should not be beyond them.  The stories in this book point out his humor, his desire to teach and learn and his showmanship.  A curious character indeed.  Read it!", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": ""}}, {"Date": "on March 6, 2001", "Text": "This book, in its chatty style, shows us the life story of Richard Feynman as told by himself to a bongoeing friend. It shows how one man's intelligence can be totally exceptional. By standard IQ tests Feynman never got very high (see the book), because his genius works along different lines and IQ is a lousy standard to begin with. It shows how Nobel-prize winning science work can be fun, can be a discovery and can take you to Japan etc. Very entertaining, especially the part where Feynman personally hacks the safes in Los Alamos!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3S4DFRV6C6SEJ"}}, {"Date": "on May 11, 2011", "Text": "Feynman, the physicist and Nobel prize winner, has been widely acknowledged to be a scientific genius.  In this book he shares numerous entertaining anecdotes about growing up, going to school, meeting girls, making discoveries and becoming a famous scientist.  Some of the stories are a bit shocking or disturbing, such as ones about trying to meet receptive girls in bars.  But these, perhaps, date the man to his time.  Most stories are truly entertaininfg and humorous, and will long be remembered.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANE84RXJIE581"}}, {"Date": "on August 19, 2000", "Text": null, "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2EDOLS6C0P37V"}}, {"Date": "on June 9, 2000", "Text": "Before reading this book, I didn't even know who Richard Feynman was.  It was given to me by my stepfather and immediately sat in a drawer for about 3 years.  After searching for something to do I brought it out and began  reading.  I was immediately floored with laughter.  Feynman is such an  interesting person.  It makes you wonder how so many things could happen to  one person.  I've now read it about 4 times and I still laugh every time.  Definitly buy this book! I WANT MY DOLLAR!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWCL4ZUMUC0YW"}}, {"Date": "on May 6, 2008", "Text": "For a physicist Mr. Feynman was a fantastically curious individual.  Although, compulsive and a bit \"different\" his passion for life and curiosity with the world around him were remarkable.  His wit and wisdom along with stories of his antics and general mischief acted as a magnet pulling me to the next page.  This book was hard to put down and reminded me to remain curious throughout life.  Well worth the time it takes to read, I will be reading other books by Mr. Feynman.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEBBJAIVIYQBU"}}, {"Date": "on November 13, 2007", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2V9HYACB5GNX8"}}, {"Date": "on November 9, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIQS65AISQ9TG"}}, {"Date": "on August 14, 2007", "Text": "I guess for a grad student this book is inspirational. It gives guidelines on how research should be done, how to not just \"believe\" blindly others work, but to try and understand it and prove it yourself. It also points out what is wrong with the way we are taught to think, learn in school, by our teachers. It shows how superficial people are in thinking, and how they prefer just to take things as they are and not think them through!!!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AU37ZMOKS5L3V"}}, {"Date": "on May 8, 2002", "Text": null, "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on July 15, 2001", "Text": null, "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A269OJ1Z2GUIAJ"}}, {"Date": "on December 4, 2013", "Text": "This book is a lot of fun. For those of us who aren't math experts or physics geeks, this is a great way to see inside Feynman's head. Heard a lot about this author on \"The Big Bang Theory,\" and wanted to get an idea of what they're talking about. Definitely gives the feeling that Feynman may indeed be a serious physics geek and higher math whiz, but he is still also a regular human being, who does regular human stuff.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29URJLB78M6C7"}}, {"Date": "on July 23, 2002", "Text": "This book is entertaining, no question about that. The anecdotes are very amusing, although Feynman sometimes comes across as a bit of a [jerk]. I think if Haulden Caulfield grew up to be a genius physicist he would be Richard Feynman. I am surprised though so many people seem to put him on a pedestal. I just hope that in the long run Feynman will not be remembered mostly for his smart-alecky pranks rather than for his outstanding contributions to theoretical physics.", "Helpfulness": 0.75, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3R9NJSPEHXF7A"}}, {"Date": "on July 10, 2000", "Text": null, "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on June 25, 2002", "Text": "I read this book fairly quickly.  Go to britannica.com and look up Feynman.  Then read this book!  There is a sharp contrast between the both of them.  This book gives you a picture of a mischievous man, and with good reason.  He is playing pranks on military personnel at Los Alamos and then playing in a band in Brazil. It is just a collection of stories that I am sure he would have told you if you two had a beer together.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQSQWAQ4PQ9BT"}}, {"Date": "on September 16, 2005", "Text": "Hilarious and trgaic. Feynman was a unique amalgam of geniuses: a genius of a physicist, a genius at amusing himself without regard to the restraints usually put on us, a genius at living and a genius at conveying the essence of joie de vivre. I could not read this book without feeling that I was a party to each of his joyous and each of his tragic episodes. In the end I took his death personally. What a man. What a read!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AH42HSXLOYXIV"}}, {"Date": "on July 20, 1996", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on November 12, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A14LSFT3PFBIOZ"}}, {"Date": "on February 15, 2014", "Text": "The BEST book about Richard Feynman's quirky personality. I read this book years ago and was waiting for a hardcover version, and finally, here it is. I am a scientist, and consider Mr. Richard Feynman an equal to Albert Einstein, and in some areas of physics I think he has surpassed E=MC2. I have defended this position successfully on several occasions using only Feynman diagrams.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A379NS5J5M5A0Z"}}, {"Date": "on June 1, 2001", "Text": "This book was amazing, it tells many interesting anecdotes of this very interesting man. From Los Alamos to Las Vegas and many other interesting places, Feynman writes a wonderful book about the way he lived life. It's amazing to see how he wove details of how he would solve difficult problems with details of meeting women in bars. I'm going to read a many of his books as I can.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PUGVIKJJ4WAB"}}, {"Date": "on May 15, 2005", "Text": "This book is definitly a fun read.  As one progresses through the book there is this feeling that you are sitting with an older Mr. Feynman who is just telling you about adventures of his life a story at a time.  Very enjoyable, but just be warned that this is not a biography in a sense that his life is talked about from birth to death, it is simply a collection of terrific anecdotes, but its worth the read.", "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GF2864MIW7HU"}}, {"Date": "on April 14, 2005", "Text": "this a terrific book about Feynman's life, and not an overview of the ideas he had that got him a Nobel prize.  he is a person who cannot be boxed up or pigeonholed, and his many zany adventures make for good reading.  Even someone who didn't go to MIT or learn advanced mathematics can relate to Feynman's unique approach to life, and his wonderful ideas.  Highly recommended reading for every type of person.", "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7JRDNX3WOMTR"}}, {"Date": "on October 10, 2005", "Text": "\"Surely You're Joking, Mr. Feynman\" is such an amazing book, everyone who loves science and puzzles will fall in love with it. Richard Feynman, though he is not such an amazing author, has the most amazing stories to tell. I must say that I was enlightened, in a scientific way. He has made want to become a physicist, and I'm only 13! This is a must read for everyone, I'm positive that you'll love it!", "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28ETIEDQOU2IL"}}, {"Date": "on April 27, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABMNRGEOKY897"}}, {"Date": "on July 19, 2009", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19HTZ18MBO9G3"}}, {"Date": "on March 17, 2014", "Text": "It was a thrill to see the world through Feynman's point of view. Even if you are like me and are unknowledgeable about the technical aspects of Feynman's work (which he avoids mentioning almost completely in this book), his curiosity is infectious and inspiring. His humor is also always present and made me laugh out loud more than a few times.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7W8DTVFD3C0P"}}, {"Date": "on March 16, 2014", "Text": "Hilarious, candid and effused with the human spirit, Richard Feynman takes us through a journey of his love. The fascination with science, the goof up's, the wonder of falling in love, the heart breaks, the incredible luck.....it forces us to re prioritize our lives. It does give you a feeling that he never loved any women as his first wife.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GKQZ4RQ1OV8M"}}, {"Date": "on February 20, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3C8NWLGZ3VDDU"}}, {"Date": "on February 14, 2014", "Text": "Love this book.  Feynman doesn't take himself too seriously, and takes us through the 40's and 50's when nuclear science and winning the war were critical to our history.  You don't have to be a scientist at all to enjoy this look at Los Alamos, the key players and what they were involved in...pranks and science and tweeking one another's brains...in an effort to solve some of the scientific puzzles of the times.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A383W2CY1NNUK"}}, {"Date": "on February 13, 2014", "Text": "For me as for a student of mathematics faculty this book was very interesting to read. I saw points of view similar to mine in many chapters and I think many people who are interested in real science could find themselves on the pages of this great book. I would recommend this book to everybody: it is full of humor, useful tricks and, also, it forces the reader to think while reading.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17ZYGXX54Y9JM"}}, {"Date": "on January 21, 2014", "Text": "Dick Feynman lived an incredibly varied, interesting and eclectic life. The characters that he ran into ranged from brilliant and influential to the everyman but it sounds like he regarded them all with the same interest and curiosity. Some of these stories are available on video and you can hear the exact same cadence and manner of speaking in the writing. Nobel prize winning brilliant physicist aside Feynman is maybe one of the most interesting raconteurs of our generation. Even if you're not a fan of science or physics this is a fun read.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PHN6YMY0VGR2"}}, {"Date": "on May 19, 2013", "Text": "I really enjoyed this book mostly due to he charismatic and quirky storytelling of Dr. Feynman. A very charming story, indeed. However, as an aspiring scientist, I appreciate his outlook on maintaining a certain quality of scientific inquiry and enthusiasm for such learning and exploring. His lifelong pleasure in solving and discovering is quite inspiring! Other students of science or those who appreciate the many wonders of life are sure to be enthrall end by this book.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YNGWSZXT5MWX"}}, {"Date": "on April 28, 2013", "Text": "You can't help but laugh out loud quite a few times when reading this book. It's very entertaining, I would definitely suggest it to just about anyone. However, there are a few times in the book where he goes into talking about Physics, which may be confusing if you don't know much about Physics, but I would suggest reading this book. Even if your not scientifically inclined, I'm sure you will enjoy reading it.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APP9LKP8XUH1O"}}, {"Date": "on April 15, 2013", "Text": "I have a bachelor's degree in physics and have always had a science mind, so a book by and about a great phsyicist with relatively little name recognition (dont believe me? Poll any of your friends who have a fine arts or polisci degree...not dissing them, just dofferent realms of knowledge). Anyways, the book is a wonderful insight into this great genius and despite my caveats above it would/should be an enjoyable read. If nothing else it will give a wonderful glimpse into a brilliant and quirky (even quarky...*rimshot*) mind.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26BTL23ROIECZ"}}, {"Date": "on April 3, 2013", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ADAA99SQW9M93"}}, {"Date": "on February 14, 2013", "Text": "I've known generally about this book for years, but I didn't read it until recently! I thought it would be full of physics information conveyed in the the marvelously lucid manner that made Mr. Feynman so famous. I was a bit surprised to learn it was a bunch of semi-random stories from throughout his amazing life! These stories are a great insight into his intellect and more notably, into his hilarious sense of humor! We elevate such legends to celebrity status, and for good reason, but they are normal people just like us! This book show us the human side of a giant of the twentieth century! It was a joy to read! I couldn't put it down!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATMXV0AQW5EN"}}, {"Date": "on January 24, 2013", "Text": "Not only was this book not structured in an meaningful way - it was just an extended series of anecdotes - it also portrayed a not pompous and at sometimes flat-out rude man.", "Helpfulness": 1.0, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A394F6JSNMPKZW"}}, {"Date": "on December 30, 2012", "Text": "Feynman was a brilliant physicist, but he's also a brilliant observer of the human mind. His puzzlement over the inability of others to see the world as a scientist does helps to explain science in a way that the actual explanation of scientific results might not do.  Entertaining and insightful.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A166KWUBADDTVX"}}, {"Date": "on December 6, 2012", "Text": "Mr. Feynman's exploits and anecdotes are pretty mystifying to an average joe like myself. It is clear that Mr. Feynman possessed an incredibly unique set of neural networking that made him at once \"accessible\" and \"ingenious.\" You almost get this \"high functioning autism/Asperger's\" quality to his quirks. At the same time, those quirks may have been less of a developmental origin and just the result of a mind wired completely different than the average dude. I also liked the historical perspective and how Mr. Feynman just sorta, bounced around all these groundbreaking American projects.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3R40LKK4ALUIC"}}, {"Date": "on December 3, 2012", "Text": "a little disjointed but very entertaining... Points well made about education in science and math.  I have experienced them in this country and was aghast to see how impractical and not related to the real world the teaching was compared to the education in those subjects I received in Europe", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1C5E1F91YR34W"}}, {"Date": "on October 29, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1E0US19GOZ0O3"}}, {"Date": "on September 7, 2012", "Text": "The book surprised me as I was not expecting it to be fun. No wonder it became a best-seller. This is a quick glimpse at some of Feynman's psychological sub-atomic \"particles\". He is brilliant, vane, profound, trivial, conceited, magnanimous, practical and idealistic. I made so much resonance with Feynman that I searched for some of his videos and then went on to read a bio on Gell-Mann to contrast the characters. Who says a genius or a Nobel laureate has to be pedantic, neurotic and isolated, this guy is fun!  And  yet, his views  are most profound. Truly a character where reduction is out of the question.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1P29IO67V0O9F"}}, {"Date": "on March 30, 2012", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1I3U97KUPQB7M"}}, {"Date": "on May 11, 2002", "Text": "This was a great read for me; I recommend it to anyone who wants to read about an interesting character who led an exciting and varied life, and especially those readers with an interest in math/science. My only complaint: I wanted more when it was done, well Mr. Feynman did write another collection of anecdotes so here I come!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on June 22, 2000", "Text": "Richard Feynman's book is full of energy and funny anecdotes.  His love for physics and understanding/tinkering with the simplest of things (like padlocks and ants, and even the behavior of people around him) is very  entertaining.  It's inspiring to read about someone who loves his work and  applies it to everyday things.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3CIBW086G71K6"}}, {"Date": "on August 2, 1999", "Text": "To peoples seeking the full spirit and atmosphere of Feynman's stories, I recommend instead or in addition the audio CDs that Ralph Leighton has--thanks Ralph--made availables. Those are the originals and really  delightful sources, straight from the horse's mouth, even though not all  stories are yet availables.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VU1J666BU5JV"}}, {"Date": "on August 8, 2006", "Text": "This book is by far the best non-technical science book. Period. You don't have to be a scientist to love the spirit of Richard Feynman. From discovering the behaviors of ants with sugar to his stints as an artist and musician, Feynman reminds us all that the world is still our playground, waiting to be discovered.", "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1W7XNE816B4KE"}}, {"Date": "on November 16, 1998", "Text": "This book should be required reading. No fiction author could create a more interesting, amazing character or a more hilarious story. It's an inspirational example of the advantages of thinking for yourself and living  your life to its fullest. I could (and will) read this again and again.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BSWJ5IGVMDR8"}}, {"Date": "on April 14, 1999", "Text": "This has got to be my all time favorite book that even resembles a biography.  It's nothing but fun the whole way through!  Look, if 30+ people can read a book and they all give it 5 stars, it's got to have  something going for it!  Welcome to the half-nutz world of a physicist...", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on September 15, 2005", "Text": "Richard Feynmann gives his readers a personal view of growing up and discovering life's mysteries. His ability to tackle a complex subject rationally and with good humor makes him readable, informative and entertaining. It should be required reading for youngsters of all ages.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KMNFXRM4E6CJ"}}, {"Date": "on February 22, 2014", "Text": "First read this in a book club in the 80's.  Chose it again for another book club now.  You will laugh out loud at his antics.  Truly an exceptional character.  Chose this used copy based on the rating and was dissappointed in condition.  First time that has happened for me.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3R1S9AAX8KNBM"}}, {"Date": "on April 7, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVBY8EL52IB6N"}}, {"Date": "on April 21, 2011", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2C2ENYB2OUQEU"}}, {"Date": "on May 15, 2012", "Text": "If you're interested in science and/or have an unusual curiosity to discover the \"how\" or \"why\" of science, Feynman's adventures/misadventures will have you smiling and laughing while also wondering.  A highly suggested read for all my fellow nerds out there.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1TRVKLNT46S8M"}}, {"Date": "on December 21, 2002", "Text": "Feynman was truly a renaissance man. The giant intellect this man possessed didn't stifle his curiosity in the least. This man exudes inspiration.  His curiosity and competence blended into one of the greatest minds I've ever had the chance to read about.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32R297XGMAHE"}}, {"Date": "on March 31, 2015", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOGE8PM6KED3O"}}, {"Date": "on March 15, 2015", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZ7QNRPFJ2IW1"}}, {"Date": "on January 7, 2015", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LQINIL15MKO4"}}, {"Date": "on March 10, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2AY8YFQYV0HQH"}}, {"Date": "on February 20, 2010", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A7H8H20MKQNRU"}}, {"Date": "on April 30, 2008", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GVOQC69P92UV"}}, {"Date": "on June 30, 2005", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2A872FUPBWG46"}}, {"Date": "on February 11, 2014", "Text": "A series of interesting and entertaining lectures, anecdotes, letters and drawings by the noted physicist Richard Feynman. Well written, well compiled, quite funny. Suitable to pretty much anyone, it doesn't require any knowledge of physics at all.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZN6JTC2C1APB"}}, {"Date": "on October 22, 2010", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LI2WLIWBK1V5"}}, {"Date": "on November 8, 2004", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UW2PULIU1HS0"}}, {"Date": "on June 25, 2011", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AW971OKQH7KOA"}}, {"Date": "on November 17, 2009", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XWXSLQNADEF7"}}, {"Date": "on February 24, 2009", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A43ITSLQBON2J"}}, {"Date": "on February 26, 2014", "Text": "This is what Dick Feynnman called his book.  This man was a real genius with a true sense of humor. The stories he tells regarding his first wife (who died far-far too young) is worth the price of the book alone.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EIWJBD31VCZQ"}}, {"Date": "on February 7, 2009", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10IAGH4KOD6NL"}}, {"Date": "on December 1, 2009", "Text": "What an entertaining romp through the life on an idiosyncratic and brilliant Nobel award winner.  Some of the adventures he gets himself in to couldn't be scripted more hilariously if they solely existed in the imagination of a creative character.  Fortunately for us Mr Feynman was determined to live his real life as if it was a brilliant fiction, to dabble in nude painting, to join an award-winning samba band, to pursue amateur experiments on ants and to successfully pick every single lock holding secrets to the Manhattan project FOR A LAUGH!!!  Lucky for us, we get to live vicariously through this brilliant and thrillseeking man.  In one section he reveals part of his technique for getting in to adventures explicitly.  On his annual summer vacation to drive as far as he can towards the Pacific (never making it there) he lands himself in Vegas.  He describes his penchant for being patient spending days in a nightclub in order to rub shoulders with bigwigs like Nick the Greek and get involved in some true adventures.  Mr Feynman is a man who has little time for the social niceties and hypocritical behavior present in our society and he holds an uncompromising scientific outlook.  Not content to let things he disagrees with slide, he is quick to point out the errors in peoples thinking whether it be an artist friend or a very well respected physicist like Niels Bohr.  I absolutely, thoroughly enjoyed this book and I would highly recommend it.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARFWFV1ANS9D7"}}, {"Date": "on December 20, 2014", "Text": "I saw the play QED (about Feynman) with friends and several days later read that Wall Street Journal columnist Jason Zweig included \"Surely You're Joking, Mr. Feynman!\" on his investor must-read list, which is curious because the book has nothing to do with business (and little to do with physics).  Zweig must have, like myself,  thought the book was so funny that in order to justify his  recommendation to the Wall Street Journal readership, he made a tenuous connection:  \"three qualities an investor needs above all others are independence, skepticism and emotional self-control.\"  Well, I saw no business connection whatsoever in the book but am extremely grateful for the recommendation.  It's the funniest book I have ever read. I disturbed people in the other room with my guffawing the entire three days I was reading it.  I couldn't help myself.  Really funny and really intelligent. It would be difficult to give examples because the stories individually are pages long and together heighten each other's effect. Think of it this way: here's a  physicist who won the Nobel prize,  who in his 20s was invited to work at Los Alamos on the Bomb, discovered whatever he discovered in physics etc. etc. and he's caring, quirky and hyper-inquisitive.  And what he is interested to write about here is not how important he is (he seems unaffected about that) but rather the strange ways of people.  Hilarious. I highly recommend it.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2APPSQFST1TS3"}}, {"Date": "on September 30, 2008", "Text": "Feynman is a true American genius with a wit and charm that sets him apart from the rest of us pedestrians. A hilarious adventure into the mind of a \"Curious Character\"... thank God he walked among us.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3S9NB8XPK1T74"}}, {"Date": "on May 21, 2013", "Text": "A great collection of short stories about a very interesting man.  Feynman is one of the most recent true Renaissance men.  Capable of advancing the fields of Physics, Art and Bongo at the same time.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQZAMFHMW13KA"}}, {"Date": "on April 7, 1999", "Text": "I was a sad and depressed Electrical Engineer, so depressed that I needed a mental therapist.  After reading this book, I no longer need her and I can laugh my way through life.  Any questions?", "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on January 14, 2007", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AI5OR1HSYXCCL"}}, {"Date": "on August 19, 2005", "Text": "This book made me laugh out loud, as well as stop and think about some of the problems he mentions. Definitely a must-read for anyone who has more than a passing interest in math and physics!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32RZZMSWXC2IK"}}, {"Date": "on March 12, 2012", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEWDJKCM8ZK10"}}, {"Date": "on October 13, 2012", "Text": "The book is easy to read and very interesting. It is a life story of Mr Feynman, true scientist and very intelligent person. He had broad sphere of interests and amazing sense of humor.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1HCI169BS2QXC"}}, {"Date": "on September 20, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARYKCL05IA4UC"}}, {"Date": "on April 9, 2003", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APQXOOQ1J8TR2"}}, {"Date": "on June 29, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33Q56OTNGNDO"}}, {"Date": "on May 15, 2013", "Text": "Feinman was deeply involved in the science of space and nuclear physics, and there has never in my experience been such a wonderful self-criticizing and hilarious autobiographer!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SVGWSRY27RT4"}}, {"Date": "on November 2, 2002", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFBX4EUPVEZFG"}}, {"Date": "on June 19, 2014", "Text": "Best advertisement for a college education ever.  And ethical and moral too.  If there is someone else in science and tech who writes this well (Read: easy to read) let me know.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CJN6S30KGPFW"}}, {"Date": "on February 19, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AD8LWKVHUJRED"}}, {"Date": "on May 3, 2015", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38STL750JQ45W"}}, {"Date": "on February 21, 2014", "Text": "This was the first of maybe 8 auto-biographical and biographical books about Feynman that I've read.  I've bought at least half a dozen copies of this book for friends.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1KYDJNS8J69LV"}}, {"Date": "on November 16, 2014", "Text": "A curious character, indeed.  A wonderful memoir of a man who made major contributions while sticking to his own ideas and principles and enjoying life to the fullest.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1E3W1B9PBOHBM"}}, {"Date": "on May 2, 2013", "Text": "Funny, funny ass book. Cool stories about a guy that's led an interesting life. I love these kinds of books. When I retire I want to be able to write a book like this", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19RO1A3ZIDR4L"}}, {"Date": "on February 15, 2014", "Text": "Because it provides insight into the character of an amazing individual, a self-described \"curious character\".  Amusing, often surprising, true incidents.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AFS1VZMY5CTC"}}, {"Date": "on October 10, 2008", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVCVGWQHT5P7S"}}, {"Date": "on July 7, 2012", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HBSC6HF1NOXF"}}, {"Date": "on September 18, 2007", "Text": "Feinerman was an amazing man in so many ways. His life is a real lesson in doing all that you can, and enjoying every minute of your life. Loved this book.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TH59CZ5RNNGU"}}, {"Date": "on June 15, 2011", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OOI32N0GMMKL"}}, {"Date": "on March 14, 2014", "Text": "Biographies usually aren't my first choice of reading material, but I really enjoyed this one.  There were times when I found it hard to put it down.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASA8TY0MONU48"}}, {"Date": "on May 19, 2014", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3Q2ILMGU9HVQ8"}}, {"Date": "on April 17, 1999", "Text": "Mr. Feynman's passion for life in general, and for science in particular, is truly inspirational. It is always difficult for a scientist to explain and express her/his passion for physics or mathematics to someone who has no scientific background. It is rather like a music lover trying to explain the genius of Mozart to the deaf. But that's exactly what Feynman does in this book, by intertwining the scientific and the not-so-scientific aspects of his life. Anyone, scientist or not, is sure to enjoy the humour and adventure in this collection of stories.  But underlying these honest and often hysterical anecdotes are some fundamental truths about science and education, which apply to many aspects of our lives.  Time and again, Feynman has you nodding your head and doubling over with laughter as he insists on pointing out the obvious, refuses to play along with absurd social norms, and just keeps on doing it his own way.  (If you enjoyed this book, you are sure to enjoy Feynman's \"What Do YOU Care What Other People Think?\"", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on March 23, 2004", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAO8I603A38ZE"}}, {"Date": "on January 23, 2015", "Text": "This book literally changed my life.  My father gave me his copy to read when I was in eighth grade and I was immediately fascinated with not just physics, but the fun that could be had by looking at the world in a curious way.  Every story captured my attention and they were all told in a way that makes one idolize Feynman, not see him as annoying or self-important, the way some intellectuals come across.  While some of the content is not exactly appropriate for a 12 year old, there's much worse stuff on TV.  I highly recommend that anybody with intellectually curious young relatives give this book to them as a present.  Creating a love of learning, especially around Science, Technology, Engineering and Math is extremely important in the modern world.  It personally led me on a hunt for knowledge through the land of physics, followed by computer science, followed by finance, followed by biotechnology.  The book of course is also great for an adult for all the same reasons, but I can't vouch for it changing your life.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAVOM88OWWUWV"}}, {"Date": "on July 2, 2011", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3D1M2S8RVBZPK"}}, {"Date": "on January 15, 2001", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GKIQT92QXRHY"}}, {"Date": "on September 25, 2004", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ZDPQA6FLY8XM"}}, {"Date": "on December 1, 2005", "Text": "\"Surely You're Joking, Mr. Feynman\" was a very funny, informative, and it seemed like you where actually there with him when he talked about his personal experiences.  I learned quite about physics I would have never thought have related to, and that the military needed physicists to actually operate at a high achieving level.  The first chapter was even worth reading about how he made a living from just fixing radios when he was around 10.  Mr. Feynman was a very honest man, even if the truth hurt.  With that, probably thanks to him many things are better for what he did such as the locks and tumblers or the research he had done with the Challenger disaster.  I think this book everyone should read, it is a very inspiring book to learn more about the earth.  It is an all around book, it has its funny moments its serious moments and above all Mr. Feynman when he talked it seemed like he was teaching you.", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QW4W34QZCM3Q"}}, {"Date": "on March 5, 2014", "Text": "A fun short read, if that's what you're looking for. This was a gift for a family member. it arrived quickly and in great condition.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OZRWGNQTV86V"}}, {"Date": "on June 12, 2006", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A31USK4NDPGO95"}}, {"Date": "on February 19, 2001", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3ABXJB8QYZK0"}}, {"Date": "on April 2, 2013", "Text": "If there is only one Richard Feynman book you will read, make it this one. I wish I had followed his work more when he was alive.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26QSJ1HE5XCJF"}}, {"Date": "on November 10, 2011", "Text": "I was in college when I found out this book existed. That was the same time I found out Feynman existed. Not being much for the physical sciences, I still have only a basic understanding of what Feynman accomplished in the world of physics. I only knew of it because it sat on my roommate's bookshelf and he insisted it was a good read, even for a person not as interested in physics as my roommate was. So I gave it a shot. This book really revolutionized my own thinking. Here was a man who, as the almost-as-mandatory follow-up book's title suggests, doesn't care what other people think. He saw the value of life, knew what he wanted to get out of his, and did so, all while having lots of fun and simultaneously becoming (apparently) one of the most heralded physicists of our time. This is a unique book because it is an autobiographical volume about a fascinating man who happened to be a physicist. Read it.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2L4YSP2XPTLAO"}}, {"Date": "on September 2, 2012", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19AWBHVX178FX"}}, {"Date": "on June 11, 2012", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AVZN0IL6ZC28J"}}, {"Date": "on November 30, 2004", "Text": "I thoroughly enjoyed reading the book \"Surely you're joking Mr. Feynman\". This book is very interesting and it was very hard to put down. The many anecdotes kept me laughing and wanting more. Even though the events occurred before present day, many of the stories can still capture in intrigue of the youth of America today. This book is one of my new favorites even though the only reason I read it was for a physics project. I am happy to know that there are other books by Mr. Feynman such as \"What do YOU care what other people think?\". I have actually already purchased this book and cant wait to begin reading it. I enjoyed this book because not only is it science, but it is also fun science! I have never been a great admirer of the science world, but Mr. Feynman's book helped me change my entire outlook.", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AETN31NOE3WS2"}}, {"Date": "on August 30, 2003", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DWUM6SN3N3NR"}}, {"Date": "on February 18, 2014", "Text": "My grandson loves this book. He was familiar with Feynman through physic lessons and was delighted to receive it from me.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HB2T8SXAVLMS"}}, {"Date": "on August 31, 1999", "Text": "After reading this book I wished that I would have half of Feynman's joy of learning and living. He was one in a zillion!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on April 24, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BFG01MKKUT78"}}, {"Date": "on February 7, 2013", "Text": "A fascinating foray into the fun yet formidable physics of Mr. Feynman.  Actually, this book is less about physics and more about the life of Nobel Prize Laureate, Richard Feynman.  (Richard just rolled over in his grave; if you want to know why -- read this book!)  Once I adjusted  my expectations from education to entertainment, I absorbed every word.  He was always interesting, at times very entertaining and despite his obvious genius he had an utter lack of pretentiousness and conceit that I previously assumed afflicted all venerated scientists.  I left this book wishing for more, and feeling inspired to pursue my own adventures in curiosity.  What could I achieve if, like Richard, I abandoned my Western culture imperative of accomplishment through suffering and played with my talents in ways I felt was fun?", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OTO8KBBIA7KR"}}, {"Date": "on March 9, 2014", "Text": "Very funny.  Tough to put the book down as it's great to be able to peer into the life and humanity of a genious.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1WOKPFSYKKDTO"}}, {"Date": "on September 24, 2006", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4S0OTF6CYGYN"}}, {"Date": "on November 18, 2003", "Text": "I've read this book probably six or seven times over the last 18 years, and each time the experience is different and wonderful.  I loved it at 11 when I didn't understand one bit of the math and science, and have only appreciated it more as I learned more and finally got a physics Ph.D. of my own.  Feynman had such a rich life that there's something in his adventures for everyone, whether you're a scientist, historian, musician, artist, or linguist.  Yes, there are certain things about the man that are less than perfectly likeable, notably his arrogance and his attitude toward women, but if you can separate the book from the person, I don't see how anyone can classify this as anything other than a 5-star experience.", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NKB4YXLWWLU"}}, {"Date": "on December 8, 2013", "Text": "Funny.  Who knew Physists could be so funny and lead a productive life changing the world one atom at a time.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30ZEPHGBI1KSA"}}, {"Date": "on December 20, 2006", "Text": "Dr. Feynman demonstrates the humor and roaring fun that made him such a favorite teacher among his students.  His sense of humor is contagious and you find yourself realizing that even physics can be fun.  His burning curiousity is also contagious and you may find yourself taking time to stare at ants for hours and enjoying every minute of it.  Get the book, it is one of the funnest books I ever read.  And it might just give you the passion for learning and impish inquisitive mind to understand the joy of spending your life in pursuit of learning.  There is not praise high enough for this joyous and rousing testament to a life well lived.", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AF3X7J0XC391L"}}, {"Date": "on April 12, 2002", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1N16EU00XJWRD"}}, {"Date": "on September 7, 2010", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2X3S7V4SC4T0W"}}, {"Date": "on June 22, 2008", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIKVLU1HAV0ZQ"}}, {"Date": "on May 28, 2012", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33WM3FAC1RTQ3"}}, {"Date": "on June 24, 1998", "Text": "Don't be misled into thinking the \"Curious\" in the sub-title of this book means \"strange.\" The word is meant to be taken literally, for indeed Feynman was curious about everything in the world around him. Surely one of the most gifted physicists of our time, Feynman won the Nobel proze for Physics in 1965. Feynman talks about boyhood adventures fixing radios, and then goes on to speak about his work on the Manhattan project, his meetings with Bohr, Einstein and Oppenheimer, and various other adventures in his personal and professional life. This book will have you laughing out loud even if you do not understand anything about quantum mechanics. Especially interesting is the chapter titled \"Safecracker meets Safecracker.\"", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on July 15, 1999", "Text": "A series of amusing stories for both the scientist and the layman.  The safecracking story is priceless.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on September 10, 2011", "Text": "It has been a long time since I first read this book, and had an opportunity to re-read it while on vacation in Maine a few weeks ago. Feynman was a blue collar character who became a great physicist and a wonderful raconteur and devilish prankster! He never forgot his humble beginnings and was as at home with waiters as he was with Noble Lauretes. This isn't a book about science, it is a book about Feyman's puckish sense of humor, which could be a tad harsh at times, but this reflected his humble roots...this wasn't an intellectual ironic Lampoonish sense of humor, but a \"Gotcha\" trap sprung on the unsuspecting. Wondeful anecdotes here which I won't spoil, but if you hav'nt read this yet, tuck it in your bookbag and open at any page. Great fun!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MX96YM4NT6HT"}}, {"Date": "on June 20, 2014", "Text": "Everyone knows of Richard Feynman's intellectual prowess and his teaching ability.  This book is about neither of those, nor is it an exposition of his technical accomplishments.  It definitely reveals the human side of Feynman, from the perverse to the comical.  His intense curiosity leads him to explore to the point of mastery pursuits, far from the realm of physics, that would be daunting to any of us normal mortals.  It is not a heavy read, I finished it in a few days, but that was also because I found it hard to put down.  You may want to pass it along to a friend rather than keep it as a permanent part of your library but you certainly want to read it if you have any interest at all in Dick Feynman and his life.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BXYWZR4TL6CB"}}, {"Date": "on July 26, 1997", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on November 2, 1999", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on April 5, 2004", "Text": "Richard Feynman's novel, \"Surely You're Joking, Mr. Feynman!\" was a true joy. Yes, I had to read it for a Physics assignment, and yes, I chose it because it was one of the few interesting-looking ones, but I had a good time reading it in spite of it all. Feynman's series of vignettes about his life experiences were extremely amusing and the quick change of pace from story to story made this book a real page turner. I would definitely recommend this book to anyone needing a good read, a funny biography, or a physics assignment.", "Helpfulness": 0.6666666666666666, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2X4FT0AHSK86B"}}, {"Date": "on June 8, 2007", "Text": "This autobiographical work is one of the most delightful discussions of a brilliant nuclear physicist you will ever read.  The book covers some of the most serious subjects of the 20th century, with humor that will amaze you.  In narrating his adventures, Feynman shows physicists to be human beings, with faults and foibles, and presents reasons why they pursue such esoteric careers.  Anyone who is aware of the history of the development of the atomic bomb, and the U.S Space Program, will both enjoy and learn from this book.  Once you read it, you will be recommending it to all your friends.", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2N8DSDSDOBUXA"}}, {"Date": "on October 22, 2012", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3T830KRSUXR1Y"}}, {"Date": "on December 28, 2014", "Text": "What a fascinating guy!  I found the book delightful, but I can see that some might not find it as wonderful.  There were certainly a few paragraphs that were WAY over my head, but when I started I was afraid I wouldn't understand any of it.  Very, very little of it is written for physicists only -- maybe a total of a page or two.  The rest is simply some life stories by a guy who lived an absolutely fascinating life, from his boyhood (when he repaired everyone's radios) to his Nobel prize.  It never once got boring, and completely held my interest from beginning to end.  If you like true stories and remembrances from amazing characters, you'll like this book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQUW1AA67GFVG"}}, {"Date": "on September 8, 2001", "Text": "I found this book to be easy to read, fun to read, and memorable. I feel it increased my scientific curiosity about the world around me. For example his testing the ability of his mind to time something, I try occasionally and find I am very bad at it.  I think he wanted to learn about everything and it was interesting to me that he came across as psychologically blind.  This made me more aware of my own blind spots, such as my inability to see any beauty in a Braque painting, whereas someone I greatly respect can go into ecstasy over them. It was fun to be a fly on the wall allowed to be let in on some aspects of the life of one of the great scientists.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEP9LH0OOB3EX"}}, {"Date": "on April 13, 1998", "Text": "I first bought this book way back in 1988 - an abridged version in a magazine had me intrigued.  A book that chronicles the life of a genius in short humourous incidents - it would be too simple to call them anecdotes - sets you wondering about life.  Feynman makes Physics seem fun and obtainable to everyone.  He takes his genius for granted and sees nothing extraordinary in it. In fact he refers to Einstein and other famous scientists as \"monster minds\" - totally unaware that he belongs to the same category.  An unusual style for an autobiography, \"Surely You're joking...\" will have you reading and laughing and get you curious...", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on October 7, 1997", "Text": "The book was given to me by my English major brother.  He often sends books my way and they usually sit for quite a bit while I try to get through them, but for some reason I picked this one up and read it in one sitting.  The last paragraph seemed like it had been written for me, \"So I have one wish for you-the good luck to be somewhere where...you do not feel forced by a need to maintain your position in the organization, or financial support, or so on, to lose your integrity.\"  Feynman remained true to himself and still had time to win a noble prize.  Science readers and everyone else would benefit by his unique outlook on the world.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on December 30, 2014", "Text": "Feynman seems so normal that it's actually astonishing that he was so brilliant.  A very funny man who lived an amazing, wide-ranging and quite fulfilling life. From his very early childhood it was clear that his fascination with how all things worked and his ability to understand propelled him to greatness in many fields. I recommend this book to everyone I know who has an appreciation for the standouts in Western society along with a sense of humor; he was certainly a character. I heard about this book during an episode of Science Friday in 2013 and even though it was published in 1985, it maintains its stature as a relevant book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OFMZ8HJIZQXF"}}, {"Date": "on January 3, 2004", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AUVYINJ1CVNCV"}}, {"Date": "on January 26, 2013", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2YEK43RAOR9U7"}}, {"Date": "on December 8, 2012", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3Q9AEC7WUXW5B"}}, {"Date": "on January 1, 2010", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TND6UOMU5J65"}}, {"Date": "on November 1, 2014", "Text": "I read this a long, long time ago, so cannot give details, but have recently bought it as a gift. This and \"What Do You Care What Other People Think?\" are both excellent collections of humorous and touching stories, by a rare and complicated American mind. The stories are straightforward, though, featuring the tricksterish charm of someone who was involved more than once in genuinely transforming the world. Here you will not find details of the technical knowledge and intuitive leaps that led to two Nobel prizes, but more personal observations on moments large and small, delivered in an easy to read way.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JE3P1E5TOED4"}}, {"Date": "on May 16, 2001", "Text": "This set of autobiographical stories brings together not just pieces of the life of Feynman, but also his joy of learning and discovery. He knows what is at the heart of science. It isn't only about finding out significant things or making improvements on others' findings. Science and life should be fun. Learning and playing are not mutually exclusive, and Feynman found a playground in laboratories, bars, Japanese hotels, and topless clubs alike. If books can help you see different perspectives, this one does it as good as any. People interested in education may find it insightful as well.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DET8JZRKSF2P"}}, {"Date": "on February 17, 2015", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27AL0L47RRLOK"}}, {"Date": "on April 20, 2004", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1J8H9QNHP8EU3"}}, {"Date": "on April 10, 2008", "Text": "One of the most entertaining biographies I have read to date. Richard P. Feynman is not your stereotypical lab-coat scientist; his relentless curiosity has led him down many adventurous paths and generated hundreds of humorous stories. Don't let the `theoretical physicist' subtitle distract you, this book is as much about the pursuit of science, as it is about the innate curiosity and passion about making the best of your life - through the eyes of Richard P. Feynman. This book is guaranteed to make you laugh. Enjoy it, and make sure to share it with your friends.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MGUNKW1ANLT5"}}, {"Date": "on June 28, 1997", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on December 27, 2013", "Text": "Dr. Richard Feynman was the opposite of every fictional, Hollywood PHD physics professor as stuffy, absent minded and quaint. He was the kind of guy most men would would drink a beer and relate raunchy stories and think he's one of us. If you were interested in physics or complex problems he jumped in and would work out solutions just for the sake of doing it. He was a genius without the ego and baggage of many contemporary intellects who considered him friend and equal. He died living a full, successful and fun life that most of us would envy.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2G63896Q4QY4M"}}, {"Date": "on February 9, 1998", "Text": "Physicist, bongo player, safe cracker, artist... This collection of stories is a delight. Richard Feynman's enthusiasm for everything he did ( with maybe the exception of learning Japanese ) shines through. These stories are wry and funny and come some way to explaining the great character that was Richard Feynman. Nothing for him was ever boring and no problem was ever trivial or  uninteresting. In these stories, his love of life along with his awe and reverence of Nature shines through and by that light we, perhaps, glimpse genius.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWDFOM2D4PTZD"}}, {"Date": "on October 13, 2010", "Text": "Did you think that all scientist could be found some where sitting in a corner reading the latest scientific journals or in a laboratory hovered over some experiment they were engaged in?  And did you think that scientist were boring and dull witted?  This book tells the personal side of a great and brilliant American scientist.  It will change your mind about the results of genius.  It is entertaining all the way through and could cause a paradigm shift in your beliefs.  I just couldn't set the book down.  Very good reading.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3M3015O01SHB7"}}, {"Date": "on May 1, 2000", "Text": "This book is not all about physics / science, rather it's about life. I found the book very real and inpirational - just the way Feynman lived his life. No, I don't think many of us would come close to his intellectual  brilliance but it's not just about that - it's about living life with  passion! he's honest being a \"real-fake\" (as opposed to a  fake-fake\"), and it's just an example of his sincerity that reaches  out to us when we read the book. Feynman shows us how to live life to the  fullest passion. Wow.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3VN3QKMCA8U68"}}, {"Date": "on May 18, 2015", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NRRV3CUBJV57"}}, {"Date": "on March 27, 2015", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VF4BV5ONRSL6"}}, {"Date": "on May 20, 2005", "Text": "This book is a keeper.  So many times I look at the cover of a book and it says - Smart and Funny.  This book is all that and more.  It makes me smile over and over again.  It's a great companion to the Feynman Lectures as he describes his time in Princeton and working with Oppenheimer amongst others.  It has amazingly small and amusing details on Feynman's world.", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1K0LCJMM9WUB0"}}, {"Date": "on January 4, 2011", "Text": "This book is so very charming and enthralling. I could not put it down until I finished the whole book. I was captivated by Feynman's incredible imagination, incessant questioning, cleverness, and his dissatisfaction with anything less then the correct answer. You will be laugh with delight at his antics and some of his life experiences as well as being thought provoked on some aspects of life which the normal person gives no thought to, but when seen through Mr. Feynman's eyes, gives new perspective.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJO04O7AUIDB8"}}, {"Date": "on June 3, 2014", "Text": "If you are a buff of WWII, physics history, or just enjoy hearing about the everyday lives of extraordinary people of yesteryear, this was a really great book.  I can't say that I am any of those things, but a friend suggested it and I really liked it.  It was informative, interesting, and quite funny in places.  Feynman was a very special person and while this book fails to fully reflect his contributions, it is a very personal look at the mindset of the man who has been very important for science.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A33UWJ6W34NO6C"}}, {"Date": "on October 19, 2009", "Text": "Feynman had no desire for fame and fortune and was just interested in finding things out.  That's what makes this book so entertaining.  It shows that there is no value in pretending to be an expert or in holding a high position in your field of endeavor without just having fun learning and experiencing life.  While Feynman was truely a great mathmatician and physicist and co-developer of the atomic bomb during WWII, this book shows some of his more human reactions and vulnerabilities we all share.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A393B264DFROES"}}, {"Date": "on January 6, 2013", "Text": "This is a collection of anecdotes written in the first person. Some of them are charming and amusing but there is little to learn and Feynman was not James Bond after all so you should not expect too much. I would have given the book 3 stars had it not been for the last essay on 'cargo cult science' where Feynman describes some of the characteristics of good and bad science, namely the need for complete integrity and honesty in proper science. But you can find that essay on the internet as well.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LJ2IBPCSQGOX"}}, {"Date": "on April 15, 2014", "Text": "The life of perhaps the brightest person who ever walked the earth is humorously portrayed by the genius himself!  While nearly bereft of any athletic ability, Richard Feynman successfully invented other ways to gain attention and respect.  He developed an acute understanding of human nature allowing him to appear to be a sorcerer.  His achievements are legend, yet the book is written without a hint of pomposity.  While his scientific endeavors were most arcane, his book is most readable.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2F37KUG8J9F1B"}}, {"Date": "on September 12, 1998", "Text": "Obviously many people have been moved by this book, as witnessed by the  number of online reviews. I have no scientific background at all, and I  agree with another reviewer who said \"everyone should read this  book.\" I have returned to this book many times since someone gave it  to me 7 years ago. In good or times or bad, this book has been an  inspiration to me. How to be yourself against the flood of conformity, how  to maintain standards, how to remain human. Unforgetable.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on March 31, 2005", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MJHMNGK2XG29"}}, {"Date": "on January 5, 2011", "Text": "No doubt, Dr. Feynman is one of the most extraordinary American scientists of all time.  Not only is he a brilliant Physicist, he is a remarkable thinker and highly relatable. His anecdotes, adventures and more in-depth stories provide an inside look to the very odd but brilliant Dr. Feynman.  While readers from a wide range of backgrounds would enjoy this work, science enthusiasts (and those familiar with his work) will be particularly pleased with this one.  An outstanding read! A+", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KZEGBTPH6MMF"}}, {"Date": "on August 3, 2014", "Text": "Richard Feynman was indeed a character and this memoir points that up well.  It is an enjoyable read, and parts of it are revealing of the folkways of academics, a curious species in themselves.  Feynman's irrepressible sense of humor, coupled with his unflinching pursuit of reason and logic got him into hot water many times during his stellar career as a physicist and gadfly.  The only reason I don't give it five stars is his occasional lapses into self-congratulation.  Good book!", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AP1H9QUCMVEVB"}}, {"Date": "on July 5, 2014", "Text": "All I knew about Dr.Feynman was that he was a great physicist but I didn't know how eventful a life he lived. Reading this book you come to know that Dr. Feynman was not only a very credible scientist but an all round intelligent, sophisticated and whimsical person. It is astonishing to read about all the situations that he landed himself into and then the way he dealt with everything is and his articulation about those situations are a fun to read. He is a truly inspiring figure.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CVRMWJWYW78"}}, {"Date": "on September 17, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27JJ9FMQ7WOJV"}}, {"Date": "on August 29, 1998", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UXTY42TDOGI"}}, {"Date": "on March 26, 2015", "Text": "A must read if you're interested in Richard Feynman.  It's great for both science educated and non science educated.  A glimpse into the most interesting physicist of the 20th century in terms of being able to communicate very complex ideas into ways that almost anyone with a curious mind can access and understand.  Feynman was really one of a kind in physics and this is a great way to introduce someone into his most eventful life.  It's a page turner.  Very fun read.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARKPBV91DYWZF"}}, {"Date": "on December 13, 2000", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TRPVAGT3NWBS"}}, {"Date": "on November 23, 2008", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30VVHVR6E1UCJ"}}, {"Date": "on December 4, 2014", "Text": "\"Are you kidding me\"...was my expression throughout this book. Being a scientist, reading about inspirational people like RPF is always a pleasure. However, this book is not a typical autobiography and will make you both laugh and think about the life of this spectacular person. Highly recommended. One of the best autobiographies i've ever read. Even bough the sequel \"What do you care what other people think\" and that was also equally wonderful.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AG8FLGJF1Q45"}}, {"Date": "on December 12, 2011", "Text": "My husband and I love Feynman's works and find this to be his best because of the personal yet humorist approach. He goes through his childhood success up to his later years describing some of his not so famous but very interesting tactics to success. I would suggest this to parents seeking out different methods to encourage thinking in their kids, also adults wanting a witty evening full of brain teasers, and any one interested in how the higher 'minds' think.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HRESDANXQ9SN"}}, {"Date": "on February 2, 2013", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A172DCU5C730S5"}}, {"Date": "on November 6, 2014", "Text": "A series of short vignettes about the infamous Mr. Feynman.  The stories shared here sketch the outline of a fascinating man with an inspiring outlook on life, but the book lacks a coherent structure.  Perhaps a professional biographer would have painted a fuller portrait, but Feynman's wit would surely have been diluted.  While some will be left unfulfilled and others intrigued for more, this reader found an enjoyable read with both insight and levity.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KZTY4AFAEOVD"}}, {"Date": "on January 8, 1997", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on January 13, 2015", "Text": "A lot of interesting anecdotes about Feynman's habits, and his life stories.  Anyone who knew about Feynman or who has met Feynman (like myself) would enjoy finding out why he does what he does, such as playing a  \"bongo\" in front of faculty members & students just before he gives a public lecture.  Although it has many interesting stories, the book has 346 pages to read, and it does get somewhat boring at times with too much details.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3W0TONHRJ0V1X"}}, {"Date": "on June 20, 2004", "Text": "I thoroughly enjoyed reading this book. It really gave dimension to a man I've heard so many stories about from my father in law. My husband got a kick out of seeing me read the book too. He had read it a few years ago and after I would finish a chapter he'd want to chit-chat about what I had just read.", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1PXH6NS60C8V5"}}, {"Date": "on April 24, 1999", "Text": "I first read this book in 1988 and have, since then, been a Feynman admirer.  Once you read this book you will see why, of all the members, he was the indispenable man on the Challenger investagory commitee.  Perhaps  not as productive as Da Vinci, he had the same keen inquisitive mind and he  also had the good sense to not become overly impressed with himself. Read  it, you'll love it.  Then you'll change the password on your computer.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on July 31, 2003", "Text": "Simply superb. Feyman is hilarious. A must-read.", "Helpfulness": 0.75, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on April 11, 2011", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BFF8VPLP4DJ6"}}], "ReviewUrl": "http://www.amazon.com/Surely-Feynman-Adventures-Curious-Character/product-reviews/0393316041/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.6 out of 5 stars"}, "OfferPrice": "$11.63", "Salesrank": "#1,854", "ListPrice": "$15.95"}