{"Category": "in Books (", "Name": ["The Science of Interstellar"], "Timestamp": "2015-05-24 21:21:26.963525", "itemurl": "http://www.amazon.com/Science-Interstellar-Kip-Thorne/dp/0393351378", "Reviews": {"TotalReviewCount": "184", "ReviewList": [{"Date": "on November 11, 2014", "Text": null, "Helpfulness": 0.9833333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IHIFAM05YL61"}}, {"Date": "on November 9, 2014", "Text": null, "Helpfulness": 0.9381443298969072, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2CFMY3OS2HFTF"}}, {"Date": "on November 8, 2014", "Text": null, "Helpfulness": 0.8707482993197279, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AL9WKVMRI6GFB"}}, {"Date": "on November 9, 2014", "Text": null, "Helpfulness": 0.8431372549019608, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MMAK51B7ZAO0"}}, {"Date": "on November 17, 2014", "Text": null, "Helpfulness": 0.875, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DJDYPVXW1ETN"}}, {"Date": "on January 28, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BPR8I5JWTBW"}}, {"Date": "on January 12, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2UTKYA2U8542F"}}, {"Date": "on February 17, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OGKXFAFRCHJR"}}, {"Date": "on December 13, 2014", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RELU94NM7RWI"}}, {"Date": "on November 15, 2014", "Text": "Excellent book! Explains pretty much everything that happens in Interstellar for anyone to understand. Highly recommend for those who had trouble understanding how certain things happened in the movie or for people who just want to learn more about astrophysics and space in general.", "Helpfulness": 0.8, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Z33XI18QYFU3"}}, {"Date": "on February 8, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOT86E19KMKOJ"}}, {"Date": "on January 11, 2015", "Text": "This is a great science book for the novice, or for someone who is well versed in physics. The book provides a great outline for the scientific concepts that were utilized in the movie Interstellar. The discussions on the anatomy of black holes, wormholes, the bulk, and the 5th dimension are all wonderful, concise, and very understandable. The book does not get into the math behind some of the concepts, though Professor Throne does tell where to find it if one is interested. The book is also illustrated very nicely. After reading this book I think it will make me appreciate seeing Interstellar again, once it comes out on blu-ray. Even if you didn't see the movie, I still think it is a very interesting read for those who love physics, like myself.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30M3DBW5MFC3R"}}, {"Date": "on January 21, 2015", "Text": "I am working my way through Kip Thorne's book now. Though I teach this subject at the college level, I have learned a few new things, while getting a slightly different perspective on subjects such as black holes. If you have an interest in astronomy and have seen the movie, then this book will be of interest. It will take a bit of commitment, but the outcome is worthwhile. The language is quite accessible. The illustrations are first rate. The book is full color throughout and printed on heavy coated paper. This book is a very nice addition to my library. If you want to learn some science that happens to be tied to an entertainment (the movie Interstellar), then I recommend this book highly.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29E6F40DKHOU2"}}, {"Date": "on January 4, 2015", "Text": "Thorne has a way of explaining very difficult advanced physics concepts so that they are relatively easy to understand. This book answered a lot of questions I had about what actually happened in Interstellar (according to Thorne's interpretation) and whether it fit in with what I understand about physics (I'm a physics major). His style strikes me as a little too much like an educational video when he asks questions like, \"What do you think?\" Instead of just explaining what he means right away. Also, many of the illustrations he uses seem weirdly cheap for a book that goes along with a movie with such amazing visual effects. Overall though I found his style to be charming and engaging.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SR74I0PMDN73"}}, {"Date": "on May 3, 2015", "Text": "Much easier to read than I thought it would be for some heady science. Kip does a great job of breaking it down into digestible bits for the layperson. He also breaks the story down into those elements that are solid 'fact', those that are 'mainstream theory', 'developing theory' and outright speculation. If your at all interested in diving into the wormhole and be able to impress your friends with a reasonable explanation of just what wormhole is - this is a must read.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LUAQS4BN7X8C"}}, {"Date": "on January 6, 2015", "Text": "There were soooo many questions after I saw the movie. I tried searching the web and could find some answers but it still left many unanswered. This book provided not just a wealth of information but also did it in a manner that was accessible. It helped me understand several concepts, clarified others and what's more - helped me respond to the questions of my 8th Grade son so much better. I only wish the binding was better. It just curls up and stays that way.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2B8RS13ZXA0Y2"}}, {"Date": "on February 12, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34WBAKYHIIJ0E"}}, {"Date": "on February 17, 2015", "Text": "If you watched the movie, even if you are a rocket scientist, you probably would enjoy having the details explained by Kip Thorne.  And if you're not a rocket scientist, you're in for a treat by having the details explained by him.  He knows the story and the science behind it well.  He did a very good job and accomplished the title objective for a broad audience.  Well done.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHKRDAWSSYXQ5"}}, {"Date": "on February 22, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BT1WS70A7LO7"}}, {"Date": "on April 17, 2015", "Text": "The book represents a fine balance between \"going over my head\" and \"dumbing down.\" It did both for me at one time or another but explaining complex concepts in simple language is a fine art and is nicely done by the author. Highly recommended.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YLVUBTV7XGBP"}}, {"Date": "on March 8, 2015", "Text": "Although I haven't seen the movie yet, I bought everything about it in book form.  I'm obviously a sci-fi nut.  My own difference from the intended Hollywood-defined Mass Audience (Slam!) is that I have been studying gravitation theory, high-energy particle physics (Wheeler), and advanced math since the 1960s, worked at UCSD in high-energy physics, and gee whiz, got lectured by people at Cal Tech like Feynman.  There, take that--I can drop names too, which this book does a helluva lot.  I'm delighted to read about the people who make movies.  Watching an Extra on the BLADE RUNNER Blu-ray disc yesterday reinforced what Kip Thorne says about Directors:  they are gods.  The Director goes with Mass Audience appeal over Truth,  beauty over Truth, which is how to make money and get an Oscar for Special Effects.  Nothing wrong with that.  Unusual to read that Truth in a science book, however.  I appreciate the updates in cosmology theory, even when they have to be labeled truth, educated guess, or speculation.  There should have been a fourth circled symbol OG for when explanations were meant for Old Geezers like me.  All the emphasis on colorful black boards full of symbols takes me back to the obviously-Einstein character in THE DAY THE EARTH STOOD STILL, although his blackboard was just plain chalk on slate probably.  In both movies, that DAY ESS and INTERSTELLAR, a blackboard full of incomprehensible (to The Mass Audience) are as much Eye Candy as the actresses.  One of my Professors wrote equations with his right hand and simultaneously erased them with his left hand.  Thanks to this book and its internet links, at least we can study the equations longer, until our brains float thru the branes.  Funny how INTERSTELLAR has a religious or occult theme, like CONTACT bringing Arroway to her dead father, and GRAVITY bringing its heroine to prayer and thanksgiving at the end.  Is it fair to ask if that trope should be labeled S?  Mass Audience again will answer.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LDO43KPFU9I4"}}, {"Date": "on January 4, 2015", "Text": "Great book explaining all the science behind the movie. However in the book there are some conflicting claims about the properties of black holes that should be cleared up. In Chapter 5 on Black Holes on page 45, Dr. Thorne writes \"First, a weird claim: Black holes are made from warped space and warped time. Nothing else - no matter whatsoever.\" Then in Chapter 6 on Gargantuan's Anatomy on page 57, Dr. Thorne writes \"If we know the mass of a black hole and how fast it spins, then from Einstein's relativistic laws we can deduce all the hole's other properties:\". If there is no matter whatsoever in a black hole, how can we calculate the mass? The equation w (weight, matter) = m (mass) x g (gravity) doesn't hold since Einstein's relativistic laws are used to calculate the mass where m (mass) = c2 (speed of light squared) / E (energy). I think this should have been made clearer with some simple examples and calculations to reduce confusion for the average person between mass and matter and where and how the Energy is measured for a black hole. I do like the quote about black holes to indicate that there are no extra, independent properties beyond its mass and spin on page 57: \"A black hole has only two hairs, from which you can deduce everything else about it.\" One question though, what about non-spinning black holes, are these just \"single hair\" black holes? I also really like Dr. Thorne's labeling of the status of the science for Interstellar on page 33 where \"T\" stands for Truth (green), \"EG\" stands for Educated Guess (purple), and \"S\" stands for Speculation (red) and this is labeled in color at the beginning of a chapter or section so the reader is aware of where science stands today on the particular subject in the movie. Overall a great book on black holes and explaining all the science behind the movie which couldn't be explained well in the movie's limited time. Well worth the read and furthering of science education.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PG50J8K4TGNE"}}, {"Date": "on February 3, 2015", "Text": "Very well thought and laid out book describing the details of the science behind Interstellar. As a novice fan of cosmology and astrophysics, I was intrigued and had newfound interest to dig deeper into some of the topics. Worthwhile read!", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3LH51D9X6TN58"}}, {"Date": "on November 10, 2014", "Text": "A clear and concise explanation of advanced concepts in physics, leading to an understanding of cutting edge ideas.  Excellent graphics. Also a delightful, quick trip through the high end of the Hollywood film making process.", "Helpfulness": 0.7142857142857143, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TK3NAVKZHRXS"}}, {"Date": "on November 9, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3UW23DBF2KHWC"}}, {"Date": "on January 5, 2015", "Text": "Excellent read for anyone who is interested in \"getting their feet wet\" in regard to astrophysics and relativity. There were very few instances where Kip failed to fully address the questions that I had.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3B6XLRCHVZOY9"}}, {"Date": "on January 21, 2015", "Text": "Must have for any hard core fan of the movie or anyone doubting the legitimacy of the science behind it. Lots of illustrations and simple examples so you don't need to be a scientist to enjoy it.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AQ5ARGNQER3Y"}}, {"Date": "on April 19, 2015", "Text": "Really amazing stuff. Thorne is a great writer, making complex issues accessible to the average science junkie. Links to the website showing clips, etc. are worth exploring. Highly recommended!!", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37HJ8PHIUZ4M9"}}, {"Date": "on November 25, 2014", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZYTNL5W3E5AB"}}, {"Date": "on December 11, 2014", "Text": "A very interesting and at many times \"fun\" read. Definitely challenging to get through and comprehend in many parts, but overall a good, enlightening read.", "Helpfulness": 1.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1IKV9U0DOZ93Q"}}, {"Date": "on March 21, 2015", "Text": "Kip Thorne does a masterful treatment of the physics, mathematics and computer modeling involved with the production of the motion picture Interstellar. Apart from the occasional gratuitous diagram or photograph, there is little to complain about. Touted as having a great degree of scientific accuracy, Kip actually points out that the depiction of many events were actually dumbed down by Chris Nolan who thought that his audience would be too stupid to make sense of them. I'm thinking, \"Whiskey Tango Foxtrot!  Most of the stuff accurately depicted is above the heads of the average scientist. Why dumb down _any_ of it?\"  Perhaps Chris Nolan is just a typical Hollywood primadonna who abandons consistency when producing a film. I think they call that \"artistic license.\"  Ask me what I call it. I do give Kip and the graphics team for genuine physics breakthroughs in modeling visualizations of black holes.  The book is instructive and the average reader will struggle with some of the material, but where I come from, we call that learning.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A267XNIM9719UE"}}, {"Date": "on January 28, 2015", "Text": "Kip Thorne explains his scientific interpretation of \"Interstellar\" and extrapolates on the story using complex modern physics concepts.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A27PFYIOH6DNGJ"}}, {"Date": "on January 29, 2015", "Text": "I'm glad I saw the film before reading the book.  After a second reading I saw the movie again and enjoyed the visual experience even more.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Q5APE6SKYSQR"}}, {"Date": "on February 24, 2015", "Text": "As a physics student who has taken relativity classes, this definitely helps explain and expand on the subject. Well written. Huge fan.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1EH95KBQ56B3D"}}, {"Date": "on March 24, 2015", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2X5ENAGFQ60WJ"}}, {"Date": "on December 9, 2014", "Text": null, "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A16JJ3TE1MM9DS"}}, {"Date": "on February 11, 2015", "Text": "Pretty spectacular science explained in this book. An awesome must have for a fan of the movie Interstellar.  Fun read.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1W6QTC5C6U9GC"}}, {"Date": "on March 23, 2015", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1BDRHEL1B4VU"}}, {"Date": "on April 19, 2015", "Text": "The book that set me going and read more on the topic of special and general relativity and modem physics.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A6VH05VP8H3WO"}}, {"Date": "on April 29, 2015", "Text": "Interesting read. Kip does work to make difficult, counter-intuitive concepts understandable.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A229UTZEADELQH"}}, {"Date": "on November 28, 2014", "Text": "As Neil D. Tyson wrote, this book is \"highly readable.\"  Of particular interest to me was the discussion of BKL singularities, the outline of Brane & Bulk, the clear denotation of \"True\" vs. \"Educated Guess\" vs. \"Speculation\" and the possibility (!!!) of surviving a crossing of the Event Horizon of a galactic-core-sized Black Hole (not to mention any daring use of a Rescue Tesseract).  Fun for the curious (or for budding school-aged Astrophysicists).  And of course, {Dr. / Feynman emeritus Prof.} K. Thorne has *always* been a great explainer. - P.T.Reszel", "Helpfulness": 0.6666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3YYD8MQ4M7F1"}}, {"Date": "on February 19, 2015", "Text": null, "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJTLNQD4CNY4A"}}, {"Date": "on February 26, 2015", "Text": "HUGE Interstellar fan, seen the movie 4 times. After the first time I ordered this book and spend each night mulling over the idea of gravitational lensing and 5th dimension tesseracts. Everyone I meet who mentions the movie gets to hear my \"30 second sell \" of the book -  keep that feeling you had when you left the theater going by diving into the book. So much backstory to the movie, I'm so inspired by Kip Thorne, Lynda Obst, Double Negative (congrats on your Oscar) and of course Christopher Nolan (you deserved the Oscar), his wife and brother Christopher. Bravo on making such a fine piece of work.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AK9TZ07H8DIGL"}}, {"Date": "on December 15, 2014", "Text": "Awesome book!  I saw the movie then read the book and then saw the movie again.  Reading this book is like journeying 25 years into the future! Even though many of the topics in this book is speculation, the science Kip Thorne presents is both eye opening and sound. Kip Thorne shows how sound science can lead to educated guesses that seem both real and plausible in terms of Einstein's outrageous legacy of relativity. See the movie first then read this book. See the movie a second time then read this book again.  You will be greatly rewarded for your efforts.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A12AI4NFFIP4PI"}}, {"Date": "on March 1, 2015", "Text": "This is a terrific book for anyone interested in science or for a fan of the movie who wants to learn more about the science behind it. There's enough science to be taken seriously by a physics major but explained in lay terms so anyone with a rudimentary interest in science should be able to follow along (say, a middle school-aged student). My son is 16 and interested in this book so we picked it up last night after seeing Interstellar for the 3rd time. It is beautifully done with full color inside and a reasonable price.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32PBNS7SGYRWE"}}, {"Date": "on December 14, 2014", "Text": null, "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AKOV30FMAHR11"}}, {"Date": "on February 26, 2015", "Text": "Dr. Kip Thorne is a scientist who debates theories about black holes with Stephen Hawking, so his credentials are impeccable.  Christopher Nolan wanted \"Interstellar\" to be science fiction based in real science, so Kip Thorne graced him with research that did just that.  This book will answer so many questions that have come up about the nature of our universe if you're a professional or novice.  I'm in the novice department, and it was a revelation to me.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PEE5Y7ZSDXK7"}}, {"Date": "on January 24, 2015", "Text": "Fun read.  The writer seems a little anxious to tell us his politics on occasion, which is oddly out of place in this book, but nevertheless, a fun read and mostly easy to understand read, except for the lensing of the black holes  (that needed some extra reading, re-reading).  I like that the author is clear about what is settled science, what is reasonably science based, and what is just plain out there.  Helps navigate the strength of the explanation.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3S1B4UG14Q8TU"}}, {"Date": "on April 12, 2015", "Text": "I loved Interstellar, but this book made me love it even more. The high point, other than getting deep into the science of the movie, was realizing how much of it was truth, or very close to what experts can perceive as truth. Kip does an excellent job separating the truth from the speculative, and really make you appreciate what he and the filmmakers were able to accomplish, while at the same time creating an inspiring and entertaining film.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A55GO8WXQ1GBV"}}, {"Date": "on January 10, 2015", "Text": "Kip Thorne does an excellent job explaining his thinking through the science of interstellar, that is accessible (in its lack of mathematics, at least during the main exposition ) and challenging (with the introduction of multiple concepts at the very fringe of modern day theoretical physics ). Truly makes you appreciate the scrupulousness the filmmakers put into integrating the science of the very large and very small when making this film.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NHAYRUSKLWI0"}}, {"Date": "on April 12, 2015", "Text": "Kip Thorne explains everything you need to know about all the scientific accuracies and inaccuracies of the movie. I love learning about astrophysics and the universe in general and his explanations help me understand a lot of the complicated aspects of these fields of study. I was hooked from the beginning and just couldn't stop reading!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3R10V3SB60QES"}}, {"Date": "on March 7, 2015", "Text": "Okay, once I got home from the movie, I ordered this book and read it cover to cover.  It was a good refresher course in the science of black holes and relativity and I'm grateful to Dr. Thorne for such a clearly written book; and sharing his views of how the movie was made was icing on the cake!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36NTW1YZSFGI9"}}, {"Date": "on February 19, 2015", "Text": "In Amanda Gefter's book \"Trespassing on Einstein's Lawn\", she wrote how Kip Thorne wasn't into research as much any more because he's \"bored\".  He is more into working on two Hollywood science fiction movies and writing for Playboy.  That's one of the privileges of tenure, how much fun it is to tell the world to get off.  I admire how even then, he's still got young bright Caltech graduate students writing great code for simulating accretion disks around black holes.  Well, true to form, Thorne came out with this book on one of those movies, \"Interstellar\", in a few months.  So many authors have written on this topic now they almost form a tribe that talk to each other across Kindle.  So that sour grape remark aside aside, let me get down to the movie, then this review.  The movie I thought was the worst mishmash of nonsense from the narrative point of view.  No part of the story is believable and there's no character worth any empathy with.  The lead actor is a corn farmer who's supposed to be an alienated or semi-retired rocket scientist who can spout general relativity with aplomb but does it in such a slur I couldn't make out half the words in the theater.  Maybe watching it on IMAX might have helped but I have my doubts.  When he tunnels through the wormhole and can still watch the latest news of his daughter on TV, I can no longer suppress my annoyance and have a hard time letting go and following the thread.  Well, that's where this book comes in: to explain what I missed.  First Gargantuan, and all the latest hype about the software written just for the movie (that's being published in a scientific journal for GR simulations).  Well and good, except the picture that's generated by all that software is no better than the picture of just such a thing as I can find in a textbook by one of Thorne's peers: Edwin Taylor and GR's main maven, the late great John Wheeler.  That great book is \"Exploring Black Holes, Introduction to General Relavitivy\" which you can find on Amazon.  The story of the movie gets worse towards the end, when attempts are made to create closure on past-future communications, before the canned final Hollywood ending with the lead jetting off to join his pseudo-romantic interest and colonizer near Saturn.  Like the Time Machine man going back in time to rescue the girl from the Morlocks.  Yes, \"Interstellar\" the movie is a true non-dazzling mess, but perversely I look forward to more from Professor Thorne in the future, because he's always right out there.", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1SFDUK4DTX6TP"}}, {"Date": "on May 5, 2015", "Text": "Very interesting book which provides the appropriate scientific background to better appreciate Interstellar movie. From my point of view Interstellar is the most interesting SF movie since 2001 Space Odyssay.. The book is very well written by a very well known expert in theorytical physics.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8HPMCK5OY8G6"}}, {"Date": "on December 13, 2014", "Text": "I'm an amateur science enthusiast and I've read many books from Hawking, Kaku, Krauss, Tyson, Deutsch and Sagan, but Throne, using Interstellar as the visual guide, made for the most effective and easy learning experience I've had. I recommend it to anyone and everyone.  Great read!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BV5LE1D3S7YW"}}, {"Date": "on March 16, 2015", "Text": "Very enjoyable book for any level. Even for those who want to learn, although they have not seen the movie. Perfect for understanding the physics that lies behind the many details of the film. From my point of view, Kip Thorne is one of the great popularizers of science.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1OY64MB3EYHGK"}}, {"Date": "on April 3, 2015", "Text": "I got it for my husband after we watched the movie together and he couldn't stop talking about it - To find out that it is a great book! It is of course fictional. But, I understand now a lot more than I did watching the movie. Great book! You will not be disappointed", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2Q26G7P3TASHV"}}, {"Date": "on April 4, 2015", "Text": "Amazing book. Explained a lot of what confusing scenes in the movies. A lot of the IMDB reviewers who say that same thing about, \"the black hole would spaghetti-fy him\" could really use this book. There are now (apparently) three singularities!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOGDNLFJVISOT"}}, {"Date": "on January 7, 2015", "Text": "Detailed explanation of almost all science happened in the movie. I'm a physics major student so I found reading the book comfortable. Not sure if it's the right book for people with no physics or astronomy background. Good book though!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AJMJROS0YAUA4"}}, {"Date": "on April 9, 2015", "Text": "Actually I'm still reading it but it's got lots of good astro physics info in it.  In my circle, I'm known as the \"Spacegeek\" and this will just help to shore up my reputation even more.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AM1DKNWXYOLSY"}}, {"Date": "on April 16, 2015", "Text": "Amazing book that explores the possibilities of science. Kip Thorne does a great job of not getting too technical at critical points of the book so as not to lose the reader. Highly recommend!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8TTA5C82I2JZ"}}, {"Date": "on February 21, 2015", "Text": "Very well written. Right amount of technical detail (or not!) for me. Reading this book has intrigued me enough to now start wanting to learn more about the subjects discussed in the book.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A26Q3CWJ629D8N"}}, {"Date": "on December 13, 2014", "Text": "I enjoyed the book a lot.  This book helps fill a lot of the questions that I had after seeing the movie.  It's extremely in-depth.  I didn't find it hard to read either.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWDT9O7HMQIZ2"}}, {"Date": "on March 26, 2015", "Text": "Excellent companion book to the film.  It's real science presented in an intelligent manner that is readable and enjoyable even if you don't have a degree in physics.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARKPBV91DYWZF"}}, {"Date": "on March 18, 2015", "Text": "Book was in perfect shape. I highly recommended this to all. The knowledge is displayed nicely, and you don't need a degree in science to understand what is in here.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3DS5MOKTHC9SP"}}, {"Date": "on April 29, 2015", "Text": "Great book. Even if I didn't fully understand the science, it was interesting to read about the science as it relates to specific scenes in the movie.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1N5FS4VJRR142"}}, {"Date": "on February 21, 2015", "Text": null, "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2DZMQY0BCFRA0"}}, {"Date": "on January 11, 2015", "Text": "My only negative comment is that I am not a strong enough scientist to comprehend all the ins and outs of the book, though I always enjoy Kip Thorne.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XMXRQUSPRTS2"}}, {"Date": "on March 4, 2015", "Text": "I loved this book! Kyp Thorne made me wish he had been my physics teacher on high school! I would have definitely understood a lot more jajajajaja!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXVU1ZO2A5JLI"}}, {"Date": "on February 8, 2015", "Text": "This was a Christmas gift and my son wasn't expecting it and is devouring it. He loves the movie and this book just adds to his enjoyment of it.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A391MBZX73H22X"}}, {"Date": "on March 10, 2015", "Text": "great book as an intro to how the movie got made, and the total involvement of Kip Thorne at Caltech in bringing the science to the movie.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Y1AF1N8FOSQ"}}, {"Date": "on December 24, 2014", "Text": "This book exceeded all my expectations. I read it twice, taking notes the second time. Written in plain English it allows anyone to understand the basics of black holes, worm holes, space and time relativity, gravitational lensing and so much more. This book also has the potential to inspire young readers to go into theoretical physics. I gave a copy to all young men and women I know (14 years old and up) hoping to get us at least one new bright mind working in this field; there is so much we still don't know. And if you feel so inclined there are also some equations in the back of the book (in technical notes), with questions that make you go back and think to see if you really understand things.  Fabulous book. Great job Dr. Thorne!", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ZIVHQY6W8YQH"}}, {"Date": "on March 17, 2015", "Text": "The kindle version on a non color reader doesn't show the diagrams very well which makes some of the explanations difficult to follow.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2SMOGE9WAKGN2"}}, {"Date": "on February 2, 2015", "Text": "Good book easy to understand for people with background in astronomy/physics and for people who don't even know what a hypothesis is.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AXLPF41ZKBX8Q"}}, {"Date": "on December 15, 2014", "Text": "This is a good book. It clearly explains what happens in the movie and splits it into multiple parts such as fact, speculation etc.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PHBCBRH6X5GU"}}, {"Date": "on May 10, 2015", "Text": "Deep, cutting edge science written in a fun, easy to read way. A must after or before watching the Interstellar movie", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A37P2NTH74CFY7"}}, {"Date": "on January 7, 2015", "Text": "Yes and no. Very informative, but the last part of the book is excessively opaque (I have a background in physics and have read some of the references Kip Thorne cites), and some of the physics assumptions seem pretty preposterous on the face it (though admittedly, he did have to accommodate the needs of the filmmakers). By comparison, I thought Lisa Randall's book \"Warped Passages..\" cited by Thorne is far more lucid when the ideas get really dense. Nevertheless, Thorne did a service to popularizing science by lending his skills to the making of this movie and then expending the effort to write this book.", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34973YLVROG2J"}}, {"Date": "on January 4, 2015", "Text": "This book by Kip Thorne is an excellent summary of the physics used to write and direct the film INTERSTELLAR.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VS6VPKJQF4JK"}}, {"Date": "on February 20, 2015", "Text": "It was very thorough and very interesting. Kip had a way of making all the complicated things much simpler.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AO9PBBOY3WERX"}}, {"Date": "on April 3, 2015", "Text": "I got it as a gift for my husband. He finished it in 3 days and loved it. It was in excellent condition.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QGBGOBSXR4UV"}}, {"Date": "on January 5, 2015", "Text": null, "Helpfulness": 0.5714285714285714, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3GAHSKFONFZRR"}}, {"Date": "on December 15, 2014", "Text": "You'll just want to go see the movie again after you read it. (and Kip Thorne knows it, too)", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2NAGFCRU6Q56O"}}, {"Date": "on November 25, 2014", "Text": "Readable and exciting explanation of the astrophysics used in the movie, \"Interstellar.\" The author writes with a light, enjoyable tone and makes each topic interesting--leaves you wanting to read more. Lavishly illustrated with diagrams, scenes from the movie; text contains lay-friendly examples that make you understand the space mysteries of the movie. Dr Thorne worked on the movie and has made numerous physics discoveries during his career. This book is highly recommended!", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2BFD2MM8TTGC5"}}, {"Date": "on March 27, 2015", "Text": "After reading the first few chapters I've had to revise my view that the earth is flat :(", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A22OH3WIWH3VAV"}}, {"Date": "on May 19, 2015", "Text": "Fast shipping, everything perfect, except cover was a little bit sticky and dirty.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3RHBOPHUD1RTS"}}, {"Date": "on May 2, 2015", "Text": "Great if you have decent knowledge of physics, but it may lose some readers.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2FY88UOJ4760C"}}, {"Date": "on December 31, 2014", "Text": "An up-to-date read about the use of space-time and black hole concepts used in the move Interstellar.  On of the very best minds in astrophysics today, author Kip Thorne illuminates the germane physics of  the movie interstellar.  It's and interesting but sometimes challenging read which occasionally challenges the imagination but it should be satisfying for most readers.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ATR7PPN8K87SS"}}, {"Date": "on December 31, 2014", "Text": null, "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2IXRG9VLYDYRC"}}, {"Date": "on December 22, 2014", "Text": "Such a fun read.  If you really liked the movie and appreciate the behind the scenes and don't mind getting lost in some pretty deep technical literature then this is for you.  I'm no scientist and was still able to piece together most of the content due to Kip's very plain way of writing.  Really enjoyed this, can't wait to see the movie again.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A23AYTEMKPIQHP"}}, {"Date": "on May 14, 2015", "Text": "awesome! very interesting...slightly biased in some parts, though.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RWKBWZ0H63IJ"}}, {"Date": "on March 28, 2015", "Text": "now I have to go see the movie again thru fresh eyes", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3W5AGB1SIH4H0"}}, {"Date": "on November 26, 2014", "Text": "If you saw the movie this explains all the moments that you might not have understood what you were looking at, especially in the end.  This makes the movie even more impressive because you realize it wasn't fantasy, these were actual plot lines backed by physics. If you haven't seen the movie it's a nice primer on black holes, astronomy and multi- dimensional space but this really is a companion to the film.", "Helpfulness": 0.6, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ASP6GYZPZ3FE0"}}, {"Date": "on May 20, 2015", "Text": "If you like science....you'll love this book!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1AOL3M9TSH3W0"}}, {"Date": "on December 31, 2014", "Text": "It's one quarter anecdotes from the movie's production and three quarters really interesting science.  It's very easily followed  by this non-scientist, and an engaging read, no matter what you thought about the movie.", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PE2YMF9574U7"}}, {"Date": "on December 21, 2014", "Text": "This book is a relevant summary of the latest state of the art in theoretical physics The film interstellar is a good support for the explanation If you loved a Brief History of Time this book is for you", "Helpfulness": 0.5, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35S5S76OVE8YD"}}, {"Date": "on December 28, 2014", "Text": "Just been going thru the book, but it is a real pleasure... lots of diagrams with explanations and interesting text, and it is nice to see actual science in a sci-fi movie... (the movie was great too!)", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANBIP299T8OBX"}}, {"Date": "on March 8, 2015", "Text": "Easy to understand with plain English", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3QII6875IXF7Y"}}, {"Date": "on February 20, 2015", "Text": "I understand the black hole concept!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1G67ZK7UAH21A"}}, {"Date": "on March 9, 2015", "Text": "Received the book in good condition", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACGDZIZZBAJ1J"}}, {"Date": "on December 23, 2014", "Text": "I am a Space exploration and Physics nut .. this was way cool! It brought together the movie and explanations/summary of modern day physics and other sciences!!", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1D3QKGTNRC8HV"}}, {"Date": "on December 14, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3B84NEOTXND9F"}}, {"Date": "on January 1, 2015", "Text": "A beautifully written piece of scientific literature. A must read for all those who enjoyed interstellar and wanted to know the science behind it.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VG2JJY1AL9G7"}}, {"Date": "on March 1, 2015", "Text": "Great book. I'm a science nerd", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8XIVCJ7G9HQ"}}, {"Date": "on December 29, 2014", "Text": "Explains movie premise very well.  Read as thoroughly as you desire. If you enjoyed the movie then you will enjoy this book.", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4SC3WGN6H3GC"}}, {"Date": "on March 12, 2015", "Text": "Good book, good reading.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2N74P1ESN3YTY"}}, {"Date": "on April 7, 2015", "Text": "(No further comments.)", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3U6GPSHG12B1O"}}, {"Date": "on December 9, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3PCXPPJDXXAUU"}}, {"Date": "on November 30, 2014", "Text": "Amazing look at the physics described in the movie. Much of it is hard to get my mind around but that was part of what made the book, and the movie, so fascinating. Kip Thorne's writing style made the extremely complex concepts understandable. It is rare that a science fiction movie actually moves a scientific field forward. The renderings of Gargantua are the first accurate view of a black hole would actually look like, using the equations that Thorne created. After reading the book I want to see the movie again!", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JDY5CC3S7SA7"}}, {"Date": "on December 29, 2014", "Text": "Although Thorne does an admiral job of speaking in layman's terms in this detailed book of the science of this incredible movie, the reader should have at least a basic knowledge of physics, Newtonian laws, and Einstein's relativity to really appreciate it. Some parts get very detailed but as he says, you can skip some if you want and still enjoy it. I'm glad the producers, director, and rest of the crew stuck with science reality and educated guesses in this film. It truly shows science is beautiful and amazing.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2KJ6KWADIGITS"}}, {"Date": "on December 9, 2014", "Text": "Explains how many of the \"silly\" plot devices could actually work. Not that they'd be likely or even realistic, but they MIGHT not be completely impossible. Like Cooper surviving a trip through a blackhole or communicating with his daughter in the past via a tesseract, or a wormhole leading conveniently close to 3 Earth like planets in a distant galaxy. But there's no way love can be a physical force similar to gravity or nuclear forces. Still, it gets an impressive amount of the science right.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AIAQJ5WXEOBBU"}}, {"Date": "on December 14, 2014", "Text": "Fantastic!!!", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3H8DLT9DUBYPT"}}, {"Date": "on March 10, 2015", "Text": "Gets Technical after the first few chapters, which gets too mired into theoretical superstring theory. Kip Thorne should have kept it easy to read for the neophyte in physics. I got lost in tessaracts. Thorne gets lost in advancing his own theories, instead of helping the non-physics major understand branes in simple diagrams or how a black hole works in the galaxy. Came away too confused and frustrated.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ANW2USP1JAU8P"}}, {"Date": "on May 8, 2015", "Text": "Great book", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PBL4F1MXG9ZB"}}, {"Date": "on March 24, 2015", "Text": "Great book", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A25OV3OELIRRVV"}}, {"Date": "on December 21, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YHNAD2L9QTEV"}}, {"Date": "on December 22, 2014", "Text": "Kip Thorne take the readers to the frontiers of the Universe and of modern astrophysics. To what he calls Extreme Physics. Some of it its true fact, other educated guesses or speculations, but it is all an exploration of the fascinating possibilities of the wonderful universe we live in. In the end the readers wants more. Maybe an Interstellar 2.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2N88MHTRPYBDM"}}, {"Date": "on December 2, 2014", "Text": "I just saw the movie and read this companion book right after seeing the film.  This book does a great job explaining phenomenon found in the film and how those events are related to the reality of our universe.  I am very impressed with the film and the book, and my mind is blown by the visuals from the film, and the realities in the book!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A296GP89ZPAZRE"}}, {"Date": "on December 26, 2014", "Text": "Amazing book that makes complex subjects easy to follow. After seeing the movie, the book reaffirms that Interstellar is one of the greatest movies of the 21st Century. With that said, this book opens your mind to a world of scientific possibilities and realities so that we can understand our place in the stars.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AFONT3QWNQY1T"}}, {"Date": "on January 5, 2015", "Text": "Fascinating read for anyone who loved the film.  I'm not an expert, but the scientific information it provides seems to be fairly accurate.  Just remember that it is a book about the science behind a science-fiction movie, not a textbook, so some of the info is a bit out of this world (pun intended).", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11MI8J8MIGNEU"}}, {"Date": "on November 19, 2014", "Text": "Not a review but a desperate request: Kindle Edition please!", "Helpfulness": 0.5714285714285714, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A36SREY8T3RYS"}}, {"Date": "on November 29, 2014", "Text": "It's such a great little book! It helps to better understand the movie, but also it just helps to explain science! This book is a great read for anyone who liked the movie or likes science and wants to find out more of what really the vast space around us is like!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A30R4CEYIEBD65"}}, {"Date": "on January 10, 2015", "Text": null, "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A28J8K54BH23I2"}}, {"Date": "on March 10, 2015", "Text": "A very nice and entertaining explanation of the scientific ins and outs of Interstellar. Not for everyone though - the concepts dealt with are tricky, and readers who want to understand what is going on will have to don their mental running shoes.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1065WSRI95XCW"}}, {"Date": "on November 12, 2014", "Text": "This is an awesome book! I will buy me another one!! It's fantastic, i really love this movie!!", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A21CCBQJZ5IXTN"}}, {"Date": "on December 3, 2014", "Text": "This book will widen your knowledge on black hole, worm holes, time travel, blight, g. lensing around black hole etc. The concepts are backed by description of experiments done in real world by scientists. Celebrity and renowned physicist Kip has laid down the book into different categories based on truth, educated guess and speculation. This makes it easier to understand and appreciate the movie all the more. There are plentiful Images in the book which add a TON of value in making one understand the concepts. For e.g. the image where an ant is walking on the trampoline to explain the concept of bulk. I definitely recommend this book to anyone including a layman like me who doesn't understand a lot about physics. After reading this book, I've become a big fan of Kip Thorne and I wish that lot of youngsters reading this book gravitate towards astro physics.", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQWUH8RS2SYT7"}}, {"Date": "on February 12, 2015", "Text": "One word:  FASCINATING!", "Helpfulness": 0.5, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1FB4KZ9Y6MLIS"}}, {"Date": "on December 2, 2014", "Text": "Clearly explains in layman's terms the different scientific phenomena used in the movie (like blight of crops, depletion of earths oxygen, 5 dimension, wormhole, black-hole, Hyper Cube etc)", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BMC3IDV1QODV"}}, {"Date": "on March 1, 2015", "Text": "Great", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1GQ8LEZSU7O9U"}}, {"Date": "on January 10, 2015", "Text": "I love this book! It has great images and excellent information about the science of black holes and the warping of time and space. Kip Thorne tells a good story, and he tells it well.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GK1J5O64M1QC"}}, {"Date": "on December 2, 2014", "Text": "Excellently crafted, \"The Science of Interstellar\" is a work that breaks down all of the difficult to comprehend concepts shown in the feature film. For the average layperson and astrophysics expert alike, all audiences left wanting more after watching the film will enjoy this book. Kip does an excellent job of taking very math-heavy concepts and presenting them in a way that make natural sense to the reader. In this way, he truly knows his audience. As a big fan of the film, I loved how Kip shared how the movie came about and how he worked with Christopher Nolan and the visual effects team to make everything as scientifically accurate as possible.", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2VOCHOMKA9RYZ"}}, {"Date": "on January 1, 2015", "Text": "Exceptional clarity, indeed it is worth buying and reading; you can use it as a very good introduction to complex matters of physics for you and perhaps your children", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2P03VXIFK0MJ6"}}, {"Date": "on January 2, 2015", "Text": "wonderful book!!!!!! I really  like the movie INTERSTELLAR. So, I was curious about the science behind the movie, I bought this book. I have to say it is amazing!!!!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A38I5VOKBZ9SRR"}}, {"Date": "on November 29, 2014", "Text": null, "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2RZ27W6QRL46G"}}, {"Date": "on March 9, 2015", "Text": "good", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2E8ZJ1ZPUJJ8J"}}, {"Date": "on January 22, 2015", "Text": "Great book. Just the right level of technical detail and easy on the maths. Highly recommend to anyone with cursory interest in physics.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24JJE1AMH97VY"}}, {"Date": "on February 3, 2015", "Text": "Bought this for Christmas gift for my son - it's one of the few paper (he prefers digital) books he's read.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VH3PMU5C0HUQ"}}, {"Date": "on November 23, 2014", "Text": "Amazing interpretation of the movie, all science. A must read for fans of the film. No detail is left out.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1LK7BP12ZTF3Y"}}, {"Date": "on December 4, 2014", "Text": "A great read indeed. Very helpful in getting a hang of modern physics. Read it and watch the movie  again", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ARKDS89D326M0"}}, {"Date": "on December 29, 2014", "Text": "An outstanding book!  I especially enjoyed the speculative writing based on currently known fact", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3FJUA2YBBT20"}}, {"Date": "on April 16, 2015", "Text": "The cover arrived slightly damaged, but the book is as in the description", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2QXDQBGR6Y7NV"}}, {"Date": "on December 10, 2014", "Text": "Great book goes in deep detail of the physics in the movie.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10FNFJCDYYDB4"}}, {"Date": "on November 21, 2014", "Text": "If you enjoyed the movie and want to stretch your brain a bit to try and understand the forces of nature at work, I highly recommend this book.  What a truly strange and wonderful universe we live in.", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34OPV0UVDOPR8"}}, {"Date": "on January 9, 2015", "Text": "My boyfriend loved it .i got it for him on Christmas .:)", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2E4D2RN9ZZOHT"}}, {"Date": "on February 15, 2015", "Text": "Yet have no chance to read it but pictures are awesome.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A319QJN14H4ZGP"}}, {"Date": "on January 5, 2015", "Text": "I am very pleased with all my purchases from Amazon.com", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2ME1GX6BLEEU2"}}, {"Date": "on January 30, 2015", "Text": "Awesome down to earth read for us less science types", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2PEQYMMNDD4RE"}}, {"Date": "on February 20, 2015", "Text": "Great book. Very interesting and friendly read.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1DDI7UXDYPCO4"}}, {"Date": "on December 5, 2014", "Text": "Have not ended it yet but so far I;ve liked it!", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A4F2B0W6PMPC8"}}, {"Date": "on February 8, 2015", "Text": "I'm super happy and excited about this book!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1V9B0K4V0Q3YQ"}}, {"Date": "on December 23, 2014", "Text": "I've only gone through the first chapter, but I've learned a lot of knowledge of cosmology that school would never teach us.", "Helpfulness": 0.3333333333333333, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2HT7PXQ7DNS9O"}}, {"Date": "on December 19, 2014", "Text": "Great companion to the movie!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24MLYDK9SGT40"}}, {"Date": "on December 15, 2014", "Text": "Very easy to understand.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1YJWU6CNU3NWF"}}, {"Date": "on February 21, 2015", "Text": "An excellent read!!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AWD5NDYKTVM2B"}}, {"Date": "on December 19, 2014", "Text": null, "Helpfulness": 0.25, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A34Q7J7VJA3EAQ"}}, {"Date": "on February 21, 2015", "Text": "Excellent!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AHMYOCMQ77JVE"}}, {"Date": "on January 20, 2015", "Text": "well done!", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1ITYGP3HOC9JD"}}, {"Date": "on January 12, 2015", "Text": "Very good.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2U584F5BIK4NL"}}, {"Date": "on January 10, 2015", "Text": "Excellent", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A35W8FUSH6BJ5Z"}}, {"Date": "on December 16, 2014", "Text": "The best part of the entire book was Matt Damon getting blown out of an airlock. I would like to see a spin-off series revolving around this single incident.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3BPKEAA9ANUMQ"}}, {"Date": "on January 3, 2015", "Text": "I gave this as a follow up to a friend who had attended a premier of the movie.  I have yet to get any feedback from her.", "Helpfulness": 0.0, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29BWV7VKN28G3"}}, {"Date": "on January 2, 2015", "Text": "I loved the book! Was one of my favorite reads, it inspires and delights! I'm so glad chose this book to read.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2OWL2D45UQ1U3"}}, {"Date": "on November 28, 2014", "Text": "If you loved the movie then buy this book. You'll love it even more. Kip makes it all come together.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A17Q7M7X41Z8NM"}}, {"Date": "on January 2, 2015", "Text": "Dense material but extremely interesting. Kip thorne makes it easier to understand.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2M0QX6DFCO65S"}}, {"Date": "on January 3, 2015", "Text": "My husband is reading the book and finds it quite interesting,", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A10Q3KP7PBQCYZ"}}, {"Date": "on December 28, 2014", "Text": "Enhances an already amazing film!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AU3SWWW3CP7HA"}}, {"Date": "on January 3, 2015", "Text": "Cam in very good condition", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3SLLEO2YPKSEG"}}, {"Date": "on December 19, 2014", "Text": "Amazing Book", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3JTVCEE7AP1Y7"}}, {"Date": "on December 27, 2014", "Text": "Great book!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1QAXM6BJ39OOH"}}, {"Date": "on January 2, 2015", "Text": "Excellent!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1XSDDMYAXDOAW"}}, {"Date": "on January 2, 2015", "Text": "Good book", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2XA33ZOIH8VJV"}}, {"Date": "on January 14, 2015", "Text": "perfect.", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AM79T16W4G7DZ"}}, {"Date": "on December 31, 2014", "Text": "perfect!", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1C6DBI7T891Q1"}}, {"Date": "on March 3, 2015", "Text": "It was interesting for a while but then I got bored with all the made up science.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1Q9391JRHTC06"}}, {"Date": "on January 18, 2015", "Text": "The book itself is a good way of introducing some of the cutting-edge theoretical physics of our time to the general movie-going public.  However, the kindle presentation of the text is really frustrating, and it illustrates the superiority of the physical book over electronic text in its current form.", "Helpfulness": 0.2857142857142857, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AEOYF5NLX8MA5"}}, {"Date": "on November 25, 2014", "Text": "Haven't read the book but loved the movie.  I am a non-science educated guy with a telescope and a high interest in all things space related.  What the movie told me (and I am sure the book will too) is that space is an extremely unsafe place to be.  Dr. Thorne and the movie producer did an excellent job getting that point across.  It may be a romantic notion to travel between the stars in search of life and a new home but the challenges are enormous and probably insurmountable.", "Helpfulness": 0.16666666666666666, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2LYH0V6E6N4FP"}}, {"Date": "on November 25, 2014", "Text": null, "Helpfulness": 0.35714285714285715, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1J0UGGU57R7S"}}, {"Date": "on March 9, 2015", "Text": null, "Helpfulness": 0.125, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1L05Q12W51QWM"}}, {"Date": "on December 7, 2014", "Text": "I enjoyed the movie very much and thought I would buy this book to learn more about the science and theory behind the movie.  Thorne's explanations of some really high-end theoretical concepts of relativity and space time were fascinating.  However, his incessant fawning over the Nolan brothers, the constant name-dropping, and his subtle but frequent reminders to the reader how important and intelligent he thinks he is really dragged the book down quite a bit, in my opinion - hence the three stars.", "Helpfulness": 0.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2TM4ES778JH3M"}}, {"Date": "on November 30, 2014", "Text": "No Comments Good Or Bad", "Helpfulness": 0.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VO3U31SAR5NB"}}, {"Date": "on January 4, 2015", "Text": "The writing in this book is not engaging. It is not well written. I put it down after a few chapters, and I was really excited to read this after seeing (and loving) Interstellar. I do not like when scientists or other experts try to explain complex terms to their readers with cliched, dumbed-down writing.", "Helpfulness": 0.2857142857142857, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AYUFSSFXRLHQ1"}}, {"Date": "on March 21, 2015", "Text": "The first chapter is some Hollywood fluff. Second chapter starts with calling the Big Bang a \"gigantic explosion.\" I'll amend my review if I continue onward, although I'm not pleased with this book so far. I'm generally a huge fan of Kip Thorne's popular works, hence the purchase of this book.", "Helpfulness": 0.0, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3MW8ONJF94KXF"}}, {"Date": "on November 21, 2014", "Text": null, "Helpfulness": 0.2459016393442623, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A20RATPC9T6T2K"}}, {"Date": "on December 6, 2014", "Text": "The author uses the book primarily as a medium for name dropping.  I am grateful that I never took a class from him, for he couldn't explain why it gets dark in a paper bag, much less how a space traveler can drop into the gravitational pull of a dying star and end up behind a book shelf in a rural American farmhouse decades before he took off and then telepathically program a watch on the front side of the bookcase to convey the secret of escaping the Earth's gravity.", "Helpfulness": 0.15254237288135594, "StarRating": "1", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AD5KAR7IL0OUH"}}, {"Date": "on November 10, 2014", "Text": "Kip Thorne knows that Super Luminal Propagation of Information has already been used to transmit information backwards in time. He also knows that containable fields of closed timelike curves have been used for decades to send information and now yes matter forward and backwards in time at subluminal speeds. Relativistic forward time travel has been known for over 100 years and Godels closed timelike curves close to 65 years. But the book is great", "Helpfulness": 0.07936507936507936, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2K52S8X3D11R0"}}], "ReviewUrl": "http://www.amazon.com/Science-Interstellar-Kip-Thorne/product-reviews/0393351378/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "4.6 out of 5 stars"}, "OfferPrice": "$19.36", "Salesrank": "#2,212", "ListPrice": "$24.95"}