{"Category": "in Books (", "Name": ["Car Stereo Cookbook (TAB Electronics Technician Library)"], "Timestamp": "2015-05-24 23:15:59.465273", "itemurl": "http://www.amazon.com/Stereo-Cookbook-Electronics-Technician-Library/dp/0071448470", "Reviews": {"TotalReviewCount": "30", "ReviewList": [{"Date": "on December 14, 1999", "Text": "I give due credit for my outstanding audio to the \"Car Stereo Cookbook\". I found far more audio system information than I will ever need, but scanning through the chapters(and actually reading some) gave me  the information I needed to design and install a system in my vehicle. I  thought subs were only for gangsta's, but this 44 year old avid hunter now  has one in my 4x4 truck, and wouldn't trade for it. Although Rumreich does  get rather technical in some areas, the average handyman possessing an  average dose of common sense can navigate this sea of information quite  easily. Thanks Mark for this great source of \"do it yourself\"  info!", "Helpfulness": 0.9473684210526315, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ABPA9LIAR0Z5U"}}, {"Date": "on December 22, 2001", "Text": "Rumreich makes the undefinable assumption that the reader \"is a beginner but has some knowledge of car stereos.\"  So exactly how much knowledge is that?  Much of the information takes you from beginner to intermediate, but many terms remain undefined.  Who's to say that the reader should already know the difference between a 12dB/octave slope and an 18dB/octave slope in a crossover?  I sure didn't, and I had to look at another book to find out, making me question the usefulness of this book.  A safer bet for a beginner would be Auto Audio by Andrew Yoder.  However, there is some original information, such as the sections on Factory Hi-Fi systems by Bose and Ford.", "Helpfulness": 0.9090909090909091, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A8Q83DFCAN9HG"}}, {"Date": "on April 25, 2004", "Text": "With a book of almost 300 pages I expected much more detailed explanations.  The author introduces technical aspects but hardly ever explains what they mean ie cross over slopes.  Set-up information is limited to wiring diagrams, you never seen any real installation pictures.  And then there are diagrams for dual preamps head outputs but the pictures show one one set going to the amps.  Then there is a huge chapter on subwoofers and the author gives no information on techniques for mounting the box to the car.  The head installation was way to general.  Good points made are setting up speakers for best ohm ratings (serial vs parallel), determining voltage with a multimeter, what power cable gauge to use.  The book is several years old and seems out of date on some subject matter.  There is also a lot of dialog on things that are obvious.  Consider this book for tips, not as a bible for installing since you won't find too much on how to actually install anything.", "Helpfulness": 1.0, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AU4ZDB7EVHTNL"}}, {"Date": "on October 25, 1999", "Text": "This book outlines the basics of how to make your car stereo the way you want it to sound.There are numbers and diagrams that you could actually  work with when tweaking with your setup. I recommend this book to anyone  from the beginner to the advanced in car stereo setups.", "Helpfulness": 0.9166666666666666, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AW0NPUP7O2VMJ"}}, {"Date": "on June 13, 1999", "Text": "This book is absolutely great. I would suggest that beginners look into less complicated literature first, but, once you want more advanced info, get this book.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": ""}}, {"Date": "on May 2, 2004", "Text": null, "Helpfulness": 0.8, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AAWYB4DLEN1GJ"}}, {"Date": "on June 22, 2002", "Text": null, "Helpfulness": 0.8333333333333334, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZW82B99OGTYM"}}, {"Date": "on April 17, 1999", "Text": "I'm the type that knows nothing of car audio. I bought this book and was able to install my CD deck. However, when reading about amplifiers, subwoofers, etc I got lost. There is too much unfamiliar terminology.", "Helpfulness": 0.8, "StarRating": "3", "Author": {"ProfileUrl": ""}}, {"Date": "on March 30, 2004", "Text": "I had a basic knowledge of car stereo before I purchased this book. The book helped me to design and install a multi speaker/multi amp system in my truck. It explained in great detail how to choose your components,especially speakers and speaker boxes. I found it well organized in that the author leaves no stone unturned. There are lots of details which help make your install more professional. The book gives you the tools to create a system that is right for your vehicle. To me this book is well worth the money and I would recommend it to anyone wanting to design/install their own system", "Helpfulness": 0.8, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A24JNZODLAND7H"}}, {"Date": "on March 20, 2002", "Text": "I say a lot of unkind things about most audio books. But not this book. If you where going to just buy one or two books on car audio This would be the first one to buy. If you don't have a clue about car audio this book will get you past most of the smoke and lies. It will give you enough information about what system is best for you. Even if you never did anything like this before. The next would be CAR STEREO SPEAKER PROJECTS ILLUSTRATED by Dan Ferguson and for ideas his old book KILLER CAR STEREO ON A BUDGET. discontinued but still available.", "Helpfulness": 0.8, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AQEPSA4XPLCLR"}}, {"Date": "on March 20, 2006", "Text": null, "Helpfulness": 0.75, "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2W60TXGSG3QCN"}}, {"Date": "on July 18, 2009", "Text": "The book covered everything from A to Z! Very informative. It has a substantial amount of pictures and diagrams. It even had some product recommendations. Overall, it is a really good educational tool.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19VWN4AUY0ZPB"}}, {"Date": "on January 18, 2008", "Text": "This book provides excellent background info, good design criteria, and photos illustrating similar installations to those discussed in the different sections. I found the book quite helpful.", "Helpfulness": 1.0, "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OG0J536Q3H0H"}}, {"Date": "on March 22, 2011", "Text": "I was happy with the pricing (some other sites asking for DOUBLE what I paid), the quality of the book, and, most of all, the shipping. I received the book a day before the estimated delivery time, which, whether it was just an error or something, was most pleasing. Over all, a very good experience. My only problem with this, and just about all other listings, is that there wasn't a lot of information on the page about this book. I had to do my research on this book on other sites to see if it was right for me before I bought it.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3O1FVLUD9X1XC"}}, {"Date": "on July 4, 2011", "Text": null, "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A114B0WCJFY3MK"}}, {"Date": "on September 15, 2009", "Text": "This book is good for beginners expaining the basics of everything and a little more on car audio/video. The only thing that fell a little short were some of the defenition's of basic audio applications and jargon. I'm a virgin car audio person and I had kind-of a hard time understanding some things. On the other hand amplifier and speaker explanation of hookup and technical advice is very thourogh and helpful.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A299U06LPKT9JZ"}}, {"Date": "on January 1, 2013", "Text": "If you are looking for an overview of various stereo options, this is a good book to get started with.  Generally, when one sees cookbook in the title you would expect the text to offer you a recipe for building or constructing something.  I would not say this book gives \"recipes\" or precise diagrams, but strives to give the reader a solid awareness.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A29E9WU0BIEF2Z"}}, {"Date": "on January 19, 2008", "Text": "I started this book with a mild understanding of car stereo's and installation and by the time I was done I was customizing my own stereo with ease. Highly recommended for anyone with a desire for good sound in there vehicle a lot of easy tricks that make a whole lot of difference", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OV9J9TMJXCLZ"}}, {"Date": "on January 10, 2011", "Text": "This book is a little out of its time,it would be like writing a book about computers when you literally would have to re-publish it every six months. The Haynes car audio Techbook is about the same, outdated.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3TNYF18N6IPUW"}}, {"Date": "on June 23, 2013", "Text": "very informative book I feel ready to do my own install with confidence instead of trepidation because of this book. Now I just need to break down and buy the system.", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3KEFXPQNX8IKQ"}}, {"Date": "on July 5, 2013", "Text": "This is a nearly completely up to date resource for making custom applications. Indispensable for the DIYer, especially with new wiring.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/APKHI1AD9AYZW"}}, {"Date": "on April 21, 2012", "Text": "It's ok.  Did not have what I really needed. Pretty basic stuff. Good starting point if you have never worked with car audio before.", "Helpfulness": "", "StarRating": "3", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AZ7733KFRYW4P"}}, {"Date": "on October 21, 2014", "Text": "This manual is a wealth of information. I would have liked to see more wiring diagrams however its a must have for any audiophile", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JB16901RSM4C"}}, {"Date": "on May 5, 2015", "Text": "Is a little dated but can give someone who is in the beginning stages of Car audio a good path to go down.", "Helpfulness": "", "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3OCMQSQWE3QBV"}}, {"Date": "on April 10, 2000", "Text": "The book is very good and allows for experimentation, but at the same time, the book is a tad out of date because of the newer technology that has emerged since the writing of the book.", "Helpfulness": 0.625, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2MW8MEUUJFVD9"}}, {"Date": "on December 23, 2014", "Text": "Great product, good price!", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A265Z9IKNIF2N3"}}, {"Date": "on October 28, 2014", "Text": "good book", "Helpfulness": "", "StarRating": "5", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A11WITYQ9AD3W6"}}, {"Date": "on July 24, 2003", "Text": "This book is certainly not for amatures.  This book was so full of technical mumbo jumbo and wiring diagrams that I thought I needed a degree in electrical enginering to understand.  This book is NOT for beginers.  The true content of the book is there but it's garbled and hard to, for an amature to understand and I personally have installed a stereo in my own car and was very confused.  If you can interpret electrical diagrams and can deal with the lack of color, pictures, common language, clearly defined definition,  you may enjoy this book but if you dont then definetly look elsewhere", "Helpfulness": 0.16666666666666666, "StarRating": "2", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/ACKQJYGFHNGCC"}}, {"Date": "on October 16, 2003", "Text": "Its a good book, you do need a little knowledge of car audio but not too much is required. I recommend it as more of a reference for experienced car audio fanatics or the amateur.", "Helpfulness": 0.16666666666666666, "StarRating": "4", "Author": {"ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AK687SH0M51W9"}}, {"Date": "on August 27, 2000", "Text": "Well, to start off, this book was absalutely fantastic!!! I couldn't  believe the wonderful metaphors used by Tolkien....I have to admit that  this a literary classic for all ages.", "Helpfulness": 0.11320754716981132, "StarRating": "5", "Author": {"ProfileUrl": ""}}], "ReviewUrl": "http://www.amazon.com/Stereo-Cookbook-Electronics-Technician-Library/product-reviews/0071448470/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful", "AverageStarRating": "3.9 out of 5 stars"}, "OfferPrice": "$23.99", "Salesrank": "#157,130", "ListPrice": "$33.00"}