{
    "Category": "in Books (",
    "ListPrice": "$19.95",
    "Name": [
        "The Nature of Light and Colour in the Open Air (Dover Books on Earth Sciences)"
    ],
    "OfferPrice": "$16.86",
    "Reviews": {
        "AverageStarRating": "3.8 out of 5 stars",
        "ReviewList": [
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on June 26, 1997",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "It is impossible to truly review this book.  Well over its 40 years old, it has become a classic. It attempts to explain, with little math but excellent science, everything we see from the appearance of the horizon, to the rainbow, to the light shining of telephone cables. This edition is old fashioned in appearance, there are no fancy full color spreads.  It is a well written book, clearly organized that shows a grasp of the subject and a deep affection for it"
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on December 3, 1997",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "Hundreds of optical phenomena visible to the naked eye are described in this classic text, ranging from colors in rainbows, halos, \"sun-dogs\" and other effects from water droplets and ice crystals in the atmosphere, to the iridescent colors of an oil spill and the visual effects of wet branches in front of street lamps.  Explanations are aimed at the layman.  Many line drawings and some b+w photographs accompany the sometimes wonderfully old-fashioned text.  If you have ever wondered what some of the puzzling optical effects are that you see outdoors, then this book is for you."
            },
            {
                "Author": {
                    "Helpfulness": "50%",
                    "Location": "Somerville, MA United States",
                    "Name": "J. Maynard Gelinas",
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AL2K5L27443L9/ref=cm_cr_pr_pdp?ie=UTF8",
                    "Ranking": "Reviewer ranking: #20,393,271"
                },
                "Date": "on November 29, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "My father gave me a copy of this when I was a kid. I've kept it ever since. The book is very easy to read, with plenty of line illustrations to explain the optics with as little math as possible. Though one will find some mathematics in the work, anyone who has taken high school physics, algebra, and geometry will have no trouble understanding the material. But what makes this work really shine is Minnaert's attention to detail when explaining the many kinds of behavior light exhibits in various environments. Everything from iridescence, refraction and reflection is given deep explanation through many examples of everyday phenomena. What the viewer might think of as distinct and separate optical effects, the author cleverly shows to be related. By the time a layperson finishes this work he or she will have a very good basic understanding of optics. Certainly well enough to ace that section of any undergraduate physics exam."
            },
            {
                "Author": {
                    "Helpfulness": "100%",
                    "Location": "Cambridge, MA",
                    "Name": "An Astronomer",
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2GKV86CRMGSYV/ref=cm_cr_pr_pdp?ie=UTF8",
                    "Ranking": "Reviewer ranking: #27,148,512"
                },
                "Date": "on July 27, 2007",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "Helpfulness": "100%",
                    "Location": "Italy",
                    "Name": "Prince Zaleski",
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2JJRRDA8WQSN9/ref=cm_cr_pr_pdp?ie=UTF8",
                    "Ranking": "Reviewer ranking: #27,837,712"
                },
                "Date": "on November 9, 2006",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "Helpfulness": "89%",
                    "Location": "",
                    "Name": "A Reader",
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1VF1IA1P3671X/ref=cm_cr_pr_pdp?ie=UTF8",
                    "Ranking": "Reviewer ranking: #10,941,597"
                },
                "Date": "on March 22, 2010",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": "Beyond the standard 18-degrees-down-Sun definition of astronomical twilight, Minnaert pioneeringly gives the night sky background's appearance when the Sun is even further down, to -24 degree level, which I call Bortle-1 twilight, for pristine conditions. Throughout the book there are similiar extensions to and detailing of familiar and not-so-familiar optical phenomena day, night, and twilight outdoors, helping anyone to better interpret what one sees and what to look for. Many of these best features are edited out of the modernized, \"colorized\" (!) edition, which is why I recommend the original with its black-and-white mostly line drawings. As so well expressed in this book, twilight is a most dramatic, dynamic time to be outdoors taking in the marvellous, changing-color sky."
            },
            {
                "Author": {
                    "Helpfulness": "100%",
                    "Location": "",
                    "Name": "Jordan Hunter",
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A32P5FTTCV1S1R/ref=cm_cr_pr_pdp?ie=UTF8",
                    "Ranking": "Reviewer ranking: #18,641,945"
                },
                "Date": "on April 4, 2013",
                "Helpfulness": 1.0,
                "StarRating": "2",
                "Text": "The technical content of this Dover reproduction is extensive, with enough equations to satisfy any student of optical physics, but the book is entirely monochrome. Really Dover? A book on light and color that's contains nothing but poorly reproduced grey-scale versions of the original color illustrations? Save your money and try to find an original copy at a library that has color plates."
            },
            {
                "Author": {
                    "Helpfulness": "100%",
                    "Location": "",
                    "Name": "William D. Mohat",
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1S9N4S60YBOA5/ref=cm_cr_pr_pdp?ie=UTF8",
                    "Ranking": "Reviewer ranking: #2,017,329"
                },
                "Date": "on August 7, 2014",
                "Helpfulness": 1.0,
                "StarRating": "4",
                "Text": "M. Minneart's book on light and colors in nature is a real treat.  The only thing keeping me from giving this a 5-star rating is that all of the pictures are in black and white !  But, if you have ever wondered about the many optical illusions and visual distortions you see when looking around you, this book will bring you a lot of surprising insights as to how these illusions are created.  Great for the more technically minded readers."
            },
            {
                "Author": {
                    "Helpfulness": "100%",
                    "Location": "",
                    "Name": "Kaban",
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/AOGXVAJZCENLQ/ref=cm_cr_pr_pdp?ie=UTF8",
                    "Ranking": "Reviewer ranking: #23,860,883"
                },
                "Date": "on July 8, 2012",
                "Helpfulness": 1.0,
                "StarRating": "5",
                "Text": null
            },
            {
                "Author": {
                    "Helpfulness": "91%",
                    "Location": "",
                    "Name": "Archer Mitchell",
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A19PRDVV5NOHFQ/ref=cm_cr_pr_pdp?ie=UTF8",
                    "Ranking": "Reviewer ranking: #5,590,799"
                },
                "Date": "on August 2, 2014",
                "Helpfulness": "",
                "StarRating": "5",
                "Text": "The pictures in the hardback edition \"in the Outdoors\" are well worth the acquisition."
            },
            {
                "Author": {
                    "Helpfulness": "78%",
                    "Location": "Teacher in Phoenix",
                    "Name": "Suzue",
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A09735703SKS707SHBB2L/ref=cm_cr_pr_pdp?ie=UTF8",
                    "Ranking": "Reviewer ranking: #174,537"
                },
                "Date": "on January 20, 2014",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": "This was listed under light and color for kids.  I downloaded it for my daughter's science project.  She is 8.  She read it and came asking questions about what the words meant.  I sat down and read a chapter, it is very hard to follow and understand even for me!  This would be great for a high school gt student learning about advanced material."
            },
            {
                "Author": {
                    "Helpfulness": "24%",
                    "Location": "",
                    "Name": "Hsueh k. Liu",
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A2WHXLO1T1UERZ/ref=cm_cr_pr_pdp?ie=UTF8",
                    "Ranking": "Reviewer ranking: #29,774,277"
                },
                "Date": "on October 25, 2014",
                "Helpfulness": "",
                "StarRating": "3",
                "Text": "good"
            },
            {
                "Author": {
                    "Helpfulness": "29%",
                    "Location": "",
                    "Name": "Michael D Johnson",
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A3AF99753UTDIG/ref=cm_cr_pr_pdp?ie=UTF8",
                    "Ranking": "Reviewer ranking: #31,311,249"
                },
                "Date": "on August 17, 2013",
                "Helpfulness": 0.0,
                "StarRating": "2",
                "Text": "There is nothing very deep in this book. Maybe something was lost when they put it into English. He says a lot of things like; When you look at a shadow on the ground the light comes from behind you to put the shadow in front of you. est...."
            },
            {
                "Author": {
                    "ProfileUrl": ""
                },
                "Date": "on March 12, 1999",
                "Helpfulness": 0.125,
                "StarRating": "4",
                "Text": "Explains many of the phenomena occuring in nature regarding both light and colour. Encourages active exploration by yourself. Good reference work but sometimes long."
            },
            {
                "Author": {
                    "Helpfulness": "44%",
                    "Location": "CT",
                    "Name": "this art guy",
                    "ProfileUrl": "http://www.amazon.com/gp/pdp/profile/A1NZ8M7K80CKW4/ref=cm_cr_pr_pdp?ie=UTF8",
                    "Ranking": "Reviewer ranking: #2,896,843"
                },
                "Date": "on December 2, 2007",
                "Helpfulness": 0.14285714285714285,
                "StarRating": "1",
                "Text": "The book makes an attempt to cover every single possible phenomenon that has to do with light and the outdoors.  It tries to cover too many of them, too briefly and I have a hunch some of the material may be dated (check the publishing date!) Most explanations leave you feeling like you missed a few chapters and usually jump right into some heavily involved equations that the author does not lead into...he simply slaps equations into the middle of the page expecting the reader to figure things out as if this was his half written journal of ideas.  Aside from being one of the worst reads I've encountered I guess the possitive take away is an introduction to some interesting phenomenons that I can reaseach elsewhere!"
            }
        ],
        "ReviewUrl": "http://www.amazon.com/Nature-Light-Colour-Dover-Sciences/product-reviews/0486201961/ref=sr_1_97?s=books&ie=UTF8&qid=1432362060&sr=1-97&keywords=mathematics+books+paperback/ref=cm_cr_dp_see_all_btm?ie=UTF8&showViewpoints=1&sortBy=helpful",
        "TotalReviewCount": "15"
    },
    "Salesrank": "#711,692",
    "Timestamp": "2015-05-23 02:21:03.023326",
    "itemurl": "http://www.amazon.com/Nature-Light-Colour-Dover-Sciences/dp/0486201961/ref=sr_1_97?s=books&ie=UTF8&qid=1432362060&sr=1-97&keywords=mathematics+books+paperback"
}
